*          DATA SET REWRIF0D   AT LEVEL 003 AS OF 07/14/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T821F0D      DATE 07/14/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P Z             T        Y              
AURREGH  DS    XL8                                                              
AURREG   DS    CL3      7   10    3  A  P N             T        Y    1         
AURREGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P N             T        Y              
AUROFFH  DS    XL8                                                              
AUROFF   DS    CL3      7   30    3  A  U N             T        Y    4         
AUROFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   38    6  A  P H             T        Y              
AURPERH  DS    XL8                                                              
AURPER   DS    CL17     7   46   17  A  U N             T        Y    6         
AURPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
AURGRPH  DS    XL8                                                              
AURGRP   DS    CL5      8   10    5  A  U N             T        Y   10         
AURGRPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
AURSTAH  DS    XL8                                                              
AURSTA   DS    CL7      8   30    7  A  U N             T        Y   14         
AURSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   38    7  A  P N             T        Y              
AURADTEH DS    XL8                                                              
AURADTE  DS    CL17     8   46   17  A  U N             T        Y   16         
AURADTEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
AURSALH  DS    XL8                                                              
AURSAL   DS    CL4      9   14    4  A  U N             T        Y   20         
AURSALX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9   20    8  A  P N             T        Y              
AURTEMH  DS    XL8                                                              
AURTEM   DS    CL3      9   30    3  A  U N             T        Y   24         
AURTEMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   38   10  A  P N             T        Y              
AURADVH  DS    XL8                                                              
AURADV   DS    CL4      9   49    4  A  U N             T        Y   26         
AURADVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   56    6  A  P N             T        Y              
AURAGYH  DS    XL8                                                              
AURAGY   DS    CL7      9   64    7  A  U N             T        Y   26         
AURAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
AURCLSH  DS    XL8                                                              
AURCLS   DS    CL3     10   10    3  A  U N             T        Y   30         
AURCLSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     10   20    8  A  P N             T        Y              
AURCATH  DS    XL8                                                              
AURCAT   DS    CL3     10   30    3  A  U N             T        Y   34         
AURCATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   38    7  A  P N             T        Y              
AURPRDH  DS    XL8                                                              
AURPRD   DS    CL4     10   49    4  A  U N             T        Y   36         
AURPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   56    4  A  P Z             T        Y              
AURBOKH  DS    XL8                                                              
AURBOK   DS    CL10    10   64   10  A  P N             T        Y   37         
AURBOKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
AURFILTH DS    XL8                                                              
AURFILT  DS    CL26    11   10   26  A  U N             T        Y   40         
AURFILTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11   38    7  A  P N             T        Y              
AUROPTH  DS    XL8                                                              
AUROPT   DS    CL26    11   46   26  A  U N             T        Y   44         
AUROPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P H             T        Y              
AURDPTH  DS    XL8                                                              
AURDPT   DS    CL1     13   15    1  A  U N             T        Y   50         
AURDPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P H             T        Y              
AURINVH  DS    XL8                                                              
AURINV   DS    CL65    14   15   65  A  U N             T        Y   52         
AURINVX  DS    XL8                                                              
AURINV2H DS    XL8                                                              
AURINV2  DS    CL65    15   15   65  A  U N             T        Y   52         
AURINV2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16    2   10  A  P H             T        Y              
AURIPERH DS    XL8                                                              
AURIPER  DS    CL17    16   15   17  A  U N             T        Y   54         
AURIPERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17    2   10  A  P N             T        Y              
AURMATH  DS    XL8                                                              
AURMAT   DS    CL8     17   15    8  A  U N             T        Y   56         
AURMATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18    2   10  A  P N             T        Y              
AURSATH  DS    XL8                                                              
AURSAT   DS    CL8     18   15    8  A  U N             T        Y   58         
AURSATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19    2    4  A  P N             T        Y              
AURBOOKH DS    XL8                                                              
AURBOOK  DS    CL15    19   15   15  A  U N             T        Y   60         
AURBOOKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
AURDEMOH DS    XL8                                                              
AURDEMO  DS    CL64    20   15   64  A  U N             T        Y   62         
AURDEMOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL64    21   15   64  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL64    22   15   64  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     23    2    8  A  P N             T        Y              
AURCDEMH DS    XL8                                                              
AURCDEM  DS    CL8     23   15    8  A  U N             T        Y   70         
AURCDEMX DS    XL8                                                              
AURLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
AURWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1432 BYTES                            
