*          DATA SET REWRKFFD   AT LEVEL 003 AS OF 09/19/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T811FFD      DATE 09/19/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A   P    N         T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A   U    N         T        Y              
SRVP1AH  DS    CL8                                                              
SRVP1A   DS    CL6      3    2    6  A   P    N         T        Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL25     3   11   25  A   U    N         T    I   Y              
SRVP2AH  DS    CL8                                                              
SRVP2A   DS    CL7      3   39    7  A   P    N         T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL32     3   48   32  A   U    N         T        Y              
SRVP3AH  DS    CL8                                                              
SRVP3A   DS    CL7      4    2    7  A   P    N         T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL69     4   11   69  A   U    N         T        Y              
SRVFCAH  DS    CL8                                                              
SRVFCA   DS    CL6      6    2    6  A   P    N         T        Y              
SRVFCH   DS    CL8                                                              
SRVFC    DS    CL69     6   11   69  A   P    N         T        Y              
SRVFH1H  DS    CL8                                                              
SRVFH1   DS    CL78     8    2   78  A   P    N         T        Y              
SRVFH2H  DS    CL8                                                              
SRVFH2   DS    CL78     9    2   78  A   P    N         T        Y              
SRVFD1H  DS    CL8                                                              
SRVFD1   DS    CL78    10    2   78  A   P    N         T        Y              
SRVFD2H  DS    CL8                                                              
SRVFD2   DS    CL78    11    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   11    1  A   U    N         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1768 BYTES                            
