*          DATA SET REWRISYSD  AT LEVEL 002 AS OF 09/04/90                      
         SPACE 3                                                                
RGD      DS    0C                  ** SYSTEM GLOBAL STORAGE **                  
         SPACE                                                                  
BASER6   DS    F                                                                
BASER7   DS    F                                                                
         SPACE                                                                  
RGTODAY0 DS    CL6                 TODAY'S DATE - EBCDIC                        
RGTODAY1 DS    PL3                                PWOS                          
RGTODAY2 DS    CL2                                COMPRESSED                    
RGTODAY8 DS    CL8                                DISPLAY                       
         SPACE                                                                  
RGEND    EQU   *                   ** END OF GLOBAL STORAGE AREAS **            
