*          DATA SET REXADDRD   AT LEVEL 009 AS OF 12/20/91                      
*                                                                               
*  REXADDRD -- INCLUDE DATASET                                                  
*                                                                               
*  DSECT TO COVER REP EXTRA ADDRESS LIST IN REREPRUNM.                          
*                                                                               
VXADDRD  DSECT                                                                  
*                                                                               
VXRQNUM  DS    A                   A(# RQST CARDS FOR THIS RPT)                 
*                                   - SEE REREPFILC                             
*                                                                               
VXRQCARD DS    A                   A(MULTI-CARD INPUT AREA)                     
*                                   - SEE REREPFILC                             
*                                                                               
VXRCDOWN DS    A                   A(RCDOWNLD FLAG)                             
*                                   - SEE REREPFILC                             
*                                                                               
VXDWDONE DS    A                   A(DOWNLOAD DATA DONE FLAG)                   
*                                   - SEE REREPFILC                             
*                                                                               
VXDOWNDF DS    A                   A(OUTPUT LINE DOWNLOAD DEF)                  
*                                   - 200 BYTES LONG                            
*                                   - SEE REREPFILC                             
LVXDOWND EQU   200                                                              
*                                                                               
VXSREP   DS    A                   A(SUBSIDIARY REP CODES)                      
*                                   - SEE REREPFILC                             
*                                                                               
VXDCBAPP DS    A                   A(DCB FOR APPLMSG FILE)                      
*                                   - SEE REREPRUNM/USED IN REREPFINT           
*                                                                               
VXREQTAB DS    A                   A(REQTAB IN RERQRP TO BE USED IN             
*                                    REREPORT)                                  
*                                                                               
****************  END OF REXADDRD INCLUDE DATASET  *******************          
