*          DATA SET RXRECD12   AT LEVEL 175 AS OF 10/07/09                      
       ++INCLUDE DXHDRD                                                         
         EJECT                                                                  
       ++INCLUDE DXTRLD            TRAILER                                      
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - CONTRACT HEADER INFO RECORD                  *         
***********************************************************************         
* CHANGES:                                                            *         
* 28JUN04 (BU ) --- CONTRACT HEADER: NEW C/P/E FIELDS                 *         
* 07JUL05 (BU ) --- NEW VERSION FOR FUTURE DEVELOPMENT                *         
* 28JUL05 (BU ) --- ADD DELFLAG, REFRESHTS TO CON,DOL RECS            *         
* 16AUG05 (BU ) --- REARRANGE ALL RECORDS PER S. WONG                 *         
* 07SEP05 (BU ) --- ADD DSECT  FOR SWITCH RECORDS                     *         
* 30SEP05 (BU ) --- INITIAL VERSION 'I' FOR ESS CHANGES / MO          *         
*                      REQUESTED BY R.MARTINEZ / B. HANNAH            *         
*                     ADD RECORD ID FOR COMPETITIVE STATION/SHARE     *         
*                         BOOKS, LENS,  DAYPARTS/CPP                  *         
* 05OCT05 (BU ) --- SWITCH FILTER RECORD                              *         
* 07OCT05 (BU ) --- STATION PID  RECORD                               *         
* 09NOV05 (BU ) --- 'LOSS' DATA TO CONTRACT HEADER                    *         
* 14NOV05 (BU ) --- ADD RECONSTT (STATUS OF ORDER)                    *         
*                   ADD RECONEDT (EXTRACT OR RECOV FILE DATE)         *         
*                   ADD RECONETM (EXTRACT OR RECOV FILE TIME)         *         
*                   ADD RESTAURL (URL FLAG: 2.1 OR 3.0)               *         
*                                                                     *         
* 30NOV05 (BU ) --- ADD COUNTERS TO RELEND,REBKSD                     *         
*                                                                     *         
* 30DEC05 (BU ) --- ADD STA/OFF VALUES TO STATION RECORD              *         
*                   ADD NEW RECORD:  CONFIRMATION COMMENT             *         
*                                                                     *         
* 24MAR06 (BU ) --- MAJOR CHANGES PER R. MARTINEZ                     *         
*                                                                     *         
* 04APR06 (BU ) --- ADD EOP RECORDS                                   *         
*                                                                     *         
* 12MAY06 (BU ) --- NEW RECORDS, CHANGES TO OLD                       *         
*                                                                     *         
* 23MAY06 (BU ) --- SPL COMMENT RECORD                                *         
*                                                                     *         
* 28JUN06 (BU ) --- THREE ACTIVITY DATES IN CONTRACT HEADER           *         
*                                                                     *         
* 08FEB07 (BU ) --- THREE CHANGES:                                    *         
*                   1.  NEW BUYCODE RECORD 5648                       *         
*                   2.  OFFICE COMMENT:  ADD 'DESCRIPTION' FIELD      *         
*                   3.  CONTRACT HEADER: ADD 'MON' RECORD INDICATOR   *         
*                                                                     *         
* 28MAR07 (BU ) --- TO BE PROMOTED WITH CHANGE OF 08FEB07             *         
*                   1.  NEW RECONPAD (PENDING ACTIVITY DATE) IN 5600  *         
*                                                                     *         
* 27AUG07 (SKU) --- BUY RECORDS                                       *         
*                                                                     *         
* 06FEB08 (SKU) --- ADD PRODUCT CODE 2                                          
*                                                                     *         
* 23JUN09 (SKU) --- ADD FLAG TO CONTRACT DOLLAR RECORD                *         
***********************************************************************         
         SPACE 1                                                                
RECOND   DSECT                     CONTRACT HEADER RECORD                       
RECONLEN DS    CL4                 RECORD LENGTH                                
RECONTYP DS    CL5                 RECORD TYPE     '05600'                      
         DS    C                                                                
RECONACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECONDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECONTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECONMAS DS    CL2                 MASTER REPCODE                               
         DS    C                                                                
RECONREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECONCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
RECONSTA DS    CL5                 STATION OF ORDER                             
         DS    C                                                                
RECONSAL DS    CL3                 SALESPERSON   CODE                           
         DS    C                                                                
RECONOFF DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
RECONTEM DS    CL2                 TEAM CODE                                    
         DS    C                                                                
RECONADV DS    CL4                 ADVERTISER CODE                              
         DS    C                                                                
RECONAGY DS    CL6                 AGENCY/AGENCY OFFICE CODE                    
         DS    C                                                                
RECONCTY DS    CL1                 CONTRACT TYPE CODE                           
         DS    C                                                                
RECONDEV DS    CL2                 DEV CONTRACT TYPE CODE                       
         DS    C                                                                
RECONDSP DS    CL3                 DEV S/P CODE                                 
         DS    C                                                                
RECONPRC DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
RECONPRT DS    CL20                PRODUCT TEXT                                 
         DS    C                                                                
RECONDEM DS    CL10                PRIMARY DEMO                                 
         DS    C                                                                
RECONCLI DS    CL4                 CLIENT/EI (ADVERTISER)                       
         DS    C                                                                
RECONPRD DS    CL4                 PRODUCT/EI                                   
         DS    C                                                                
RECONEST DS    CL10                ESTIMATE #/EI                                
         DS    C                                                                
RECONFLS DS    CL8                 FLIGHT START DATE                            
         DS    C                                                                
RECONFLE DS    CL8                 FLIGHT END DATE                              
         DS    C                                                                
RECONXRE DS    CL1                 EXCLUDE FROM RER FLAG Y/N                    
         DS    C                                                                
RECONCTP DS    CL1                 BUCKET TYPE                                  
*                                   F-FORECAST                                  
*                                   P-PENDING                                   
*                                   B-BACK BILLING                              
*                                                                               
*                                                                               
*                                                                               
         DS    C                                                                
RECONCRE DS    CL8                 CONTRACT CREATION DATE                       
         DS    C                                                                
RECONBLD DS    CL8                 DATE 1ST BUYLINE ADDED                       
         DS    C                                                                
RECONMOD DS    CL4                 MOD #                                        
         DS    C                                                                
RECONVER DS    CL4                 VERSION #                                    
         DS    C                                                                
RECONWIP DS    CL1                 WIP:  Y = WIP, N=NOT WIP                     
         DS    C                                                                
RECONLSB DS    CL1                 LAST SENT BY:                                
*                                  ' ' = NOT SENT                               
*                                  'R' = SENT BY REP                            
*                                  'S' = SENT BY STATION                        
         DS    C                                                                
RECONSTT DS    CL1                 STATUS                                       
*                                  'N' = NOT CONFIRMED                          
*                                  'C' = CONFIRMED                              
*                                  'P' = PARTIAL CONFIRM                        
         DS    C                                                                
RECONDLS DS    CL8                 DATE LAST SENT                               
         DS    C                                                                
RECONTRF DS    CL10                TRAFFIC NUMBER                               
         DS    C                                                                
RECONOTP DS    CL1                 ORDER TYPE                                   
*                                  'M' = MANUAL                                 
*                                  'D' = DARE                                   
*                                  'X' = XML                                    
         DS    C                                                                
RECONBYR DS    CL20                BUYER                                        
         DS    C                                                                
RECONSHR DS    CL5                 COMPETITIVE STN SHARE (100.00)               
         DS    C                                                                
RECONMBD DS    CL10                MARKET  BUDGET                               
         DS    C                                                                
RECONSSG DS    CL3                 STATION SHARE GOAL    (100)                  
         DS    C                                                                
RECONDLE DS    CL8                 DATE LAST EC'D                               
         DS    C                                                                
RECONPMG DS    CL1                 PENDING MAKEGOODS                            
*                                  'N' = NO M/GS                                
*                                  'Y' = PENDING M/GS                           
         DS    C                                                                
RECONLSF DS    CL1                 LOSS FLAG                                    
*                                  'N' = NOT A LOSS                             
*                                  'Y' = LOSS                                   
         DS    C                                                                
RECONLS$ DS    CL10                LOSS DOLLARS (NO PENNIES)                    
*                                  ONLY PRESENT IF RECONLSF = Y                 
         DS    C                                                                
RECONEDT DS    CL8                 EXTRACT OR RECOV FILE DATE                   
         DS    C                                                                
RECONETM DS    CL8                 EXTRACT OR RECOV FILE TIME HH:MM:SS          
         DS    C                                                                
RECONTAD DS    CL8                 TRUE ACTIVITY DATE                           
         DS    C                                                                
RECONSAD DS    CL8                 SPL  ACTIVITY DATE                           
         DS    C                                                                
RECONSED DS    CL8                 SPL  ENTRY    DATE                           
         DS    C                                                                
RECONTXT DS    CL8                 TEXT:  BONUS / TRADE / ETC                   
         DS    C                                                                
RECONMON DS    CL1                 MON ORDER INDICATOR:  Y/N                    
         DS    C                                                                
RECONPAD DS    CL8                 PENDING LAST ACTIVITY DATE                   
         DS    C                                                                
RECONPR2 DS    CL4                 PRODUCT/EI 2                                 
         DS    C                                                                
RECONRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RECONDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
RECONDX  DS    CL2                 RECORD END                                   
RECONDL  EQU   *-RECOND            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - CONTRACT DOLLAR BUCKET RECORD                *         
*        MONTHLY ACTIVITY ELEMENTS ASSOCIATED WITH HEADER INFORMATION *         
*        BY CONTRACT NUMBER.                                          *         
*        FOR PRAGER USE, ALL ACTIVITY FOR A SINGLE MONTH WILL BE      *         
*        ACCUMULATED, AND TRANSFERRED WITH AN ACTIVITY DATE EQUAL     *         
*        TO THE MONDAY OF THE WEEK OF THE RUN.                        *         
*        OTHER FUNCTIONALITY LATER DEVELOPED WILL RECEIVE DATA WITH   *         
*        'PACED' DATES, RATHER THAN A SINGLE FORCED DATE.             *         
***********************************************************************         
         SPACE 1                                                                
REDOLD   DSECT                     CONTRACT DOLLAR RECORD                       
REDOLLEN DS    CL4                 RECORD LENGTH                                
REDOLTYP DS    CL5                 RECORD TYPE     '05601'                      
         DS    C                                                                
REDOLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REDOLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REDOLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REDOLREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REDOLCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REDOLFLG DS    CL1                 SPECIAL FLAG                                 
* FLAG  DESCRIPTION                                                             
* ----  -----------                                                             
*  A    ACTUAL BUCKETS FOUND IN REPPAK CONTRACT RECORD                          
*  Z    ZERO DOLLAR BUCKETS CREATED SPECIALLY FOR MO REPORT APP                 
*  X    USED INTERNALLY. THIS WILL BE SET TO Z BUT                              
*         IT WILL ALSO ISSUE A 'K'(ILL) RECORD BEFORE THE ADD RECORD            
*                                                                               
         DS    C                                                                
REDOLBTP DS    CL1                 BUCKET TYPE                                  
* THIS CHART DEFINES THE BUCKET TYPES AND SUBTYPES USED IN                      
* THE EXTRACTED DOLLAR RECORDS                                                  
*                                                                               
* TYPE  SUB  DESCRIPTION                                                        
* ----  ---  ----------                                                         
*  X         OLD STYLE AS AT BUCKET BEST/FINAL                                  
*  C     B   CASH - BOOKED                                                      
*  C     I   CASH - INVOICED                                                    
*  D     B   CASH ALTERNATE CALENDAR - BOOKED                                   
*  D     I   CASH ALTERNATE CALENDAR - INVOICED                                 
*  F         FORECAST                                                           
*  P         PENDING                                                            
*  X     4   PENDING - O4 ELEMENT FOUND, MARKED NOT PENDING                     
*  T     B   TRADE - BOOKED                                                     
*  T     I   TRADE - INVOICED                                                   
*  U     B   TRADE ALTERNATE CALENDAR - BOOKED                                  
*  U     I   TRADE ALTERNATE CALENDAR - INVOICED                                
*  B         OLD STYLE AS AT BUCKET FOR BACK BILLING DOLLARS                    
*  B     B   CASH - BOOKED FOR BACK BILLING DOLLARS                             
*  B     N   BOOKED THIS WEEK/NEW ORDER FOR BACK BILLING                        
*  B     C   BOOKED THIS WEEK/CHANGED ORDER FOR BACK BILLING                    
*  Z     N   BOOKED THIS WEEK/NEW ORDER                                         
*  Z     C   BOOKED THIS WEEK/CHANGED ORDER                                     
*                                                                               
         DS    C                                                                
REDOLBTX DS    CL1                 BUCKET SUB TYPE                              
         DS    C                                                                
REDOLMON DS    CL8                 MONTH OF SERVICE                             
         DS    C                                                                
REDOLACD DS    CL8                 ACTIVITY DATE                                
         DS    C                                                                
REDOLDOL DS    CL12                BEST MONTH AMOUNT: 2 DECL PLACES             
         DS    C                                                                
REDOLADL DS    CL12                FINAL AMOUNT: 2 DECL PLACES                  
         DS    C                                                                
REDOLXRE DS    CL1                 EXCLUDE FROM RER FLAG Y/N                    
         DS    C                                                                
REDOLRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REDOLDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REDOLDX  DS    CL2                 RECORD END                                   
REDOLDL  EQU   *-REDOLD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - AGENCY/AGENCY OFFICE INFORMATION RECORD      *         
***********************************************************************         
         SPACE 1                                                                
REAGYD   DSECT                     AGENCY INFORMATION RECORD                    
REAGYLEN DS    CL4                 RECORD LENGTH                                
REAGYTYP DS    CL5                 RECORD TYPE   '05602'                        
         DS    C                                                                
REAGYACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REAGYDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REAGYTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REAGYREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REAGYAGY DS    CL6                 AGENCY/AGENCY OFFICE CODE                    
         DS    C                                                                
REAGYNAM DS    CL33                AGENCY NAME (FOR CONTRACTS)                  
         DS    C                                                                
REAGYAD1 DS    CL34                AGENCY ADDRESS LINE 1                        
         DS    C                                                                
REAGYAD2 DS    CL34                AGENCY ADDRESS LINE 2                        
         DS    C                                                                
REAGYCTY DS    CL20                AGENCY ADDRESS CITY                          
         DS    C                                                                
REAGYSTA DS    CL2                 AGENCY ADDRESS STATE                         
         DS    C                                                                
REAGYZIP DS    CL10                AGENCY ADDRESS ZIP                           
         DS    C                                                                
REAGYPHO DS    CL10                AGENCY PHONE NUMBER                          
         DS    C                                                                
REAGYCRR DS    CL2                 CREDIT RISK                                  
         DS    C                                                                
REAGYLIA DS    CL2                 LIABILITY POSITION                           
         DS    C                                                                
REAGYFAX DS    CL10                FAX NUMBER                                   
         DS    C                                                                
REAGYTER DS    CL2                 TERRITORY CODE                               
         DS    C                                                                
REAGYICO DS    CL1                 IN CARE OF FLAG                              
         DS    C                                                                
REAGYDLU DS    CL8                 DATE LAST UPDATED                            
         DS    C                                                                
REAGYRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REAGYDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REAGYDX  DS    CL2                 RECORD END                                   
REAGYDL  EQU   *-REAGYD            RECORD LENGTH                                
         EJECT                                                                  
*                                                                               
***********************************************************************         
* REP   SYSTEM EXTRACT - ADVERTISER INFORMATION RECORD                *         
***********************************************************************         
         SPACE 1                                                                
READVD   DSECT                     ADVERT INFORMATION RECORD                    
READVLEN DS    CL4                 RECORD LENGTH                                
READVTYP DS    CL5                 RECORD TYPE   '05603'                        
         DS    C                                                                
READVACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
READVDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
READVTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
READVREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
READVADV DS    CL4                 ADVERTISER CODE                              
         DS    C                                                                
READVNAM DS    CL20                ADVERT NAME                                  
         DS    C                                                                
READVCAT DS    CL2                 ADVERT CATEGORY                              
         DS    C                                                                
READVNET DS    CL1                 ADVERT INTERNET FLAG                         
         DS    C                                                                
READVCTY DS    CL20                ADVERT CITY                                  
         DS    C                                                                
READVAA1 DS    CL34                ALT ADDRESS #1                               
         DS    C                                                                
READVAA2 DS    CL34                ALT ADDRESS #2                               
         DS    C                                                                
READVAA3 DS    CL36                ALT ADDRESS #3                               
         DS    C                                                                
READVCTA DS    CL1                 ALTERNATE ADDRESS CONTRACT TYPE              
         DS    C                                                                
READVAOF DS    CL2                 ALTERNATE ADDRESS OFFICE CODE                
         DS    C                                                                
READVA21 DS    CL34                ALT ADDRESS #1                               
         DS    C                                                                
READVA22 DS    CL34                ALT ADDRESS #2                               
         DS    C                                                                
READVA23 DS    CL36                ALT ADDRESS #3                               
         DS    C                                                                
READVCTB DS    CL1                 ALTERNATE ADDRESS CONTRACT TYPE              
         DS    C                                                                
READVOFB DS    CL2                 ALTERNATE ADDRESS OFFICE CODE                
         DS    C                                                                
READVRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
READVDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
READVDX  DS    CL2                 RECORD END                                   
READVDL  EQU   *-READVD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - SALESPERSON INFORMATION RECORD               *         
***********************************************************************         
         SPACE 1                                                                
RESALD   DSECT                     S/P INFORMATION RECORD                       
RESALLEN DS    CL4                 RECORD LENGTH                                
RESALTYP DS    CL5                 RECORD TYPE  '05604'                         
         DS    C                                                                
RESALACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESALDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESALTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESALREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESALSAL DS    CL3                 SALESPERSON CODE                             
         DS    C                                                                
RESALNAM DS    CL20                SALESPERSON NAME                             
         DS    C                                                                
RESALOFF DS    CL2                 SALESPERSON OFFICE                           
         DS    C                                                                
RESALTEM DS    CL2                 SALESPERSON TEAM                             
         DS    C                                                                
RESALTEL DS    CL12                SALESPERSON TELEPHONE                        
         DS    C                                                                
RESALFAX DS    CL12                SALESPERSON FAX                              
         DS    C                                                                
RESALEML DS    CL50                SALESPERSON EMAIL                            
         DS    C                                                                
RESALLDT DS    CL8                 SALESPERSON LEAVE DATE                       
         DS    C                                                                
RESALMGR DS    CL1                 SALESPERSON MANAGER = Y                      
         DS    C                                                                
RESALRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESALDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESALDX  DS    CL2                 RECORD END                                   
RESALDL  EQU   *-RESALD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - CONTRACT TYPE INFO RECORD                    *         
***********************************************************************         
         SPACE 1                                                                
RECTYD   DSECT                     CONTYPE INFORMATION RECORD                   
RECTYLEN DS    CL4                 RECORD LENGTH                                
RECTYTYP DS    CL5                 RECORD TYPE '05605'                          
         DS    C                                                                
RECTYACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECTYDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECTYTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECTYREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECTYCTY DS    CL1                 CONTYPE CODE                                 
         DS    C                                                                
RECTYNAM DS    CL20                CONTYPE DESCRIPTION                          
         DS    C                                                                
RECTYCCM DS    CL8                 CONTYPE COMMENT                              
         DS    C                                                                
RECTYRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RECTYDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RECTYDX  DS    CL2                 RECORD END                                   
RECTYDL  EQU   *-RECTYD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - DEV CON TYPE  INFO RECORD                    *         
***********************************************************************         
         SPACE 1                                                                
REDCTD   DSECT                     DEV CONTYPE INFORMATION RECORD               
REDCTLEN DS    CL4                 RECORD LENGTH                                
REDCTTYP DS    CL5                 RECORD TYPE '05606'                          
         DS    C                                                                
REDCTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REDCTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REDCTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REDCTREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REDCTDCT DS    CL2                 DEV CONTYPE CODE                             
         DS    C                                                                
REDCTNAM DS    CL20                DEV CONTYPE DESCRIPTION                      
         DS    C                                                                
REDCTRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REDCTDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REDCTDX  DS    CL2                 RECORD END                                   
REDCTDL  EQU   *-REDCTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - STATION INFORMATION RECORD                   *         
***********************************************************************         
         SPACE 1                                                                
RESTAD   DSECT                     STATION INFORMATION RECORD                   
RESTALEN DS    CL4                 RECORD LENGTH                                
RESTATYP DS    CL5                 RECORD TYPE '05607'                          
         DS    C                                                                
RESTAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESTADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESTATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESTAREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESTASTA DS    CL5                 STATION CALL LETTERS                         
         DS    C                                                                
RESTAGRP DS    CL2                 STATION GROUP/SUBGROUP                       
         DS    C                                                                
RESTAJDT DS    CL8                 STATION JOIN  DATE                           
         DS    C                                                                
RESTALDT DS    CL8                 STATION LEAVE DATE                           
         DS    C                                                                
RESTACDT DS    CL8                 STATION CLOSE DATE                           
         DS    C                                                                
RESTAMKT DS    CL4                 STATION MARKET CODE                          
         DS    C                                                                
RESTAAFF DS    CL3                 STATION AFFILIATION                          
         DS    C                                                                
RESTAOWN DS    CL3                 STATION OWNERSHIP                            
         DS    C                                                                
RESTACHN DS    CL4                 STATION CHANNEL                              
         DS    C                                                                
RESTAINF DS    CL10                INTERFACE CODE                               
         DS    C                                                                
RESTAIDN DS    CL10                ID NUMBER                                    
         DS    C                                                                
RESTANEW DS    CL3                 NEW REP                                      
         DS    C                                                                
RESTAFRM DS    CL3                 FORMER REP                                   
         DS    C                                                                
RESTATVB DS    CL2                 TVB REGION                                   
         DS    C                                                                
RESTARNK DS    CL1                 STATION MARKET CODE RANK                     
         DS    C                                                                
RESTAMOU DS    CL1                 MEDIA OCEAN USER FLAG                        
         DS    C                                                                
RESTAURL DS    CL1                 URL INDICATOR FLAG (Y/N)                     
         DS    C                                                                
RESTATZ  DS    CL2                 TIME ZONE                                    
         DS    C                                                                
RESTAFAX DS    CL19                FAX NUMBER                                   
*                                  THREE FORMATS MAY BE ENTERED:                
*                                  1ST 3 BYTES = 'MB='                          
*                                     MAILBOX W/NEXT 8 NUMERIC                  
*                                  1ST 3 BYTES = 011 = INTERNAT'L               
*                                  ELSE                                         
*                                     STANDARD FAX NUMBER                       
         DS    C                                                                
RESTALIA DS    CL2                 LIABILITY                                    
         DS    C                                                                
RESTAINV DS    CL1                 Y = INVOICE, N = NO INVOICE                  
         DS    C                                                                
RESTAEC  DS    CL1                 Y = ELECTRONIC CONTRACT STATION              
         DS    C                                                                
RESTATRF DS    CL1                 TRAFFIC FORMAT                               
         DS    C                                                                
RESTASTT DS    CL8                 STATUS                                       
*                                  Y IN POSITION INDICATES 'YES'                
*                                                                               
*                                  POS 1: BOP CHECK OVERRIDE (RADIO)            
*                                  POS 2: CONTRACT LOCKOUT                      
*                                  POS 3: NOT IN USE                            
*                                  POS 4: SAR SCHED GRPS MANDATORY              
*                                  POS 5: DONT SEND CONTRCT TO STATION          
*                                  POS 6: PRINT CHANGES ONLY                    
*                                  POS 7: DON'T SEND '#DS' BUYLINES             
*                                  POS 8: NOT IN USE                            
         DS    C                                                                
RESTADLU DS    CL8                 DATE LAST UPDATED                            
         DS    C                                                                
RESTACBY DS    CL4                 CLOSED BY                                    
*                                  TAPE   -  ACTUALIZER                         
*                                  INVC   - INVOICE PROGRAM                     
*                                  RE16   - 16 REPORT                           
*                                  FILE   - FILE PROGRAM                        
         DS    C                                                                
RESTACLU DS    CL8                 CLOSED BY LUID                               
         DS    C                                                                
RESTADCL DS    CL8                 CLOSED ON DATE                               
         DS    C                                                                
RESTACCM DS    CL60                CONTRACT COMMENT                             
*                                  C=XX   KEYWORD FOR STANDARD COMMENT          
*                                     WHERE XX IS COMMENT CODE                  
         DS    C                                                                
RESTASC1 DS    CL65                STATION  COMMENT # 1                         
         DS    C                                                                
RESTASC2 DS    CL65                CONTRACT COMMENT # 2                         
         DS    C                                                                
RESTARTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESTADEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESTADX  DS    CL2                 RECORD END                                   
RESTADL  EQU   *-RESTAD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - GROUP/SUBGROUP INFO RECORD                   *         
***********************************************************************         
         SPACE 1                                                                
REGRPD   DSECT                     GROUP/SUBGRP INFORMATION RECORD              
REGRPLEN DS    CL4                 RECORD LENGTH                                
REGRPTYP DS    CL5                 RECORD TYPE '05608'                          
         DS    C                                                                
REGRPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REGRPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REGRPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REGRPREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REGRPGRP DS    CL2                 G/SG CODE                                    
         DS    C                                                                
REGRPNAM DS    CL10                GROUP NAME                                   
         DS    C                                                                
REGRPSNM DS    CL10                SUBGROUP NAME                                
         DS    C                                                                
REGRPRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REGRPDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REGRPDX  DS    CL2                 RECORD END                                   
REGRPDL  EQU   *-REGRPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - DEV S/P     INFORMATION RECORD               *         
***********************************************************************         
         SPACE 1                                                                
REDSPD   DSECT                     S/P INFORMATION RECORD                       
REDSPLEN DS    CL4                 RECORD LENGTH                                
REDSPTYP DS    CL5                 RECORD TYPE '05609'                          
         DS    C                                                                
REDSPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REDSPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REDSPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REDSPREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REDSPSAL DS    CL3                 SALESPERSON CODE                             
         DS    C                                                                
REDSPNAM DS    CL20                SALESPERSON NAME                             
         DS    C                                                                
REDSPTEL DS    CL12                SALESPERSON TELEPHONE                        
         DS    C                                                                
REDSPFAX DS    CL12                SALESPERSON FAX                              
         DS    C                                                                
REDSPLDT DS    CL8                 SALESPERSON LEAVE DATE                       
         DS    C                                                                
REDSPRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REDSPDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REDSPDX  DS    CL2                 RECORD END                                   
REDSPDL  EQU   *-REDSPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - TEAM        INFORMATION RECORD               *         
***********************************************************************         
         SPACE 1                                                                
RETEMD   DSECT                     S/P INFORMATION RECORD                       
RETEMLEN DS    CL4                 RECORD LENGTH                                
RETEMTYP DS    CL5                 RECORD TYPE '05610'                          
         DS    C                                                                
RETEMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RETEMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RETEMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RETEMREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RETEMTEM DS    CL2                 TEAM CODE                                    
         DS    C                                                                
RETEMNAM DS    CL10                TEAM NAME                                    
         DS    C                                                                
RETEMDIV DS    CL10                DIVISION NAME                                
         DS    C                                                                
RETEMRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RETEMDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RETEMDX  DS    CL2                 RECORD END                                   
RETEMDL  EQU   *-RETEMD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - PRODUCT     INFORMATION RECORD               *         
***********************************************************************         
         SPACE 1                                                                
REPRDD   DSECT                     PRODUCT INFORMATION RECORD                   
REPRDLEN DS    CL4                 RECORD LENGTH                                
REPRDTYP DS    CL5                 RECORD TYPE '05611'                          
         DS    C                                                                
REPRDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REPRDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REPRDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REPRDREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REPRDADV DS    CL4                 ADVERTISER CODE                              
         DS    C                                                                
REPRDPRD DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
REPRDNAM DS    CL20                PRODUCT NAME                                 
         DS    C                                                                
REPRDCAT DS    CL2                 PRODUCT CATEGORY                             
         DS    C                                                                
REPRDPTP DS    CL3                 POINT PERSON CODE                            
         DS    C                                                                
REPRDRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REPRDDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REPRDDX  DS    CL2                 RECORD END                                   
REPRDDL  EQU   *-REPRDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - PRODUCT CLASS INFO      RECORD               *         
***********************************************************************         
         SPACE 1                                                                
RECLSD   DSECT                     PRODUCT CLASS INFORMATION RECORD             
RECLSLEN DS    CL4                 RECORD LENGTH                                
RECLSTYP DS    CL5                 RECORD TYPE '05612'                          
         DS    C                                                                
RECLSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECLSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECLSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECLSREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECLSCOD DS    CL2                 CLASS CODE                                   
         DS    C                                                                
RECLSNAM DS    CL30                CLASS   NAME                                 
         DS    C                                                                
RECLSRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RECLSDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RECLSDX  DS    CL2                 RECORD END                                   
RECLSDL  EQU   *-RECLSD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - PRODUCT CATEGORY INFO   RECORD               *         
***********************************************************************         
         SPACE 1                                                                
RECATD   DSECT                     PRODUCT CATEGORY INFO     RECORD             
RECATLEN DS    CL4                 RECORD LENGTH                                
RECATTYP DS    CL5                 RECORD TYPE '05613'                          
         DS    C                                                                
RECATACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECATDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECATTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECATREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECATCOD DS    CL2                 CATEGORY CODE                                
         DS    C                                                                
RECATNAM DS    CL30                CATEGORY NAME                                
         DS    C                                                                
RECATCLS DS    CL2                 CLASS CODE                                   
         DS    C                                                                
RECATRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RECATDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RECATDX  DS    CL2                 RECORD END                                   
RECATDL  EQU   *-RECATD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - OFFICE INFORMATION RECORD                    *         
***********************************************************************         
         SPACE 1                                                                
REOFFD   DSECT                     OFFICE INFO RECORD                           
REOFFLEN DS    CL4                 RECORD LENGTH                                
REOFFTYP DS    CL5                 RECORD TYPE '05614'                          
         DS    C                                                                
REOFFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REOFFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REOFFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REOFFREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REOFFCOD DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
REOFFNAM DS    CL20                OFFICE NAME                                  
         DS    C                                                                
REOFFREG DS    CL2                 OFFICE REGION                                
         DS    C                                                                
REOFFAD1 DS    CL20                OFFICE ADDRESS 1                             
         DS    C                                                                
REOFFAD2 DS    CL18                OFFICE ADDRESS 2                             
         DS    C                                                                
REOFFSTT DS    CL2                 OFFICE STATE                                 
         DS    C                                                                
REOFFZIP DS    CL10                OFFICE ZIP                                   
         DS    C                                                                
REOFFFAX DS    CL10                OFFICE FAX                                   
         DS    C                                                                
REOFFNL  DS    CL1                 N  =  NATIONAL                               
*                                  L  =  LOCAL                                  
         DS    C                                                                
REOFFRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REOFFDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REOFFDX  DS    CL2                 RECORD END                                   
REOFFDL  EQU   *-REOFFD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - OWNER INFORMATION RECORD                     *         
***********************************************************************         
         SPACE 1                                                                
REOWND   DSECT                     OWNER INFO RECORD                            
REOWNLEN DS    CL4                 RECORD LENGTH                                
REOWNTYP DS    CL5                 RECORD TYPE '05615'                          
         DS    C                                                                
REOWNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REOWNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REOWNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REOWNREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REOWNCOD DS    CL3                 OWNER CODE                                   
         DS    C                                                                
REOWNNAM DS    CL20                OWNER NAME                                   
         DS    C                                                                
REOWNRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REOWNDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REOWNDX  DS    CL2                 RECORD END                                   
REOWNDL  EQU   *-REOWND            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  MARKET INFO RECORD                          *         
***********************************************************************         
         SPACE 1                                                                
REMKTD   DSECT                     MARKET INFO RECORD                           
REMKTLEN DS    CL4                 RECORD LENGTH                                
REMKTTYP DS    CL5                 RECORD TYPE '05616'                          
         DS    C                                                                
REMKTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REMKTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REMKTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REMKTREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REMKTCOD DS    CL4                 MARKET CODE                                  
         DS    C                                                                
REMKTNAM DS    CL20                MARKET NAME                                  
         DS    C                                                                
REMKTRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REMKTDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REMKTDX  DS    CL2                 RECORD END                                   
REMKTDL  EQU   *-REMKTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  MASTER/SUB RECORD                           *         
***********************************************************************         
         SPACE 1                                                                
REMSTD   DSECT                     MASTER/SUB INFO RECORD                       
REMSTLEN DS    CL4                 RECORD LENGTH                                
REMSTTYP DS    CL5                 RECORD TYPE '05617'                          
         DS    C                                                                
REMSTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REMSTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REMSTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REMSTSUB DS    CL2                 SUBSIDIARY REP CODE (SEE-ME CODE)            
         DS    C                                                                
REMSTMST DS    CL2                 MASTER REP CODE (READ-ME CODE)               
         DS    C                                                                
REMSTRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REMSTDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REMSTDX  DS    CL2                 RECORD END                                   
REMSTDL  EQU   *-REMSTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  REP INFO   RECORD                           *         
***********************************************************************         
         SPACE 1                                                                
REREPD   DSECT                     REP INFO RECORD                              
REREPLEN DS    CL4                 RECORD LENGTH                                
REREPTYP DS    CL5                 RECORD TYPE '05618'                          
         DS    C                                                                
REREPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REREPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REREPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REREPSUB DS    CL2                 REP CODE                                     
         DS    C                                                                
REREPMAS DS    CL2                 MASTER REP CODE                              
         DS    C                                                                
REREPNAM DS    CL33                REP NAME (WAS 20 CHARACTERS)                 
         DS    C                                                                
REREPRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REREPDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REREPDX  DS    CL2                 RECORD END                                   
REREPDL  EQU   *-REREPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  REP BUDGET RECORD: STATION/OFFICE           *         
***********************************************************************         
         SPACE 1                                                                
REBD1D   DSECT                     BUDGET RECORD: STATION/OFFICE                
REBD1LEN DS    CL4                 RECORD LENGTH                                
REBD1TYP DS    CL5                 RECORD TYPE '05619'                          
         DS    C                                                                
REBD1ACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBD1DAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBD1TME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBD1REP DS    CL2                 REP CODE                                     
         DS    C                                                                
REBD1RTP DS    CL1                 TYPE OF BUDGET                               
*                                  C'S'   =  STATION                            
*                                  C'O'   =  STATION/OFFICE                     
*                                  C'C'   =  COMPANY                            
*                                  C'D'   =  COMPANY/OFFICE                     
         DS    C                                                                
REBD1STA DS    CL5                 STATION CALL LETTERS                         
         DS    C                                                                
REBD1OFF DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
REBD1BYR DS    CL4                 BUDGET YEAR (INFO: EX: 2003)                 
         DS    C                                                                
REBD1MOS DS    CL8                 MONTH OF SERVICE                             
         DS    C                                                                
REBD1BUD DS    CL12                MONTHLY BUDGET AMOUNT                        
         DS    C                                                                
REBD1RTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBD1DEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBD1DX  DS    CL2                 RECORD END                                   
REBD1DL  EQU   *-REBD1D            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  REP BUDGET RECORD: OFFICE BUDGET            *         
***********************************************************************         
         SPACE 1                                                                
REBD2D   DSECT                     BUDGET RECORD: OFFICE BUDGET                 
REBD2LEN DS    CL4                 RECORD LENGTH                                
REBD2TYP DS    CL5                 RECORD TYPE '05620'                          
         DS    C                                                                
REBD2ACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBD2DAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBD2TME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBD2REP DS    CL2                 REP CODE                                     
         DS    C                                                                
REBD2OFF DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
REBD2TEM DS    CL2                 TEAM   CODE (MAY BE NULL)                    
         DS    C                                                                
REBD2GSG DS    CL2                 G/SG   CODE (MAY BE NULL)                    
         DS    C                                                                
REBD2BYR DS    CL4                 BUDGET YEAR (INFO: EX: 2003)                 
         DS    C                                                                
REBD2MOS DS    CL8                 MONTH OF SERVICE                             
         DS    C                                                                
REBD2BUD DS    CL12                MONTHLY BUDGET AMOUNT                        
         DS    C                                                                
REBD2RTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBD2DEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBD2DX  DS    CL2                 RECORD END                                   
REBD2DL  EQU   *-REBD2D            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -   POINT PERSON INFORMATION RECORD                      
***********************************************************************         
         SPACE 1                                                                
REPTPD   DSECT                     P/P INFORMATION RECORD                       
REPTPLEN DS    CL4                 RECORD LENGTH                                
REPTPTYP DS    CL5                 RECORD TYPE  '05621'                         
         DS    C                                                                
REPTPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REPTPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REPTPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REPTPREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REPTPPTP DS    CL3                 POINTPERSON CODE                             
         DS    C                                                                
REPTPNAM DS    CL20                POINTPERSON NAME                             
         DS    C                                                                
REPTPOFF DS    CL2                 POINTPERSON OFFICE                           
         DS    C                                                                
REPTPTEL DS    CL12                POINTPERSON TELEPHONE                        
         DS    C                                                                
REPTPFAX DS    CL12                POINTPERSON FAX                              
         DS    C                                                                
REPTPEML DS    CL50                POINTPERSON EMAIL                            
         DS    C                                                                
REPTPSPR DS    CL3                 LOCAL S/P CODE                               
         DS    C                                                                
REPTPLDT DS    CL8                 LEAVE DATE                                   
         DS    C                                                                
REPTPRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REPTPDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REPTPDX  DS    CL2                 RECORD END                                   
REPTPDL  EQU   *-REPTPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  SET RECORD                                            
***********************************************************************         
         SPACE 1                                                                
RESTND   DSECT                     SET NAME RECORD                              
RESTNLEN DS    CL4                 RECORD LENGTH                                
RESTNTYP DS    CL5                 RECORD TYPE  '05622'                         
         DS    C                                                                
RESTNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESTNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESTNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESTNREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESTNSTY DS    CL2                 SET TYPE                                     
         DS    C                                                                
RESTNSNM DS    CL4                 SET NAME                                     
         DS    C                                                                
RESTNSFL DS    CL1                 SET EXCLUSION FLAG: Y/N                      
         DS    C                                                                
RESTNSDS DS    CL60                SET DESCRIPTION                              
         DS    C                                                                
RESTNRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESTNDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESTNDX  DS    CL2                 RECORD END                                   
RESTNDL  EQU   *-RESTND            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  SET RECORD                                            
***********************************************************************         
         SPACE 1                                                                
RESTCD   DSECT                     SET CODE RECORD                              
RESTCLEN DS    CL4                 RECORD LENGTH                                
RESTCTYP DS    CL5                 RECORD TYPE  '05623'                         
         DS    C                                                                
RESTCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESTCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESTCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESTCREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESTCSTY DS    CL2                 SET TYPE                                     
         DS    C                                                                
RESTCSNM DS    CL4                 SET NAME                                     
         DS    C                                                                
RESTCSCD DS    CL10                SET CODE                                     
         DS    C                                                                
RESTCCTR DS    CL12                SET COUNTER                                  
         DS    C                                                                
RESTCRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESTCDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESTCDX  DS    CL2                 RECORD END                                   
RESTCDL  EQU   *-RESTCD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  SWITCH RECORD                                         
***********************************************************************         
         SPACE 1                                                                
RESWID   DSECT                     SET NAME RECORD                              
RESWILEN DS    CL4                 RECORD LENGTH                                
RESWITYP DS    CL5                 RECORD TYPE  '05624'                         
         DS    C                                                                
RESWIACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESWIDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESWITME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESWIREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESWISDT DS    CL8                 SWITCH DATE                                  
         DS    C                                                                
RESWISTY DS    CL2                 SWITCH RECORD TYPE                           
         DS    C                                                                
RESWIOLD DS    CL7                 OLD CODE                                     
         DS    C                                                                
RESWISEQ DS    CL3                 SEQUENCE #                                   
         DS    C                                                                
RESWINEW DS    CL7                 NEW CODE                                     
         DS    C                                                                
RESWIIT1 DS    CL2                 NEW CODE: INHERITED TYPE 1                   
         DS    C                                                                
RESWIIC1 DS    CL3                 NEW CODE: INHERITED CODE 1                   
         DS    C                                                                
RESWIIT2 DS    CL2                 NEW CODE: INHERITED TYPE 2                   
         DS    C                                                                
RESWIIC2 DS    CL3                 NEW CODE: INHERITED CODE 2                   
         DS    C                                                                
RESWIDDS DS    CL1                 Y = DON'T OVERWRITE OLD STATION              
*                                  N = OLD STATION DELETED                      
         DS    C                                                                
RESWIDTS DS    CL8                 START DATE FILTER                            
         DS    C                                                                
RESWIDTW DS    CL1                 Y = START DATE FILTER W/IN CONTRACT          
*                                      FLIGHT DATES                             
*                                  N = CONTRACT START DATE NOT EARLIER          
*                                      THAN START DATE                          
         DS    C                                                                
RESWIRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESWIDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESWIDX  DS    CL2                 RECORD END                                   
RESWIDL  EQU   *-RESWID            RECORD LENGTH                                
         EJECT                                                                  
***>>>                                                                          
***********************************************************************         
* REP   SYSTEM EXTRACT -  SWITCH FILTER RECORD                                  
***********************************************************************         
         SPACE 1                                                                
RESWFD   DSECT                     SET NAME RECORD                              
RESWFLEN DS    CL4                 RECORD LENGTH                                
RESWFTYP DS    CL5                 RECORD TYPE  '05625'                         
         DS    C                                                                
RESWFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESWFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESWFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESWFREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESWFSDT DS    CL8                 SWITCH DATE                                  
         DS    C                                                                
RESWFSTY DS    CL2                 SWITCH RECORD TYPE                           
         DS    C                                                                
RESWFOLD DS    CL7                 OLD CODE                                     
         DS    C                                                                
RESWFSEQ DS    CL3                 SEQUENCE #                                   
         DS    C                                                                
*                                                                               
RESWFF1T DS    CL2                 FILTER 1 TYPE OF RECORD                      
         DS    C                                                                
RESWFF1C DS    CL7                 FILTER 1 CODE OF RECORD                      
         DS    C                                                                
RESWFRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESWFDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESWFDX  DS    CL2                 RECORD END                                   
RESWFDL  EQU   *-RESWFD            RECORD LENGTH                                
         EJECT                                                                  
***>>>                                                                          
***********************************************************************         
* REP   SYSTEM EXTRACT -  COMPETITIVE STATIONS RECORD                           
***********************************************************************         
         SPACE 1                                                                
RECPTD   DSECT                     SET NAME RECORD                              
RECPTLEN DS    CL4                 RECORD LENGTH                                
RECPTTYP DS    CL5                 RECORD TYPE  '05626'                         
         DS    C                                                                
RECPTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECPTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECPTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECPTREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECPTCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
RECPTSTA DS    CL5                 STATION                                      
         DS    C                                                                
RECPTPCT DS    CL5                 STATION PERCENT (100.00)                     
         DS    C                                                                
RECPTRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RECPTDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RECPTDX  DS    CL2                 RECORD END                                   
RECPTDL  EQU   *-RECPTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  DAYPART/CPP RECORD                                    
***********************************************************************         
         SPACE 1                                                                
REDPTD   DSECT                     SET NAME RECORD                              
REDPTLEN DS    CL4                 RECORD LENGTH                                
REDPTTYP DS    CL5                 RECORD TYPE  '05627'                         
         DS    C                                                                
REDPTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REDPTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REDPTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REDPTREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REDPTCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REDPTDPT DS    CL1                 DAYPART CODE                                 
         DS    C                                                                
REDPTCPP DS    CL10                CPP VALUE (TWO DECIMAL)                      
         DS    C                                                                
REDPTRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REDPTDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REDPTDX  DS    CL2                 RECORD END                                   
REDPTDL  EQU   *-REDPTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  LENGTH RECORD                                         
***********************************************************************         
         SPACE 1                                                                
RELEND   DSECT                     SET NAME RECORD                              
RELENLEN DS    CL4                 RECORD LENGTH                                
RELENTYP DS    CL5                 RECORD TYPE  '05628'                         
         DS    C                                                                
RELENACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RELENDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RELENTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RELENREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RELENCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
RELENCTR DS    CL12                COUNTER                                      
         DS    C                                                                
RELENLTH DS    CL4                 SPOT LENGTH                                  
         DS    C                                                                
RELENRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RELENDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RELENDX  DS    CL2                 RECORD END                                   
RELENDL  EQU   *-RELEND            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  BOOKS RECORD                                          
***********************************************************************         
         SPACE 1                                                                
REBKSD   DSECT                     SET NAME RECORD                              
REBKSLEN DS    CL4                 RECORD LENGTH                                
REBKSTYP DS    CL5                 RECORD TYPE  '05629'                         
         DS    C                                                                
REBKSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBKSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBKSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBKSREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REBKSCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBKSCTR DS    CL12                COUNTER                                      
         DS    C                                                                
REBKSBOK DS    CL10                BOOK DATE (SPECIAL DEM FORMAT)               
         DS    C                                                                
REBKSRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBKSDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBKSDX  DS    CL2                 RECORD END                                   
REBKSDL  EQU   *-REBKSD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - STATION PID         RECORD                   *         
***********************************************************************         
         SPACE 1                                                                
REPIDD   DSECT                     STATION PID RECORD                           
REPIDLEN DS    CL4                 RECORD LENGTH                                
REPIDTYP DS    CL5                 RECORD TYPE '05630'                          
         DS    C                                                                
REPIDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REPIDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REPIDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REPIDREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REPIDSTA DS    CL5                 STATION CALL LETTERS                         
         DS    C                                                                
REPIDPID DS    CL8                 PERSONAL ID                                  
         DS    C                                                                
REPIDRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REPIDDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REPIDDX  DS    CL2                 RECORD END                                   
REPIDDL  EQU   *-REPIDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - STATION OFFICE FILTER RECORD                 *         
***********************************************************************         
         SPACE 1                                                                
RESOFD   DSECT                     STATION OFFICE FILTER RECORD                 
RESOFLEN DS    CL4                 RECORD LENGTH                                
RESOFTYP DS    CL5                 RECORD TYPE '05631'                          
         DS    C                                                                
RESOFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESOFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESOFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESOFREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESOFSTA DS    CL5                 STATION CALL LETTERS                         
         DS    C                                                                
RESOFOFF DS    CL2                 OFFICE FILTER                                
         DS    C                                                                
RESOFRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESOFDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESOFDX  DS    CL2                 RECORD END                                   
RESOFDL  EQU   *-RESOFD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - CONFIRM COMMENT RECORD                       *         
***********************************************************************         
         SPACE 1                                                                
RECCOD   DSECT                     CONFIRMATION COMMENT  RECORD                 
RECCOLEN DS    CL4                 RECORD LENGTH                                
RECCOTYP DS    CL5                 RECORD TYPE '05632'                          
         DS    C                                                                
RECCOACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECCODAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECCOTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECCOREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECCOCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
RECCORTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RECCODEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RECCODX  DS    CL2                 RECORD END                                   
RECCODL  EQU   *-RECCOD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - PENDING / FORECAST COMMENT RECORD            *         
*                                D                                    *         
***********************************************************************         
         SPACE 1                                                                
REPFCD   DSECT                     PENDFORE COMMENT RECORD                      
REPFCLEN DS    CL4                 RECORD LENGTH                                
REPFCTYP DS    CL5                 RECORD TYPE   '05633'                        
         DS    C                                                                
REPFCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REPFCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REPFCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REPFCREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REPFCCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REPFCCO# DS    CL2                 LINE NUMBER                                  
         DS    C                                                                
REPFCLIN DS    CL70                LINE OF COMMENT                              
         DS    C                                                                
REPFCRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REPFCDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REPFCDX  DS    CL2                 RECORD END                                   
REPFCDL  EQU   *-REPFCD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - STATION EMAIL ADDRESS RECORD                 *         
***********************************************************************         
         SPACE 1                                                                
RESEMD   DSECT                     STATION EMAIL ADDR RECORD                    
RESEMLEN DS    CL4                 RECORD LENGTH                                
RESEMTYP DS    CL5                 RECORD TYPE '05634'                          
         DS    C                                                                
RESEMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESEMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESEMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESEMREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESEMSTA DS    CL5                 STATION CALL LETTERS                         
         DS    C                                                                
RESEMEM# DS    CL2                 EMAIL NUMBER                                 
         DS    C                                                                
RESEMEML DS    CL65                EMAIL ADDRESS                                
         DS    C                                                                
RESEMRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESEMDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESEMDX  DS    CL2                 RECORD END                                   
RESEMDL  EQU   *-RESEMD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  STATION COMPETITIVE STATIONS RECORD                   
***********************************************************************         
         SPACE 1                                                                
RECMSD   DSECT                     SET NAME RECORD                              
RECMSLEN DS    CL4                 RECORD LENGTH                                
RECMSTYP DS    CL5                 RECORD TYPE  '05635'                         
         DS    C                                                                
RECMSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECMSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECMSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECMSREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECMSRST DS    CL5                 REP'D STATION                                
         DS    C                                                                
RECMSCST DS    CL5                 COMPETITIVE STATION                          
         DS    C                                                                
RECMSAFF DS    CL3                 AFFILIATION                                  
         DS    C                                                                
RECMSRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RECMSDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RECMSDX  DS    CL2                 RECORD END                                   
RECMSDL  EQU   *-RECMSD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  OFFICE TEAM RECORD                                    
***********************************************************************         
         SPACE 1                                                                
REOTMD   DSECT                     SET NAME RECORD                              
REOTMLEN DS    CL4                 RECORD LENGTH                                
REOTMTYP DS    CL5                 RECORD TYPE  '05636'                         
         DS    C                                                                
REOTMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REOTMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REOTMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REOTMREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REOTMRST DS    CL5                 REP'D STATION                                
         DS    C                                                                
REOTMCOF DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
REOTMATM DS    CL2                 TEAM CODE                                    
         DS    C                                                                
REOTMRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REOTMDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REOTMDX  DS    CL2                 RECORD END                                   
REOTMDL  EQU   *-REOTMD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  REGION RECORD                                         
***********************************************************************         
         SPACE 1                                                                
RERGND   DSECT                     SET NAME RECORD                              
RERGNLEN DS    CL4                 RECORD LENGTH                                
RERGNTYP DS    CL5                 RECORD TYPE  '05637'                         
         DS    C                                                                
RERGNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RERGNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RERGNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RERGNREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RERGNREG DS    CL2                 REGION CODE                                  
         DS    C                                                                
RERGNNAM DS    CL20                REGION NAME                                  
         DS    C                                                                
RERGNRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RERGNDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RERGNDX  DS    CL2                 RECORD END                                   
RERGNDL  EQU   *-RERGND            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  TERRITORY RECORD                                      
***********************************************************************         
         SPACE 1                                                                
RETERD   DSECT                     SET NAME RECORD                              
RETERLEN DS    CL4                 RECORD LENGTH                                
RETERTYP DS    CL5                 RECORD TYPE  '05638'                         
         DS    C                                                                
RETERACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RETERDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RETERTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RETERREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RETERTER DS    CL2                 TERRITORY CODE                               
         DS    C                                                                
RETERNAM DS    CL30                TERRITORY NAME                               
         DS    C                                                                
RETERRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RETERDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RETERDX  DS    CL2                 RECORD END                                   
RETERDL  EQU   *-RETERD            RECORD LENGTH                                
         EJECT                                                                  
**********************************************************************          
* REP   SYSTEM EXTRACT -  STANDARD COMMENT                                      
**********************************************************************          
         SPACE 1                                                                
RESCMD   DSECT                     SET NAME RECORD                              
RESCMLEN DS    CL4                 RECORD LENGTH                                
RESCMTYP DS    CL5                 RECORD TYPE  '05639'                         
         DS    C                                                                
RESCMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESCMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESCMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESCMREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESCMCOD DS    CL8                 STANDARD COMMENT CODE                        
         DS    C                                                                
RESCMCO# DS    CL2                 LINE NUMBER                                  
         DS    C                                                                
RESCMLIN DS    CL70                LINE OF COMMENT                              
         DS    C                                                                
RESCMRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESCMDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESCMDX  DS    CL2                 RECORD END                                   
RESCMDL  EQU   *-RESCMD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  OFFICE   COMMENT                                      
***********************************************************************         
         SPACE 1                                                                
REOFCD   DSECT                     SET NAME RECORD                              
REOFCLEN DS    CL4                 RECORD LENGTH                                
REOFCTYP DS    CL5                 RECORD TYPE  '05640'                         
         DS    C                                                                
REOFCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REOFCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REOFCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REOFCREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REOFCCOO DS    CL2                 OFFICE   COMMENT OFFICE                      
         DS    C                                                                
REOFCCOD DS    CL2                 OFFICE   COMMENT CODE                        
         DS    C                                                                
REOFCCO# DS    CL2                 LINE NUMBER                                  
         DS    C                                                                
REOFCLIN DS    CL60                LINE OF COMMENT                              
         DS    C                                                                
REOFCDES DS    CL30                DESCRIPTION (LINE 1 ONLY)                    
         DS    C                                                                
REOFCRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REOFCDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REOFCDX  DS    CL2                 RECORD END                                   
REOFCDL  EQU   *-REOFCD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - DARE AGENCY OFFICE RECORD                    *         
***********************************************************************         
         SPACE 1                                                                
REDAOD   DSECT                     DARE AGENCY OFFICE RECORD                    
REDAOLEN DS    CL4                 RECORD LENGTH                                
REDAOTYP DS    CL5                 RECORD TYPE   '05641'                        
         DS    C                                                                
REDAOACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REDAODAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REDAOTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REDAOREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REDAOAGY DS    CL6                 AGENCY/AGENCY OFFICE CODE                    
         DS    C                                                                
REDAOAGO DS    CL5                 AGENCY / AGENCY OFFICE                       
         DS    C                                                                
REDAOCTR DS    CL1                 SEQUENCE COUNTER                             
         DS    C                                                                
REDAORTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REDAODEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REDAODX  DS    CL2                 RECORD END                                   
REDAODL  EQU   *-REDAOD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - AGENCY COMMENT RECORD                        *         
***********************************************************************         
         SPACE 1                                                                
REACOD   DSECT                     DARE AGENCY COMMENT RECORD                   
REACOLEN DS    CL4                 RECORD LENGTH                                
REACOTYP DS    CL5                 RECORD TYPE   '05642'                        
         DS    C                                                                
REACOACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REACODAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REACOTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REACOREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REACOAGY DS    CL6                 AGENCY/AGENCY OFFICE CODE                    
         DS    C                                                                
REACOCOM DS    CL60                AGENCY COMMENT                               
         DS    C                                                                
REACOCTR DS    CL1                 SEQUENCE COUNTER                             
         DS    C                                                                
REACORTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REACODEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REACODX  DS    CL2                 RECORD END                                   
REACODL  EQU   *-REACOD            RECORD LENGTH                                
         EJECT                                                                  
**>>>>   EOP AGENCY                                                             
***********************************************************************         
* REP   SYSTEM EXTRACT - EOP AGENCY RECORD                            *         
***********************************************************************         
         SPACE 1                                                                
REEPAD   DSECT                     CONTYPE INFORMATION RECORD                   
REEPALEN DS    CL4                 RECORD LENGTH                                
REEPATYP DS    CL5                 RECORD TYPE '05643'                          
         DS    C                                                                
REEPAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REEPADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REEPATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REEPAREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REEPATRF DS    CL1                 TRAFFIC SYSTEM                               
*                                  B  =  BIAS                                   
*                                  C  =  COLUMBINE                              
*                                  E  =  ENTERPRISE                             
*                                  J  =  JDS/2000                               
         DS    C                                                                
REEPASTA DS    CL5                 STATION                                      
         DS    C                                                                
REEPAAGY DS    CL6                 DDS AGENCY CODE                              
         DS    C                                                                
REEPAEAG DS    CL8                 TRAFFIC AGENCY EQUIVALENCY CODE              
*                                  BIAS/ENT/VCI  =  6N                          
*                                  COL           =  5N                          
*                                  JDS           =  6N                          
         DS    C                                                                
REEPASTT DS    CL1                 STATUS                                       
         DS    C                                                                
REEPAADT DS    CL8                 ACTIVITY DATE                                
         DS    C                                                                
REEPATOF DS    CL2                 TRADE OFFICE                                 
         DS    C                                                                
REEPARTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REEPADEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REEPADX  DS    CL2                 RECORD END                                   
REEPADL  EQU   *-REEPAD            RECORD LENGTH                                
         EJECT                                                                  
**>>>>   EOP AGENCY                                                             
**>>>>   EOP ADVERT                                                             
***********************************************************************         
* REP   SYSTEM EXTRACT - EOP ADVERT RECORD                            *         
***********************************************************************         
         SPACE 1                                                                
REEPDD   DSECT                     CONTYPE INFORMATION RECORD                   
REEPDLEN DS    CL4                 RECORD LENGTH                                
REEPDTYP DS    CL5                 RECORD TYPE '05644'                          
         DS    C                                                                
REEPDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REEPDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REEPDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REEPDREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REEPDTRF DS    CL1                 TRAFFIC SYSTEM                               
*                                  B  =  BIAS                                   
*                                  C  =  COLUMBINE                              
*                                  E  =  ENTERPRISE                             
*                                  J  =  JDS/2000                               
         DS    C                                                                
REEPDSTA DS    CL5                 STATION                                      
         DS    C                                                                
REEPDADV DS    CL4                 DDS ADVERT CODE                              
         DS    C                                                                
REEPDEAD DS    CL8                 TRAFFIC ADVERT EQUIVALENCY CODE              
*                                  BIAS/ENT/VCI  =  6N                          
*                                  COL           =  5N                          
*                                  JDS           =  4A                          
         DS    C                                                                
REEPDSTT DS    CL1                 STATUS                                       
         DS    C                                                                
REEPDADT DS    CL8                 ACTIVITY DATE                                
         DS    C                                                                
REEPDRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REEPDDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REEPDDX  DS    CL2                 RECORD END                                   
REEPDDL  EQU   *-REEPDD            RECORD LENGTH                                
         EJECT                                                                  
**>>>>   EOP ADVERT                                                             
**>>>>   EOP OFFICE                                                             
***********************************************************************         
* REP   SYSTEM EXTRACT - EOP OFFICE RECORD                            *         
***********************************************************************         
         SPACE 1                                                                
REEPOD   DSECT                     CONTYPE INFORMATION RECORD                   
REEPOLEN DS    CL4                 RECORD LENGTH                                
REEPOTYP DS    CL5                 RECORD TYPE '05645'                          
         DS    C                                                                
REEPOACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REEPODAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REEPOTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REEPOREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REEPOTRF DS    CL1                 TRAFFIC SYSTEM                               
*                                  B  =  BIAS                                   
*                                  C  =  COLUMBINE                              
*                                  E  =  ENTERPRISE                             
*                                  J  =  JDS/2000                               
         DS    C                                                                
REEPOSTA DS    CL5                 STATION                                      
         DS    C                                                                
REEPOOFF DS    CL4                 DDS OFFICE CODE                              
         DS    C                                                                
REEPOEOF DS    CL8                 TRAFFIC ADVERT EQUIVALENCY CODE              
*                                  BIAS/ENT/VCI  =  6N                          
*                                  COL           =  NA                          
*                                  JDS           =  3A                          
         DS    C                                                                
REEPOSTT DS    CL1                 STATUS                                       
         DS    C                                                                
REEPOADT DS    CL8                 ACTIVITY DATE                                
         DS    C                                                                
REEPORTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REEPODEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REEPODX  DS    CL2                 RECORD END                                   
REEPODL  EQU   *-REEPOD            RECORD LENGTH                                
         EJECT                                                                  
**>>>>   EOP OFFICE                                                             
**>>>>   EOP S/P                                                                
***********************************************************************         
* REP   SYSTEM EXTRACT - EOP OFFICE RECORD                            *         
***********************************************************************         
         SPACE 1                                                                
REEPSD   DSECT                     CONTYPE INFORMATION RECORD                   
REEPSLEN DS    CL4                 RECORD LENGTH                                
REEPSTYP DS    CL5                 RECORD TYPE '05646'                          
         DS    C                                                                
REEPSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REEPSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REEPSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REEPSREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REEPSTRF DS    CL1                 TRAFFIC SYSTEM                               
*                                  B  =  BIAS                                   
*                                  C  =  COLUMBINE                              
*                                  E  =  ENTERPRISE                             
*                                  J  =  JDS/2000                               
         DS    C                                                                
REEPSSTA DS    CL5                 STATION                                      
         DS    C                                                                
REEPSSP  DS    CL4                 DDS OFFICE CODE                              
         DS    C                                                                
REEPSESP DS    CL8                 TRAFFIC ADVERT EQUIVALENCY CODE              
*                                  BIAS/ENT/VCI  =  6N                          
*                                  COL           =  3N                          
*                                  JDS           =  4N                          
         DS    C                                                                
REEPSSTT DS    CL1                 STATUS                                       
         DS    C                                                                
REEPSADT DS    CL8                 ACTIVITY DATE                                
         DS    C                                                                
REEPSRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REEPSDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REEPSDX  DS    CL2                 RECORD END                                   
REEPSDL  EQU   *-REEPSD            RECORD LENGTH                                
         EJECT                                                                  
**>>>>   EOP S/P                                                                
***********************************************************************         
* REP   SYSTEM EXTRACT - SPL COMMENT RECORD                           *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
RESPCD   DSECT                     PENDFORE COMMENT RECORD                      
RESPCLEN DS    CL4                 RECORD LENGTH                                
RESPCTYP DS    CL5                 RECORD TYPE   '05647'                        
         DS    C                                                                
RESPCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESPCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESPCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESPCREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
RESPCCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
RESPCCO# DS    CL2                 LINE NUMBER                                  
         DS    C                                                                
RESPCLIN DS    CL70                LINE OF COMMENT                              
         DS    C                                                                
RESPCRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
RESPCDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
RESPCDX  DS    CL2                 RECORD END                                   
RESPCDL  EQU   *-RESPCD            RECORD LENGTH                                
         EJECT                                                                  
****   SPECIAL BUY CODE                                                         
***********************************************************************         
* REP   SYSTEM EXTRACT - SPECIAL BUY CODE RECORD                      *         
*                                                                     *         
***********************************************************************         
         SPACE 1                                                                
REBCDD   DSECT                     SPECIAL BUYCODE  RECORD                      
REBCDLEN DS    CL4                 RECORD LENGTH                                
REBCDTYP DS    CL5                 RECORD TYPE   '05648'                        
         DS    C                                                                
REBCDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBCDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBCDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBCDREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBCDRTY DS    CL1                 BUYCODE RECORD TYPE:                         
*                                  T  =  TYPE RECORD                            
*                                  C  =  CODE RECORD                            
         DS    C                                                                
REBCDCOD DS    CL3                 RECORD CODE                                  
*                                  2 CHAR IF REBCDRTY = T                       
*                                  3 CHAR MAX IF      = C                       
         DS    C                                                                
REBCDDES DS    CL20                DESCRIPTION                                  
         DS    C                                                                
*                                                                               
*   FOLLOWING THREE FIELDS MAY HAVE WHEN REBCDRTY = C ONLY                      
*                                                                               
REBCDTY1 DS    CL2                 TYPE CODE 1                                  
         DS    C                                                                
REBCDTY2 DS    CL2                 TYPE CODE 2                                  
         DS    C                                                                
REBCDTY3 DS    CL2                 TYPE CODE 3                                  
         DS    C                                                                
REBCDDTE DS    CL8                 DATE LAST ENTERED                            
         DS    C                                                                
REBCDDTC DS    CL8                 DATE LAST CHANGED                            
         DS    C                                                                
REBCDLUI DS    CL8                 LUID MAKING CHANGE                           
         DS    C                                                                
REBCDRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBCDDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBCDDX  DS    CL2                 RECORD END                                   
REBCDDL  EQU   *-REBCDD            RECORD LENGTH                                
         EJECT                                                                  
****   SPECIAL BUY CODE                                                         
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY HEADER RECORD                            *         
* 1 PER BUY                                                           *         
***********************************************************************         
         SPACE 1                                                                
REBUYD   DSECT                     BUY HEADER RECORD                            
REBUYLEN DS    CL4                 RECORD LENGTH                                
REBUYTYP DS    CL5                 RECORD TYPE   '05649'                        
         DS    C                                                                
REBUYACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBUYDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBUYTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBUYREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBUYCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBUYPLN DS    CL3                 PLAN CODE                                    
         DS    C                                                                
REBUYMLN DS    CL3                 MASTER LINE NUMBER                           
*                                  (NORMALLY SAME AS LINE NUMBER                
*                                  BUT FOR MAKE-GOODS THIS REFERS               
*                                  TO MISSED LINE FOR PROPER                    
*                                  SORTING SEQUENCE)                            
         DS    C                                                                
REBUYLIN DS    CL3                 LINE NUMBER                                  
         DS    C                                                                
REBUYNW  DS    CL3                 NUMBER PER WEEK                              
         DS    C                                                                
REBUYCOS DS    CL10                COST IN PENNIES                              
         DS    C                                                                
REBUYCLS DS    CL3                 CLASS CODE                                   
         DS    C                                                                
REBUYSEC DS    CL3                 SECTION CODE                                 
         DS    C                                                                
REBUYCRE DS    CL8                 BUY CREATION DATE                            
         DS    C                                                                
REBUYCRD DS    CL3                 CARD AND/OR UNITS                            
         DS    C                                                                
REBUYLCD DS    CL8                 LAST CHANGE DATE                             
         DS    C                                                                
REBUYKMD DS    CL3                 CONTRACT MODIFICATION NUMBER                 
         DS    C                                                                
REBUYCHI DS    CL2                 CHANGE INDICATORS                            
*                                  A=ADDED                                      
*                                  C=CANCELLED                                  
*                                  D=DAYS CHANGED                               
*                                  E=EFFECTIVE DATES CHANGED                    
*                                  F=FLIGHT NUMBER CHANGED                      
*                                  L=LENGTH CHANGED                             
*                                  M=MAKE-GOOD STATUS CHANGE                    
*                                  O=ORDER COMMENTS CHANGED                     
*                                  T=TIME CHANGED                               
*                                  S=SPOTS/WEEK CHANGED                         
*                                  P=PLAN, CLASS OR SECTION CHG                 
*                                  R=RATE CHANGED                               
*                                  X=DELETE (NO PRINTING)                       
*                                  Z=COMMENTS CHANGE                            
*                                  *=MORE THAN 2 CODES CHANGED                  
         DS    C                                                                
REBUYTSP DS    CL5                 TOTAL SPOTS                                  
         DS    C                                                                
REBUYTCS DS    CL10                TOTAL COST IN PENNIES                        
         DS    C                                                                
REBUYWKD DS    CL3                 TOTAL WEEKS                                  
         DS    C                                                                
REBUYSTD DS    CL1                 START DAY FOR ALL '05650' RECORDS            
*                                  (MONDAY=1, TUESDAY=2,ETC)                    
         DS    C                                                                
REBUYEND DS    CL1                 END DAY FOR ALL '05650' RECORDS              
         DS    C                                                                
REBUYDUR DS    CL5                 LENGTH IN SECONDS                            
         DS    C                                                                
REBUYMFG DS    CL1                 LENGTH IN MINUTES FLAG                       
*                                  'Y' = LENGTH IS IN MINUTES                   
         DS    C                                                                
REBUYSPT DS    CL1                 SPORTS BUY FLAG                              
*                                  'Y' = SPORTS BUY                             
         DS    C                                                                
REBUYSTY DS    CL1                 SPORTS BUY TYPE                              
*                                  H = HARD SIGN                                
*                                  E = ELECTRONIC SIGN                          
*                                  V = VIRTUAL                                  
*                                  D = ENDORSEMENT                              
*                                  P = PROMOTION                                
         DS    C                                                                
REBUYFLT DS    CL3                 FLIGHT CODE                                  
         DS    C                                                                
REBUYVER DS    CL3                 VERSION NUMBER                               
         DS    C                                                                
REBUYPTP DS    CL1                 PROGRAM TYPE                                 
         DS    C                                                                
REBUYDPT DS    CL1                 DAYPART CODE                                 
         DS    C                                                                
REBUYSTT DS    CL8                 STATUS                                       
*                                  Y IN POSITION INDICATES 'YES'                
*                                  POS 1=REP-TO-SPOT FLIP/FLOP                  
*                                  POS 2=BUY IS A COMBO                         
*                                  POS 3=BUY IS A BONUS                         
*                                  POS 4=BUY IS A PREEMPT/CREDIT                
*                                  POS 5=BUY IS A LATE RUN                      
*                                  POS 6=BUY IS A LATE RUN WITH                 
*                                          BONUS. POS 3 IS ALSO                 
*                                          ON IF THIS IS THE                    
*                                          BONUS PART OF THE LR                 
*                                  POS 7=BUY IS A REPLACEMENT NA                
*                                  POS 8=BUY SPOTS WERE ZEROED                  
*                                        BY CONTRACT PROFILE 36                 
*                                        OR MANUALLY                            
         DS    C                                                                
REBUYAGN DS    CL3                 DARE AGENCY BUY NUMBER LINK                  
         DS    C                                                                
REBUYST2 DS    CL8                 STATUS                                       
*                                  Y IN POSITION INDICATES 'YES'                
*                                  POS 1='DAILY' ORDER                          
*                                  POS 2=ADDED BY SFM BUYCOPY                   
*                                  POS 3=CONVERSION 'CANCL' ORDER               
*                                  POS 4=DELETED BUYLINE                        
*                                  POS 5=CANCELLED BUYLINE                      
*                                  POS 6=CREDIT                                 
*                                  POS 7=TRADE                                  
*                                  POS 8=BONUS                                  
         DS    C                                                                
REBUYRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBUYDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBUYDX  DS    CL2                 RECORD END                                   
REBUYDL  EQU   *-REBUYD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY DAY-TIME RECORD                          *         
* 1 OR MORE PER BUY. 2 OR MORE = ORBIT                                *         
***********************************************************************         
         SPACE 1                                                                
REBDTD   DSECT                     BUY DAY-TIME RECORD                          
REBDTLEN DS    CL4                 RECORD LENGTH                                
REBDTTYP DS    CL5                 RECORD TYPE   '05650'                        
         DS    C                                                                
REBDTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBDTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBDTTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBDTREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBDTCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBDTLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBDTSTR DS    CL1                 START DAY (MONDAY=1, ETC)                    
         DS    C                                                                
REBDTEND DS    CL1                 END DAY                                      
         DS    C                                                                
REBDTDYS DS    CL8                 DAYS                                         
*                                  Y IN POSITION INDICATES ON                   
*                                  POS 1=CC (PROGRAM CONCLUSION                 
*                                        OVERRIDE)                              
*                                  POS 2=MONDAY                                 
*                                  POS 3=TUESDAY                                
*                                  POS 4=WEDNESDAY                              
*                                  POS 5=THURSDAY                               
*                                  POS 6=FRIDAY                                 
*                                  POS 7=SATURDAY                               
*                                  POS 8=SUNDAY                                 
         DS    C                                                                
REBDTTM1 DS    CL4                 0000-2400 START TIME FOR REBDDAYS            
         DS    C                                                                
REBDTTM2 DS    CL4                 0000-2400 END TIME FOR REBDDAYS              
         DS    C                                                                
REBDTSSB DS    CL1                 SPORTS SPECTRUM FLAG                         
*                                  Y=BUY IS SPORTS SPECTRUM. THERE IS           
*                                    NO DAY/TIME DATA                           
         DS    C                                                                
REBDTWTF DS    CL3                 WEIGHTING FACTOR (NO. SPOTS) IN THIS         
*                                  DAY-TIME PERIOD                              
         DS    C                                                                
REBDTRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBDTDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBDTDX  DS    CL2                 RECORD END                                   
REBDTDL  EQU   *-REBDTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY EFFECTIVE DATE RECORD                    *         
* 1 OR MORE PER BUY                                                   *         
***********************************************************************         
         SPACE 1                                                                
REBEDD   DSECT                     BUY EFFECTIVE DATE RECORD                    
REBEDLEN DS    CL4                 RECORD LENGTH                                
REBEDTYP DS    CL5                 RECORD TYPE   '05651'                        
         DS    C                                                                
REBEDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBEDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBEDTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBEDREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBEDCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBEDLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBEDSTR DS    CL8                 START DATE = 1ST DAY IN WEEK 1               
*                                  PLAN RECORD DATE ELEMENT ENDS HERE           
*                                  WITH MONDAY WEEK DATE                        
REBEDEND DS    CL8                 END DATE = END DAY IN END WEEK               
         DS    C                                                                
REBEDALT DS    CL1                 ALTERNATE WEEK INDICATOR                     
*                                  Y=RUNS EVERY OTHER WEEK                      
         DS    C                                                                
REBEDNPO DS    CL1                 NPW OVERRIDE                                 
*                                  Y=OVERRIDES NPW IN RECORD '05649'            
         DS    C                                                                
REBEDNPW DS    CL3                 NUMBER PER WEEK. USUALLY SAME AS             
*                                  REBUYNW IN RECORD '05649'                    
REBEDNOW DS    CL3                 NUMBER OF WEEKS                              
         DS    C                                                                
REBEDRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBEDDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBEDX   DS    CL2                 RECORD END                                   
REBEDTDL  EQU   *-REBEDD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY COMMENT RECORD                           *         
* 0 OR MORE PER BUY                                                   *         
***********************************************************************         
         SPACE 1                                                                
REBCMD   DSECT                     BUY COMMENT RECORD                           
REBCMLEN DS    CL4                 RECORD LENGTH                                
REBCMTYP DS    CL5                 RECORD TYPE   '05652'                        
         DS    C                                                                
REBCMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBCMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBCMTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBCMREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBCMCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBCMLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBCMCMT DS    CL60                BUY COMMENT                                  
         DS    C                                                                
REBCMRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBCMDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBCMX   DS    CL2                 RECORD END                                   
REBCMDL  EQU   *-REBCMD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY AGENCY DEMO CATEGORY/VALUE RECORD        *         
* 0 OR MORE PER BUY                                                   *         
***********************************************************************         
         SPACE 1                                                                
REBDDD   DSECT                     BUY AGENCY DEMO RECORD                       
REBDDLEN DS    CL4                 RECORD LENGTH                                
REBDDTYP DS    CL5                 RECORD TYPE   '05653'                        
         DS    C                                                                
REBDDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBDDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBDDTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBDDREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBDDCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBDDLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBDDCAT DS    CL10                DEMO CATEGORY                                
         DS    C                                                                
REBDDVAL DS    CL10                1 IMPLIED DECIMAL, IMP'S IN 1000'S           
*                                  IF SPACES, VALUE WAS NOT PROVIDED            
         DS    C                                                                
REBDDPVL DS    CL10                PREVIOUS VALUE                               
*                                  SEE REBDDVAL FOR DATA FORMAT                 
         DS    C                                                                
REBDDRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBDDDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBDDX   DS    CL2                 RECORD END                                   
REBDDDL  EQU   *-REBDDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY REP DEMO CATEGORY/VALUE RECORD           *         
* 0 OR MORE PER BUY                                                   *         
***********************************************************************         
         SPACE 1                                                                
REBRDD   DSECT                     BUY REP DEMO RECORD                          
REBRDLEN DS    CL4                 RECORD LENGTH                                
REBRDTYP DS    CL5                 RECORD TYPE   '05654'                        
         DS    C                                                                
REBRDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBRDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBRDTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBRDREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBRDCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBRDLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBRDCAT DS    CL10                DEMO CATEGORY                                
         DS    C                                                                
REBRDVAL DS    CL10                1 IMPLIED DECIMAL, IMP'S IN 1000'S           
*                                  IF SPACES, VALUE WAS NOT PROVIDED            
*                                  BY THE AGENCY                                
         DS    C                                                                
REBRDPVL DS    CL10                PREVIOUS VALUE                               
*                                  SEE REBRDVAL FOR DATA FORMAT                 
         DS    C                                                                
REBRDRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBRDDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBRDX   DS    CL2                 RECORD END                                   
REBRDDL  EQU   *-REBRDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY PATTERN RECORD                           *         
* 0 OR 1 PER BUY                                                      *         
***********************************************************************         
         SPACE 1                                                                
REBPTD   DSECT                     BUY PATTERN RECORD                           
REBPTLEN DS    CL4                 RECORD LENGTH                                
REBPTTYP DS    CL5                 RECORD TYPE   '05655'                        
         DS    C                                                                
REBPTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBPTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBPTTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBPTREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBPTCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBPTLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBPTPT  DS    CL10                PATTERN                                      
         DS    C                                                                
REBPTNOT DS    CL15                NOTATION                                     
         DS    C                                                                
REBPTFLG DS    CL1                 PATTERN USE FLAG                             
*                                  Y=USE START/END TIMES FROM SELL              
*                                  PATTERN                                      
         DS    C                                                                
REBPTRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBPTDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBPTX   DS    CL2                 RECORD END                                   
REBPTDL  EQU   *-REBPTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY PROGRAM RECORD                           *         
* 0 OR 1 PER BUY                                                      *         
***********************************************************************         
         SPACE 1                                                                
REBPGD   DSECT                     BUY PROGRAM RECORD                           
REBPGLEN DS    CL4                 RECORD LENGTH                                
REBPGTYP DS    CL5                 RECORD TYPE   '05656'                        
         DS    C                                                                
REBPGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBPGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBPGTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBPGREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBPGCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBPGLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBPGPGN DS    CL34                PROGRAM NAME                                 
         DS    C                                                                
REBPGRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBPGDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBPGX   DS    CL2                 RECORD END                                   
REBPGDL  EQU   *-REBPGD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY SPECIAL BUY CODE RECORD                  *         
* 0 OR 1 PER BUY                                                      *         
***********************************************************************         
         SPACE 1                                                                
REBBCD   DSECT                     BUY SPECIAL BUY CODE RECORD                  
REBBCLEN DS    CL4                 RECORD LENGTH                                
REBBCTYP DS    CL5                 RECORD TYPE   '05657'                        
         DS    C                                                                
REBBCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBBCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBBCTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBBCREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBBCCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBBCLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBBCBCD DS    CL3                 BUY CODE                                     
         DS    C                                                                
REBBCRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBBCDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBBCX   DS    CL2                 RECORD END                                   
REBBCDL  EQU   *-REBBCD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY SPORTS BUY DESCRIPTIVE COMMENTS RECORD   *         
* 0 OR MORE PER BUY                                                   *         
***********************************************************************         
         SPACE 1                                                                
REBSBD   DSECT                     SPORTS BUY DESCRIPTIVE RECORD                
REBSBLEN DS    CL4                 RECORD LENGTH                                
REBSBTYP DS    CL5                 RECORD TYPE   '05658'                        
         DS    C                                                                
REBSBACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBSBDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBSBTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBSBREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBSBCON DS    CL8                     CONTRACT NUMBER                          
         DS    C                                                                
REBSBLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBSBCMT DS    CL40                COMMENT                                      
         DS    C                                                                
REBSBRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBSBDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBSBX   DS    CL2                 RECORD END                                   
REBSBDL  EQU   *-REBSBD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - BUY ORDER COMMENTS RECORD                    *         
* 0 OR MORE PER BUY                                                   *         
***********************************************************************         
         SPACE 1                                                                
REBOCD   DSECT                     BUY ORDER COMMENTS RECORD                    
REBOCLEN DS    CL4                 RECORD LENGTH                                
REBOCTYP DS    CL5                 RECORD TYPE   '05659'                        
         DS    C                                                                
REBOCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REBOCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REBOCTIM DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REBOCREP DS    CL2                 REP CODE (MASTER REP CODE)                   
         DS    C                                                                
REBOCCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REBOCLIN DS    CL3                 LINE NUMBER (GROUPS WITH REBUYLIN            
*                                  IN RECORD TYPE '05649')                      
         DS    C                                                                
REBOCROS DS    CL1                 REP OR STATION INPUT COMMENT                 
*                                  R=REP                                        
*                                  S=STATION                                    
REBOCCMT DS    CL60                COMMENT                                      
         DS    C                                                                
REBOCRTS DS    CL14                REFRESH TIME STAMP                           
         DS    C                                                                
REBOCDEL DS    CL1                 DELETE FLAG (D OR BLANK)                     
*                                                                               
REBOCX   DS    CL2                 RECORD END                                   
REBOCDL  EQU   *-REBOCD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  TRANSFER END OF DATA RECORD                 *         
***********************************************************************         
         SPACE 1                                                                
REXFRD   DSECT                     REP TRANSFER RECORD                          
REXFRLEN DS    CL4                 RECORD LENGTH                                
REXFRTYP DS    CL5                 RECORD TYPE '99999'                          
REXFRMSG DS    CL11                CONSTANT: 'END OF DATA'                      
REXFRDL  EQU   *-REXFRD            RECORD LENGTH                                
         EJECT                                                                  
