*          DATA SET RXRECDS    AT LEVEL 057 AS OF 05/03/02                      
       ++INCLUDE DXHDRD                                                         
         EJECT                                                                  
       ++INCLUDE DXTRLD            TRAILER                                      
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - CONTRACT HEADER INFO RECORD                  *         
***********************************************************************         
         SPACE 1                                                                
RECOND   DSECT                     CONTRACT HEADER RECORD                       
RECONLEN DS    CL4                 RECORD LENGTH                                
RECONTYP DS    CL5                 RECORD TYPE     '05600'                      
         DS    C                                                                
RECONACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECONDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECONTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECONREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECONCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
RECONSTA DS    CL5                 STATION OF ORDER                             
         DS    C                                                                
RECONSAL DS    CL3                 SALESPERSON   CODE                           
         DS    C                                                                
RECONOFF DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
RECONTEM DS    CL2                 TEAM CODE                                    
         DS    C                                                                
RECONADV DS    CL4                 ADVERTISER CODE                              
         DS    C                                                                
RECONAGY DS    CL6                 AGENCY/AGENCY OFFICE CODE                    
         DS    C                                                                
RECONCTY DS    CL1                 CONTRACT TYPE CODE                           
         DS    C                                                                
RECONDEV DS    CL2                 DEV CONTRACT TYPE CODE                       
         DS    C                                                                
RECONDSP DS    CL3                 DEV S/P CODE                                 
         DS    C                                                                
RECONPRC DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
RECONPRT DS    CL20                PRODUCT TEXT                                 
         DS    C                                                                
RECONDEM DS    CL10                PRIMARY DEMO                                 
         DS    C                                                                
RECONFLS DS    CL8                 FLIGHT START DATE                            
         DS    C                                                                
RECONFLE DS    CL8                 FLIGHT END DATE                              
         DS    C                                                                
RECONMAS DS    CL2                 MASTER REPCODE                               
         DS    C                                                                
RECONXRE DS    CL1                 EXCLUDE FROM RER FLAG Y/N                    
*                                                                               
RECONDX  DS    CL2                 RECORD END                                   
RECONDL  EQU   *-RECOND            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - CONTRACT DOLLAR BUCKET RECORD                *         
*        MONTHLY ACTIVITY ELEMENTS ASSOCIATED WITH HEADER INFORMATION *         
*        BY CONTRACT NUMBER.                                          *         
*        FOR PRAGER USE, ALL ACTIVITY FOR A SINGLE MONTH WILL BE      *         
*        ACCUMULATED, AND TRANSFERRED WITH AN ACTIVITY DATE EQUAL     *         
*        TO THE MONDAY OF THE WEEK OF THE RUN.                        *         
*        OTHER FUNCTIONALITY LATER DEVELOPED WILL RECEIVE DATA WITH   *         
*        'PACED' DATES, RATHER THAN A SINGLE FORCED DATE.             *         
***********************************************************************         
         SPACE 1                                                                
REDOLD   DSECT                     CONTRACT DOLLAR RECORD                       
REDOLLEN DS    CL4                 RECORD LENGTH                                
REDOLTYP DS    CL5                 RECORD TYPE     '05601'                      
         DS    C                                                                
REDOLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REDOLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REDOLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REDOLREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REDOLCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
REDOLMON DS    CL8                 MONTH OF SERVICE                             
         DS    C                                                                
REDOLACD DS    CL8                 ACTIVITY DATE                                
         DS    C                                                                
REDOLDOL DS    CL12                BEST MONTH AMOUNT: 2 DECL PLACES             
         DS    C                                                                
REDOLADL DS    CL12                FINAL AMOUNT: 2 DECL PLACES                  
         DS    C                                                                
REDOLXRE DS    CL1                 EXCLUDE FROM RER FLAG Y/N                    
*                                                                               
REDOLDX  DS    CL2                 RECORD END                                   
REDOLDL  EQU   *-REDOLD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - AGENCY/AGENCY OFFICE INFORMATION RECORD      *         
***********************************************************************         
         SPACE 1                                                                
REAGYD   DSECT                     AGENCY INFORMATION RECORD                    
REAGYLEN DS    CL4                 RECORD LENGTH                                
REAGYTYP DS    CL5                 RECORD TYPE   '05602'                        
         DS    C                                                                
REAGYACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REAGYDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REAGYTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REAGYREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REAGYAGY DS    CL6                 AGENCY/AGENCY OFFICE CODE                    
         DS    C                                                                
REAGYNAM DS    CL33                AGENCY NAME (FOR CONTRACTS)                  
         DS    C                                                                
REAGYAD1 DS    CL34                AGENCY ADDRESS LINE 1                        
         DS    C                                                                
REAGYAD2 DS    CL34                AGENCY ADDRESS LINE 2                        
         DS    C                                                                
REAGYCTY DS    CL20                AGENCY ADDRESS CITY                          
         DS    C                                                                
REAGYSTA DS    CL2                 AGENCY ADDRESS STATE                         
         DS    C                                                                
REAGYZIP DS    CL10                AGENCY ADDRESS ZIP                           
         DS    C                                                                
REAGYPHO DS    CL10                AGENCY PHONE NUMBER                          
*                                                                               
REAGYDX  DS    CL2                 RECORD END                                   
REAGYDL  EQU   *-REAGYD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - ADVERTISER INFORMATION RECORD                *         
***********************************************************************         
         SPACE 1                                                                
READVD   DSECT                     ADVERT INFORMATION RECORD                    
READVLEN DS    CL4                 RECORD LENGTH                                
READVTYP DS    CL5                 RECORD TYPE   '05603'                        
         DS    C                                                                
READVACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
READVDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
READVTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
READVREP DS    CL2                 REP CODE                                     
         DS    C                                                                
READVADV DS    CL4                 ADVERTISER CODE                              
         DS    C                                                                
READVNAM DS    CL20                ADVERT NAME                                  
         DS    C                                                                
READVCAT DS    CL2                 ADVERT CATEGORY                              
         DS    C                                                                
READVNET DS    CL1                 ADVERT INTERNET FLAG                         
*                                                                               
READVDX  DS    CL2                 RECORD END                                   
READVDL  EQU   *-READVD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - SALESPERSON INFORMATION RECORD               *         
***********************************************************************         
         SPACE 1                                                                
RESALD   DSECT                     S/P INFORMATION RECORD                       
RESALLEN DS    CL4                 RECORD LENGTH                                
RESALTYP DS    CL5                 RECORD TYPE  '05604'                         
         DS    C                                                                
RESALACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESALDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESALTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESALREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESALSAL DS    CL3                 SALESPERSON CODE                             
         DS    C                                                                
RESALNAM DS    CL20                SALESPERSON NAME                             
         DS    C                                                                
RESALTEM DS    CL2                 SALESPERSON TEAM                             
         DS    C                                                                
RESALTEL DS    CL12                SALESPERSON TELEPHONE                        
*                                                                               
RESALDX  DS    CL2                 RECORD END                                   
RESALDL  EQU   *-RESALD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - CONTRACT TYPE INFO RECORD                    *         
***********************************************************************         
         SPACE 1                                                                
RECTYD   DSECT                     CONTYPE INFORMATION RECORD                   
RECTYLEN DS    CL4                 RECORD LENGTH                                
RECTYTYP DS    CL5                 RECORD TYPE '05605'                          
         DS    C                                                                
RECTYACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECTYDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECTYTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECTYREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECTYCTY DS    CL1                 CONTYPE CODE                                 
         DS    C                                                                
RECTYNAM DS    CL20                CONTYPE DESCRIPTION                          
*                                                                               
RECTYDX  DS    CL2                 RECORD END                                   
RECTYDL  EQU   *-RECTYD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - DEV CON TYPE  INFO RECORD                    *         
***********************************************************************         
         SPACE 1                                                                
REDCTD   DSECT                     DEV CONTYPE INFORMATION RECORD               
REDCTLEN DS    CL4                 RECORD LENGTH                                
REDCTTYP DS    CL5                 RECORD TYPE '5606'                           
         DS    C                                                                
REDCTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REDCTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REDCTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REDCTREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REDCTDCT DS    CL2                 DEV CONTYPE CODE                             
         DS    C                                                                
REDCTNAM DS    CL20                DEV CONTYPE DESCRIPTION                      
*                                                                               
REDCTDX  DS    CL2                 RECORD END                                   
REDCTDL  EQU   *-REDCTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - STATION INFORMATION RECORD                   *         
***********************************************************************         
         SPACE 1                                                                
RESTAD   DSECT                     STATION INFORMATION RECORD                   
RESTALEN DS    CL4                 RECORD LENGTH                                
RESTATYP DS    CL5                 RECORD TYPE '05607'                          
         DS    C                                                                
RESTAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RESTADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RESTATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RESTAREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RESTASTA DS    CL5                 STATION CALL LETTERS                         
         DS    C                                                                
RESTAGRP DS    CL2                 STATION GROUP/SUBGROUP                       
         DS    C                                                                
RESTAJDT DS    CL8                 STATION JOIN  DATE                           
         DS    C                                                                
RESTALDT DS    CL8                 STATION LEAVE DATE                           
         DS    C                                                                
RESTACDT DS    CL8                 STATION CLOSE DATE                           
         DS    C                                                                
RESTAMKT DS    CL4                 STATION MARKET CODE                          
         DS    C                                                                
RESTAAFF DS    CL3                 STATION AFFILIATION                          
         DS    C                                                                
RESTAOWN DS    CL3                 STATION OWNERSHIP                            
*                                                                               
RESTADX  DS    CL2                 RECORD END                                   
RESTADL  EQU   *-RESTAD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - GROUP/SUBGROUP INFO RECORD                   *         
***********************************************************************         
         SPACE 1                                                                
REGRPD   DSECT                     GROUP/SUBGRP INFORMATION RECORD              
REGRPLEN DS    CL4                 RECORD LENGTH                                
REGRPTYP DS    CL5                 RECORD TYPE '05608'                          
         DS    C                                                                
REGRPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REGRPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REGRPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REGRPREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REGRPGRP DS    CL2                 G/SG CODE                                    
         DS    C                                                                
REGRPNAM DS    CL10                GROUP NAME                                   
         DS    C                                                                
REGRPSNM DS    CL10                SUBGROUP NAME                                
*                                                                               
REGRPDX  DS    CL2                 RECORD END                                   
REGRPDL  EQU   *-REGRPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - DEV S/P     INFORMATION RECORD               *         
***********************************************************************         
         SPACE 1                                                                
REDSPD   DSECT                     S/P INFORMATION RECORD                       
REDSPLEN DS    CL4                 RECORD LENGTH                                
REDSPTYP DS    CL5                 RECORD TYPE '05609'                          
         DS    C                                                                
REDSPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REDSPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REDSPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REDSPREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REDSPSAL DS    CL3                 SALESPERSON CODE                             
         DS    C                                                                
REDSPNAM DS    CL20                SALESPERSON NAME                             
         DS    C                                                                
REDSPTEM DS    CL2                 SALESPERSON TEAM                             
         DS    C                                                                
REDSPTEL DS    CL12                SALESPERSON TELEPHONE                        
*                                                                               
REDSPDX  DS    CL2                 RECORD END                                   
REDSPDL  EQU   *-REDSPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - TEAM        INFORMATION RECORD               *         
***********************************************************************         
         SPACE 1                                                                
RETEMD   DSECT                     S/P INFORMATION RECORD                       
RETEMLEN DS    CL4                 RECORD LENGTH                                
RETEMTYP DS    CL5                 RECORD TYPE '05610'                          
         DS    C                                                                
RETEMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RETEMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RETEMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RETEMREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RETEMTEM DS    CL2                 TEAM CODE                                    
         DS    C                                                                
RETEMNAM DS    CL10                TEAM NAME                                    
         DS    C                                                                
RETEMDIV DS    CL10                DIVISION NAME                                
*                                                                               
RETEMDX  DS    CL2                 RECORD END                                   
RETEMDL  EQU   *-RETEMD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - PRODUCT     INFORMATION RECORD               *         
***********************************************************************         
         SPACE 1                                                                
REPRDD   DSECT                     PRODUCT INFORMATION RECORD                   
REPRDLEN DS    CL4                 RECORD LENGTH                                
REPRDTYP DS    CL5                 RECORD TYPE '05611'                          
         DS    C                                                                
REPRDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REPRDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REPRDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REPRDREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REPRDADV DS    CL4                 ADVERTISER CODE                              
         DS    C                                                                
REPRDPRD DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
REPRDNAM DS    CL20                PRODUCT NAME                                 
         DS    C                                                                
REPRDCAT DS    CL2                 PRODUCT CATEGORY                             
*                                                                               
REPRDDX  DS    CL2                 RECORD END                                   
REPRDDL  EQU   *-REPRDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - PRODUCT CLASS INFO      RECORD               *         
***********************************************************************         
         SPACE 1                                                                
RECLSD   DSECT                     PRODUCT CLASS INFORMATION RECORD             
RECLSLEN DS    CL4                 RECORD LENGTH                                
RECLSTYP DS    CL5                 RECORD TYPE '05612'                          
         DS    C                                                                
RECLSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECLSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECLSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECLSREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECLSCOD DS    CL2                 CLASS CODE                                   
         DS    C                                                                
RECLSNAM DS    CL30                CLASS   NAME                                 
*                                                                               
RECLSDX  DS    CL2                 RECORD END                                   
RECLSDL  EQU   *-RECLSD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - PRODUCT CATEGORY INFO   RECORD               *         
***********************************************************************         
         SPACE 1                                                                
RECATD   DSECT                     PRODUCT CATEGORY INFO     RECORD             
RECATLEN DS    CL4                 RECORD LENGTH                                
RECATTYP DS    CL5                 RECORD TYPE '05613'                          
         DS    C                                                                
RECATACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
RECATDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
RECATTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
RECATREP DS    CL2                 REP CODE                                     
         DS    C                                                                
RECATCOD DS    CL2                 CATEGORY CODE                                
         DS    C                                                                
RECATNAM DS    CL30                CATEGORY NAME                                
         DS    C                                                                
RECATCLS DS    CL2                 CLASS CODE                                   
*                                                                               
RECATDX  DS    CL2                 RECORD END                                   
RECATDL  EQU   *-RECATD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - OFFICE INFORMATION RECORD                    *         
***********************************************************************         
         SPACE 1                                                                
REOFFD   DSECT                     OFFICE INFO RECORD                           
REOFFLEN DS    CL4                 RECORD LENGTH                                
REOFFTYP DS    CL5                 RECORD TYPE '05614'                          
         DS    C                                                                
REOFFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REOFFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REOFFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REOFFREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REOFFCOD DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
REOFFNAM DS    CL20                OFFICE NAME                                  
         DS    C                                                                
REOFFREG DS    CL2                 OFFICE REGION                                
         DS    C                                                                
REOFFAD1 DS    CL20                OFFICE ADDRESS 1                             
         DS    C                                                                
REOFFAD2 DS    CL18                OFFICE ADDRESS 2                             
         DS    C                                                                
REOFFSTT DS    CL2                 OFFICE STATE                                 
         DS    C                                                                
REOFFZIP DS    CL10                OFFICE ZIP                                   
*                                                                               
REOFFDX  DS    CL2                 RECORD END                                   
REOFFDL  EQU   *-REOFFD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT - OWNER INFORMATION RECORD                     *         
***********************************************************************         
         SPACE 1                                                                
REOWND   DSECT                     OWNER INFO RECORD                            
REOWNLEN DS    CL4                 RECORD LENGTH                                
REOWNTYP DS    CL5                 RECORD TYPE '05615'                          
         DS    C                                                                
REOWNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REOWNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REOWNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REOWNREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REOWNCOD DS    CL3                 OWNER CODE                                   
         DS    C                                                                
REOWNNAM DS    CL20                OWNER NAME                                   
*                                                                               
REOWNDX  DS    CL2                 RECORD END                                   
REOWNDL  EQU   *-REOWND            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  MARKET INFO RECORD                          *         
***********************************************************************         
         SPACE 1                                                                
REMKTD   DSECT                     MARKET INFO RECORD                           
REMKTLEN DS    CL4                 RECORD LENGTH                                
REMKTTYP DS    CL5                 RECORD TYPE '05616'                          
         DS    C                                                                
REMKTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REMKTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REMKTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REMKTREP DS    CL2                 REP CODE                                     
         DS    C                                                                
REMKTCOD DS    CL4                 MARKET CODE                                  
         DS    C                                                                
REMKTNAM DS    CL20                MARKET NAME                                  
*                                                                               
REMKTDX  DS    CL2                 RECORD END                                   
REMKTDL  EQU   *-REMKTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  MASTER/SUB RECORD                           *         
***********************************************************************         
         SPACE 1                                                                
REMSTD   DSECT                     MASTER/SUB INFO RECORD                       
REMSTLEN DS    CL4                 RECORD LENGTH                                
REMSTTYP DS    CL5                 RECORD TYPE '05617'                          
         DS    C                                                                
REMSTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REMSTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REMSTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REMSTSUB DS    CL2                 SUBSIDIARY REP CODE (SEE-ME CODE)            
         DS    C                                                                
REMSTMST DS    CL2                 MASTER REP CODE (READ-ME CODE)               
*                                                                               
REMSTDX  DS    CL2                 RECORD END                                   
REMSTDL  EQU   *-REMSTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  REP INFO   RECORD                           *         
***********************************************************************         
         SPACE 1                                                                
REREPD   DSECT                     REP INFO RECORD                              
REREPLEN DS    CL4                 RECORD LENGTH                                
REREPTYP DS    CL5                 RECORD TYPE '05618'                          
         DS    C                                                                
REREPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
REREPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
REREPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
REREPSUB DS    CL2                 REP CODE                                     
         DS    C                                                                
REREPNAM DS    CL20                REP NAME                                     
*                                                                               
REREPDX  DS    CL2                 RECORD END                                   
REREPDL  EQU   *-REREPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* REP   SYSTEM EXTRACT -  TRANSFER END OF DATA RECORD                 *         
***********************************************************************         
         SPACE 1                                                                
REXFRD   DSECT                     REP TRANSFER RECORD                          
REXFRLEN DS    CL4                 RECORD LENGTH                                
REXFRTYP DS    CL5                 RECORD TYPE '99999'                          
REXFRMSG DS    CL11                CONSTANT: 'END OF DATA'                      
REXFRDL  EQU   *-REXFRD            RECORD LENGTH                                
         EJECT                                                                  
