*          DATA SET RXRECID    AT LEVEL 033 AS OF 07/12/99                      
***********************************************************************         
* REP SYSTEM EXTRACT     RECORD TYPES                                 *         
***********************************************************************         
          SPACE 1                                                               
*NOTE THERE IS A 3 CHAR CODE ASSOCIATED WITH EACH OF THESE RECORDS              
*WHICH UNIQUELY DEFINES THE RECORD TYPE. IT IS USED WHEN RUNNING THE            
*EXTRACT FOR A SINGLE RECORD TYPE. IT ALSO GIVES THE NAME OF THE REP            
*BOOK WHICH RELATES TO THIS RECORD, AND THE RECORD`S ENTRY IN RECNVX            
*WHICH BUILDS THE VARIABLE LENGTH TABLE ENTRIES FOR SQL RECORDS                 
*THE 3 CHAR CODE IS THE 4.5.6 CHARS OF THE EQUATE NAME -E.G. FOR THE            
*CONTRACT HDR  RECORD, THE 3 CHAR CODE IS CON.                                  
          SPACE 2                                                               
REPCONQ   DC   CL5'05600'          CONTRACT HEADER RECORD                       
REPDOLQ   DC   CL5'05601'          CONTRACT DOLLAR RECORD                       
REPAGYQ   DC   CL5'05602'          AGENCY RECORD                                
REPADVQ   DC   CL5'05603'          ADVERTISER RECORD                            
REPSALQ   DC   CL5'05604'          SALESPERSON RECORD                           
REPCTYQ   DC   CL5'05605'          CONTRACT TYPE RECORD                         
REPDCTQ   DC   CL5'05606'          DEVELOPMENTAL CON TYPE RECORD                
REPSTAQ   DC   CL5'05607'          STATION RECORD                               
REPGRPQ   DC   CL5'05608'          GROUP/SUB GROUP                              
REPDSPQ   DC   CL5'05609'          DEVELOPMENTAL S/P RECORD                     
REPTEMQ   DC   CL5'05610'          TEAM RECORD                                  
REPPRDQ   DC   CL5'05611'          PRODUCT RECORD                               
REPCLSQ   DC   CL5'05612'          CLASS RECORD                                 
REPCATQ   DC   CL5'05613'          CATEGORY RECORD                              
REPOFFQ   DC   CL5'05614'          OFFICE RECORD                                
REPOWNQ   DC   CL5'05615'          OWNER RECORD                                 
REPMKTQ   DC   CL5'05616'          MARKET RECORD                                
REPMSTQ   DC   CL5'05617'          SEE-ME/READ-ME MASTER/SUB RECORD             
REPREPQ   DC   CL5'05618'          REP RECORD                                   
