*          DATA SET SATELEM    AT LEVEL 003 AS OF 08/09/73                      
SATELEM  DS    0C                  *** SATTELITE ELEMENT ***                    
SATCODE  DS    X'14'               ELEMENT CODE                                 
SATLEN   DS    CL1 . B             ELEMENT LENGTH                               
         DS    CL4 . X             SPARE                                        
*              VARIABLE NUMBER OF 4 BYTE FIELDS                                 
SATCALL  DS    CL5  A              SATTELITE CALL LETTERS                       
