*          DATA SET SCSFM9AD   AT LEVEL 001 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2979AD      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PWMMEDH  DS    XL8                                                              
PWMMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PWMCLTH  DS    XL8                                                              
PWMCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
PWMPRDH  DS    XL8                                                              
PWMPRD   DS    CL3      5   46    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      5   56    8  A  P H             T        Y              
PWMESTH  DS    XL8                                                              
PWMEST   DS    CL3      5   65    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
PWMMKTH  DS    XL8                                                              
PWMMKT   DS    CL5      6   10    5  A  U H             T        Y              
PWMMKNMH DS    XL8                                                              
PWMMKNM  DS    CL19     6   16   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   36    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
PWMGLTXH DS    XL8                                                              
PWMGLTX  DS    CL6      6   46    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     6   56   13  A  P H             T        Y              
PWMPRCTH DS    XL8                                                              
PWMPRCT  DS    CL7      6   70    7  A  P N             T        Y              
PWM1TIMH DS    XL8                                                              
PWM1TIM  DS    CL2      6   78    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PWMOPTNH DS    XL8                                                              
PWMOPTN  DS    CL25     7   10   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      7   38    9  A  P N             T        Y              
PWMRQIDH DS    XL8                                                              
PWMRQID  DS    CL3      7   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17     7   56   17  A  P N             T        Y              
PWMLOCKH DS    XL8                                                              
PWMLOCK  DS    CL3      7   74    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  P H             T        Y              
PWMWEEKH DS    XL8                                                              
PWMWEEK  DS    CL12     9    2   12  A  P N             T        Y              
PWMCBUDH DS    XL8                                                              
PWMCBUD  DS    CL7      9   16    7  A  P N             T        Y              
PWMWBUDH DS    XL8                                                              
PWMWBUD  DS    CL7      9   25    7  A  P N             T        Y              
PWMCLCKH DS    XL8                                                              
PWMCLCK  DS    CL7      9   34    7  A  P N             T        Y              
PWMWLCKH DS    XL8                                                              
PWMWLCK  DS    CL7      9   43    7  A  P N             T        Y              
PWMCCOSH DS    XL8                                                              
PWMCCOS  DS    CL7      9   52    7  A  U N             T        Y              
PWMWCOSH DS    XL8                                                              
PWMWCOS  DS    CL7      9   61    7  A  P N             T        Y              
PWMPWPH  DS    XL8                                                              
PWMPWP   DS    CL7      9   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   70    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   70    7  A  U N             T        Y              
PWMLSTWH DS    XL8                                                              
PWMLSTW  DS    CL12    21    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   70    7  A  U N             T        Y              
PWMSTTLH DS    XL8                                                              
PWMSTTL  DS    CL12    22    2   12  A  P H             T        Y              
PWMSACGH DS    XL8                                                              
PWMSACG  DS    CL7     22   16    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   25    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   34    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   43    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   52    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   61    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   70    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     23    2    9  A  P N             T        Y              
PWMTGRPH DS    XL8                                                              
PWMTGRP  DS    CL7     23   16    7  A  U N             T        Y              
PWMESDTH DS    XL8                                                              
PWMESDT  DS    CL20    23   29   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   53    3  A  P N             T        Y              
PWMBYSTH DS    XL8                                                              
PWMBYST  DS    CL8     23   57    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     23   67    3  A  P N             T        Y              
PWMPWSTH DS    XL8                                                              
PWMPWST  DS    CL8     23   71    8  A  P H             T        Y              
PWMPFLNH DS    XL8                                                              
PWMPFLN  DS    CL78    24    2   78  A  P H             T        Y              
PWMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PWMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2392 BYTES                            
