*          DATA SET SCSFM88D   AT LEVEL 001 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29788D      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL30    11    2   30  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    11   38   30  A  P H             T        Y              
SPGPGM1H DS    XL8                                                              
SPGPGM1  DS    CL20    12    2   20  A  U N             T        Y   10         
SPGPGM1X DS    XL8                                                              
SPGMIN1H DS    XL8                                                              
SPGMIN1  DS    CL3     12   23    3  A  U N             T        Y   11         
SPGMIN1X DS    XL8                                                              
SPGMAX1H DS    XL8                                                              
SPGMAX1  DS    CL3     12   28    3  A  U N             T        Y   12         
SPGMAX1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    12   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    13    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    13   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    14    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    14   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    15    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    15   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    16    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    16   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    17    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    17   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    18    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    18   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    19    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    19   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    20    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    20   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    21    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    21   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    22    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    22   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    23    2   20  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   23    3  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   28    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    23   38   20  A  U N             T        Y   20         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   59    3  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   64    3  A  U N             T        Y   22         
         DS    XL8                                                              
SPGPFKYH DS    XL8                                                              
SPGPFKY  DS    CL22    24    2   22  A  P H             T        Y              
SPGREH   DS    XL8                                                              
SPGRE    DS    CL11    24   68   11  A  P Z             T        Y   99         
SPGREX   DS    XL8                                                              
SPGLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SPGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1912 BYTES                            
