*          DATA SET SCSFM60D   AT LEVEL 009 AS OF 04/28/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29760D      DATE 04/28/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SQDMEDKH DS    XL8                                                              
SQDMEDK  DS    CL1      5   10    1  A  U N             T    I   Y              
SQDMEDNH DS    XL8                                                              
SQDMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     5   38   12  A  P H             T        Y              
SQDDPRTH DS    XL8                                                              
SQDDPRT  DS    CL1      5   56    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   15    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    3    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      7   29    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      7   55    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      8    4    1  A  P H             T        Y              
SQDDAY1H DS    XL8                                                              
SQDDAY1  DS    CL5      8    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      9    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      9   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      9   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     10    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     10   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     10   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     11    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     11   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     11   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     12    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     12   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     12   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     16    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     16   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     16   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     17    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     17   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     17   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     18    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     18   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     18   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    4    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     19    7    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   14   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   30    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     19   33    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   56    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     19   59    5  A  U N             T        Y              
SQDDAY2H DS    XL8                                                              
SQDDAY2  DS    CL12    19   66   12  A  P N             T        Y              
SQDLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
SQDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1648 BYTES                            
