*          DATA SET SCSFM50D   AT LEVEL 007 AS OF 06/28/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29750D      DATE 06/28/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PGEMEDSH DS    XL8                                                              
PGEMEDS  DS    CL1      5   12    1  A  U N             T    I   Y              
PGEMEDEH DS    XL8                                                              
PGEMEDE  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
PGECLISH DS    XL8                                                              
PGECLIS  DS    CL3      5   50    3  A  U N             T        Y              
PGECLIEH DS    XL8                                                              
PGECLIE  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
PGEPRDSH DS    XL8                                                              
PGEPRDS  DS    CL3      6   12    3  A  U N             T        Y              
PGEPRDEH DS    XL8                                                              
PGEPRDE  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
PGEESTSH DS    XL8                                                              
PGEESTS  DS    CL3      7   12    3  A  U N             T        Y              
PGEESTEH DS    XL8                                                              
PGEESTE  DS    CL1      7   30    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL21     9    2   21  A  P N             T        Y              
PGECHRH  DS    XL8                                                              
PGECHR   DS    CL3      9   25    3  A  U N             T        Y   10         
PGECHRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    10    2   21  A  P N             T        Y              
PGEACCH  DS    XL8                                                              
PGEACC   DS    CL6     10   25    6  A  U N             T        Y   20         
PGEACCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    11    2   21  A  P N             T        Y              
PGEBRNH  DS    XL8                                                              
PGEBRN   DS    CL4     11   25    4  A  U N             T        Y   30         
PGEBRNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    12    2   21  A  P N             T        Y              
PGEESTH  DS    XL8                                                              
PGEEST   DS    CL4     12   25    4  A  U N             T        Y   40         
PGEESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    13    2   21  A  P N             T        Y              
PGEEVTH  DS    XL8                                                              
PGEEVT   DS    CL6     13   25    6  A  U N             T        Y   50         
PGEEVTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    14    2   21  A  P N             T        Y              
PGEMBFH  DS    XL8                                                              
PGEMBF   DS    CL1     14   25    1  A  U N             T        Y   60         
PGEMBFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    15    2   21  A  P N             T        Y              
PGENOBH  DS    XL8                                                              
PGENOB   DS    CL1     15   25    1  A  U N             T        Y   70         
PGENOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    16    2   21  A  P N             T        Y              
PGEENDH  DS    XL8                                                              
PGEEND   DS    CL8     16   25    8  A  U N             T        Y   80         
PGEENDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    17    2   21  A  P N             T        Y              
PGEXFRH  DS    XL8                                                              
PGEXFR   DS    CL3     17   25    3  A  U N             T        Y   90         
PGEXFRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    18    2   21  A  P N             T        Y              
PGESUFH  DS    XL8                                                              
PGESUF   DS    CL2     18   25    2  A  U N             T        Y  100         
PGESUFX  DS    XL8                                                              
PGETAGH  DS    XL8                                                              
PGETAG   DS    CL1     18   80    1  A  P N             T        Y              
PGELAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PGEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 688  BYTES                            
