*          DATA SET SCSFM87D   AT LEVEL 001 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29787D      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
SRUTYPEH DS    XL8                                                              
SRUTYPE  DS    CL20     6   10   20  A  U N             T        Y    1         
SRUTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SRUMEDH  DS    XL8                                                              
SRUMED   DS    CL1      7   10    1  A  U N             T        Y    2         
SRUMEDX  DS    XL8                                                              
SRUMEDNH DS    XL8                                                              
SRUMEDN  DS    CL10     7   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   38    6  A  P H             T        Y              
SRUCLTH  DS    XL8                                                              
SRUCLT   DS    CL3      7   48    3  A  U N             T        Y    3         
SRUCLTX  DS    XL8                                                              
SRUCLTNH DS    XL8                                                              
SRUCLTN  DS    CL15     7   55   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SRUPRDH  DS    XL8                                                              
SRUPRD   DS    CL7      8   10    7  A  U N             T        Y    4         
SRUPRDX  DS    XL8                                                              
SRUPRDNH DS    XL8                                                              
SRUPRDN  DS    CL15     8   20   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   38    8  A  P H             T        Y              
SRUESTH  DS    XL8                                                              
SRUEST   DS    CL3      8   48    3  A  U N             T        Y    5         
SRUESTX  DS    XL8                                                              
SRUESTNH DS    XL8                                                              
SRUESTN  DS    CL15     8   55   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
SRUTAGH  DS    XL8                                                              
SRUTAG   DS    CL1     10    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     11    7    9  L  P N             T        Y              
SRUSELH  DS    XL8                                                              
SRUSEL   DS    CL3     12    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
SRUTAGH  DS    XL8                                                              
SRUTAG   DS    CL1     23    2    1  A  P N             T        Y              
SRULAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SRUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1352 BYTES                            
