*          DATA SET SCSFM3FD   AT LEVEL 003 AS OF 10/05/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2973FD      DATE 10/05/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P N             T        Y              
DEMFUNCH DS    XL8                                                              
DEMFUNC  DS    CL8      5   15    8  A  U N             T    I   Y    0         
DEMFUNCX DS    XL8                                                              
DEMMSGH  DS    XL8                                                              
DEMMSG   DS    CL30     5   25   30  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P N             T        Y              
DEMFILEH DS    XL8                                                              
DEMFILE  DS    CL8      6   15    8  A  U N             T        Y    0         
DEMFILEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   25   10  A  P N             T        Y              
DEMMEDH  DS    XL8                                                              
DEMMED   DS    CL8      6   38    8  A  U N             T        Y    0         
DEMMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     6   48   11  A  P N             T        Y              
DEMSRCH  DS    XL8                                                              
DEMSRC   DS    CL8      6   61    8  A  U N             T        Y    0         
DEMSRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
DEMSTAH  DS    XL8                                                              
DEMSTA   DS    CL5      7   15    5  A  U N             T        Y    0         
DEMSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     7   25   12  A  P N             T        Y              
DEMSTYPH DS    XL8                                                              
DEMSTYP  DS    CL1      7   38    1  A  U N             T        Y    0         
DEMSTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   48    7  A  P N             T        Y              
DEMAMKTH DS    XL8                                                              
DEMAMKT  DS    CL4      7   61    4  A  U N             T        Y    0         
DEMAMKTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
DEMRMKTH DS    XL8                                                              
DEMRMKT  DS    CL4      8   15    4  A  U N             T        Y    0         
DEMRMKTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   25    7  A  P N             T        Y              
DEMKMKTH DS    XL8                                                              
DEMKMKT  DS    CL5      8   38    5  A  U N             T        Y    0         
DEMKMKTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   48    7  A  P N             T        Y              
DEMUMKTH DS    XL8                                                              
DEMUMKT  DS    CL4      8   61    4  A  U N             T        Y    0         
DEMUMKTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
DEMPROGH DS    XL8                                                              
DEMPROG  DS    CL5      9   15    5  A  U N             T        Y    0         
DEMPROGX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9   25    9  A  P N             T        Y              
DEMINVH  DS    XL8                                                              
DEMINV   DS    CL4      9   38    4  A  U N             T        Y    0         
DEMINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
DEMPUREH DS    XL8                                                              
DEMPURE  DS    CL4     10   15    4  A  U N             T        Y    0         
DEMPUREX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11    2    4  A  P N             T        Y              
DEMBOOKH DS    XL8                                                              
DEMBOOK  DS    CL6     11   15    6  A  U N             T        Y    0         
DEMBOOKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11   25    9  A  P N             T        Y              
DEMBTYPH DS    XL8                                                              
DEMBTYP  DS    CL2     11   38    2  A  U N             T        Y    0         
DEMBTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
DEMB1WKH DS    XL8                                                              
DEMB1WK  DS    CL8     12   15    8  A  U N             T        Y    0         
DEMB1WKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12   25   11  A  P N             T        Y              
DEMBWKNH DS    XL8                                                              
DEMBWKN  DS    CL3     12   38    3  A  U N             T        Y    0         
DEMBWKNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
DEMBLIMH DS    XL8                                                              
DEMBLIM  DS    CL6     13   15    6  A  U N             T        Y    0         
DEMBLIMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
DEMAGYH  DS    XL8                                                              
DEMAGY   DS    CL2     14   15    2  A  U N             T        Y    0         
DEMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14   25   11  A  P N             T        Y              
DEMCLIH  DS    XL8                                                              
DEMCLI   DS    CL3     14   38    3  A  U N             T        Y    0         
DEMCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
DEMDAYSH DS    XL8                                                              
DEMDAYS  DS    CL16    15   15   16  A  U N             T        Y    0         
DEMDAYSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
DEMTIMSH DS    XL8                                                              
DEMTIMS  DS    CL16    16   15   16  A  U N             T        Y    0         
DEMTIMSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
DEMBESTH DS    XL8                                                              
DEMBEST  DS    CL1     17   15    1  A  U N             T        Y    0         
DEMBESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
DEMTPTTH DS    XL8                                                              
DEMTPTT  DS    CL1     18   15    1  A  U N             T        Y    0         
DEMTPTTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
DEMDEMOH DS    XL8                                                              
DEMDEMO  DS    CL50    19   15   50  A  U N             T        Y    0         
DEMDEMOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
DEMPRNTH DS    XL8                                                              
DEMPRNT  DS    CL1     20   15    1  A  U N             T        Y    0         
DEMPRNTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    20   25   11  A  P N             T        Y              
DEMEFLTH DS    XL8                                                              
DEMEFLT  DS    CL20    20   38   20  A  U N             T        Y    0         
DEMEFLTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    21    2   11  A  P N             T        Y              
DEMTAPEH DS    XL8                                                              
DEMTAPE  DS    CL1     21   15    1  A  U N             T        Y    0         
DEMTAPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     21   25    9  A  P N             T        Y              
DEMPTTH  DS    XL8                                                              
DEMPTT   DS    CL1     21   38    1  A  U N             T        Y    0         
DEMPTTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   25   10  A  P N             T        Y              
DEMIUNFH DS    XL8                                                              
DEMIUNF  DS    CL20    22   38   20  A  U N             T        Y    0         
DEMIUNFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     23    2    9  A  P N             T        Y              
DEMMJKYH DS    XL8                                                              
DEMMJKY  DS    CL60    23   15   60  A  U N             T        Y    0         
DEMMJKYX DS    XL8                                                              
DEMTABH  DS    XL8                                                              
DEMTAB   DS    CL1     23   78    1  A  U N             T        Y    0         
DEMTABX  DS    XL8                                                              
DEMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
