*          DATA SET SCSFM7DD   AT LEVEL 001 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2977DD      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
ILSMEDH  DS    XL8                                                              
ILSMED   DS    CL8      5   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
ILSCLIH  DS    XL8                                                              
ILSCLI   DS    CL8      5   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
ILSPROH  DS    XL8                                                              
ILSPRO   DS    CL8      5   47    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
ILSESTH  DS    XL8                                                              
ILSEST   DS    CL4      6   12    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
ILSMKTH  DS    XL8                                                              
ILSMKT   DS    CL4      6   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
ILSSTAH  DS    XL8                                                              
ILSSTA   DS    CL5      6   46    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     7    2   16  A  P N             T        Y              
ILSMOSH  DS    XL8                                                              
ILSMOS   DS    CL6      7   20    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   11    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   19    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   25    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   32    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   41    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   63    6  A  P N             T        Y              
ILSSELH  DS    XL8                                                              
ILSSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70     9   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    10   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    11   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    12   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    13   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    14   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    15   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    16   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    17   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    18   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    19   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    20   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    21   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    22   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    23   10   70  A  P N             T        Y              
ILSLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
ILSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
