*          DATA SET SCSFM9CD   AT LEVEL 001 AS OF 03/18/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2979CD      DATE 03/18/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SBUMEDIH DS    XL8                                                              
SBUMEDI  DS    CL1      5   11    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SBUCLTH  DS    XL8                                                              
SBUCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SBUPRODH DS    XL8                                                              
SBUPROD  DS    CL3      5   47    3  A  U N             T        Y              
SBUPRDDH DS    XL8                                                              
SBUPRDD  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P H             T        Y              
SBUESTH  DS    XL8                                                              
SBUEST   DS    CL3      6   11    3  A  U N             T        Y              
SBUESTNH DS    XL8                                                              
SBUESTN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
SBUSTATH DS    XL8                                                              
SBUSTAT  DS    CL8      7   11    8  A  U N             T        Y              
SBUSTANH DS    XL8                                                              
SBUSTAN  DS    CL4      7   20    4  A  P N             T        Y              
SBUSTADH DS    XL8                                                              
SBUSTAD  DS    CL24     7   26   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   54    7  A  P H             T        Y              
SBUBUYLH DS    XL8                                                              
SBUBUYL  DS    CL3      7   63    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
SBUDATAH DS    XL8                                                              
SBUDATA  DS    CL69     9   11   69  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
SBUADATH DS    XL8                                                              
SBUADAT  DS    CL5     10   15    5  A  U N             T        Y              
SBUADAYH DS    XL8                                                              
SBUADAY  DS    CL3     10   23    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   30    4  A  P N             T        Y              
SBUATIMH DS    XL8                                                              
SBUATIM  DS    CL5     10   35    5  A  U N             T        Y              
SBUAMISH DS    XL8                                                              
SBUAMIS  DS    CL12    10   46   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
SBUBSTAH DS    XL8                                                              
SBUBSTA  DS    CL1     12   13    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   23    8  A  P N             T        Y              
SBUBTYPH DS    XL8                                                              
SBUBTYP  DS    CL1     12   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   40    8  A  P N             T        Y              
SBUSDATH DS    XL8                                                              
SBUSDAT  DS    CL10    12   49   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   60    7  A  P N             T        Y              
SBUSTIMH DS    XL8                                                              
SBUSTIM  DS    CL11    12   68   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19    14    2   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
SBUCREDH DS    XL8                                                              
SBUCRED  DS    CL4     15   16    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   26   12  A  P N             T        Y              
SBUCHECH DS    XL8                                                              
SBUCHEC  DS    CL4     15   40    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   50    4  A  P N             T        Y              
SBUCODH  DS    XL8                                                              
SBUCOD   DS    CL4     15   55    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   62    9  A  P N             T        Y              
SBUPROMH DS    XL8                                                              
SBUPROM  DS    CL4     15   72    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16    2   13  A  P N             T        Y              
SBUNUM9H DS    XL8                                                              
SBUNUM9  DS    CL4     16   16    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   26   12  A  P N             T        Y              
SBUATTTH DS    XL8                                                              
SBUATTT  DS    CL4     16   40    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   48    6  A  P N             T        Y              
SBULEADH DS    XL8                                                              
SBULEAD  DS    CL4     16   55    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    18    2   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
SBUUPS1H DS    XL8                                                              
SBUUPS1  DS    CL4     19    8    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   14    5  A  P N             T        Y              
SBUUPS2H DS    XL8                                                              
SBUUPS2  DS    CL4     19   20    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   26    5  A  P N             T        Y              
SBUUPS3H DS    XL8                                                              
SBUUPS3  DS    CL4     19   32    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   38    5  A  P N             T        Y              
SBUUPS4H DS    XL8                                                              
SBUUPS4  DS    CL4     19   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   50    5  A  P N             T        Y              
SBUUPS5H DS    XL8                                                              
SBUUPS5  DS    CL4     19   56    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    21    2   15  A  P N             T        Y              
SBUCHEKH DS    XL8                                                              
SBUCHEK  DS    CL1     21   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   33    8  A  P N             T        Y              
SBULAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SBUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1000 BYTES                            
