*          DATA SET SCSFM39D   AT LEVEL 001 AS OF 11/14/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29739D      DATE 11/14/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
BPLMEDSH DS    XL8                                                              
BPLMEDS  DS    CL1      5   12    1  A  U N             T    I   Y              
BPLMEDEH DS    XL8                                                              
BPLMEDE  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
BPLCLISH DS    XL8                                                              
BPLCLIS  DS    CL3      5   50    3  A  U N             T        Y              
BPLCLIEH DS    XL8                                                              
BPLCLIE  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
BPLPRDSH DS    XL8                                                              
BPLPRDS  DS    CL3      6   12    3  A  U N             T        Y              
BPLPRDEH DS    XL8                                                              
BPLPRDE  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
BPLESTSH DS    XL8                                                              
BPLESTS  DS    CL3      7   12    3  A  U N             T        Y              
BPLESTEH DS    XL8                                                              
BPLESTE  DS    CL20     7   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
BPLTTLEH DS    XL8                                                              
BPLTTLE  DS    CL60     9   10   60  A  P H             T        Y              
BPLUND1H DS    XL8                                                              
BPLUND1  DS    CL3     10    2    3  A  P H             T        Y              
BPLUND2H DS    XL8                                                              
BPLUND2  DS    CL60    10   10   60  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     10   78    1  A  P N             T        Y              
BPLSELH  DS    XL8                                                              
BPLSEL   DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    11   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    12   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    13   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    14   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    15   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    16   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    17   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    18   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    19   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    20   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL60    21   10   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22   10   74  A  P N             T        Y              
BPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1344 BYTES                            
