*          DATA SET SCSFM86D   AT LEVEL 001 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29786D      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CTMMEDH  DS    XL8                                                              
CTMMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL8      5   20    8  A  P H             T        Y              
CTMCNUMH DS    XL8                                                              
CTMCNUM  DS    CL5      5   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
CTMREVNH DS    XL8                                                              
CTMREVN  DS    CL3      6   11    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
CTMRESNH DS    XL8                                                              
CTMRESN  DS    CL40     6   31   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
CTMCNTRH DS    XL8                                                              
CTMCNTR  DS    CL6      8   20    6  A  U N             T        Y              
CTMCONTH DS    XL8                                                              
CTMCONT  DS    CL40     8   31   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
CTMPARFH DS    XL8                                                              
CTMPARF  DS    CL61    10   20   61  A  U N             T        Y              
CTMPARLH DS    XL8                                                              
CTMPARL  DS    CL61    11   20   61  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
CTMCONSH DS    XL8                                                              
CTMCONS  DS    CL8     12   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   31   12  A  P N             T        Y              
CTMCONEH DS    XL8                                                              
CTMCONE  DS    CL8     12   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
CTMGCIH  DS    XL8                                                              
CTMGCI   DS    CL9     13   19    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   31    3  A  P N             T        Y              
CTMNCIH  DS    XL8                                                              
CTMNCI   DS    CL9     13   44    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   57   15  A  P N             T        Y              
CTMCOMMH DS    XL8                                                              
CTMCOMM  DS    CL5     13   76    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    14    2   18  A  P N             T        Y              
CTMTRCMH DS    XL8                                                              
CTMTRCM  DS    CL6     14   22    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   31   10  A  P N             T        Y              
CTMTCSHH DS    XL8                                                              
CTMTCSH  DS    CL9     14   44    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   57   14  A  P N             T        Y              
CTMTCTRH DS    XL8                                                              
CTMTCTR  DS    CL9     14   72    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    16    2   13  A  P N             T        Y              
CTMCTYPH DS    XL8                                                              
CTMCTYP  DS    CL3     16   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   25    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL21    17    2   21  A  P N             T        Y              
CTMCLT1H DS    XL8                                                              
CTMCLT1  DS    CL3     17   25    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   31    3  A  P N             T        Y              
CTMPRD1H DS    XL8                                                              
CTMPRD1  DS    CL3     17   36    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   42    6  A  P N             T        Y              
CTMPER1H DS    XL8                                                              
CTMPER1  DS    CL17    17   50   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   20    3  A  P N             T        Y              
CTMCLT2H DS    XL8                                                              
CTMCLT2  DS    CL3     18   25    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   31    3  A  P N             T        Y              
CTMPRD2H DS    XL8                                                              
CTMPRD2  DS    CL3     18   36    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   42    6  A  P N             T        Y              
CTMPER2H DS    XL8                                                              
CTMPER2  DS    CL17    18   50   17  A  U N             T        Y              
CTMTDRNH DS    XL8                                                              
CTMTDRN  DS    CL10    19    2   10  A  P N             T        Y              
CTMRDRTH DS    XL8                                                              
CTMRDRT  DS    CL24    19   20   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20    2   11  A  P N             T        Y              
CTMMEDBH DS    XL8                                                              
CTMMEDB  DS    CL24    20   20   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    21    2   15  A  P N             T        Y              
CTMSENDH DS    XL8                                                              
CTMSEND  DS    CL1     21   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
CTMOPTNH DS    XL8                                                              
CTMOPTN  DS    CL60    22   20   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    23    2   14  A  P N             T        Y              
CTMCADDH DS    XL8                                                              
CTMCADD  DS    CL8     23   20    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   31   12  A  P N             T        Y              
CTMCCHGH DS    XL8                                                              
CTMCCHG  DS    CL8     23   50    8  A  P N             T        Y              
CTMPFH   DS    XL8                                                              
CTMPF    DS    CL43    24    2   43  A  P H             T        Y              
CTMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
CTMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1248 BYTES                            
