*          DATA SET SCSFM3AD   AT LEVEL 005 AS OF 11/20/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2973AD      DATE 11/20/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
BPCMEDSH DS    XL8                                                              
BPCMEDS  DS    CL1      5   12    1  A  U N             T    I   Y              
BPCMEDEH DS    XL8                                                              
BPCMEDE  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
BPCCLISH DS    XL8                                                              
BPCCLIS  DS    CL3      5   50    3  A  U N             T        Y              
BPCCLIEH DS    XL8                                                              
BPCCLIE  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
BPCPRDSH DS    XL8                                                              
BPCPRDS  DS    CL3      6   12    3  A  U N             T        Y              
BPCPRDEH DS    XL8                                                              
BPCPRDE  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
BPCESTSH DS    XL8                                                              
BPCESTS  DS    CL3      7   12    3  A  U N             T        Y              
BPCESTEH DS    XL8                                                              
BPCESTE  DS    CL20     7   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
BPCHD1H  DS    XL8                                                              
BPCHD1   DS    CL50     9    2   50  A  P N             T        Y              
BPCHD2H  DS    XL8                                                              
BPCHD2   DS    CL50    10    2   50  A  P N             T        Y              
BPCMOSH  DS    XL8                                                              
BPCMOS   DS    CL6     11    2    6  A  U N             T        Y              
BPCPCTH  DS    XL8                                                              
BPCPCT   DS    CL5     11    9    5  A  U N             T        Y              
BPCDTCH  DS    XL8                                                              
BPCDTC   DS    CL12    11   19   12  A  P N             T        Y              
BPCIDCH  DS    XL8                                                              
BPCIDC   DS    CL8     11   32    8  A  P N             T        Y              
BPCLVH   DS    XL8                                                              
BPCLV    DS    CL5     11   42    5  A  P N             T        Y              
BPCL2H   DS    XL8                                                              
BPCL2    DS    CL6     12    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     14    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     16    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     20    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   42    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     22    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     22    9    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   19   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   32    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   42    5  A  P N             T        Y              
BPCTAGH  DS    XL8                                                              
BPCTAG   DS    CL1     22   80    1  A  P N             T        Y              
BPCLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BPCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1256 BYTES                            
