*          DATA SET SCSFM6DD   AT LEVEL 001 AS OF 03/13/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2976DD      DATE 03/13/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL14     6    2   14  A  P H             T        Y              
RMNRSNH  DS    XL8                                                              
RMNRSN   DS    CL6      6   20    6  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     8    2   20  A  P H             T        Y              
RMNUSRH  DS    XL8                                                              
RMNUSR   DS    CL1      8   28    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P H             T        Y              
RMNDESCH DS    XL8                                                              
RMNDESC  DS    CL30    10   20   30  A  U N             T        Y              
RMNLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
RMNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 144  BYTES                            
