*          DATA SET SCSFM44D   AT LEVEL 008 AS OF 05/20/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29744D      DATE 05/20/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
GFEMEDSH DS    XL8                                                              
GFEMEDS  DS    CL1      5   12    1  A  U N             T    I   Y              
GFEMEDEH DS    XL8                                                              
GFEMEDE  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
GFECLISH DS    XL8                                                              
GFECLIS  DS    CL3      5   50    3  A  U N             T        Y              
GFECLIEH DS    XL8                                                              
GFECLIE  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
GFEPRDSH DS    XL8                                                              
GFEPRDS  DS    CL3      6   12    3  A  U N             T        Y              
GFEPRDEH DS    XL8                                                              
GFEPRDE  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
GFEESTSH DS    XL8                                                              
GFEESTS  DS    CL3      7   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19     9    2   19  A  P N             T        Y              
GFEDBCH  DS    XL8                                                              
GFEDBC   DS    CL2      9   22    2  A  U N             T        Y   10         
GFEDBCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
GFEPRCH  DS    XL8                                                              
GFEPRC   DS    CL4     10   22    4  A  U N             T        Y   20         
GFEPRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
GFEGFNH  DS    XL8                                                              
GFEGFN   DS    CL3     11   22    3  A  U N             T        Y   30         
GFEGFNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
GFEGFSH  DS    XL8                                                              
GFEGFS   DS    CL3     12   22    3  A  U N             T        Y   40         
GFEGFSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    13    2   18  A  P N             T        Y              
GFEBAGYH DS    XL8                                                              
GFEBAGY  DS    CL8     13   22    8  A  U N             T        Y   50         
GFEBAGYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    14    2   18  A  P N             T        Y              
GFEEXPTH DS    XL8                                                              
GFEEXPT  DS    CL6     14   22    6  A  U N             T        Y   60         
GFEEXPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    15    2   19  A  P N             T        Y              
GFEPRIDH DS    XL8                                                              
GFEPRID  DS    CL10    15   22   10  A  U N             T        Y   70         
GFEPRIDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    16    2   18  A  P N             T        Y              
GFECAGYH DS    XL8                                                              
GFECAGY  DS    CL8     16   22    8  A  U N             T        Y   80         
GFECAGYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    17    2   18  A  P N             T        Y              
GFESAGYH DS    XL8                                                              
GFESAGY  DS    CL8     17   22    8  A  U N             T        Y   90         
GFESAGYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    18    2   19  A  P N             T        Y              
GFEREQNH DS    XL8                                                              
GFEREQN  DS    CL20    18   22   20  A  U N             T        Y  100         
GFEREQNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    19    2   18  A  P N             T        Y              
GFETMKTH DS    XL8                                                              
GFETMKT  DS    CL1     19   22    1  A  U N             T        Y  110         
GFETMKTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    20    2   19  A  P N             T        Y              
GFEDEALH DS    XL8                                                              
GFEDEAL  DS    CL10    20   22   10  A  U N             T        Y  120         
GFEDEALX DS    XL8                                                              
GFETAGH  DS    XL8                                                              
GFETAG   DS    CL1     22   22    1  A  U N             T        Y              
GFELAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
GFEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 768  BYTES                            
