*          DATA SET SCSFM71D   AT LEVEL 003 AS OF 02/04/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29771D      DATE 02/04/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PLSMEDKH DS    XL8                                                              
PLSMEDK  DS    CL1      5   10    1  A  U N             T    I   Y              
PLSMEDNH DS    XL8                                                              
PLSMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
PLSCLIKH DS    XL8                                                              
PLSCLIK  DS    CL3      5   46    3  A  U N             T        Y              
PLSCLINH DS    XL8                                                              
PLSCLIN  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
PLSPROKH DS    XL8                                                              
PLSPROK  DS    CL3      6   10    3  A  U N             T        Y              
PLSPRONH DS    XL8                                                              
PLSPRON  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
PLSFILH  DS    XL8                                                              
PLSFIL   DS    CL65     7   10   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9    8    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12     9   16   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      9   40    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      9   52    5  A  P H             T        Y              
PLSGSTH  DS    XL8                                                              
PLSGST   DS    CL3      9   61    3  A  P H             T        Y              
PLSPSTH  DS    XL8                                                              
PLSPST   DS    CL3      9   68    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     10    8    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    10   16   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     10   40    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     10   52    5  A  P H             T        Y              
PLSGSTUH DS    XL8                                                              
PLSGSTU  DS    CL3     10   61    3  A  P H             T        Y              
PLSPSTUH DS    XL8                                                              
PLSPSTU  DS    CL3     10   68    3  A  P H             T        Y              
PLSSELH  DS    XL8                                                              
PLSSEL   DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    11    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    12    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    13    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    14    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    15    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    16    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    17    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    18    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    19    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    20    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    21    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    22    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    23    8   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    24    2   50  A  P H             T        Y              
PLSREH   DS    XL8                                                              
PLSRE    DS    CL11    24   68   11  A  P H             T        Y              
PLSLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
PLSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1704 BYTES                            
