*          DATA SET SCSFMF4D   AT LEVEL 006 AS OF 03/30/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217F4D      DATE 03/30/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
SCMMEDH  DS    CL8                                                              
SCMMED   DS    CL1      6   10    1  A  U N             T        Y    1         
SCMMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   20    6  A  P H             T        Y              
SCMCLTH  DS    CL8                                                              
SCMCLT   DS    CL3      6   28    3  A  U N             T        Y    2         
SCMCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
SCMPRDH  DS    CL8                                                              
SCMPRD   DS    CL8      6   46    8  A  U N             T        Y    3         
SCMPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      6   56    8  A  P H             T        Y              
SCMESTH  DS    CL8                                                              
SCMEST   DS    CL3      6   65    3  A  U N             T        Y    4         
SCMESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
SCMSTATH DS    CL8                                                              
SCMSTAT  DS    CL8      7   10    8  A  U N             T        Y    7         
SCMSTATX DS    CL8                                                              
SCMMKTNH DS    CL8                                                              
SCMMKTN  DS    CL24     7   20   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SCMLN1H  DS    CL8                                                              
SCMLN1   DS    CL70     8   10   70  A  U N             T        Y    5         
SCMLN1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70     9   10   70  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    10   10   70  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    11   10   70  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    12   10   70  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    13   10   70  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    14   10   70  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    15   10   70  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    16   10   70  A  U N             T        Y    5         
         DS    CL8                                                              
SCMLN10H DS    CL8                                                              
SCMLN10  DS    CL7     17    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    17   10   70  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL70    18   10   70  A  P N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL70    19   10   70  A  P N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20    2    7  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL70    20   10   70  A  P N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL70    21   10   70  A  P N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
SCMPROFH DS    CL8                                                              
SCMPROF  DS    CL30    22   10   30  A  U N             T        Y    6         
SCMPROFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22   42    7  A  P N             T        Y              
SCMCDTEH DS    CL8                                                              
SCMCDTE  DS    CL8     22   50    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   60   11  A  P N             T        Y              
SCMADTEH DS    CL8                                                              
SCMADTE  DS    CL8     22   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    24    2   29  A  P H             T        Y              
SCMLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SCMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1800 BYTES                            
