*          DATA SET SCSFM49D   AT LEVEL 004 AS OF 02/27/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29749D      DATE 02/27/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
DSRMEDKH DS    XL8                                                              
DSRMEDK  DS    CL1      5   10    1  A  U N             T        Y              
DSRMEDNH DS    XL8                                                              
DSRMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
DSRSTAH  DS    XL8                                                              
DSRSTA   DS    CL8      5   46    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   56    6  A  P N             T        Y              
DSRCLTH  DS    XL8                                                              
DSRCLT   DS    CL3      5   64    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DSROPTH  DS    XL8                                                              
DSROPT   DS    CL8      6   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P H             T        Y              
DSRFAXH  DS    XL8                                                              
DSRFAX   DS    CL16     8   14   16  A  U N             T        Y              
DSRREPTH DS    XL8                                                              
DSRREPT  DS    CL16     8   42   16  A  P Z             T        Y              
DSRREPUH DS    XL8                                                              
DSRREPU  DS    CL16     8   61   16  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
DSRATTNH DS    XL8                                                              
DSRATTN  DS    CL25     9   14   25  A  U N             T        Y              
DSRREP1H DS    XL8                                                              
DSRREP1  DS    CL15     9   42   15  A  P Z             T        Y  111         
DSRREP1X DS    XL8                                                              
DSRREP2H DS    XL8                                                              
DSRREP2  DS    CL15     9   61   15  A  P Z             T        Y  111         
DSRREP2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
DSRPHONH DS    XL8                                                              
DSRPHON  DS    CL16    10   14   16  A  U N             T        Y              
DSRREP3H DS    XL8                                                              
DSRREP3  DS    CL15    10   42   15  A  P Z             T        Y  111         
DSRREP3X DS    XL8                                                              
DSRREP4H DS    XL8                                                              
DSRREP4  DS    CL15    10   61   15  A  P Z             T        Y  111         
DSRREP4X DS    XL8                                                              
DSRREP5H DS    XL8                                                              
DSRREP5  DS    CL15    11   42   15  A  P Z             T        Y  111         
DSRREP5X DS    XL8                                                              
DSRREP6H DS    XL8                                                              
DSRREP6  DS    CL15    11   61   15  A  P Z             T        Y  111         
DSRREP6X DS    XL8                                                              
DSRDESLH DS    XL8                                                              
DSRDESL  DS    CL18    12    2   18  A  P Z             T        Y              
DSRDESTH DS    XL8                                                              
DSRDEST  DS    CL3     12   22    3  A  P Z             T        Y              
DSRREP7H DS    XL8                                                              
DSRREP7  DS    CL15    12   42   15  A  P Z             T        Y  111         
DSRREP7X DS    XL8                                                              
DSRREP8H DS    XL8                                                              
DSRREP8  DS    CL15    12   61   15  A  P Z             T        Y  111         
DSRREP8X DS    XL8                                                              
DSRREP9H DS    XL8                                                              
DSRREP9  DS    CL15    13   42   15  A  P Z             T        Y  111         
DSRREP9X DS    XL8                                                              
DSRREPAH DS    XL8                                                              
DSRREPA  DS    CL15    13   61   15  A  P Z             T        Y  111         
DSRREPAX DS    XL8                                                              
DSRREPBH DS    XL8                                                              
DSRREPB  DS    CL15    14   42   15  A  P Z             T        Y  111         
DSRREPBX DS    XL8                                                              
DSRREPCH DS    XL8                                                              
DSRREPC  DS    CL15    14   61   15  A  P Z             T        Y  111         
DSRREPCX DS    XL8                                                              
DSRROULH DS    XL8                                                              
DSRROUL  DS    CL22    15    2   22  A  P Z             T        Y              
DSRROUTH DS    XL8                                                              
DSRROUT  DS    CL3     15   27    3  A  P Z             T        Y              
DSRREPDH DS    XL8                                                              
DSRREPD  DS    CL15    15   42   15  A  P Z             T        Y  111         
DSRREPDX DS    XL8                                                              
DSRREPEH DS    XL8                                                              
DSRREPE  DS    CL15    15   61   15  A  P Z             T        Y  111         
DSRREPEX DS    XL8                                                              
DSRREPFH DS    XL8                                                              
DSRREPF  DS    CL15    16   42   15  A  P Z             T        Y  111         
DSRREPFX DS    XL8                                                              
DSRREPGH DS    XL8                                                              
DSRREPG  DS    CL15    16   61   15  A  P Z             T        Y  111         
DSRREPGX DS    XL8                                                              
DSRREPHH DS    XL8                                                              
DSRREPH  DS    CL15    17   42   15  A  P Z             T        Y  111         
DSRREPHX DS    XL8                                                              
DSRREPIH DS    XL8                                                              
DSRREPI  DS    CL15    17   61   15  A  P Z             T        Y  111         
DSRREPIX DS    XL8                                                              
DSRREPJH DS    XL8                                                              
DSRREPJ  DS    CL15    18   42   15  A  P Z             T        Y  111         
DSRREPJX DS    XL8                                                              
DSRREPKH DS    XL8                                                              
DSRREPK  DS    CL15    18   61   15  A  P Z             T        Y  111         
DSRREPKX DS    XL8                                                              
DSRREPLH DS    XL8                                                              
DSRREPL  DS    CL15    19   42   15  A  P Z             T        Y  111         
DSRREPLX DS    XL8                                                              
DSRREPMH DS    XL8                                                              
DSRREPM  DS    CL15    19   61   15  A  P Z             T        Y  111         
DSRREPMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     22   33    8  A  P N             T        Y              
DSRCDTEH DS    XL8                                                              
DSRCDTE  DS    CL8     22   46    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   56    8  A  P N             T        Y              
DSRCRTRH DS    XL8                                                              
DSRCRTR  DS    CL8     22   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   33   12  A  P N             T        Y              
DSRADTEH DS    XL8                                                              
DSRADTE  DS    CL8     23   46    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    23   56   11  A  P N             T        Y              
DSRCWHOH DS    XL8                                                              
DSRCWHO  DS    CL8     23   68    8  A  P N             T        Y              
DSRTAGH  DS    XL8                                                              
DSRTAG   DS    CL1     24   78    1  A  U N             T        Y              
DSRLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
DSRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1224 BYTES                            
