*          DATA SET SCSFM9DD   AT LEVEL 001 AS OF 03/18/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2979DD      DATE 03/18/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SINMEDH  DS    XL8                                                              
SINMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SINCLTH  DS    XL8                                                              
SINCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SINPRDH  DS    XL8                                                              
SINPRD   DS    CL3      5   46    3  A  U N             T        Y              
SINPRDNH DS    XL8                                                              
SINPRDN  DS    CL20     5   50   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
SINESTH  DS    XL8                                                              
SINEST   DS    CL3      6   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     6   20   15  A  P N             T        Y              
SINMKTH  DS    XL8                                                              
SINMKT   DS    CL4      6   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL39     8    2   39  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     8   55   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL39     9    2   39  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     9   55   10  A  P H             T        Y              
SINSELH  DS    XL8                                                              
SINSEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
SINTAGH  DS    XL8                                                              
SINTAG   DS    CL1     24    2    1  A  P N             T        Y              
SINLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1616 BYTES                            
