*          DATA SET SCSFM99D   AT LEVEL 001 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29799D      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PWLMEDH  DS    XL8                                                              
PWLMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PWLCLTH  DS    XL8                                                              
PWLCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
PWLPRDH  DS    XL8                                                              
PWLPRD   DS    CL3      5   46    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      5   56    8  A  P H             T        Y              
PWLESTH  DS    XL8                                                              
PWLEST   DS    CL3      5   65    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
PWLMKTH  DS    XL8                                                              
PWLMKT   DS    CL4      6   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
PWLOPTNH DS    XL8                                                              
PWLOPTN  DS    CL25     6   28   25  A  U N             T        Y    7         
PWLOPTNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     6   56   13  A  P H             T        Y              
PWLPRCTH DS    XL8                                                              
PWLPRCT  DS    CL7      6   70    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PWLFLTRH DS    XL8                                                              
PWLFLTR  DS    CL45     7   10   45  A  U N             T        Y    8         
PWLFLTRX DS    XL8                                                              
PWLESDTH DS    XL8                                                              
PWLESDT  DS    CL20     7   56   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      8   56    8  A  P N             T        Y              
PWLBUYRH DS    XL8                                                              
PWLBUYR  DS    CL3      8   65    3  A  U N             T        Y    9         
PWLBUYRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
PWLCHDRH DS    XL8                                                              
PWLCHDR  DS    CL78     9    2   78  L  P H             T        Y              
PWLSELH  DS    XL8                                                              
PWLSEL   DS    CL3     10    2    3  A  U N             T        Y    6         
PWLSELX  DS    XL8                                                              
PWLDATAH DS    XL8                                                              
PWLDATA  DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
PWLTOTLH DS    XL8                                                              
PWLTOTL  DS    CL74    23    7   74  A  P H             T        Y              
PWLPFLNH DS    XL8                                                              
PWLPFLN  DS    CL78    24    2   78  L  P H             T        Y              
PWLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PWLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
