*          DATA SET SCSFM8ED   AT LEVEL 001 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2978ED      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL14    11    2   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL14    11   40   14  A  P H             T        Y              
SHLDATEH DS    XL8                                                              
SHLDATE  DS    CL18    12    2   18  A  U N             T        Y   10         
SHLDATEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    12   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    13    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    13   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    14    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    14   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    15    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    15   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    16    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    16   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    17    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    17   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    18    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    18   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    19    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    19   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    20    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    20   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    21    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    21   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    22    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    22   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    23    2   18  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    23   40   18  A  U N             T        Y   11         
         DS    XL8                                                              
SHLPFKYH DS    XL8                                                              
SHLPFKY  DS    CL22    24    2   22  A  P H             T        Y              
SHLREH   DS    XL8                                                              
SHLRE    DS    CL11    24   68   11  A  P Z             T        Y   99         
SHLREX   DS    XL8                                                              
SHLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SHLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 920  BYTES                            
