*          DATA SET SCSFM5CD   AT LEVEL 007 AS OF 03/04/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2975CD      DATE 03/04/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
AGYAGENH DS    XL8                                                              
AGYAGEN  DS    CL2      5   10    2  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL1      5   15    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
AGYSNMEH DS    XL8                                                              
AGYSNME  DS    CL33     7   19   33  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
AGYSADDH DS    XL8                                                              
AGYSADD  DS    CL33     8   19   33  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
AGYSIDH  DS    XL8                                                              
AGYSID   DS    CL3      9   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   19   12  A  P N             T        Y              
AGYALPHH DS    XL8                                                              
AGYALPH  DS    CL2      9   32    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   39   10  A  P N             T        Y              
AGYHEXH  DS    XL8                                                              
AGYHEX   DS    CL1      9   50    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
AGYSACCH DS    XL8                                                              
AGYSACC  DS    CL18    10   17   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   39   10  A  P N             T        Y              
AGYACCH  DS    XL8                                                              
AGYACC   DS    CL24    10   50   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
AGYOPTSH DS    XL8                                                              
AGYOPTS  DS    CL62    11   17   62  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12    2   20  A  P N             T        Y              
AGYRATSH DS    XL8                                                              
AGYRATS  DS    CL1     12   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   28   20  A  P N             T        Y              
AGYCLRGH DS    XL8                                                              
AGYCLRG  DS    CL1     12   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   53   20  A  P N             T        Y              
AGYBLPCH DS    XL8                                                              
AGYBLPC  DS    CL2     12   74    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13    2   20  A  P N             T        Y              
AGYEXDMH DS    XL8                                                              
AGYEXDM  DS    CL1     13   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   28   20  A  P N             T        Y              
AGYBOTOH DS    XL8                                                              
AGYBOTO  DS    CL1     13   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   53   20  A  P N             T        Y              
AGYCANH  DS    XL8                                                              
AGYCAN   DS    CL1     13   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14    2   20  A  P N             T        Y              
AGYTMSHH DS    XL8                                                              
AGYTMSH  DS    CL1     14   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   28   20  A  P N             T        Y              
AGYBILLH DS    XL8                                                              
AGYBILL  DS    CL1     14   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   53   20  A  P N             T        Y              
AGYBIRQH DS    XL8                                                              
AGYBIRQ  DS    CL1     14   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15    2   20  A  P N             T        Y              
AGYCBLH  DS    XL8                                                              
AGYCBL   DS    CL1     15   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   28   20  A  P N             T        Y              
AGYRPOLH DS    XL8                                                              
AGYRPOL  DS    CL1     15   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   53   20  A  P N             T        Y              
AGYXOTOH DS    XL8                                                              
AGYXOTO  DS    CL1     15   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16    2   20  A  P N             T        Y              
AGYMGDMH DS    XL8                                                              
AGYMGDM  DS    CL1     16   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   28   20  A  P N             T        Y              
AGYSAUTH DS    XL8                                                              
AGYSAUT  DS    CL1     16   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   53   20  A  P N             T        Y              
AGYOFRQH DS    XL8                                                              
AGYOFRQ  DS    CL1     16   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17    2   20  A  P N             T        Y              
AGYBYBLH DS    XL8                                                              
AGYBYBL  DS    CL1     17   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   28   20  A  P N             T        Y              
AGYACOCH DS    XL8                                                              
AGYACOC  DS    CL1     17   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    2   10  A  P N             T        Y              
AGYTTLEH DS    XL8                                                              
AGYTTLE  DS    CL10    18   15   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   28    6  A  P N             T        Y              
AGYRFPIH DS    XL8                                                              
AGYRFPI  DS    CL10    18   40   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   40    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   46   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   58   12  A  P N             T        Y              
AGYMEDH  DS    XL8                                                              
AGYMED   DS    CL1     21    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21    8   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   20    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   40    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   58    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22    8   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   20    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   40    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   58    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    23    8   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   20    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   40    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   58    7  A  U N             T        Y              
AGYTABH  DS    XL8                                                              
AGYTAB   DS    CL1     24   40    1  A  U N             T        Y              
AGYLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
AGYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1496 BYTES                            
