*          DATA SET SCSFM97D   AT LEVEL 001 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29797D      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PWUMEDH  DS    XL8                                                              
PWUMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PWUCLTH  DS    XL8                                                              
PWUCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
PWUPRDH  DS    XL8                                                              
PWUPRD   DS    CL3      5   46    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      5   56    8  A  P H             T        Y              
PWUESTH  DS    XL8                                                              
PWUEST   DS    CL3      5   65    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
PWUBFRCH DS    XL8                                                              
PWUBFRC  DS    CL3      8    2    3  A  P H             T        Y              
PWUBOFH  DS    XL8                                                              
PWUBOF   DS    CL2      8    6    2  A  P N             T        Y              
PWUBTTLH DS    XL8                                                              
PWUBTTL  DS    CL3      8    9    3  A  P H             T        Y              
PWUBCM1H DS    XL8                                                              
PWUBCM1  DS    CL65     8   13   65  A  P N             T        Y              
PWUBCM2H DS    XL8                                                              
PWUBCM2  DS    CL12    10   10   12  A  P N             T        Y              
PWUBCM3H DS    XL8                                                              
PWUBCM3  DS    CL10    10   23   10  A  P N             T        Y              
PWUBLFTH DS    XL8                                                              
PWUBLFT  DS    CL1     10   35    1  A  P N             T        Y              
PWUBOKH  DS    XL8                                                              
PWUBOK   DS    CL2     10   37    2  A  U H             T        Y              
PWUBRGTH DS    XL8                                                              
PWUBRGT  DS    CL1     10   40    1  A  P N             T        Y              
PWUBREQH DS    XL8                                                              
PWUBREQ  DS    CL21    10   46   21  A  P N             T        Y              
PWUBRQLH DS    XL8                                                              
PWUBRQL  DS    CL1     10   68    1  A  P N             T        Y              
PWUBIDH  DS    XL8                                                              
PWUBID   DS    CL3     10   70    3  A  U N             T        Y              
PWUBRQRH DS    XL8                                                              
PWUBRQR  DS    CL1     10   74    1  A  P N             T        Y              
PWUPFRCH DS    XL8                                                              
PWUPFRC  DS    CL3     13    2    3  A  P H             T        Y              
PWUPOFH  DS    XL8                                                              
PWUPOF   DS    CL2     13    6    2  A  P N             T        Y              
PWUPTTLH DS    XL8                                                              
PWUPTTL  DS    CL3     13    9    3  A  P H             T        Y              
PWUPCM1H DS    XL8                                                              
PWUPCM1  DS    CL65    13   13   65  A  P N             T        Y              
PWUPCM2H DS    XL8                                                              
PWUPCM2  DS    CL12    15   10   12  A  P N             T        Y              
PWUPCM3H DS    XL8                                                              
PWUPCM3  DS    CL9     15   23    9  A  P N             T        Y              
PWUPLFTH DS    XL8                                                              
PWUPLFT  DS    CL1     15   34    1  A  P N             T        Y              
PWUPOKH  DS    XL8                                                              
PWUPOK   DS    CL2     15   36    2  A  U H             T        Y              
PWUPRGTH DS    XL8                                                              
PWUPRGT  DS    CL1     15   39    1  A  P N             T        Y              
PWUTAGH  DS    XL8                                                              
PWUTAG   DS    CL1     16    2    1  A  P N             T        Y              
PWULAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PWUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 520  BYTES                            
