*          DATA SET SCSFM5FD   AT LEVEL 005 AS OF 12/05/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2975FD      DATE 12/05/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
SVRBGPH  DS    XL8                                                              
SVRBGP   DS    CL2      5   10    2  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
SVRINTH  DS    XL8                                                              
SVRINT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SVROFFH  DS    XL8                                                              
SVROFF   DS    CL2      5   46    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SVRLISH  DS    XL8                                                              
SVRLIS   DS    CL1      6   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     6   20   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      6   38    5  A  P N             T        Y              
SVRMEDH  DS    XL8                                                              
SVRMED   DS    CL1      6   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   50    7  A  P N             T        Y              
SVRPLNH  DS    XL8                                                              
SVRPLN   DS    CL1      6   58    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
SVRLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SVRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 184  BYTES                            
