*          DATA SET SCSFMD9D   AT LEVEL 001 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297D9D      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CTUMEDH  DS    XL8                                                              
CTUMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL8      5   20    8  A  P H             T        Y              
CTUCNUMH DS    XL8                                                              
CTUCNUM  DS    CL5      5   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     7    2   10  A  P N             T        Y              
CTUCNTRH DS    XL8                                                              
CTUCNTR  DS    CL6      7   14    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7   24    3  A  P N             T        Y              
CTUGCIH  DS    XL8                                                              
CTUGCI   DS    CL10     7   31   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   48    7  A  P N             T        Y              
CTUBALNH DS    XL8                                                              
CTUBALN  DS    CL11     7   59   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL38     9    2   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28     9   45   28  A  P N             T        Y              
CTULINEH DS    XL8                                                              
CTULINE  DS    CL78    10    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
CTUPFH   DS    XL8                                                              
CTUPF    DS    CL11    24    2   11  A  P N             T        Y              
CTULAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
CTUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1464 BYTES                            
