*          DATA SET SCSFM72D   AT LEVEL 004 AS OF 11/04/20                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29772D      DATE 11/04/20                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
ESTMEDKH DS    XL8                                                              
ESTMEDK  DS    CL1      5   12    1  A  U N             T    I   Y              
ESTMEDNH DS    XL8                                                              
ESTMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
ESTCLIKH DS    XL8                                                              
ESTCLIK  DS    CL3      5   50    3  A  U N             T        Y              
ESTCLINH DS    XL8                                                              
ESTCLIN  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
ESTPRDKH DS    XL8                                                              
ESTPRDK  DS    CL3      6   12    3  A  U N             T        Y              
ESTPRDNH DS    XL8                                                              
ESTPRDN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
ESTESTKH DS    XL8                                                              
ESTESTK  DS    CL3      7   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   30    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
ESTDESCH DS    XL8                                                              
ESTDESC  DS    CL20     8   20   20  A  U N             T        Y              
ESTPONDH DS    XL8                                                              
ESTPOND  DS    CL3      9    2    3  A  P N             T        Y              
ESTPONH  DS    XL8                                                              
ESTPON   DS    CL15     9   10   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   38    6  A  P N             T        Y              
ESTSTATH DS    XL8                                                              
ESTSTAT  DS    CL8      9   50    8  A  U N             T        Y              
ESTEXPGH DS    XL8                                                              
ESTEXPG  DS    CL10     9   60   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
ESTSTRDH DS    XL8                                                              
ESTSTRD  DS    CL9     10   20    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   38    8  A  P N             T        Y              
ESTENDDH DS    XL8                                                              
ESTENDD  DS    CL9     10   50    9  A  U N             T        Y              
ESTBBTXH DS    XL8                                                              
ESTBBTX  DS    CL28    11    2   28  A  P N             T        Y              
ESTBBASH DS    XL8                                                              
ESTBBAS  DS    CL5     11   31    5  A  U N             T        Y              
ESTCPTXH DS    XL8                                                              
ESTCPTX  DS    CL8     11   38    8  A  P N             T        Y              
ESTCPCTH DS    XL8                                                              
ESTCPCT  DS    CL8     11   47    8  A  U N             T        Y              
ESTCBTXH DS    XL8                                                              
ESTCBTX  DS    CL10    11   56   10  A  P N             T        Y              
ESTCBASH DS    XL8                                                              
ESTCBAS  DS    CL5     11   67    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
ESTDEMSH DS    XL8                                                              
ESTDEMS  DS    CL69    12   10   69  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
ESTDEM2H DS    XL8                                                              
ESTDEM2  DS    CL69    13   10   69  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P N             T        Y              
ESTDEM3H DS    XL8                                                              
ESTDEM3  DS    CL69    14   10   69  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
ESTWTSH  DS    XL8                                                              
ESTWTS   DS    CL69    15   10   69  A  U N             T        Y              
ESTRBKDH DS    XL8                                                              
ESTRBKD  DS    CL11    16    2   11  A  P N             T        Y              
ESTRBKH  DS    XL8                                                              
ESTRBK   DS    CL6     16   15    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   24    7  A  P N             T        Y              
ESTHUTH  DS    XL8                                                              
ESTHUT   DS    CL7     16   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   43    8  A  P N             T        Y              
ESTMENUH DS    XL8                                                              
ESTMENU  DS    CL2     16   53    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   61    7  A  P N             T        Y              
ESTFLTRH DS    XL8                                                              
ESTFLTR  DS    CL3     16   70    3  A  U N             T        N              
         DS    XL8                                                              
         DS    CL9     17    2    9  A  P N             T        Y              
ESTCOPYH DS    XL8                                                              
ESTCOPY  DS    CL1     17   12    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   24   11  A  P N             T        Y              
ESTREPH  DS    XL8                                                              
ESTREP   DS    CL3     17   36    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   43    7  A  P N             T        Y              
ESTCPPEH DS    XL8                                                              
ESTCPPE  DS    CL7     17   53    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   61    8  A  P N             T        Y              
ESTTYPEH DS    XL8                                                              
ESTTYPE  DS    CL3     17   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    18    2   13  A  P N             T        Y              
ESTRANH  DS    XL8                                                              
ESTRAN   DS    CL7     18   16    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   24    9  A  P N             T        Y              
ESTRTYPH DS    XL8                                                              
ESTRTYP  DS    CL2     18   35    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   43    9  A  P N             T        Y              
ESTBTYPH DS    XL8                                                              
ESTBTYP  DS    CL2     18   53    2  A  U N             T        Y              
ESTCBTH  DS    XL8                                                              
ESTCBT   DS    CL18    18   58   18  A  P Z             T        Y              
ESTCBTYH DS    XL8                                                              
ESTCBTY  DS    CL2     18   77    2  A  U Z             T        Y              
         DS    XL8                                                              
         DS    CL20    19    2   20  A  P N             T        Y              
ESTOWDH  DS    XL8                                                              
ESTOWD   DS    CL4     19   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   33    7  A  P N             T        Y              
ESTECONH DS    XL8                                                              
ESTECON  DS    CL15    19   43   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    19   59   16  A  P N             T        Y              
ESTERTLH DS    XL8                                                              
ESTERTL  DS    CL2     19   77    2  A  U N             T        Y              
ESTCSDH  DS    XL8                                                              
ESTCSD   DS    CL21    20    2   21  A  P Z             T        Y              
ESTCSDTH DS    XL8                                                              
ESTCSDT  DS    CL1     20   24    1  A  U Z             T        Y              
ESTDSC1H DS    XL8                                                              
ESTDSC1  DS    CL20    21    2   20  A  P N             T        Y              
ESTUSR1H DS    XL8                                                              
ESTUSR1  DS    CL32    21   23   32  A  U N             T        Y              
ESTDSC2H DS    XL8                                                              
ESTDSC2  DS    CL20    22    2   20  A  P N             T        Y              
ESTUSR2H DS    XL8                                                              
ESTUSR2  DS    CL32    22   23   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
ESTOPTH  DS    XL8                                                              
ESTOPT   DS    CL65    23   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL55    24    2   55  A  P H             T        Y              
ESTREH   DS    XL8                                                              
ESTRE    DS    CL11    24   70   11  A  P H             T        Y              
ESTLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1680 BYTES                            
