*          DATA SET SCSFM32D   AT LEVEL 009 AS OF 12/17/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29732D      DATE 12/17/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
COMMEDH  DS    XL8                                                              
COMMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     5   20   12  A  P H             T        Y              
COMIDH   DS    XL8                                                              
COMID    DS    CL8      5   34    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
COMFILLH DS    XL8                                                              
COMFILL  DS    CL75     6    2   75  A  P N             T        Y              
COMTXTH  DS    XL8                                                              
COMTXT   DS    CL75     7    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     8    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     9    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    10    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    11    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    12    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    13    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    14    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    15    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    16    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    17    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    18    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    19    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    20    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    21    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    22    2   75  L  U N             T        Y              
COMTXTLH DS    XL8                                                              
COMTXTL  DS    CL75    23    2   75  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL28    24    2   28  L  P H             T        Y              
COMPF5H  DS    XL8                                                              
COMPF5   DS    CL12    24   42   12  L  P Z             T        Y              
COMPF6H  DS    XL8                                                              
COMPF6   DS    CL8     24   56    8  L  P H             T        Y              
COMPF12H DS    XL8                                                              
COMPF12  DS    CL11    24   66   11  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  P N             T        Y              
COMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1664 BYTES                            
