*          DATA SET SCSFM3DD   AT LEVEL 015 AS OF 09/27/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2973DD      DATE 09/27/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
DLMMEDH  DS    XL8                                                              
DLMMED   DS    CL1      5   14    1  A  U N             T    I   Y    0         
DLMMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     5   25   11  A  P N             T        Y              
DLMDNOH  DS    XL8                                                              
DLMDNO   DS    CL6      5   38    6  N  U N             T        Y    0         
DLMDNOX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P N             T        Y              
DLMDNMH  DS    XL8                                                              
DLMDNM   DS    CL30     6   14   30  A  U N             T        Y    0         
DLMDNMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DLMPRDH  DS    XL8                                                              
DLMPRD   DS    CL17     7   14   17  A  U N             T        Y    0         
DLMPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   38    8  A  P N             T        Y              
DLMREPH  DS    XL8                                                              
DLMREP   DS    CL3      7   48    3  A  U N             T        Y    0         
DLMREPX  DS    XL8                                                              
DLMLHL1H DS    XL8                                                              
DLMLHL1  DS    CL53     8    4   53  A  P N             T        Y              
DLML1STH DS    XL8                                                              
DLML1ST  DS    CL5      9    5    5  A  U N             T        Y              
DLMLGRSH DS    XL8                                                              
DLMLGRS  DS    CL9      9   15    9  A  U N             T        Y              
DLMLNETH DS    XL8                                                              
DLMLNET  DS    CL9      9   27    9  A  U N             T        Y              
DLMLPCTH DS    XL8                                                              
DLMLPCT  DS    CL3      9   40    3  A  U N             T        Y              
DLMLBYRH DS    XL8                                                              
DLMLBYR  DS    CL30     9   47   30  A  U N             T        Y              
DLML2STH DS    XL8                                                              
DLML2ST  DS    CL5     10    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    10   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    11   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    12   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    13   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    14   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    15   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    16   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    18   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    19   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    20   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    21   47   30  A  U N             T        Y              
DLMLLSTH DS    XL8                                                              
DLMLLST  DS    CL5     22    5    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   27    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    22   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   39    8  A  P N             T        Y              
DLMCDTEH DS    XL8                                                              
DLMCDTE  DS    CL8     23   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   61    8  A  P N             T        Y              
DLMCRTRH DS    XL8                                                              
DLMCRTR  DS    CL8     23   73    8  A  P N             T        Y              
DLMPFKYH DS    XL8                                                              
DLMPFKY  DS    CL36    24    2   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    24   39   12  A  P N             T        Y              
DLMADTEH DS    XL8                                                              
DLMADTE  DS    CL8     24   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    24   61   11  A  P N             T        Y              
DLMCWHOH DS    XL8                                                              
DLMCWHO  DS    CL8     24   73    8  A  P N             T        Y              
DLMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DLMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
