*          DATA SET SCSFM62D   AT LEVEL 008 AS OF 07/28/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21762D      DATE 07/28/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
LI2MEDIH DS    CL8                                                              
LI2MEDI  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
LI2CLTH  DS    CL8                                                              
LI2CLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
LI2PRDH  DS    CL8                                                              
LI2PRD   DS    CL8      5   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   56    8  A  P N             T        Y              
LI2ESTH  DS    CL8                                                              
LI2EST   DS    CL3      5   65    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
LI2STATH DS    CL8                                                              
LI2STAT  DS    CL8      6   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
LI2MYRH  DS    CL8                                                              
LI2MYR   DS    CL8      6   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
LI2PR2H  DS    CL8                                                              
LI2PR2   DS    CL8      6   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   56    4  A  P N             T        Y              
LI2ES2H  DS    CL8                                                              
LI2ES2   DS    CL3      6   65    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   70    1  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     7    2   24  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     7   27   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7   41    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL24     8    2   24  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     8   27   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      8   41    7  A  P H             T        Y              
LI2SELH  DS    CL8                                                              
LI2SEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
LI2TAGH  DS    CL8                                                              
LI2TAG   DS    CL1     24    2    1  A  P N             T        Y              
LI2LAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
LI2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
