*          DATA SET SCSFM4CD   AT LEVEL 001 AS OF 12/09/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2974CD      DATE 12/09/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SUDMEDH  DS    XL8                                                              
SUDMED   DS    CL1      5   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SUDCLTH  DS    XL8                                                              
SUDCLT   DS    CL3      5   28    3  A  U N             T        Y              
SUDCLNMH DS    XL8                                                              
SUDCLNM  DS    CL20     5   38   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     7    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     8    2   18  A  P N             T        Y              
SUDTOTLH DS    XL8                                                              
SUDTOTL  DS    CL2      8   21    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10    2   13  A  P N             T        Y              
SUDF1H   DS    XL8                                                              
SUDF1    DS    CL30    10   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    11    2   15  A  P N             T        Y              
SUDF1RQH DS    XL8                                                              
SUDF1RQ  DS    CL1     11   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   28    9  A  P N             T        Y              
SUDF1EDH DS    XL8                                                              
SUDF1ED  DS    CL1     11   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   48    7  A  P N             T        Y              
SUDF1LNH DS    XL8                                                              
SUDF1LN  DS    CL2     11   56    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    12    2   13  A  P N             T        Y              
SUDF2H   DS    XL8                                                              
SUDF2    DS    CL30    12   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P N             T        Y              
SUDF2RQH DS    XL8                                                              
SUDF2RQ  DS    CL1     13   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   28    9  A  P N             T        Y              
SUDF2EDH DS    XL8                                                              
SUDF2ED  DS    CL1     13   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   48    7  A  P N             T        Y              
SUDF2LNH DS    XL8                                                              
SUDF2LN  DS    CL2     13   56    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  P N             T        Y              
SUDF3H   DS    XL8                                                              
SUDF3    DS    CL30    14   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15    2    9  A  P N             T        Y              
SUDF3RQH DS    XL8                                                              
SUDF3RQ  DS    CL1     15   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   28    9  A  P N             T        Y              
SUDF3EDH DS    XL8                                                              
SUDF3ED  DS    CL1     15   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   48    7  A  P N             T        Y              
SUDF3LNH DS    XL8                                                              
SUDF3LN  DS    CL2     15   56    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16    2   13  A  P N             T        Y              
SUDF4H   DS    XL8                                                              
SUDF4    DS    CL30    16   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17    2    9  A  P N             T        Y              
SUDF4RQH DS    XL8                                                              
SUDF4RQ  DS    CL1     17   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   28    9  A  P N             T        Y              
SUDF4EDH DS    XL8                                                              
SUDF4ED  DS    CL1     17   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   48    7  A  P N             T        Y              
SUDF4LNH DS    XL8                                                              
SUDF4LN  DS    CL2     17   56    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    18    2   13  A  P N             T        Y              
SUDF5H   DS    XL8                                                              
SUDF5    DS    CL30    18   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19    2    9  A  P N             T        Y              
SUDF5RQH DS    XL8                                                              
SUDF5RQ  DS    CL1     19   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   28    9  A  P N             T        Y              
SUDF5EDH DS    XL8                                                              
SUDF5ED  DS    CL1     19   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   48    7  A  P N             T        Y              
SUDF5LNH DS    XL8                                                              
SUDF5LN  DS    CL2     19   56    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
SUDLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SUDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 984  BYTES                            
