*          DATA SET SCSFM56D   AT LEVEL 002 AS OF 03/01/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29756D      DATE 03/01/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
BHLMEDH  DS    XL8                                                              
BHLMED   DS    CL1      5   12    1  A  U N             T    I   Y              
BHLMNMH  DS    XL8                                                              
BHLMNM   DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
BHLCLTH  DS    XL8                                                              
BHLCLT   DS    CL3      6   12    3  A  U N             T        Y              
BHLCNMH  DS    XL8                                                              
BHLCNM   DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
BHLPRDH  DS    XL8                                                              
BHLPRD   DS    CL3      7   12    3  A  U N             T        Y              
BHLPNMH  DS    XL8                                                              
BHLPNM   DS    CL20     7   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
BHLESTH  DS    XL8                                                              
BHLEST   DS    CL3      8   12    3  A  U N             T        Y              
BHLENMH  DS    XL8                                                              
BHLENM   DS    CL20     8   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
BHLSTAH  DS    XL8                                                              
BHLSTA   DS    CL5      9   12    5  A  U N             T        Y              
BHLMKNH  DS    XL8                                                              
BHLMKN   DS    CL20     9   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P H             T        Y              
BHLMOSH  DS    XL8                                                              
BHLMOS   DS    CL6     10   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    12    2   23  A  P N             T        Y              
BHLEDTH  DS    XL8                                                              
BHLEDT   DS    CL8     12   27    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    14    2   21  A  P N             T        Y              
BHLGRSH  DS    XL8                                                              
BHLGRS   DS    CL16    15    2   16  A  U N             T        Y              
BHLNETH  DS    XL8                                                              
BHLNET   DS    CL16    15   20   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   50    1  A  U N             T        Y              
BHLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BHLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 432  BYTES                            
