*          DATA SET SCSFM8CD   AT LEVEL 001 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2978CD      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL28    10    2   28  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL28    10   41   28  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL29    11    2   29  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL29    11   41   29  A  P H             T        Y              
SSDPROGH DS    XL8                                                              
SSDPROG  DS    CL3     12    3    3  A  U N             T        Y   10         
SSDPROGX DS    XL8                                                              
SSDDAYSH DS    XL8                                                              
SSDDAYS  DS    CL10    12   11   10  A  U N             T        Y   11         
SSDDAYSX DS    XL8                                                              
SSDSDAYH DS    XL8                                                              
SSDSDAY  DS    CL4     12   25    4  A  U N             T        Y   12         
SSDSDAYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     13   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     13   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     21   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     21   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23    3    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23   11   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     23   25    4  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   42    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23   50   10  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     23   64    4  A  U N             T        Y   12         
         DS    XL8                                                              
SSDPFKYH DS    XL8                                                              
SSDPFKY  DS    CL22    24    2   22  A  P H             T        Y              
SSDREH   DS    XL8                                                              
SSDRE    DS    CL11    24   68   11  A  P Z             T        Y   99         
SSDREX   DS    XL8                                                              
SSDLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SSDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1768 BYTES                            
