*          DATA SET SCSFM69D   AT LEVEL 002 AS OF 03/13/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29769D      DATE 03/13/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SELMEDH  DS    XL8                                                              
SELMED   DS    CL1      5   10    1  A  U N             T    I   Y              
SELMEDNH DS    XL8                                                              
SELMEDN  DS    CL10     5   16   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
SELCLIH  DS    XL8                                                              
SELCLI   DS    CL3      5   47    3  A  U N             T        Y              
SELCLINH DS    XL8                                                              
SELCLIN  DS    CL20     5   53   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SELPROH  DS    XL8                                                              
SELPRO   DS    CL3      6   10    3  A  U N             T        Y              
SELPRONH DS    XL8                                                              
SELPRON  DS    CL20     6   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   38    8  A  P H             T        Y              
SELESTH  DS    XL8                                                              
SELEST   DS    CL3      6   47    3  A  U N             T        Y              
SELESTNH DS    XL8                                                              
SELESTN  DS    CL20     6   53   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SELMKTH  DS    XL8                                                              
SELMKT   DS    CL4      7   10    4  A  U N             T        Y              
SELMKTNH DS    XL8                                                              
SELMKTN  DS    CL20     7   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23     9    2   23  A  P N             T        Y              
SELSELH  DS    XL8                                                              
SELSEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    24    7   74  A  P N             T        Y              
SELLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
