*          DATA SET SCSFM9BD   AT LEVEL 001 AS OF 03/18/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2979BD      DATE 03/18/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SCTMEDIH DS    XL8                                                              
SCTMEDI  DS    CL1      5   11    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SCTCLTH  DS    XL8                                                              
SCTCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SCTPRODH DS    XL8                                                              
SCTPROD  DS    CL3      5   47    3  A  U N             T        Y              
SCTPRDDH DS    XL8                                                              
SCTPRDD  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P H             T        Y              
SCTESTH  DS    XL8                                                              
SCTEST   DS    CL3      6   11    3  A  U N             T        Y              
SCTESTNH DS    XL8                                                              
SCTESTN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
SCTSTATH DS    XL8                                                              
SCTSTAT  DS    CL8      7   11    8  A  U N             T        Y              
SCTSTANH DS    XL8                                                              
SCTSTAN  DS    CL4      7   20    4  A  P N             T        Y              
SCTSTADH DS    XL8                                                              
SCTSTAD  DS    CL24     7   26   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   54    7  A  P H             T        Y              
SCTBUYLH DS    XL8                                                              
SCTBUYL  DS    CL3      7   63    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   77    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
SCTDATAH DS    XL8                                                              
SCTDATA  DS    CL69     9   11   69  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
SCTSDATH DS    XL8                                                              
SCTSDAT  DS    CL5     10   15    5  A  U N             T        Y              
SCTSDAYH DS    XL8                                                              
SCTSDAY  DS    CL3     10   23    3  A  P N             T        Y              
SCTSMISH DS    XL8                                                              
SCTSMIS  DS    CL12    10   46   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL71    12    2   71  A  P N             T        Y              
SCTDATEH DS    XL8                                                              
SCTDATE  DS    CL5     14    2    5  A  P N             T        Y              
SCTCCH   DS    XL8                                                              
SCTCC    DS    CL4     14    9    4  A  U N             T        Y              
SCTLEADH DS    XL8                                                              
SCTLEAD  DS    CL4     14   23    4  A  U N             T        Y              
SCTUPS1H DS    XL8                                                              
SCTUPS1  DS    CL4     14   30    4  A  U N             T        Y              
SCTUPS2H DS    XL8                                                              
SCTUPS2  DS    CL4     14   39    4  A  U N             T        Y              
SCTUPS3H DS    XL8                                                              
SCTUPS3  DS    CL4     14   48    4  A  U N             T        Y              
SCTUPS4H DS    XL8                                                              
SCTUPS4  DS    CL4     14   57    4  A  U N             T        Y              
SCTUPS5H DS    XL8                                                              
SCTUPS5  DS    CL4     14   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15    9    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   23    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   39    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   48    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   57    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16    9    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   23    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   39    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   48    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   57    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17    9    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   23    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   39    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   48    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   57    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    9    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   23    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   39    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   48    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   57    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19    9    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   23    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   39    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   48    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   57    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20    9    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   23    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   39    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   48    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   57    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21    9    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   23    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   39    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   48    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   57    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     22    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     22    9    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   23    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   39    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   48    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   57    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   66    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     23    9    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   23    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   39    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   48    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   57    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   66    4  A  U N             T        Y              
SCTLLINH DS    XL8                                                              
SCTLLIN  DS    CL5     24    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28    24   24   28  A  P N             T        Y              
SCTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SCTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1528 BYTES                            
