*          DATA SET SCSFM4AD   AT LEVEL 001 AS OF 08/27/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2974AD      DATE 08/27/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
DSLMEDKH DS    XL8                                                              
DSLMEDK  DS    CL1      5   10    1  A  U N             T        Y              
DSLMEDNH DS    XL8                                                              
DSLMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
DSLSTAH  DS    XL8                                                              
DSLSTA   DS    CL8      5   46    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DSLOPTH  DS    XL8                                                              
DSLOPT   DS    CL8      6   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8    7    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      8   17    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     8   22   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9      8   39    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   65    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      9    7    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   17    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16     9   22   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25     9   39   25  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16     9   65   16  A  P H             T        Y              
DSLSELH  DS    XL8                                                              
DSLSEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
DSLTAGH  DS    XL8                                                              
DSLTAG   DS    CL1     24   78    1  A  U N             T        Y              
DSLLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
DSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
