*          DATA SET SCSFM2AD   AT LEVEL 013 AS OF 07/19/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2972AD      DATE 07/19/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y   10         
         DS    XL8                                                              
BXFMEDH  DS    XL8                                                              
BXFMED   DS    CL8      6   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y   20         
         DS    XL8                                                              
BXFOPTSH DS    XL8                                                              
BXFOPTS  DS    CL50     7   11   50  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17     9    2   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  A  P N             T        Y   30         
         DS    XL8                                                              
BXFFRCLH DS    XL8                                                              
BXFFRCL  DS    CL8     10   11    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   20    7  A  P N             T        Y   40         
         DS    XL8                                                              
BXFFRPRH DS    XL8                                                              
BXFFRPR  DS    CL8     10   29    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y   50         
         DS    XL8                                                              
BXFFRESH DS    XL8                                                              
BXFFRES  DS    CL8     11   11    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   20    6  A  P N             T        Y   70         
         DS    XL8                                                              
BXFFRDTH DS    XL8                                                              
BXFFRDT  DS    CL20    11   29   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y   60         
         DS    XL8                                                              
BXFFRSTH DS    XL8                                                              
BXFFRST  DS    CL78    13    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15    2   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y   30         
         DS    XL8                                                              
BXFTOCLH DS    XL8                                                              
BXFTOCL  DS    CL8     16   11    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   20    7  A  P N             T        Y   40         
         DS    XL8                                                              
BXFTOPRH DS    XL8                                                              
BXFTOPR  DS    CL8     16   29    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y   50         
         DS    XL8                                                              
BXFTOESH DS    XL8                                                              
BXFTOES  DS    CL8     17   11    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   20    6  A  P N             T        Y   70         
         DS    XL8                                                              
BXFTODTH DS    XL8                                                              
BXFTODT  DS    CL20    17   29   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y   60         
         DS    XL8                                                              
BXFTOSTH DS    XL8                                                              
BXFTOST  DS    CL8     18   11    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
BXFOPT5H DS    XL8                                                              
BXFOPT5  DS    CL1     20   18    1  A  U N             T        Y              
BXFLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BXFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 696  BYTES                            
