*          DATA SET SCSFM2ED   AT LEVEL 001 AS OF 05/11/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2972ED      DATE 05/11/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
MNTMEDH  DS    XL8                                                              
MNTMED   DS    CL1      5   10    1  A  U N             T    I   Y              
MNTMDNH  DS    XL8                                                              
MNTMDN   DS    CL10     5   20   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
MNTCLTH  DS    XL8                                                              
MNTCLT   DS    CL3      5   46    3  A  U N             T        Y              
MNTCLNH  DS    XL8                                                              
MNTCLN   DS    CL16     5   56   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
MNTPRDH  DS    XL8                                                              
MNTPRD   DS    CL3      6   10    3  A  U N             T        Y              
MNTPDNH  DS    XL8                                                              
MNTPDN   DS    CL16     6   20   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
MNTPTRH  DS    XL8                                                              
MNTPTR   DS    CL3      6   46    3  A  U N             T        Y              
MNTPRNH  DS    XL8                                                              
MNTPRN   DS    CL19     6   56   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P H             T        Y              
MNTESTH  DS    XL8                                                              
MNTEST   DS    CL3      7   10    3  A  U N             T        Y              
MNTESDH  DS    XL8                                                              
MNTESD   DS    CL17     7   20   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
MNTSTAH  DS    XL8                                                              
MNTSTA   DS    CL5      7   46    5  A  U N             T        Y              
MNTMKNH  DS    XL8                                                              
MNTMKN   DS    CL19     7   56   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
MNTDATH  DS    XL8                                                              
MNTDAT   DS    CL8      8   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   20    3  A  P H             T        Y              
MNTMOSH  DS    XL8                                                              
MNTMOS   DS    CL8      8   29    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
MNTREPH  DS    XL8                                                              
MNTREP   DS    CL3      8   46    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   36    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   48    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   71    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   35   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   46   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   57   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   68   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
MNTDMEH  DS    XL8                                                              
MNTDME   DS    CL1     12   20    1  A  P N             T        Y              
MNTIV1H  DS    XL8                                                              
MNTIV1   DS    CL10    12   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
MNTDCLH  DS    XL8                                                              
MNTDCL   DS    CL3     13   20    3  A  P N             T        Y              
MNTIV2H  DS    XL8                                                              
MNTIV2   DS    CL10    13   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
MNTDPRH  DS    XL8                                                              
MNTDPR   DS    CL3     14   20    3  A  P N             T        Y              
MNTIV3H  DS    XL8                                                              
MNTIV3   DS    CL10    14   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
MNTDP2H  DS    XL8                                                              
MNTDP2   DS    CL3     15   20    3  A  P N             T        Y              
MNTIV4H  DS    XL8                                                              
MNTIV4   DS    CL10    15   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
MNTDESH  DS    XL8                                                              
MNTDES   DS    CL3     16   20    3  A  P N             T        Y              
MNTIV5H  DS    XL8                                                              
MNTIV5   DS    CL10    16   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
MNTDSTH  DS    XL8                                                              
MNTDST   DS    CL5     17   20    5  A  P N             T        Y              
MNTIV6H  DS    XL8                                                              
MNTIV6   DS    CL10    17   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
MNTMKTH  DS    XL8                                                              
MNTMKT   DS    CL4     18   20    4  A  P N             T        Y              
MNTIV7H  DS    XL8                                                              
MNTIV7   DS    CL10    18   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
MNTDMOH  DS    XL8                                                              
MNTDMO   DS    CL6     19   20    6  A  P N             T        Y              
MNTIV8H  DS    XL8                                                              
MNTIV8   DS    CL10    19   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20    2    4  A  P N             T        Y              
MNTSREPH DS    XL8                                                              
MNTSREP  DS    CL5     20   20    5  A  P N             T        Y              
MNTIV9H  DS    XL8                                                              
MNTIV9   DS    CL10    20   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    21    2   15  A  P N             T        Y              
MNTPAYH  DS    XL8                                                              
MNTPAY   DS    CL12    21   20   12  A  U N             T        Y              
MNTI10H  DS    XL8                                                              
MNTI10   DS    CL10    21   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22    2    9  A  P N             T        Y              
MNTPDTH  DS    XL8                                                              
MNTPDT   DS    CL8     22   20    8  A  U N             T        Y              
MNTI11H  DS    XL8                                                              
MNTI11   DS    CL10    22   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   68   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23    2    6  A  P N             T        Y              
MNTERRH  DS    XL8                                                              
MNTERR   DS    CL2     23   20    2  A  U N             T        Y              
MNTI12H  DS    XL8                                                              
MNTI12   DS    CL10    23   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   68   10  A  U N             T        Y              
MNTI13H  DS    XL8                                                              
MNTI13   DS    CL10    24   35   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    24   46   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    24   57   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    24   68   10  A  U N             T        Y              
MNTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1784 BYTES                            
