*          DATA SET SCSFMC2D   AT LEVEL 001 AS OF 02/10/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297C2D      DATE 02/10/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
AUTMEDH  DS    XL8                                                              
AUTMED   DS    CL1      5   10    1  A  U N             T    I   Y              
AUTMDNH  DS    XL8                                                              
AUTMDN   DS    CL10     5   20   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
AUTCLTH  DS    XL8                                                              
AUTCLT   DS    CL3      5   46    3  A  U N             T        Y              
AUTCLNH  DS    XL8                                                              
AUTCLN   DS    CL16     5   56   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
AUTPRDH  DS    XL8                                                              
AUTPRD   DS    CL7      6   10    7  A  U N             T        Y              
AUTPDNH  DS    XL8                                                              
AUTPDN   DS    CL16     6   20   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      6   38    3  A  P H             T        Y              
AUTESTH  DS    XL8                                                              
AUTEST   DS    CL3      6   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   46    3  A  P H             T        Y              
AUTVERH  DS    XL8                                                              
AUTVER   DS    CL1      6   50    1  A  U N             T        Y              
AUTESDH  DS    XL8                                                              
AUTESD   DS    CL19     6   56   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
AUTMKTH  DS    XL8                                                              
AUTMKT   DS    CL4      7   10    4  A  U N             T        Y              
AUTMKNH  DS    XL8                                                              
AUTMKN   DS    CL16     7   20   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
AUTSTAH  DS    XL8                                                              
AUTSTA   DS    CL8      7   46    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
AUTRENH  DS    XL8                                                              
AUTREN   DS    CL2      8   10    2  A  U N             T        Y              
AUTDKAH  DS    XL8                                                              
AUTDKA   DS    CL11     8   38   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      9   20    6  A  P H             T        Y              
AUTPWDH  DS    XL8                                                              
AUTPWD   DS    CL8      9   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29     9   38   29  A  P N             T        Y              
AUTAPPH  DS    XL8                                                              
AUTAPP   DS    CL1      9   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
AUTBISH  DS    XL8                                                              
AUTBIS   DS    CL8     10   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   38    9  A  P N             T        Y              
AUTBBAH  DS    XL8                                                              
AUTBBA   DS    CL1     10   56    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    11    2   16  A  P N             T        Y              
AUTBFSH  DS    XL8                                                              
AUTBFS   DS    CL8     11   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   38   10  A  P N             T        Y              
AUTSPVH  DS    XL8                                                              
AUTSPV   DS    CL7     11   56    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
AUTBFEH  DS    XL8                                                              
AUTBFE   DS    CL8     12   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   38    4  A  P N             T        Y              
AUTFLGH  DS    XL8                                                              
AUTFLG   DS    CL2     12   56    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
AUTBDUH  DS    XL8                                                              
AUTBDU   DS    CL8     13   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   38   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  P N             T        Y              
AUTRDAH  DS    XL8                                                              
AUTRDA   DS    CL8     14   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    14   38   31  A  P N             T        Y              
AUTFLTH  DS    XL8                                                              
AUTFLT   DS    CL1     14   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
AUTPPRH  DS    XL8                                                              
AUTPPR   DS    CL8     15   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    15   38   32  A  P N             T        Y              
AUTHIAH  DS    XL8                                                              
AUTHIA   DS    CL1     15   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    16    2   16  A  P N             T        Y              
AUTTPPH  DS    XL8                                                              
AUTTPP   DS    CL8     16   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL34    16   38   34  A  P N             T        Y              
AUTDHTH  DS    XL8                                                              
AUTDHT   DS    CL1     16   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    17    2   14  A  P N             T        Y              
AUTAFFH  DS    XL8                                                              
AUTAFF   DS    CL8     17   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    17   38   33  A  P N             T        Y              
AUTOFLH  DS    XL8                                                              
AUTOFL   DS    CL1     17   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18    2   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     18   15    3  A  P N             T        Y              
AUTRDTH  DS    XL8                                                              
AUTRDT   DS    CL8     18   20    8  A  U N             T        Y              
AUTREVH  DS    XL8                                                              
AUTREV   DS    CL2     18   29    2  A  U N             T        Y              
AUTRNOH  DS    XL8                                                              
AUTRNO   DS    CL2     18   32    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    18   38   33  A  P N             T        Y              
AUTCMSH  DS    XL8                                                              
AUTCMS   DS    CL1     18   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19    2   15  A  P N             T        Y              
AUTMDDH  DS    XL8                                                              
AUTMDD   DS    CL8     19   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL23    19   38   23  A  P N             T        Y              
AUTWMGH  DS    XL8                                                              
AUTWMG   DS    CL3     19   74    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20    2   11  A  P N             T        Y              
AUTGIDH  DS    XL8                                                              
AUTGID   DS    CL8     20   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   38   14  A  P H             T        Y              
AUTROVH  DS    XL8                                                              
AUTROV   DS    CL1     20   56    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    21    2   13  A  P N             T        Y              
AUTGCDH  DS    XL8                                                              
AUTGCD   DS    CL8     21   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    22    2   14  A  P N             T        Y              
AUTWRDH  DS    XL8                                                              
AUTWRD   DS    CL8     22   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   53   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12    23    2   12  A  P N             T        Y              
AUTBTDH  DS    XL8                                                              
AUTBTD   DS    CL8     23   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    23   53   15  A  P N             T        Y              
AUTOSDH  DS    XL8                                                              
AUTOSD   DS    CL8     23   71    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    24    2   16  A  P N             T        Y              
AUTMLDH  DS    XL8                                                              
AUTMLD   DS    CL8     24   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   33    6  A  P N             T        Y              
AUTBGDH  DS    XL8                                                              
AUTBGD   DS    CL8     24   40    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    24   53   14  A  P N             T        Y              
AUTSCDH  DS    XL8                                                              
AUTSCD   DS    CL8     24   71    8  A  U N             T        Y              
AUTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
AUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1584 BYTES                            
