*          DATA SET SCSFM96D   AT LEVEL 010 AS OF 05/05/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21796D      DATE 05/05/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
LCOMEDIH DS    CL8                                                              
LCOMEDI  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
LCOCLTH  DS    CL8                                                              
LCOCLT   DS    CL3      5   27    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
LCOPRDH  DS    CL8                                                              
LCOPRD   DS    CL8      5   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   56    8  A  P N             T        Y              
LCOESTH  DS    CL8                                                              
LCOEST   DS    CL3      5   65    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   10    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     7    2   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7   23    7  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL7      7   31    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     8    2   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      8   23    7  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL7      8   31    7  A  P H             T        Y              
LCOSELH  DS    CL8                                                              
LCOSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
LCOTAGH  DS    CL8                                                              
LCOTAG   DS    CL1     24    2    1  A  P N             T        Y              
LCOLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
LCOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
