*          DATA SET SCSFMEDD   AT LEVEL 001 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297EDD      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
MNTMEDH  DS    XL8                                                              
MNTMED   DS    CL1      5   10    1  A  U N             T    I   Y              
MNTMDNH  DS    XL8                                                              
MNTMDN   DS    CL10     5   20   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
MNTCLTH  DS    XL8                                                              
MNTCLT   DS    CL3      5   46    3  A  U N             T        Y              
MNTCLNH  DS    XL8                                                              
MNTCLN   DS    CL16     5   56   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
MNTPRDH  DS    XL8                                                              
MNTPRD   DS    CL3      6   10    3  A  U N             T        Y              
MNTPDNH  DS    XL8                                                              
MNTPDN   DS    CL16     6   20   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
MNTPTRH  DS    XL8                                                              
MNTPTR   DS    CL3      6   46    3  A  U N             T        Y              
MNTPRNH  DS    XL8                                                              
MNTPRN   DS    CL19     6   56   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P H             T        Y              
MNTESTH  DS    XL8                                                              
MNTEST   DS    CL3      7   10    3  A  U N             T        Y              
MNTESDH  DS    XL8                                                              
MNTESD   DS    CL17     7   20   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
MNTSTAH  DS    XL8                                                              
MNTSTA   DS    CL5      7   46    5  A  U N             T        Y              
MNTMKNH  DS    XL8                                                              
MNTMKN   DS    CL19     7   56   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
MNTDATH  DS    XL8                                                              
MNTDAT   DS    CL8      8   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
MNTDMEH  DS    XL8                                                              
MNTDME   DS    CL1     10   20    1  A  U N             T        Y              
MNTDME2H DS    XL8                                                              
MNTDME2  DS    CL1     10   35    1  A  U N             T        Y              
MNTDME3H DS    XL8                                                              
MNTDME3  DS    CL1     10   50    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
MNTDCLH  DS    XL8                                                              
MNTDCL   DS    CL3     11   20    3  A  U N             T        Y              
MNTDCL2H DS    XL8                                                              
MNTDCL2  DS    CL3     11   35    3  A  U N             T        Y              
MNTDCL3H DS    XL8                                                              
MNTDCL3  DS    CL3     11   50    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
MNTDPRH  DS    XL8                                                              
MNTDPR   DS    CL3     12   20    3  A  U N             T        Y              
MNTDPR2H DS    XL8                                                              
MNTDPR2  DS    CL3     12   35    3  A  U N             T        Y              
MNTDPR3H DS    XL8                                                              
MNTDPR3  DS    CL3     12   50    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
MNTDP2H  DS    XL8                                                              
MNTDP2   DS    CL3     13   20    3  A  U N             T        Y              
MNTDP22H DS    XL8                                                              
MNTDP22  DS    CL3     13   35    3  A  U N             T        Y              
MNTDP23H DS    XL8                                                              
MNTDP23  DS    CL3     13   50    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
MNTDESH  DS    XL8                                                              
MNTDES   DS    CL3     14   20    3  A  U N             T        Y              
MNTDES2H DS    XL8                                                              
MNTDES2  DS    CL3     14   35    3  A  U N             T        Y              
MNTDES3H DS    XL8                                                              
MNTDES3  DS    CL3     14   50    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
MNTDSTH  DS    XL8                                                              
MNTDST   DS    CL5     15   20    5  A  U N             T        Y              
MNTDST2H DS    XL8                                                              
MNTDST2  DS    CL5     15   35    5  A  U N             T        Y              
MNTDST3H DS    XL8                                                              
MNTDST3  DS    CL5     15   50    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
MNTMKTH  DS    XL8                                                              
MNTMKT   DS    CL4     16   20    4  A  U N             T        Y              
MNTMKT2H DS    XL8                                                              
MNTMKT2  DS    CL4     16   35    4  A  U N             T        Y              
MNTMKT3H DS    XL8                                                              
MNTMKT3  DS    CL4     16   50    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
MNTDMOH  DS    XL8                                                              
MNTDMO   DS    CL6     17   20    6  A  U N             T        Y              
MNTDMO2H DS    XL8                                                              
MNTDMO2  DS    CL6     17   35    6  A  U N             T        Y              
MNTDMO3H DS    XL8                                                              
MNTDMO3  DS    CL6     17   50    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    2    4  A  P N             T        Y              
MNTSREPH DS    XL8                                                              
MNTSREP  DS    CL5     18   20    5  A  U N             T        Y              
MNTSRE2H DS    XL8                                                              
MNTSRE2  DS    CL5     18   35    5  A  U N             T        Y              
MNTSRE3H DS    XL8                                                              
MNTSRE3  DS    CL5     18   50    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19    2   15  A  P N             T        Y              
MNTPAYH  DS    XL8                                                              
MNTPAY   DS    CL12    19   20   12  A  U N             T        Y              
MNTPAY2H DS    XL8                                                              
MNTPAY2  DS    CL12    19   35   12  A  U N             T        Y              
MNTPAY3H DS    XL8                                                              
MNTPAY3  DS    CL12    19   50   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20    2    9  A  P N             T        Y              
MNTPDTH  DS    XL8                                                              
MNTPDT   DS    CL8     20   20    8  A  U N             T        Y              
MNTPDT2H DS    XL8                                                              
MNTPDT2  DS    CL8     20   35    8  A  U N             T        Y              
MNTPDT3H DS    XL8                                                              
MNTPDT3  DS    CL8     20   50    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
MNTERRH  DS    XL8                                                              
MNTERR   DS    CL2     21   20    2  A  U N             T        Y              
MNTERR2H DS    XL8                                                              
MNTERR2  DS    CL2     21   35    2  A  U N             T        Y              
MNTERR3H DS    XL8                                                              
MNTERR3  DS    CL2     21   50    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22    2    9  A  P N             T        Y              
MNTINVH  DS    XL8                                                              
MNTINV   DS    CL55    22   20   55  A  U N             T        Y              
MNTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1056 BYTES                            
