*          DATA SET SCSFM5AD   AT LEVEL 013 AS OF 03/04/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2975AD      DATE 03/04/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
MNTMEDSH DS    XL8                                                              
MNTMEDS  DS    CL1      5   10    1  A  U N             T    I   Y              
MNTMEDEH DS    XL8                                                              
MNTMEDE  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   38    4  A  P H             T        Y              
MNTMNUSH DS    XL8                                                              
MNTMNUS  DS    CL1      5   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   48    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   56    5  A  P N             T        Y              
MNTSORTH DS    XL8                                                              
MNTSORT  DS    CL1      5   64    1  A  U N             T        Y              
MNTSTRTH DS    XL8                                                              
MNTSTRT  DS    CL11     7    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   15   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   28   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   41   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   67   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8   15   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8   28   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8   41   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8   67   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   15   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   28   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   41   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   67   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   15   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   28   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   41   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   67   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   15   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   28   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   41   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   67   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   15   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   28   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   41   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   54   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   67   11  A  U N             T        Y              
MNTTABH  DS    XL8                                                              
MNTTAB   DS    CL1     13    8    1  A  U N             T        Y              
MNTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
MNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 792  BYTES                            
