*          DATA SET SCSFM2CD   AT LEVEL 002 AS OF 03/05/20                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2972CD      DATE 03/05/20                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CLFMEDH  DS    XL8                                                              
CLFMED   DS    CL2      5   15    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
CLFTESTH DS    XL8                                                              
CLFTEST  DS    CL1      6   15    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      7    2    9  A  P H             T        Y              
CLFDATEH DS    XL8                                                              
CLFDATE  DS    CL8      7   15    8  A  U N             T        Y              
CLFLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CLFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 96   BYTES                            
