*          DATA SET SCSFM7ED   AT LEVEL 001 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2977ED      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
BCHMEDH  DS    XL8                                                              
BCHMED   DS    CL1      6   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P H             T        Y              
BCHCLIH  DS    XL8                                                              
BCHCLI   DS    CL8      6   30    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
BCHPRDH  DS    XL8                                                              
BCHPRD   DS    CL8      7   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   20    8  A  P H             T        Y              
BCHESTH  DS    XL8                                                              
BCHEST   DS    CL4      7   30    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   38    6  A  P H             T        Y              
BCHMKTH  DS    XL8                                                              
BCHMKT   DS    CL20     7   46   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
BCHRDTH  DS    XL8                                                              
BCHRDT   DS    CL8      9   16    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
BCHADTH  DS    XL8                                                              
BCHADT   DS    CL8     10   16    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    10   30   11  A  P N             T        Y              
BCHASTH  DS    XL8                                                              
BCHAST   DS    CL1     10   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    10   48   11  A  P N             T        Y              
BCHPERH  DS    XL8                                                              
BCHPER   DS    CL15    10   60   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
BCHMRDTH DS    XL8                                                              
BCHMRDT  DS    CL8     11   16    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    11   30   11  A  P N             T        Y              
BCHMSTH  DS    XL8                                                              
BCHMST   DS    CL2     11   43    2  A  P H             T        Y              
BCHLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BCHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 360  BYTES                            
