*          DATA SET SCSFM8AD   AT LEVEL 001 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2978AD      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL30    10    2   30  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    10   41   30  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    11    2   30  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    11   41   30  A  P H             T        Y              
SDSDPTH  DS    XL8                                                              
SDSDPT   DS    CL3     12    4    3  A  U N             T        Y   10         
SDSDPTX  DS    XL8                                                              
SDSSTATH DS    XL8                                                              
SDSSTAT  DS    CL4     12   12    4  A  U N             T        Y   11         
SDSSTATX DS    XL8                                                              
SDSMINH  DS    XL8                                                              
SDSMIN   DS    CL3     12   20    3  A  U N             T        Y   12         
SDSMINX  DS    XL8                                                              
SDSMAXH  DS    XL8                                                              
SDSMAX   DS    CL3     12   25    3  A  U N             T        Y   13         
SDSMAXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     13   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     13   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     21   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     21   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23    4    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     23   12    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   20    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   25    3  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   43    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     23   51    4  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   59    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   64    3  A  U N             T        Y   13         
         DS    XL8                                                              
SDSPFKYH DS    XL8                                                              
SDSPFKY  DS    CL22    24    2   22  A  P H             T        Y              
SDSREH   DS    XL8                                                              
SDSRE    DS    CL11    24   68   11  A  P Z             T        Y   99         
SDSREX   DS    XL8                                                              
SDSLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SDSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2064 BYTES                            
