*          DATA SET SCSFM4BD   AT LEVEL 002 AS OF 04/02/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2974BD      DATE 04/02/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
MFLMEDKH DS    XL8                                                              
MFLMEDK  DS    CL1      5   10    1  A  U N             T    I   Y              
MFLMEDNH DS    XL8                                                              
MFLMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     6    2   13  A  P N             T        Y              
MFLCLTH  DS    XL8                                                              
MFLCLT   DS    CL3      6   16    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   21    6  A  P N             T        Y              
MFLOMKTH DS    XL8                                                              
MFLOMKT  DS    CL4      6   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   34    7  A  P N             T        Y              
MFLSTAH  DS    XL8                                                              
MFLSTA   DS    CL8      6   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   52    6  A  P N             T        Y              
MFLNMKTH DS    XL8                                                              
MFLNMKT  DS    CL4      6   59    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   65    4  A  P N             T        Y              
MFLDATEH DS    XL8                                                              
MFLDATE  DS    CL8      6   70    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8    7    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8   15    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   25    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   33    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9      8   43    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL23     8   57   23  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      9    7    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      9   15    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      9   25    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      9   33    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12     9   43   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL23     9   57   23  A  P H             T        Y              
MFLLST1H DS    XL8                                                              
MFLLST1  DS    CL79    10    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    23    2   79  A  P N             T        Y              
MFLTAGH  DS    XL8                                                              
MFLTAG   DS    CL1     24   78    1  A  U N             T        Y              
MFLLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
MFLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1664 BYTES                            
