*          DATA SET SCSFM57D   AT LEVEL 002 AS OF 03/01/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29757D      DATE 03/01/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
BHSMEDH  DS    XL8                                                              
BHSMED   DS    CL1      5   12    1  A  U N             T    I   Y              
BHSMNMH  DS    XL8                                                              
BHSMNM   DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
BHSCLTH  DS    XL8                                                              
BHSCLT   DS    CL3      6   12    3  A  U N             T        Y              
BHSCNMH  DS    XL8                                                              
BHSCNM   DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
BHSPRDH  DS    XL8                                                              
BHSPRD   DS    CL3      7   12    3  A  U N             T        Y              
BHSPNMH  DS    XL8                                                              
BHSPNM   DS    CL20     7   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
BHSESTH  DS    XL8                                                              
BHSEST   DS    CL3      8   12    3  A  U N             T        Y              
BHSENMH  DS    XL8                                                              
BHSENM   DS    CL20     8   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
BHSSTAH  DS    XL8                                                              
BHSSTA   DS    CL5      9   12    5  A  U N             T        Y              
BHSMKNH  DS    XL8                                                              
BHSMKN   DS    CL20     9   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
BHSMOSH  DS    XL8                                                              
BHSMOS   DS    CL6     10   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    6    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   10    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   14    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   18    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   24    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    11   31   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    11   48   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   65    8  A  P N             T        Y              
BHSSELH  DS    XL8                                                              
BHSSEL   DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    12    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    13    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    14    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    15    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    16    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    17    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    18    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    19    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    20    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    21    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    22    6   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    23    6   73  A  P N             T        Y              
BHSLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
BHSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1536 BYTES                            
