*          DATA SET SCSFM7AD   AT LEVEL 001 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2977AD      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
PXLMEDH  DS    XL8                                                              
PXLMED   DS    CL2      5   10    2  A  U N             T        Y              
PXLMEDXH DS    XL8                                                              
PXLMEDX  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
PXLCLTH  DS    XL8                                                              
PXLCLT   DS    CL3      5   46    3  A  U N             T        Y              
PXLCLTXH DS    XL8                                                              
PXLCLTX  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PXLPRDH  DS    XL8                                                              
PXLPRD   DS    CL3      6   10    3  A  U N             T        Y              
PXLPRDXH DS    XL8                                                              
PXLPRDX  DS    CL17     6   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   38    3  A  P N             T        Y              
PXLESTH  DS    XL8                                                              
PXLEST   DS    CL3      6   46    3  A  U N             T        Y              
PXLESTXH DS    XL8                                                              
PXLESTX  DS    CL20     6   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PXLSTAH  DS    XL8                                                              
PXLSTA   DS    CL7      7   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   10    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   40    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   55    7  A  P N             T        Y              
PXLSELH  DS    XL8                                                              
PXLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70     9   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    10   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    11   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    12   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    13   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    14   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    15   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    16   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    17   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    18   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    19   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    20   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    21   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    22   10   70  A  P N             T        Y              
PXLLSTH  DS    XL8                                                              
PXLLST   DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    23   10   70  A  P N             T        Y              
PXLTAGH  DS    XL8                                                              
PXLTAG   DS    CL1     24    2    1  A  P N             T        Y              
PXLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
PXLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1656 BYTES                            
