*          DATA SET SCSFM9ED   AT LEVEL 001 AS OF 03/18/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2979ED      DATE 03/18/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SINMEDIH DS    XL8                                                              
SINMEDI  DS    CL1      5   11    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SINCLTH  DS    XL8                                                              
SINCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SINPRODH DS    XL8                                                              
SINPROD  DS    CL3      5   47    3  A  U N             T        Y              
SINPRDDH DS    XL8                                                              
SINPRDD  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P H             T        Y              
SINESTH  DS    XL8                                                              
SINEST   DS    CL3      6   11    3  A  U N             T        Y              
SINESTNH DS    XL8                                                              
SINESTN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
SINSTATH DS    XL8                                                              
SINSTAT  DS    CL8      7   11    8  A  U N             T        Y              
SINSTANH DS    XL8                                                              
SINSTAN  DS    CL4      7   20    4  A  P N             T        Y              
SINSTADH DS    XL8                                                              
SINSTAD  DS    CL24     7   26   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   20    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   32    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   42    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   52    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   62    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
SINTCOH  DS    XL8                                                              
SINTCO   DS    CL6     10   20    6  A  U N             T        Y              
SINTCU1H DS    XL8                                                              
SINTCU1  DS    CL6     10   30    6  A  U N             T        Y              
SINTCU2H DS    XL8                                                              
SINTCU2  DS    CL6     10   40    6  A  U N             T        Y              
SINTCU3H DS    XL8                                                              
SINTCU3  DS    CL6     10   50    6  A  U N             T        Y              
SINTCU4H DS    XL8                                                              
SINTCU4  DS    CL6     10   60    6  A  U N             T        Y              
SINTCU5H DS    XL8                                                              
SINTCU5  DS    CL6     10   70    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
SINTROH  DS    XL8                                                              
SINTRO   DS    CL6     11   20    6  A  U N             T        Y              
SINTRU1H DS    XL8                                                              
SINTRU1  DS    CL6     11   30    6  A  U N             T        Y              
SINTRU2H DS    XL8                                                              
SINTRU2  DS    CL6     11   40    6  A  U N             T        Y              
SINTRU3H DS    XL8                                                              
SINTRU3  DS    CL6     11   50    6  A  U N             T        Y              
SINTRU4H DS    XL8                                                              
SINTRU4  DS    CL6     11   60    6  A  U N             T        Y              
SINTRU5H DS    XL8                                                              
SINTRU5  DS    CL6     11   70    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12    2   15  A  P N             T        Y              
SINBEOH  DS    XL8                                                              
SINBEO   DS    CL8     12   18    8  A  U N             T        Y              
SINBEU1H DS    XL8                                                              
SINBEU1  DS    CL8     12   28    8  A  U N             T        Y              
SINBEU2H DS    XL8                                                              
SINBEU2  DS    CL8     12   38    8  A  U N             T        Y              
SINBEU3H DS    XL8                                                              
SINBEU3  DS    CL8     12   48    8  A  U N             T        Y              
SINBEU4H DS    XL8                                                              
SINBEU4  DS    CL8     12   58    8  A  U N             T        Y              
SINBEU5H DS    XL8                                                              
SINBEU5  DS    CL8     12   68    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13    2   13  A  P N             T        Y              
SINTEOH  DS    XL8                                                              
SINTEO   DS    CL7     13   19    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
SINBUDGH DS    XL8                                                              
SINBUDG  DS    CL7     14   19    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    16    2   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17    2    4  A  P N             T        Y              
SINUPS1H DS    XL8                                                              
SINUPS1  DS    CL12    17   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   28    4  A  P N             T        Y              
SINUPS2H DS    XL8                                                              
SINUPS2  DS    CL12    17   34   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   50    4  A  P N             T        Y              
SINUPS3H DS    XL8                                                              
SINUPS3  DS    CL12    17   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    2    4  A  P N             T        Y              
SINUPS4H DS    XL8                                                              
SINUPS4  DS    CL12    18   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   28    4  A  P N             T        Y              
SINUPS5H DS    XL8                                                              
SINUPS5  DS    CL12    18   34   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    20    2   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
SINPRC1H DS    XL8                                                              
SINPRC1  DS    CL6     21   10    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   28    6  A  P N             T        Y              
SINPRC2H DS    XL8                                                              
SINPRC2  DS    CL6     21   36    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   50    6  A  P N             T        Y              
SINPRC3H DS    XL8                                                              
SINPRC3  DS    CL6     21   58    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22    2    6  A  P N             T        Y              
SINPRC4H DS    XL8                                                              
SINPRC4  DS    CL6     22   10    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   28    6  A  P N             T        Y              
SINPRC5H DS    XL8                                                              
SINPRC5  DS    CL6     22   36    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   50   12  A  P N             T        Y              
SINPRCRH DS    XL8                                                              
SINPRCR  DS    CL8     22   63    8  A  U N             T        Y              
SINENDH  DS    XL8                                                              
SINEND   DS    CL72    23    2   72  A  P N             T        Y              
SINLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1280 BYTES                            
