*          DATA SET SCSFM98D   AT LEVEL 001 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29798D      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PWBMEDH  DS    XL8                                                              
PWBMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PWBCLTH  DS    XL8                                                              
PWBCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
PWBPRDH  DS    XL8                                                              
PWBPRD   DS    CL3      5   46    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      5   56    8  A  P H             T        Y              
PWBESTH  DS    XL8                                                              
PWBEST   DS    CL3      5   65    3  A  U H             T        Y              
PWBEFLGH DS    XL8                                                              
PWBEFLG  DS    CL6      5   71    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
PWBMKTH  DS    XL8                                                              
PWBMKT   DS    CL5      6   10    5  A  U H             T        Y              
PWBMKNMH DS    XL8                                                              
PWBMKNM  DS    CL22     6   16   22  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13     6   56   13  A  P H             T        Y              
PWBPRCTH DS    XL8                                                              
PWBPRCT  DS    CL7      6   70    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PWBOPTNH DS    XL8                                                              
PWBOPTN  DS    CL25     7   10   25  A  U N             T        Y              
PWB1TIMH DS    XL8                                                              
PWB1TIM  DS    CL2      7   78    2  A  P Z             T        Y              
PWBESDTH DS    XL8                                                              
PWBESDT  DS    CL20     8    2   20  A  P H             T        Y              
PWBM1H   DS    XL8                                                              
PWBM1    DS    CL8      8   25    8  A  P H             T        Y              
PWBM2H   DS    XL8                                                              
PWBM2    DS    CL8      8   36    8  A  P H             T        Y              
PWBM3H   DS    XL8                                                              
PWBM3    DS    CL8      8   47    8  A  P H             T        Y              
PWBM4H   DS    XL8                                                              
PWBM4    DS    CL8      8   58    8  A  P H             T        Y              
PWBTTLH  DS    XL8                                                              
PWBTTL   DS    CL8      8   69    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20     9    2   20  A  P N             T        Y              
PWBLCLTH DS    XL8                                                              
PWBLCLT  DS    CL8      9   25    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   36    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   58    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   69    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    10    2   20  A  P N             T        Y              
PWBCCLTH DS    XL8                                                              
PWBCCLT  DS    CL8     10   25    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   36    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   58    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   69    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    11    2   20  A  P N             T        Y              
PWBCBILH DS    XL8                                                              
PWBCBIL  DS    CL8     11   25    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   36    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   58    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   69    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
PWBLPWH  DS    XL8                                                              
PWBLPW   DS    CL8     13   25    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   36    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   58    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   69    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
PWBCPWH  DS    XL8                                                              
PWBCPW   DS    CL8     14   25    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   47    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   58    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   69    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16    2   20  A  P N             T        Y              
PWBLWIMH DS    XL8                                                              
PWBLWIM  DS    CL8     16   25    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   36    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   58    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   69    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    17    2   20  A  P N             T        Y              
PWBCWIMH DS    XL8                                                              
PWBCWIM  DS    CL8     17   25    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   36    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   47    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   58    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   69    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    18    2   20  A  P H             T        Y              
PWBDWIMH DS    XL8                                                              
PWBDWIM  DS    CL8     18   25    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   36    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   47    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   58    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   69    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    20    2   20  A  P H             T        Y              
PWBDCLTH DS    XL8                                                              
PWBDCLT  DS    CL8     20   25    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   36    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   47    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   58    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   69    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    21    2   20  A  P N             T        Y              
PWBBILLH DS    XL8                                                              
PWBBILL  DS    CL8     21   25    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   47    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   58    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   69    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    22    2   20  A  P N             T        Y              
PWBPJBLH DS    XL8                                                              
PWBPJBL  DS    CL8     22   25    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   36    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   47    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   58    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   69    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL20    23    2   20  A  P H             T        Y              
PWBPJPWH DS    XL8                                                              
PWBPJPW  DS    CL8     23   25    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8     23   36    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8     23   47    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8     23   58    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8     23   69    8  A  U H             T        Y              
PWBPFLNH DS    XL8                                                              
PWBPFLN  DS    CL50    24    2   50  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     24   54    3  A  P N             T        Y              
PWBBYSTH DS    XL8                                                              
PWBBYST  DS    CL8     24   58    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     24   68    2  A  P N             T        Y              
PWBPWSTH DS    XL8                                                              
PWBPWST  DS    CL8     24   71    8  A  P H             T        Y              
PWBLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PWBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
