*          DATA SET SCSFM5ED   AT LEVEL 007 AS OF 05/12/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2975ED      DATE 05/12/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SPLMEDKH DS    XL8                                                              
SPLMEDK  DS    CL1      5   11    1  A  U N             T        Y              
SPLMEDNH DS    XL8                                                              
SPLMEDN  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
SPLCLTKH DS    XL8                                                              
SPLCLTK  DS    CL3      5   46    3  A  U N             T        Y              
SPLCLTNH DS    XL8                                                              
SPLCLTN  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SPLPRDKH DS    XL8                                                              
SPLPRDK  DS    CL3      6   11    3  A  U N             T        Y              
SPLPRDNH DS    XL8                                                              
SPLPRDN  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
SPLESTKH DS    XL8                                                              
SPLESTK  DS    CL3      7   11    3  A  U N             T        Y              
SPLESTNH DS    XL8                                                              
SPLESTN  DS    CL20     7   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
SPLDPT1H DS    XL8                                                              
SPLDPT1  DS    CL5      9    2    5  A  P N             T        Y              
SPLFLD1H DS    XL8                                                              
SPLFLD1  DS    CL6      9    8    6  A  U N             T        Y              
SPLDPT2H DS    XL8                                                              
SPLDPT2  DS    CL5      9   17    5  A  P N             T        Y              
SPLFLD2H DS    XL8                                                              
SPLFLD2  DS    CL6      9   24    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   33    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   40    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   49    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   56    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   65    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   72    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    8    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   24    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   33    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   40    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   49    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   56    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   65    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   72    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    8    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   24    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   33    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   40    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   49    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   56    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   65    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   72    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    8    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   24    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   33    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   40    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   49    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   56    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   65    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   72    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17    8    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   24    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   33    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   40    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   49    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   56    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   65    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   72    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    8    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   24    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   33    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   40    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   49    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   56    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   65    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   72    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21    8    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   24    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   33    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   40    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   49    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   56    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   65    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   72    6  A  U N             T        Y              
SPLMSGH  DS    XL8                                                              
SPLMSG   DS    CL60    23    8   60  A  P N             T        Y              
SPLTAGH  DS    XL8                                                              
SPLTAG   DS    CL1     23   78    1  A  U N             T        Y              
SPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1240 BYTES                            
