*          DATA SET SCSFM79D   AT LEVEL 001 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T29779D      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
PXDMEDH  DS    XL8                                                              
PXDMED   DS    CL2      5   10    2  A  U N             T        Y              
PXDMEDXH DS    XL8                                                              
PXDMEDX  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
PXDCLTH  DS    XL8                                                              
PXDCLT   DS    CL3      5   46    3  A  U N             T        Y              
PXDCLTXH DS    XL8                                                              
PXDCLTX  DS    CL20     5   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PXDPRDH  DS    XL8                                                              
PXDPRD   DS    CL3      6   10    3  A  U N             T        Y              
PXDPRDXH DS    XL8                                                              
PXDPRDX  DS    CL17     6   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   38    3  A  P N             T        Y              
PXDESTH  DS    XL8                                                              
PXDEST   DS    CL3      6   46    3  A  U N             T        Y              
PXDESTXH DS    XL8                                                              
PXDESTX  DS    CL20     6   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PXDSTAH  DS    XL8                                                              
PXDSTA   DS    CL7      7   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     9   21   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   44    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     9   63   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    10   21   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   44    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    10   63   15  A  P N             T        Y              
PXDFRSTH DS    XL8                                                              
PXDFRST  DS    CL17    11    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23    2   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   21   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   44   17  A  U N             T        Y              
PXDLSTH  DS    XL8                                                              
PXDLST   DS    CL14    23   63   14  A  U N             T        Y              
PXDTAGH  DS    XL8                                                              
PXDTAG   DS    CL1     23   78    1  A  P N             T        Y              
PXDLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
PXDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
