*          DATA SET SCSFM3ED   AT LEVEL 008 AS OF 10/05/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2973ED      DATE 10/05/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
DISMEDSH DS    XL8                                                              
DISMEDS  DS    CL1      5   10    1  A  U N             T    I   Y              
DISSLN1H DS    XL8                                                              
DISSLN1  DS    CL7      7    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   10    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   19    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   28    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   46    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   55    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   64    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   73    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   10    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   19    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   28    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   46    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   55    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   64    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   73    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   10    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   19    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   28    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   46    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   55    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   64    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   73    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   10    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   19    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   28    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   46    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   55    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   64    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   73    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   10    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   19    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   28    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   46    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   55    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   64    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   73    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   10    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   19    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   28    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   46    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   55    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   64    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   73    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   10    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   19    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   28    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   46    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   55    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   64    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   73    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   10    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   19    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   28    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   46    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   55    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   64    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   73    7  A  P N             T        Y              
DISTAGH  DS    XL8                                                              
DISTAG   DS    CL1     22    2    1  A  P N             T        Y              
DISLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
DISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1120 BYTES                            
