*          DATA SET SEACSECD   AT LEVEL 001 AS OF 11/13/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DECD      DATE 11/13/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  L  P N             T        Y              
SCRSYSH  DS    XL8                                                              
SCRSYS   DS    CL8      5   10    8  A  U N             T        Y  101         
SCRSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   20    8  L  P N             T        Y              
SCRLISTH DS    XL8                                                              
SCRLIST  DS    CL3      5   29    3  A  U N             T        Y  102         
SCRLISTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      5   37    9  L  P N             T        Y              
SCRDEFH  DS    XL8                                                              
SCRDEF   DS    CL10     5   48   10  A  U N             T        Y  103         
SCRDEFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P N             T        Y              
SCRNAMEH DS    XL8                                                              
SCRNAME  DS    CL30     6   10   30  A  U N             T        Y  104         
SCRNAMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
SCRTXTTH DS    XL8                                                              
SCRTXTT  DS    CL72     8    2   72  L  P N             T        Y              
SCRTYP1H DS    XL8                                                              
SCRTYP1  DS    CL1      9    3    1  A  U N             T        Y  121         
SCRTYP1X DS    XL8                                                              
SCRVALH  DS    XL8                                                              
SCRVAL   DS    CL20     9    9   20  A  U N             T        Y  122         
SCRVALX  DS    XL8                                                              
SCRMODEH DS    XL8                                                              
SCRMODE  DS    CL1      9   32    1  A  U N             T        Y  123         
SCRMODEX DS    XL8                                                              
SCRDESH  DS    XL8                                                              
SCRDES   DS    CL34     9   37   34  A  P N             T        Y  124         
SCRDESX  DS    XL8                                                              
SCRTYP2H DS    XL8                                                              
SCRTYP2  DS    CL1     10    3    1  A  U N             T        Y  121         
SCRTYP2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    10    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    10   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    11    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    11   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    12    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    12   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    13    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    13   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    14    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    14   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    15    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    15   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    16    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    16   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    17    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    17   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    18    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    18   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    19    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    19   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    20    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    20   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21    3    1  A  U N             T        Y  121         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    21    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    21   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
SCRTYPXH DS    XL8                                                              
SCRTYPX  DS    CL1     22    3    1  A  U N             T        Y  121         
SCRTYPXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    22    9   20  A  U N             T        Y  122         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   32    1  A  U N             T        Y  123         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    22   37   34  A  P N             T        Y  124         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    23    2   79  L  P N             T        Y  125         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    24    2   79  L  P N             T        Y  125         
         DS    XL8                                                              
SCRLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2144 BYTES                            
