*          DATA SET SEACSF4D   AT LEVEL 012 AS OF 08/31/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DF4D      DATE 08/31/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL20     5    2   20  L  P H             T        Y              
AGRGCDEH DS    CL8                                                              
AGRGCDE  DS    CL8      5   27    8  A  U N             T        Y  111         
AGRGCDEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     7    2   20  L  P H             T        Y              
AGRGNMEH DS    CL8                                                              
AGRGNME  DS    CL30     7   27   30  L  U N             T        Y  134         
AGRGNMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     9    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   23    1  L  P N             T        Y              
AGRPIDH  DS    CL8                                                              
AGRPID   DS    CL8      9   27    8  A  U H             T        Y  130         
AGRPIDX  DS    CL8                                                              
AGRPIDNH DS    CL8                                                              
AGRPIDN  DS    CL30     9   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    10    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   23    1  L  P N             T        Y              
AGRPI2H  DS    CL8                                                              
AGRPI2   DS    CL8     10   27    8  A  U H             T        Y  130         
AGRPI2X  DS    CL8                                                              
AGRPI2NH DS    CL8                                                              
AGRPI2N  DS    CL30    10   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    11    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   23    1  L  P N             T        Y              
AGRPI3H  DS    CL8                                                              
AGRPI3   DS    CL8     11   27    8  A  U H             T        Y  130         
AGRPI3X  DS    CL8                                                              
AGRPI3NH DS    CL8                                                              
AGRPI3N  DS    CL30    11   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    12    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   23    1  L  P N             T        Y              
AGRPI4H  DS    CL8                                                              
AGRPI4   DS    CL8     12   27    8  A  U H             T        Y  130         
AGRPI4X  DS    CL8                                                              
AGRPI4NH DS    CL8                                                              
AGRPI4N  DS    CL30    12   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    13    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   23    1  L  P N             T        Y              
AGRPI5H  DS    CL8                                                              
AGRPI5   DS    CL8     13   27    8  A  U H             T        Y  130         
AGRPI5X  DS    CL8                                                              
AGRPI5NH DS    CL8                                                              
AGRPI5N  DS    CL30    13   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    14    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   23    1  L  P N             T        Y              
AGRPI6H  DS    CL8                                                              
AGRPI6   DS    CL8     14   27    8  A  U H             T        Y  130         
AGRPI6X  DS    CL8                                                              
AGRPI6NH DS    CL8                                                              
AGRPI6N  DS    CL30    14   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  L  P N             T        Y              
AGRCOMH  DS    CL8                                                              
AGRCOM   DS    CL53    16   27   53  A  U N             T        Y  135         
AGRCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  U N             T        Y  135         
         DS    CL8                                                              
AGRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
AGRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1280 BYTES                            
