*          DATA SET SEACSBED   AT LEVEL 012 AS OF 05/05/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DBED      DATE 05/05/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     5    2   12  L  P N             T        Y              
DOMGRPH  DS    XL8                                                              
DOMGRP   DS    CL3      5   16    3  A  U N             T        Y  102         
DOMGRPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     5   24   12  L  P N             T        Y              
DOMGNMH  DS    XL8                                                              
DOMGNM   DS    CL26     5   38   26  A  U N             T        Y  103         
DOMGNMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   78    1  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   10    7  L  P N             T        Y              
DOMDON1H DS    XL8                                                              
DOMDON1  DS    CL2      8    6    2  L  P N             T        Y              
DOMDOM1H DS    XL8                                                              
DOMDOM1  DS    CL64     8   10   64  A  U N             T        Y  201         
DOMDOM1X DS    XL8                                                              
DOMDON2H DS    XL8                                                              
DOMDON2  DS    CL2      9    6    2  L  P N             T        Y              
DOMDOM2H DS    XL8                                                              
DOMDOM2  DS    CL64     9   10   64  A  U N             T        Y  202         
DOMDOM2X DS    XL8                                                              
DOMDON3H DS    XL8                                                              
DOMDON3  DS    CL2     10    6    2  L  P N             T        Y              
DOMDOM3H DS    XL8                                                              
DOMDOM3  DS    CL64    10   10   64  A  U N             T        Y  203         
DOMDOM3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     11    6    2  L  P N             T        Y              
DOMDOM4H DS    XL8                                                              
DOMDOM4  DS    CL64    11   10   64  A  U N             T        Y  204         
DOMDOM4X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     12    6    2  L  P N             T        Y              
DOMDOM5H DS    XL8                                                              
DOMDOM5  DS    CL64    12   10   64  A  U N             T        Y  205         
DOMDOM5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     13    6    2  L  P N             T        Y              
DOMDOM6H DS    XL8                                                              
DOMDOM6  DS    CL64    13   10   64  A  U N             T        Y  206         
DOMDOM6X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14    6    2  L  P N             T        Y              
DOMDOM7H DS    XL8                                                              
DOMDOM7  DS    CL64    14   10   64  A  U N             T        Y  207         
DOMDOM7X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15    6    2  L  P N             T        Y              
DOMDOM8H DS    XL8                                                              
DOMDOM8  DS    CL64    15   10   64  A  U N             T        Y  208         
DOMDOM8X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    6    2  L  P N             T        Y              
DOMDOM9H DS    XL8                                                              
DOMDOM9  DS    CL64    16   10   64  A  U N             T        Y  209         
DOMDOM9X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17    6    2  L  P N             T        Y              
DOMDOMAH DS    XL8                                                              
DOMDOMA  DS    CL64    17   10   64  A  U N             T        Y  210         
DOMDOMAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    6    2  L  P N             T        Y              
DOMDOMBH DS    XL8                                                              
DOMDOMB  DS    CL64    18   10   64  A  U N             T        Y  211         
DOMDOMBX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19    6    2  L  P N             T        Y              
DOMDOMCH DS    XL8                                                              
DOMDOMC  DS    CL64    19   10   64  A  U N             T        Y  212         
DOMDOMCX DS    XL8                                                              
DOMDONDH DS    XL8                                                              
DOMDOND  DS    CL2     20    6    2  L  P N             T        Y              
DOMDOMDH DS    XL8                                                              
DOMDOMD  DS    CL64    20   10   64  A  U N             T        Y  213         
DOMDOMDX DS    XL8                                                              
DOMDONEH DS    XL8                                                              
DOMDONE  DS    CL2     21    6    2  L  P N             T        Y              
DOMDOMEH DS    XL8                                                              
DOMDOME  DS    CL64    21   10   64  A  U N             T        Y  214         
DOMDOMEX DS    XL8                                                              
DOMDONFH DS    XL8                                                              
DOMDONF  DS    CL2     22    6    2  L  P N             T        Y              
DOMDOMFH DS    XL8                                                              
DOMDOMF  DS    CL64    22   10   64  A  U N             T        Y  215         
DOMDOMFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     23    6    2  L  P N             T        Y  220         
         DS    XL8                                                              
DOMDOMTH DS    XL8                                                              
DOMDOMT  DS    CL2     23    9    2  L  P N             T        Y  222         
DOMDOMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    XL8                                                              
DOMLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
DOMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1608 BYTES                            
