*          DATA SET SEACSF8D   AT LEVEL 011 AS OF 07/05/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DF8D      DATE 07/05/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     5    2   16  L  P H             T        Y              
DPTOIDH  DS    CL8                                                              
DPTOID   DS    CL2      5   27    2  A  U N             T        Y  108         
DPTOIDX  DS    CL8                                                              
DPTOIDNH DS    CL8                                                              
DPTOIDN  DS    CL30     5   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL16     6    2   16  L  P H             T        Y              
DPTDIDH  DS    CL8                                                              
DPTDID   DS    CL3      6   27    3  A  U N             T        Y  109         
DPTDIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     8    2   16  L  P H             T        Y              
DPTDIDNH DS    CL8                                                              
DPTDIDN  DS    CL30     8   27   30  L  U N             T        Y  131         
DPTDIDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10    2   16  L  P N             T        Y              
DPTAPCH  DS    CL8                                                              
DPTAPC   DS    CL8     10   27    8  A  U H             T        Y  131         
DPTAPCX  DS    CL8                                                              
DPTAPCNH DS    CL8                                                              
DPTAPCN  DS    CL30    10   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    12    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   23    1  L  P N             T        Y              
DPTPIDH  DS    CL8                                                              
DPTPID   DS    CL8     12   27    8  A  U H             T        Y  130         
DPTPIDX  DS    CL8                                                              
DPTPIDNH DS    CL8                                                              
DPTPIDN  DS    CL30    12   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    13    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   23    1  L  P N             T        Y              
DPTPI2H  DS    CL8                                                              
DPTPI2   DS    CL8     13   27    8  A  U H             T        Y  130         
DPTPI2X  DS    CL8                                                              
DPTPI2NH DS    CL8                                                              
DPTPI2N  DS    CL30    13   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    14    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   23    1  L  P N             T        Y              
DPTPI3H  DS    CL8                                                              
DPTPI3   DS    CL8     14   27    8  A  U H             T        Y  130         
DPTPI3X  DS    CL8                                                              
DPTPI3NH DS    CL8                                                              
DPTPI3N  DS    CL30    14   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    15    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   23    1  L  P N             T        Y              
DPTPI4H  DS    CL8                                                              
DPTPI4   DS    CL8     15   27    8  A  U H             T        Y  130         
DPTPI4X  DS    CL8                                                              
DPTPI4NH DS    CL8                                                              
DPTPI4N  DS    CL30    15   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   23    1  L  P N             T        Y              
DPTPI5H  DS    CL8                                                              
DPTPI5   DS    CL8     16   27    8  A  U H             T        Y  130         
DPTPI5X  DS    CL8                                                              
DPTPI5NH DS    CL8                                                              
DPTPI5N  DS    CL30    16   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    17    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   23    1  L  P N             T        Y              
DPTPI6H  DS    CL8                                                              
DPTPI6   DS    CL8     17   27    8  A  U H             T        Y  130         
DPTPI6X  DS    CL8                                                              
DPTPI6NH DS    CL8                                                              
DPTPI6N  DS    CL30    17   37   30  L  P H             T        Y              
DPTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 880  BYTES                            
