*          DATA SET SEACSA4D   AT LEVEL 003 AS OF 10/23/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DA4D      DATE 10/23/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     5    2   12  L  P N             T        Y              
GRDFORH  DS    XL8                                                              
GRDFOR   DS    CL8      5   16    8  A  U H             T        Y  198         
GRDFORX  DS    XL8                                                              
GRDAGRNH DS    XL8                                                              
GRDAGRN  DS    CL10     5   30   10  L  P N             T        Y  111         
GRDAGRNX DS    XL8                                                              
GRDAGRH  DS    XL8                                                              
GRDAGR   DS    CL8      5   42    8  A  U N             T        Y  112         
GRDAGRX  DS    XL8                                                              
GRDSYSNH DS    XL8                                                              
GRDSYSN  DS    CL12     5   54   12  L  P N             T        Y  121         
GRDSYSNX DS    XL8                                                              
GRDSYSH  DS    XL8                                                              
GRDSYS   DS    CL7      5   68    7  A  U N             T        Y  122         
GRDSYSX  DS    XL8                                                              
GRDTYPNH DS    XL8                                                              
GRDTYPN  DS    CL10     6   30   10  L  P N             T        Y  131         
GRDTYPNX DS    XL8                                                              
GRDTYPH  DS    XL8                                                              
GRDTYP   DS    CL8      6   42    8  A  U N             T        Y  132         
GRDTYPX  DS    XL8                                                              
GRDCODNH DS    XL8                                                              
GRDCODN  DS    CL12     6   54   12  L  P N             T        Y  121         
GRDCODNX DS    XL8                                                              
GRDCODH  DS    XL8                                                              
GRDCOD   DS    CL7      6   68    7  A  U N             T        Y  122         
GRDCODX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
GRDLIN1H DS    XL8                                                              
GRDLIN1  DS    CL78    10    2   78  A  P N             T        Y              
GRDLIN2H DS    XL8                                                              
GRDLIN2  DS    CL78    11    2   78  A  P N             T        Y              
GRDLIN3H DS    XL8                                                              
GRDLIN3  DS    CL78    12    2   78  A  P N             T        Y              
GRDLIN4H DS    XL8                                                              
GRDLIN4  DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
GRDLINLH DS    XL8                                                              
GRDLINL  DS    CL78    23    2   78  A  P N             T        Y              
GRDFOOTH DS    XL8                                                              
GRDFOOT  DS    CL78    24    2   78  L  P H             T        Y  254         
GRDFOOTX DS    XL8                                                              
GRDLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
GRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1560 BYTES                            
