*          DATA SET SEACS9DD   AT LEVEL 001 AS OF 01/30/20                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0D9DD      DATE 01/30/20                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL10     6    2   10  L  P H             T        Y              
BAGBAGH  DS    XL8                                                              
BAGBAG   DS    CL3      6   14    3  A  U N             T        Y  102         
BAGBAGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL25     8    2   25  L  P N             T        Y              
BAGNAMH  DS    XL8                                                              
BAGNAM   DS    CL33     8   30   33  A  U N             T        Y  201         
BAGNAMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    24    4   77  L  P H             T        Y  254         
         DS    XL8                                                              
BAGLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
BAGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 216  BYTES                            
