*          DATA SET SEACSF2D   AT LEVEL 009 AS OF 07/11/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DF2D      DATE 07/11/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13  L  P H             T        Y              
DSPSYSH  DS    CL8                                                              
DSPSYS   DS    CL7      5   16    7  A  U N             T        Y  200         
DSPSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     6    2   13  L  P H             T        Y              
DSPPGMH  DS    CL8                                                              
DSPPGM   DS    CL7      6   16    7  A  U N             T        Y  201         
DSPPGMX  DS    CL8                                                              
DSPPGMAH DS    CL8                                                              
DSPPGMA  DS    CL48     6   27   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  L  P H             T        Y              
DSPFLDNH DS    CL8                                                              
DSPFLDN  DS    CL3      7   16    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     9    2   13  L  P N             T        Y              
DSPWRDNH DS    CL8                                                              
DSPWRDN  DS    CL8      9   16    8  A  U H             T        Y              
DSPWRDAH DS    CL8                                                              
DSPWRDA  DS    CL8      9   27    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    10    2   13  L  P N             T        Y              
DSPDSCNH DS    CL8                                                              
DSPDSCN  DS    CL5     10   16    5  A  U H             T        Y              
DSPDSCAH DS    CL8                                                              
DSPDSCA  DS    CL48    10   27   48  A  P N             T        Y              
DSPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DSPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 328  BYTES                            
