*          DATA SET SEACSFFD   AT LEVEL 008 AS OF 01/25/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DFFD      DATE 01/25/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ACSMSGH  DS    CL8                                                              
ACSMSG   DS    CL60     1    2   60  L  P H             T        Y              
ACSSRVH  DS    CL8                                                              
ACSSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P H             T        Y              
ACSRECH  DS    CL8                                                              
ACSREC   DS    CL8      2   10    8  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      2   20    6  L  P H             T        Y              
ACSACTH  DS    CL8                                                              
ACSACT   DS    CL8      2   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      2   37    3  L  P N             T        Y              
ACSKEYH  DS    CL8                                                              
ACSKEY   DS    CL39     2   41   39  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      3    2    7  L  P N             T        Y              
ACSOPTH  DS    CL8                                                              
ACSOPT   DS    CL70     3   10   70  A  U H        M    T        Y              
ACSTABH  DS    CL8                                                              
ACSTAB   DS    CL1      4   10    1  A  U N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
