*          DATA SET SEACSA7D   AT LEVEL 003 AS OF 10/23/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DA7D      DATE 10/23/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     4    2   11  L  P H             T        Y              
AGRGCDEH DS    XL8                                                              
AGRGCDE  DS    CL8      4   14    8  A  U N             T        Y  111         
AGRGCDEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      4   27    8  L  P H             T        Y              
AGRGNMEH DS    XL8                                                              
AGRGNME  DS    CL30     4   37   30  L  U N             T        Y  134         
AGRGNMEX DS    XL8                                                              
AGRSSSH  DS    XL8                                                              
AGRSSS   DS    CL78     6    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     8    2   20  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   23    1  L  P N             T        Y              
AGRPIDH  DS    XL8                                                              
AGRPID   DS    CL8      8   27    8  A  P H             T        Y  130         
AGRPIDX  DS    XL8                                                              
AGRPIDNH DS    XL8                                                              
AGRPIDN  DS    CL30     8   37   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL20     9    2   20  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   23    1  L  P N             T        Y              
AGRPI2H  DS    XL8                                                              
AGRPI2   DS    CL8      9   27    8  A  P H             T        Y  130         
AGRPI2X  DS    XL8                                                              
AGRPI2NH DS    XL8                                                              
AGRPI2N  DS    CL30     9   37   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    10    2   20  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   23    1  L  P N             T        Y              
AGRPI3H  DS    XL8                                                              
AGRPI3   DS    CL8     10   27    8  A  P H             T        Y  130         
AGRPI3X  DS    XL8                                                              
AGRPI3NH DS    XL8                                                              
AGRPI3N  DS    CL30    10   37   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    11    2   20  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   23    1  L  P N             T        Y              
AGRPI4H  DS    XL8                                                              
AGRPI4   DS    CL8     11   27    8  A  P H             T        Y  130         
AGRPI4X  DS    XL8                                                              
AGRPI4NH DS    XL8                                                              
AGRPI4N  DS    CL30    11   37   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    12    2   20  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   23    1  L  P N             T        Y              
AGRPI5H  DS    XL8                                                              
AGRPI5   DS    CL8     12   27    8  A  P H             T        Y  130         
AGRPI5X  DS    XL8                                                              
AGRPI5NH DS    XL8                                                              
AGRPI5N  DS    CL30    12   37   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    13    2   20  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   23    1  L  P N             T        Y              
AGRPI6H  DS    XL8                                                              
AGRPI6   DS    CL8     13   27    8  A  P H             T        Y  130         
AGRPI6X  DS    XL8                                                              
AGRPI6NH DS    XL8                                                              
AGRPI6N  DS    CL30    13   37   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  L  P N             T        Y              
AGRCOMH  DS    XL8                                                              
AGRCOM   DS    CL60    15   20   60  A  U N             T        Y  135         
AGRCOMX  DS    XL8                                                              
AGRCOM2H DS    XL8                                                              
AGRCOM2  DS    CL78    16    2   78  A  U N             T        Y  135         
AGRCOM2X DS    XL8                                                              
AGRCOM3H DS    XL8                                                              
AGRCOM3  DS    CL78    17    2   78  A  U N             T        Y  135         
AGRCOM3X DS    XL8                                                              
AGRCOM4H DS    XL8                                                              
AGRCOM4  DS    CL78    18    2   78  A  U N             T        Y  135         
AGRCOM4X DS    XL8                                                              
AGRCOM5H DS    XL8                                                              
AGRCOM5  DS    CL78    19    2   78  A  U N             T        Y  135         
AGRCOM5X DS    XL8                                                              
AGRCOMLH DS    XL8                                                              
AGRCOML  DS    CL78    20    2   78  A  U N             T        Y  135         
AGRCOMLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    23    3   77  L  P H             T        Y  254         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    XL8                                                              
AGRLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
AGRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1536 BYTES                            
