*          DATA SET SEACSAED   AT LEVEL 004 AS OF 03/10/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DAED      DATE 03/10/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL13     4    2   13  L  P H             T        Y              
DDSPIDH  DS    XL8                                                              
DDSPID   DS    CL8      4   16    8  A  U H             T        Y  101         
DDSPIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     4   27   13  L  P N             T        Y              
DDSDEFH  DS    XL8                                                              
DDSDEF   DS    CL10     4   42   10  A  U H             T        Y  110         
DDSDEFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     6    2   13  L  P N             T        Y              
DDSGODH  DS    XL8                                                              
DDSGOD   DS    CL3      6   16    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     6   27   13  L  P N             T        Y              
DDSDEPH  DS    XL8                                                              
DDSDEP   DS    CL8      6   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   52    6  L  P N             T        Y              
DDSLEVH  DS    XL8                                                              
DDSLEV   DS    CL8      6   60    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     8    2   13  L  P N             T        Y              
DDSSYSH  DS    XL8                                                              
DDSSYS   DS    CL8      8   16    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL14     8   27   14  L  P N             T        Y              
DDSOVLH  DS    XL8                                                              
DDSOVL   DS    CL10     8   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    10    2   25  L  P H             T        Y              
DDSLIS1H DS    XL8                                                              
DDSLIS1  DS    CL79    11    2   79  A  U N             T        Y              
DDSLIS2H DS    XL8                                                              
DDSLIS2  DS    CL79    12    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    14    2   25  L  P H             T        Y              
DDSLIS7H DS    XL8                                                              
DDSLIS7  DS    CL79    15    2   79  A  U N             T        Y              
DDSLIS8H DS    XL8                                                              
DDSLIS8  DS    CL79    16    2   79  A  U N             T        Y              
DDSLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
DDSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 688  BYTES                            
