*          DATA SET SEACSF0D   AT LEVEL 009 AS OF 07/11/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DF0D      DATE 07/11/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     5    2   17  L  P H             T        Y              
DSPSYSH  DS    CL8                                                              
DSPSYS   DS    CL7      5   20    7  A  U N             T        Y  200         
DSPSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     6    2   17  L  P H             T        Y              
DSPPGMH  DS    CL8                                                              
DSPPGM   DS    CL7      6   20    7  A  U N             T        Y  201         
DSPPGMX  DS    CL8                                                              
DSPPGMDH DS    CL8                                                              
DSPPGMD  DS    CL48     6   30   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     7    2   17  L  P H             T        Y              
DSPUIDH  DS    CL8                                                              
DSPUID   DS    CL8      7   20    8  A  U N             T        Y  209         
DSPUIDX  DS    CL8                                                              
DSPUIDDH DS    CL8                                                              
DSPUIDD  DS    CL33     7   30   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     8    2   17  L  P H             T        Y              
DSPACGH  DS    CL8                                                              
DSPACG   DS    CL8      8   20    8  A  U N             T        Y  212         
DSPACGX  DS    CL8                                                              
DSPACGDH DS    CL8                                                              
DSPACGD  DS    CL50     8   30   50  A  P N             T        Y              
DSPMSGH  DS    CL8                                                              
DSPMSG   DS    CL70    10    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   73    4  L  P H             T        Y              
DSPPAGEH DS    CL8                                                              
DSPPAGE  DS    CL3     10   78    3  A  P H             T        Y              
DSPTBARH DS    CL8                                                              
DSPTBAR  DS    CL79    11    2   79  A  P H             T        Y              
DSPFLDH  DS    CL8                                                              
DSPFLD   DS    CL16    12    2   16  A  P N             T        Y              
DSPINPH  DS    CL8                                                              
DSPINP   DS    CL2     12   19    2  A  P N             T        Y              
DSPFLD2H DS    CL8                                                              
DSPFLD2  DS    CL16    12   22   16  A  P N             T        Y              
DSPINP2H DS    CL8                                                              
DSPINP2  DS    CL2     12   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    12   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   59    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    12   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   19    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    13   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    13   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   59    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    13   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    14    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   19    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   59    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    15    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   19    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    15   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    15   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   59    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    15   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   19    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    16   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    16   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   59    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    16   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   19    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   59    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    18    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   19    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    18   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    18   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   59    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    18   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    19    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   19    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    19   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    19   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   59    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    19   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    20    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   19    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   59    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    21    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   19    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    21   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   39    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    21   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   59    2  A  P N             T        Y              
DSPFLDLH DS    CL8                                                              
DSPFLDL  DS    CL16    21   62   16  A  P N             T        Y              
DSPINPLH DS    CL8                                                              
DSPINPL  DS    CL2     21   79    2  A  P N             T        Y              
DSPBBARH DS    CL8                                                              
DSPBBAR  DS    CL79    22    2   79  A  P H             T        Y              
DSPPFK1H DS    CL8                                                              
DSPPFK1  DS    CL79    23    2   79  L  P N             T        Y              
DSPPFK2H DS    CL8                                                              
DSPPFK2  DS    CL79    24    2   79  L  P N             T        Y              
DSPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DSPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2168 BYTES                            
