*          DATA SET SEACSFBD   AT LEVEL 010 AS OF 07/11/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DFBD      DATE 07/11/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     5    2   16  L  P H             T        Y              
DSPSYSH  DS    CL8                                                              
DSPSYS   DS    CL7      5   20    7  A  U N             T        Y  200         
DSPSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     6    2   16  L  P H             T        Y              
DSPPGMH  DS    CL8                                                              
DSPPGM   DS    CL7      6   20    7  A  U N             T        Y  201         
DSPPGMX  DS    CL8                                                              
DSPPGMDH DS    CL8                                                              
DSPPGMD  DS    CL48     6   31   48  A  P N             T        Y              
DSPRECWH DS    CL8                                                              
DSPRECW  DS    CL16     7    2   16  L  P H             T        Y              
DSPRECH  DS    CL8                                                              
DSPREC   DS    CL3      7   20    3  A  U N             T        Y  206         
DSPRECX  DS    CL8                                                              
DSPFMTDH DS    CL8                                                              
DSPFMTD  DS    CL15     7   31   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  L  P N             T        Y              
DSPATTH  DS    CL8                                                              
DSPATT   DS    CL3      8   20    3  A  U N             T        Y              
DSPATTWH DS    CL8                                                              
DSPATTW  DS    CL8      8   31    8  L  P H             T        Y              
DSPATTDH DS    CL8                                                              
DSPATTD  DS    CL40     8   41   40  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL16     9    2   16  L  P N             T        Y              
DSPWRDNH DS    CL8                                                              
DSPWRDN  DS    CL8      9   20    8  A  U H             T        Y              
DSPWRDAH DS    CL8                                                              
DSPWRDA  DS    CL8      9   31    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    10    2   16  L  P N             T        Y              
DSPDSCNH DS    CL8                                                              
DSPDSCN  DS    CL5     10   20    5  A  U H             T        Y              
DSPDSCAH DS    CL8                                                              
DSPDSCA  DS    CL48    10   31   48  A  P N             T        Y              
DSPMSGH  DS    CL8                                                              
DSPMSG   DS    CL68    12    2   68  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   71    4  L  P H             T        Y              
DSPPAGEH DS    CL8                                                              
DSPPAGE  DS    CL3     12   76    3  A  P H             T        Y              
DSPTBARH DS    CL8                                                              
DSPTBAR  DS    CL79    13    2   79  A  P H             T        Y              
DSPACTH  DS    CL8                                                              
DSPACT   DS    CL8     14    2    8  A  P N             T        Y              
DSPINPH  DS    CL8                                                              
DSPINP   DS    CL2     14   11    2  A  P H             T        Y              
DSPACT2H DS    CL8                                                              
DSPACT2  DS    CL8     14   15    8  A  P N             T        Y              
DSPINP2H DS    CL8                                                              
DSPINP2  DS    CL2     14   24    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     14   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   37    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     14   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   50    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     14   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   63    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     14   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   76    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   11    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     15   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   24    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     15   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   37    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     15   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   50    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     15   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   63    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     15   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   76    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   11    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     16   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   24    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     16   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   37    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     16   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   50    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     16   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   63    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     16   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   76    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   11    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     17   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   24    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     17   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   37    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     17   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   50    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     17   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   63    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     17   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   76    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   11    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   24    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   37    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   50    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   63    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   76    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   11    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     19   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   24    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     19   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   37    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     19   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   50    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     19   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   63    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     19   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   76    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   11    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   24    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   37    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   50    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   63    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   76    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   11    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     21   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   24    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     21   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   37    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     21   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   50    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     21   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   63    2  A  P H             T        Y              
DSPACTLH DS    CL8                                                              
DSPACTL  DS    CL8     21   67    8  A  P N             T        Y              
DSPINPLH DS    CL8                                                              
DSPINPL  DS    CL2     21   76    2  A  P H             T        Y              
DSPBBARH DS    CL8                                                              
DSPBBAR  DS    CL79    22    2   79  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    24    2   79  L  P N             T        Y              
DSPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DSPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2168 BYTES                            
