*          DATA SET SEACSD6D   AT LEVEL 009 AS OF 08/31/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DD6D      DATE 08/31/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     5    2   17  L  P N             T        Y              
LSTSYSH  DS    CL8                                                              
LSTSYS   DS    CL7      5   20    7  A  U H             T        Y  200         
LSTSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     5   37   17  L  P N             T        Y              
LSTPGMH  DS    CL8                                                              
LSTPGM   DS    CL7      5   55    7  A  U H             T        Y  201         
LSTPGMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     6    2   17  L  P N             T        Y              
LSTUIDH  DS    CL8                                                              
LSTUID   DS    CL8      6   20    8  A  U H             T        Y  209         
LSTUIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     6   37   17  L  P N             T        Y              
LSTACGH  DS    CL8                                                              
LSTACG   DS    CL8      6   55    8  A  U H             T        Y  212         
LSTACGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8    2    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8    6    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8   15    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL9      8   24    9  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8   34    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL36     8   43   36  L  P H             T        Y              
LSTACTH  DS    CL8                                                              
LSTACT   DS    CL3      9    2    3  A  U N             T        Y    1         
LSTACTX  DS    CL8                                                              
LSTLINEH DS    CL8                                                              
LSTLINE  DS    CL74     9    6   74  A  P N             T        Y              
LSTACT2H DS    CL8                                                              
LSTACT2  DS    CL3     10    2    3  A  U N             T        Y    1         
LSTACT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
LSTFOOTH DS    CL8                                                              
LSTFOOT  DS    CL78    24    2   78  L  P H             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1920 BYTES                            
