*          DATA SET SEACSF6D   AT LEVEL 008 AS OF 01/25/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DF6D      DATE 01/25/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     5    2   17  L  P H             T        Y              
DSPSYSH  DS    CL8                                                              
DSPSYS   DS    CL7      5   20    7  A  U N             T        Y  200         
DSPSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     6    2   17  L  P H             T        Y              
DSPPGMH  DS    CL8                                                              
DSPPGM   DS    CL7      6   20    7  A  U N             T        Y  201         
DSPPGMX  DS    CL8                                                              
DSPPGMDH DS    CL8                                                              
DSPPGMD  DS    CL48     6   30   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     7    2   17  L  P H             T        Y              
DSPUIDH  DS    CL8                                                              
DSPUID   DS    CL8      7   20    8  A  U N             T        Y  209         
DSPUIDX  DS    CL8                                                              
DSPUIDDH DS    CL8                                                              
DSPUIDD  DS    CL33     7   30   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     8    2   17  L  P H             T        Y              
DSPACGH  DS    CL8                                                              
DSPACG   DS    CL8      8   20    8  A  U N             T        Y  212         
DSPACGX  DS    CL8                                                              
DSPACGDH DS    CL8                                                              
DSPACGD  DS    CL50     8   30   50  A  P N             T        Y              
DSPTABH  DS    CL8                                                              
DSPTAB   DS    CL1      9    2    1  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 368  BYTES                            
