*          DATA SET SEACSD3D   AT LEVEL 012 AS OF 02/01/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DD3D      DATE 02/01/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     5    2   12  L  P N             T        Y              
LSTPWDH  DS    CL8                                                              
LSTPWD   DS    CL10     5   15   10  A  U H             T        Y  102         
LSTPWDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     5   27   13  L  P N             T        Y              
LSTPIDH  DS    CL8                                                              
LSTPID   DS    CL8      5   42    8  A  U H             T        Y  101         
LSTPIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      5   57    9  L  P N             T        Y              
LSTDEFH  DS    CL8                                                              
LSTDEF   DS    CL10     5   68   10  A  U H             T        Y  136         
LSTDEFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     6    2   12  L  P N             T        Y              
LSTAGRH  DS    CL8                                                              
LSTAGR   DS    CL8      6   15    8  A  U H             T        Y  111         
LSTAGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79     8    2   79  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  L  P H             T        Y              
LSTACT1H DS    CL8                                                              
LSTACT1  DS    CL3     10    2    3  A  U N             T        Y    1         
LSTACT1X DS    CL8                                                              
LSTLIN1H DS    CL8                                                              
LSTLIN1  DS    CL74    10    6   74  A  P N             T        Y              
LSTACT2H DS    CL8                                                              
LSTACT2  DS    CL3     11    2    3  A  U N             T        Y    1         
LSTACT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
LSTFOOTH DS    CL8                                                              
LSTFOOT  DS    CL78    24    2   78  L  P H             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1856 BYTES                            
