*          DATA SET SEACSA1D   AT LEVEL 002 AS OF 04/23/20                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DA1D      DATE 04/23/20                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL17     5    2   17  L  P H             T        Y              
REPREQH  DS    XL8                                                              
REPREQ   DS    CL3      5   20    3  A  U N             T        Y   50         
REPREQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     6    2   17  L  P H             T        Y              
REPWHENH DS    XL8                                                              
REPWHEN  DS    CL10     6   20   10  A  U N             T        Y   51         
REPWHENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     7    2   17  L  P N             T        Y              
REPDESTH DS    XL8                                                              
REPDEST  DS    CL10     7   20   10  A  U H             T        Y   52         
REPDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     8    2   17  L  P N             T        Y              
REPOTYPH DS    XL8                                                              
REPOTYP  DS    CL6      8   20    6  A  U H             T        Y  150         
REPOTYPX DS    XL8                                                              
REPSYSNH DS    XL8                                                              
REPSYSN  DS    CL17    10    2   17  L  P N             T        Y              
REPSYSH  DS    XL8                                                              
REPSYS   DS    CL8     10   20    8  A  U H             T        Y  108         
REPSYSX  DS    XL8                                                              
REPOFLNH DS    XL8                                                              
REPOFLN  DS    CL17    11    2   17  L  P N             T        Y              
REPOFFLH DS    XL8                                                              
REPOFFL  DS    CL2     11   20    2  A  U H             T        Y  108         
REPOFFLX DS    XL8                                                              
REPOFCNH DS    XL8                                                              
REPOFCN  DS    CL17    12    2   17  L  P N             T        Y              
REPOFFCH DS    XL8                                                              
REPOFFC  DS    CL2     12   20    2  A  U H             T        Y  108         
REPOFFCX DS    XL8                                                              
REPLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 336  BYTES                            
