*          DATA SET SEACSFILE  AT LEVEL 007 AS OF 06/29/20                      
***********************************************************************         
* SECURITY SYSTEM RECORD DSECTS IN CONTROL FILE.                      *         
* THE CONTROL FILE IS A VARAIBLE LENGTH INDEXED SEQUENTIAL FILE.      *         
* <KEY><LENGTH><STATUS><DATA ELEM><DATA ELEM>.....<DATA ELEM><00>     *         
* WHERE:                                                              *         
* <KEY>        XL25  DESCRIBED FOR EACH RECORD BY DSECTS BELOW        *         
* <LENGTH>     XL2   RECORD LENGTH                                    *         
* <STATUS>     XL1   RECORD STATUS BYTE                               *         
* <DATA ELEM>  XLN   DESCRIBED BY DSECTS BELOW                        *         
***********************************************************************         
*##FILENAME CTFILE                                                              
*##PROCESS ON                                                                   
*##PROCESS ACTIVE RECORD ON                                                     
*##PROCESS ACTIVE KEY OFF                                                       
                                                                                
***********************************************************************         
* DSECT TO COVER PROGRAM RECORDS                                      *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* PROGRAM      F   10  00  00  SY  PG  00  00  00  00  00  00  00  00 *         
* WHERE:                                                              *         
* SY           SYSTEM NUMBER                                          *         
* PG           PROGRAM NUMBER                                         *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'B7'        PROGRAM                                                *         
***********************************************************************         
SAPGREC  DSECT                                                                  
SAPGKEY  DS    0CL25     V         KEY                                          
SAPGTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAPGTYPQ EQU   C'F'                                                             
SAPGSUB  DS    XL1       X         RECORD TYPE                                  
SAPGSUBQ EQU   X'10'               PROGRAM RECORD KEY                           
         DS    CL13      V         N/D                                          
SAPGOVPG DS    0XL2      X         OVERLAY SYSTEM/PROGRAM NUMBER                
SAPGOVS  DS    XL1       X         OVERLAY SYSTEM NUMBER                        
SAPGPGM  DS    XL1       X         PROGRAM NUMBER                               
         ORG   SAPGKEY+L'SAPGKEY                                                
SAPGEND  DS    0X                  END OF KEY FIELDS                            
SAPGLEN  DS    XL2       X         RECORD LENGTH                                
SAPGSTAT DS    XL1       X         STATUS                                       
SAPGDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER ACTION RECORDS                                       *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACTION       F   11  00  00  SY  PG  AC  00  00  00  00  00  00  00 *         
* WHERE:                                                              *         
* AC           ACTION NUMBER                                          *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'B8'        ACTION                                                 *         
***********************************************************************         
SAACREC  DSECT                                                                  
SAACKEY  DS    0CL25     V         KEY                                          
SAACTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAACTYPQ EQU   C'F'                                                             
SAACSUB  DS    XL1       X         RECORD TYPE                                  
SAACSUBQ EQU   X'11'               ACTION RECORD KEY                            
         DS    CL13      V         N/D                                          
SAACOVPG DS    0XL2      X         OVERLAY SYSTEM/PROGRAM NUMBER                
SAACOVS  DS    XL1       X         OVERLAY SYSTEM NUMBER                        
SAACPGM  DS    XL1       X         PROGRAM NUMBER                               
SAACACT  DS    XL1       X         ACTION NUMBER                                
         ORG   SAACKEY+L'SAACKEY                                                
SAACEND  DS    0X                  END OF KEY FIELDS                            
SAACLEN  DS    XL2       X         RECORD LENGTH                                
SAACSTAT DS    XL1       X         STATUS                                       
SAACDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER RECORD RECORDS                                       *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* RECORD       F   12  00  00  SY  PG  RC  00  00  00  00  00  00  00 *         
* WHERE:                                                              *         
* RC           RECORD NUMBER                                          *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'B9'        RECORD                                                 *         
* X'BA'        RECORD/ACTIONS                                         *         
***********************************************************************         
SARCREC  DSECT                                                                  
SARCKEY  DS    0CL25     V         KEY                                          
SARCTYP  DS    CL1       C         RECORD TYPE 'F'                              
SARCTYPQ EQU   C'F'                                                             
SARCSUB  DS    XL1       X         RECORD TYPE                                  
SARCSUBQ EQU   X'12'               RECORD RECORD KEY                            
         DS    CL13      V         N/D                                          
SARCOVPG DS    0XL2      X         OVERLAY SYSTEM/PROGRAM NUMBER                
SARCOVS  DS    XL1       X         OVERLAY SYSTEM NUMBER                        
SARCPGM  DS    XL1       X         PROGRAM NUMBER                               
SARCRCD  DS    XL1       X         RECORD NUMBER                                
         ORG   SARCKEY+L'SARCKEY                                                
SARCEND  DS    0X                  END OF KEY FIELDS                            
SARCLEN  DS    XL2       X         RECORD LENGTH                                
SARCSTAT DS    XL1       X         STATUS                                       
SARCDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER FIELD RECORDS                                        *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* FIELD        F   13  00  00  SY  PG  FD  00  00  00  00  00  00  00 *         
* WHERE:                                                              *         
* FD           FIELD NUMBER                                           *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
***********************************************************************         
SAFDREC  DSECT                                                                  
SAFDKEY  DS    0CL25     V         KEY                                          
SAFDTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAFDTYPQ EQU   C'F'                                                             
SAFDSUB  DS    XL1       X         RECORD TYPE                                  
SAFDSUBQ EQU   X'13'               FIELD RECORD KEY                             
         DS    CL13      V         N/D                                          
SAFDOVPG DS    0XL2      X         OVERLAY SYSTEM/PROGRAM NUMBER                
SAFDOVS  DS    XL1       X         OVERLAY SYSTEM NUMBER                        
SAFDPGM  DS    XL1       X         PROGRAM NUMBER                               
SAFDFCD  DS    XL1       X         FIELD CODE                                   
         ORG   SAFDKEY+L'SAFDKEY                                                
SAFDEND  DS    0X                  END OF KEY FIELDS                            
SAFDLEN  DS    XL2       X         RECORD LENGTH                                
SAFDSTAT DS    XL1       X         STATUS                                       
SAFDDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER OPTIONS RECORDS                                      *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* OPTION       F   14  00  00  SY  PG  OP  00  00  00  00  00  00  00 *         
* WHERE:                                                              *         
* OP           OPTION NUMBER                                          *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
***********************************************************************         
SAOPREC  DSECT                                                                  
SAOPKEY  DS    0CL25     V         KEY                                          
SAOPTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAOPTYPQ EQU   C'F'                                                             
SAOPSUB  DS    XL1       X         RECORD TYPE                                  
SAOPSUBQ EQU   X'14'               OPTIONS RECORD KEY                           
         DS    XL13      V         N/D                                          
SAOPOVPG DS    0XL2      X         OVERLAY SYSTEM/PROGRAM NUMBER                
SAOPOVS  DS    XL1       X         OVERLAY SYSTEM NUMBER                        
SAOPPGM  DS    XL1       X         PROGRAM NUMBER                               
SAOPOCD  DS    XL1       X         OPTION CODE                                  
         ORG   SAOPKEY+L'SAOPKEY                                                
SAOPEND  DS    0X                  END OF KEY FIELDS                            
SAOPLEN  DS    XL2       X         RECORD LENGTH                                
SAOPSTAT DS    XL1       X         STATUS                                       
SAOPDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER ACCESS RECORDS                                       *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACCESS       F   15  AGALPH  SY  PG  USER-ID AGROUP  00  00  00  00 *         
* WHERE:                                                              *         
* AGALPH       AGENCY ALPHA ID                                        *         
* AGROUP       PERSON ACCESS GROUP NUMBER                             *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
***********************************************************************         
SAASREC  DSECT                                                                  
SAASKEY  DS    0CL25     V         KEY                                          
SAASTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAASTYPQ EQU   C'F'                                                             
SAASSUB  DS    XL1       X         RECORD TYPE                                  
SAASSUBQ EQU   X'15'                                                            
         DS    CL11      V         N/D                                          
SAASAGY  DS    CL2       C         AGENCY ALPHA ID                              
SAASOVPG DS    0XL2      X         OVERLAY SYSTEM/PROGRAM NUMBER                
SAASOVS  DS    XL1       X         OVERLAY SYSTEM NUMBER                        
SAASPGM  DS    XL1       X         PROGRAM NUMBER                               
SAASUID  DS    XL2       X         USER-ID NUMBER                               
SAASAGN  DS    XL2       X         ACCESS GROUP NUMBER                          
         ORG   SAASKEY+L'SAASKEY                                                
SAASEND  DS    0X                  END OF KEY FIELDS                            
SAASLEN  DS    XL2       X         RECORD LENGTH                                
SAASSTAT DS    XL1       X         STATUS                                       
SAASDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER FIELD CONTROL RECORDS                                *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACCESS       F   16  AGALPH  SY  PG  USER-ID AGROUP  00  00  00  00 *         
* WHERE:                                                              *         
* AGALPH       AGENCY ALPHA ID                                        *         
* AGROUP       PERSON ACCESS GROUP NUMBER                             *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
***********************************************************************         
SAFCREC  DSECT                                                                  
SAFCKEY  DS    0CL25     V         KEY                                          
SAFCTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAFCTYPQ EQU   C'F'                                                             
SAFCSUB  DS    XL1       X         RECORD TYPE                                  
SAFCSUBQ EQU   X'16'                                                            
         DS    CL11      V         N/D                                          
SAFCAGY  DS    CL2       C         AGENCY ALPHA ID                              
SAFCOVPG DS    0XL2      X         OVERLAY SYSTEM/PROGRAM NUMBER                
SAFCOVS  DS    XL1       X         OVERLAY SYSTEM NUMBER                        
SAFCPGM  DS    XL1       X         PROGRAM NUMBER                               
SAFCUID  DS    XL2       X         USER-ID NUMBER                               
SAFCAGN  DS    XL2       X         ACCESS GROUP NUMBER                          
         ORG   SAFCKEY+L'SAFCKEY                                                
SAFCEND  DS    0X                  END OF KEY FIELDS                            
SAFCLEN  DS    XL2       X         RECORD LENGTH                                
SAFCSTAT DS    XL1       X         STATUS                                       
SAFCDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER OPTION CONTROL RECORDS                               *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACCESS       F   17  AGALPH  SY  PG  USER-ID AGROUP  00  00  00  00 *         
* WHERE:                                                              *         
* AGALPH       AGENCY ALPHA ID                                        *         
* AGROUP       PERSON ACCESS GROUP NUMBER                             *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
***********************************************************************         
SAOCREC  DSECT                                                                  
SAOCKEY  DS    0CL25     V         KEY                                          
SAOCTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAOCTYPQ EQU   C'F'                                                             
SAOCSUB  DS    XL1       X         RECORD TYPE                                  
SAOCSUBQ EQU   X'17'                                                            
         DS    CL11      V         N/D                                          
SAOCAGY  DS    CL2       C         AGENCY ALPHA ID                              
SAOCOVPG DS    0XL2      X         OVERLAY SYSTEM/PROGRAM NUMBER                
SAOCOVS  DS    XL1       X         OVERLAY SYSTEM NUMBER                        
SAOCPGM  DS    XL1       X         PROGRAM NUMBER                               
SAOCUID  DS    XL2       X         USER-ID NUMBER                               
SAOCAGN  DS    XL2       X         ACCESS GROUP NUMBER                          
         ORG   SAOCKEY+L'SAOCKEY                                                
SAOCEND  DS    0X                  END OF KEY FIELDS                            
SAOCLEN  DS    XL2       X         RECORD LENGTH                                
SAOCSTAT DS    XL1       X         STATUS                                       
SAOCDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER OFFICE RECORDS                                       *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* OFFICE       F   02  AGALPH  OFFCID  00  00  00  00  00  00  00  00 *         
* WHERE:                                                              *         
* OFFCID       OFFICE CODE                                            *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'C0'        OFFICE                                                 *         
* X'C2'        PERSON COUNT                                           *         
* X'E0'        TIME SHEET APPROVER GROUP CODE                         *         
***********************************************************************         
SAOFREC  DSECT                                                                  
SAOFKEY  DS    0CL25     V         KEY                                          
SAOFTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAOFTYPQ EQU   C'F'                                                             
SAOFSUB  DS    XL1       X         RECORD TYPE                                  
SAOFSUBQ EQU   X'02'                                                            
         DS    CL11      V         N/D                                          
SAOFAGY  DS    CL2       C         AGENCY ALPHA ID                              
SAOFOID  DS    CL2       C         OFFICE-ID CODE                               
         ORG   SAOFKEY+L'SAOFKEY                                                
SAOFEND  DS    0X                  END OF KEY FIELDS                            
SAOFLEN  DS    XL2       X         RECORD LENGTH                                
SAOFSTAT DS    XL1       X         STATUS                                       
SAOFDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER DEPARTMENT RECORDS                                   *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* DEPARTMENT   F   03  AGALPH  OFFCID  <---DEPTID--->  00  00  00  00 *         
* WHERE:                                                              *         
* DEPTID       DEPARTMENT ID CODE                                     *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'C1'        DEPARTMENT                                             *         
* X'C2'        PERSON COUNT                                           *         
* X'E0'        TIME SHEET APPROVER GROUP CODE                         *         
***********************************************************************         
SADPREC  DSECT                                                                  
SADPKEY  DS    0CL25     V         KEY                                          
SADPTYP  DS    CL1       C         RECORD TYPE 'F'                              
SADPTYPQ EQU   C'F'                                                             
SADPSUB  DS    XL1       X         RECORD TYPE                                  
SADPSUBQ EQU   X'03'                                                            
         DS    CL11      V         N/D                                          
SADPAGY  DS    CL2       C         AGENCY ALPHA ID                              
SADPOID  DS    CL2       C         OFFICE-ID CODE                               
SADPDID  DS    CL3       C         DEPARTMENT-ID CODE                           
         ORG   SADPKEY+L'SADPKEY                                                
SADPEND  DS    0X                  END OF KEY FIELDS                            
SADPLEN  DS    XL2       X         RECORD LENGTH                                
SADPSTAT DS    XL1       X         STATUS                                       
SADPDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON RECORDS                                       *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* PERSON       F   04  AGALPH  <--------PERSONAL ID--------->  EFDATE *         
* WHERE:                                                              *         
* EFDATE       DATE EFFECTIVE 1'S COMPLEMENT                          *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'04'        DATE LAST LOGGED ON                                    *         
* X'C4'        PASSWORD NUMBER/CODE                                   *         
* X'C5'        PERSON NAME                                            *         
* X'C6'        PERSONNEL DETAILS                                      *         
* X'C7'        PERSON ADDRESS                                         *         
* X'C8'        PERSON ACCESS GROUP NUMBER/CODE                        *         
* X'CD'        PERSON LIMIT ACCESS GROUP CODE                         *         
* X'DD'        PERSON DDS DETAILS (IF DDS EMPLOYEE)                   *         
* X'DE'        PERSON DDS AGENCY LIST ELEMENTS                        *         
* X'E0'        TIME SHEET APPROVER GROUP CODE                         *         
***********************************************************************         
SAPEREC  DSECT                                                                  
SAPEKEY  DS    0CL25     V         KEY                                          
SAPETYP  DS    CL1       C         RECORD TYPE 'F'                              
SAPETYPQ EQU   C'F'                                                             
SAPESUB  DS    XL1       X         RECORD TYPE                                  
SAPESUBQ EQU   X'04'                                                            
         DS    CL11      V         N/D                                          
SAPEAGY  DS    CL2       C         AGENCY ALPHA ID                              
SAPEPID  DS    CL8       C         PERSONAL-ID                                  
SAPEDEF  DS    XP(DT02X)L2        EFFECTIVE DATE 1'S COMPLEMENT                 
         ORG   SAPEKEY+L'SAPEKEY                                                
SAPEEND  DS    0X                  END OF KEY FIELDS                            
SAPELEN  DS    XL2       X         RECORD LENGTH                                
SAPESTAT DS    XL1       X         STATUS                                       
SAPEDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON ACCESS GROUP RECORDS                          *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACCESS GROUP F   05  AGALPH  <-----ACCESS GROUP CODE------>  00  00 *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'C2'        PERSON COUNT                                           *         
* X'C9'        PERSON ACCESS GROUP NUMBER/NAME                        *         
* X'CE'        COMMENT DATA LINES                                     *         
*                                                                     *         
* ACCESS GROUP NUMBER MAINTAINED IN AGENCY MASTER RECORD:             *         
* GROUP COUNT  F   05  AGALPH  00  00  00  00  00  00  00  00  00  00 *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'C9'        PERSON ACCESS GROUP NUMBER                             *         
***********************************************************************         
SAAGREC  DSECT                                                                  
SAAGKEY  DS    0CL25     V         KEY                                          
SAAGTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAAGTYPQ EQU   C'F'                                                             
SAAGSUB  DS    XL1       X         RECORD TYPE                                  
SAAGSUBQ EQU   X'05'                                                            
         DS    CL11      V         N/D                                          
SAAGAGY  DS    CL2       C         AGENCY ALPHA ID                              
SAAGAGR  DS    CL8       C         ACCESS GROUP CODE                            
         ORG   SAAGKEY+L'SAAGKEY                                                
SAAGEND  DS    0X                  END OF KEY FIELDS                            
SAAGLEN  DS    XL2       X         RECORD LENGTH                                
SAAGSTAT DS    XL1       X         STATUS                                       
SAAGDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER LIMIT ACCESS GROUP RECORDS                           *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACCESS GROUP F   18  AGALPH  <-LIMIT ACCESS GROUP CODE---->  00  00 *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'C2'        PERSON COUNT                                           *         
* X'CB'        LIMIT ACCESS GROUP NAME                                *         
* X'CC'        LIMIT ACCESS SYSTEM ELEMENT                            *         
***********************************************************************         
SALAREC  DSECT                                                                  
SALAKEY  DS    0CL25     V         KEY                                          
SALATYP  DS    CL1       C         RECORD TYPE 'F'                              
SALATYPQ EQU   C'F'                                                             
SALASUB  DS    XL1       X         RECORD TYPE                                  
SALASUBQ EQU   X'18'                                                            
         DS    CL11      V         N/D                                          
SALAAGY  DS    CL2       C         AGENCY ALPHA ID                              
SALAAGR  DS    CL8       C         ACCESS GROUP CODE                            
         ORG   SALAAGR                                                          
         DS    XL6                 NULL FILLED                                  
SALAAGN  DS    XL2       X         DATA GROUP NUMBER                            
         ORG   SALAKEY+L'SALAKEY                                                
SALAEND  DS    0X                  END OF KEY FIELDS                            
SALALEN  DS    XL2       X         RECORD LENGTH                                
SALASTAT DS    XL1       X         STATUS                                       
SALADATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER LIMIT ACCESS LIST RECORDS                            *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACCESS GROUP F   19  SYS AGALPH LIST ID  00  00  00  00  00  00  00 *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'02'        DESCRIPTION                                            *         
* X'05'        LIMIT ACCESS LIST ELEMENT                              *         
***********************************************************************         
SALMREC  DSECT                                                                  
SALMKEY  DS    0CL25     V         KEY                                          
SALMTYP  DS    CL1       C         RECORD TYPE 'F'                              
SALMTYPQ EQU   C'F'                                                             
SALMSUB  DS    XL1       X         RECORD TYPE                                  
SALMSUBQ EQU   X'19'                                                            
         DS    CL11      V         N/D                                          
SALMSYS  DS    XL1       C         SYSTEM OVERLAY NUMBER                        
SALMAGY  DS    CL2       C         AGENCY ALPHA ID                              
SALMLID  DS    XL2       C         LIST ID                                      
         ORG   SALMKEY+L'SALMKEY                                                
SALMEND  DS    0X                  END OF KEY FIELDS                            
SALMLEN  DS    XL2       X         RECORD LENGTH                                
SALMSTAT DS    XL1       X         STATUS                                       
SALMDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER TIME SHEET APPROVER GROUP RECORDS                    *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACCESS GROUP F   05  AGALPH  <-----APPROVER GROUP CODE --->  00  00 *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'C2'        PERSON COUNT                                           *         
* X'DF'        APPROVER GROUP NUMBER/NAME                             *         
* X'CE'        COMMENT DATA LINES                                     *         
*                                                                     *         
* APPROVER GROUP NUMBER MAINTAINED IN AGENCY MASTER RECORD:           *         
* GROUP COUNT  F   05  AGALPH  00  00  00  00  00  00  00  00  00  00 *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'C9'        APPROVER GROUP NUMBER                                  *         
***********************************************************************         
SAAPREC  DSECT                                                                  
SAAPKEY  DS    0CL25     V         KEY                                          
SAAPTYP  DS    CL1       C         RECORD TYPE 'F'                              
SAAPTYPQ EQU   C'F'                                                             
SAAPSUB  DS    XL1       X         RECORD TYPE                                  
SAAPSUBQ EQU   X'20'                                                            
         DS    CL11      V         N/D                                          
SAAPAGY  DS    CL2       C         AGENCY ALPHA ID                              
SAAPAGR  DS    CL8       C         APPROVER GROUP CODE                          
         ORG   SAAPKEY+L'SAAPKEY                                                
SAAPEND  DS    0X                  END OF KEY FIELDS                            
SAAPLEN  DS    XL2       X         RECORD LENGTH                                
SAAPSTAT DS    XL1       X         STATUS                                       
SAAPDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER TEXT LIMIT ACCESS LIST RECORDS                       *         
* RECORD TYPE  00 +01 +13 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACCESS GROUP F   21  AGALPH SYS <-LIST ID->  00  EFDATE  00  00  00 *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'02'        DESCRIPTION                                            *         
* X'07'        TEXT LIMIT ACCESS LIST ELEMENT                         *         
***********************************************************************         
SATLREC  DSECT                                                                  
SATLKEY  DS    0CL25     V         KEY                                          
SATLTYP  DS    CL1       C         RECORD TYPE 'F'                              
SATLTYPQ EQU   C'F'                                                             
SATLSUB  DS    XL1       X         RECORD TYPE                                  
SATLSUBQ EQU   X'21'                                                            
         DS    CL11      V         N/D                                          
SATLAGY  DS    CL2       C         AGENCY ALPHA ID                              
SATLSYS  DS    XL1       X         SYSTEM OVERLAY NUMBER                        
SATLLID  DS    XL3       X         LIST ID                                      
         DS    XL1                 SPARE                                        
SATLDEF  DS    XP(DT02X)L2         EFFECTIVE DATE 1'S COMPLEMENT                
         ORG   SATLKEY+L'SATLKEY                                                
SATLEND  DS    0X                  END OF KEY FIELDS                            
SATLLEN  DS    XL2       X         RECORD LENGTH                                
SATLSTAT DS    XL1       X         STATUS                                       
SATLDATA DS    0C        V         DATA                                         
                                                                                
***********************************************************************         
* PERSONAL AUTHORISATION OR PASSWORD RECORD STRUCTURES                *         
* THESE RECORDS ARE DEFINED BY FIRST BYTE CHARACTER CODE C'0' AND ARE *         
* IN PAIRS OF ACTIVE AND PASSIVE RECORDS WITH THE SAME DATA ELEMENTS. *         
*                                                                     *         
* RECORD TYPE  00 +01 +02 +14 +15 +16 +17 +18 +19 +20 +21 +22 +23 +24 *         
* -----------  ------------------------------------------------------ *         
* ACTIVE       0   AGALPH  <-------------PASSWORD CODE--------------> *         
* PASSIVE      0   AGALPH  00  00  00  00  00  00  00  00  00  PASSWD *         
* ELEMENTS:                                                           *         
* X'01'        ACTIVITY                                               *         
* X'02'        DESCRIPTION                                            *         
* X'03'        POINTER                                                *         
* X'20'        USER-ID                                                *         
* X'21'        SYSTEM                                                 *         
* X'C3'        PERSONAL-ID                                            *         
* X'CA'        EFFECTIVE DATES                                        *         
***********************************************************************         
                                                                                
***********************************************************************         
* DSECT TO COVER PERSONAL AUTHORIZATION OR PASSWORD RECORDS           *         
***********************************************************************         
SA0REC   DSECT                                                                  
SA0KEY   DS    0CL25     V         KEY                                          
SA0KTYP  DS    CL1       C         RECORD TYPE                                  
SA0KTYPQ EQU   C'0'                                                             
SA0KAGY  DS    CL2       C         AGENCY ALPHA ID                              
SA0KEYS  DS    0CL22                                                            
*                                  AUTHORIZATION PASSWORD # RECORDS             
         DS    XL20      X         SPARE (BINARY ZEROES)                        
SA0KNUM  DS    XL2       X         PERSON AUTH NUMBER (X'FFFF'-X'0000')         
*                                  AUTHORIZATION PASSWORD CODE RECORDS          
         ORG   SA0KEYS                                                          
SA0KPID  DS    CL8       X         PERSONAL ID IF REQUIRED ELSE NULLS           
SA0KDTM  DS    0XL4      X         EFFECTIVE DATE/TIME 1'S COMPLEMENT           
SA0KDTD  DS    XP(DT02X)L2         EFFECTIVE DATE 1'S COMPLEMENT                
SA0KDTT  DS    XL2       X         EFFECTIVE TIME 1'S COMPLEMENT                
SA0KCODE DS    CL10      C         SECRET PASSWORD LOG-ON CODE                  
SA0LEN   DS    XL2       X         RECORD LENGTH                                
SA0STAT  DS    XL1       X         STATUS (X'20' LOCKED)                        
*                                         (X'40' NEW PERSON PASSWORD)           
SA0DATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'03' POINTER ELEMENTS)                
*                                       (X'21' SYSTEM ELEMENTS)                 
                                                                                
***********************************************************************         
* DSECT TO COVER ID RECORDS                                           *         
***********************************************************************         
SAIREC   DSECT                                                                  
SAIKEY   DS    0CL25     C         KEY                                          
SAIKTYP  DS    CL1       C                                                      
SAIKTYPQ EQU   C'I'                                                             
SAIKSPAR DS    CL14      C         SPARE (BINARY ZEROES)                        
SAIKID   DS    CL10      C         ID NAME                                      
         ORG   SAIKID                                                           
         DS    XL8                 N/D                                          
SAIKNUM  DS    XL2       X         ID NUMBER                                    
SAILEN   DS    CL2       X         RECORD LENGTH                                
SAISTAT  DS    CL1       X         STATUS                                       
SAIDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION - ID NUM)            
*                                       (X'03' PRINCIPAL ID ELEMENT)            
*                                       (X'06' TWO CHR AGY ID ELEMENT)          
*                                       (X'20' ID ELEMENTS)                     
*                                       (X'21' SYSTEM ELEMENTS)                 
*                                       (X'33' UK AGENCY ELEMENT)               
*                                       (X'34' VALID DESTINATION)               
*                                       (X'36' ORIGIN DETAILS)                  
*                                       (X'30' DESTINATION DETAIL)              
*                                       (X'31' ATTENTION DETAIL)                
*                                       (X'3A' VALID PRINTER ELEMENT)           
*                                       (X'42' OUTPUT TYPE CODE)                
*                                       (X'23' PROGRAM TEST ELEMENTS)           
                                                                                
***********************************************************************         
* DSECT TO COVER SYSTEM LIST RECORDS                                  *         
***********************************************************************         
SAWREC   DSECT                                                                  
SAWKEY   DS    0CL25     V         KEY                                          
SAWKTYP  DS    CL1       C         RECORD TYPE 'W'                              
SAWKTYPQ EQU   C'W'                                                             
SAWKSPAR DS    CL14      X         SPARE (BINARY ZEROES)                        
SAWKAGY  DS    CL2       X         AGENCY CODE OR BINARY ZEROES                 
SAWKREC  DS    CL1       C         SUB-RECORD TYPE -                            
SAWKRLIN EQU   C'L'                LINE LIST                                    
SAWKRUSR EQU   C'I'                USER-ID LIST                                 
SAWKRSYS EQU   C'S'                SYSTEM LIST                                  
SAWKRPTS EQU   C'P'                PTS LIST                                     
SAWKRPRT EQU   C'R'                PRINTER LIST                                 
SAWKRIDG EQU   C'G'                ID GROUP LIST                                
SAWKID   DS    CL6       C         LIST ID                                      
SAWKSUB  DS    CL1       X         SUB-NUMBER                                   
SAWLEN   DS    CL2       X         RECORD LENGTH                                
SAWSTAT  DS    CL1       X         STATUS                                       
SAWDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENT)             
*                                       (X'A4' LIST ELEMENTS)                   
*                                       (X'A5' LIST INCLUDE ELEMENTS)           
                                                                                
***********************************************************************         
* SECURITY SYSTEM DATA ELEMENT DSECTS                                 *         
***********************************************************************         
*##PROCESS ACTIVE RECORD OFF                                                    
***##PROCESS ACTIVE KEY OFF                                                     
*##PROCESS ELEMENT ON                                                           
***********************************************************************         
* DSECT TO COVER ACTIVITY ELEMENT (X'01')                             *         
***********************************************************************         
SAACVD   DSECT                                                                  
SAACVEL  DS    XL1                 ELEMENT CODE                                 
SAACVELQ EQU   X'01'                                                            
SAACVLEN DS    XL1                 ELEMENT LENGTH (7)                           
*##DATATYPE DATCON3                                                             
SAACVDT  DS    XL3                 DATE OF LAST ACTIVITY (YMD)                  
SAACVSEQ DS    XL2                 RECORD SEQUENCE NUMBER                       
*##ASSOCIATED SAACVLEN                                                          
SAACVLNQ EQU   *-SAACVD                                                         
                                                                                
***********************************************************************         
* DSECT TO COVER DESCRIPTION ELEMENT (X'02')                          *         
***********************************************************************         
SADSCD   DSECT                                                                  
SADSCEL  DS    XL1                 ELEMENT CODE X'02'                           
SADSCELQ EQU   X'02'                                                            
SADSCLEN DS    XL1                 ELEMENT LENGTH (DESCRIPTION+2)               
*##DATATYPE RESTOFEL                                                            
SADSC    DS    0CL60               DESCRIPTION                                  
                                                                                
***********************************************************************         
* DSECT TO COVER PASSIVE POINTER ELEMENT                              *         
***********************************************************************         
SAPASD   DSECT                                                                  
SAPASEL  DS    XL1                 ELEMENT CODE X'03'                           
SAPASELQ EQU   X'03'                                                            
SAPASLEN DS    XL1                 ELEMENT LENGTH - (04)=NUMBER                 
*                                                   (NN)=NAME                   
*##DATATYPE RESTOFEL                                                            
SAPASDTA DS    0C                  NUMBER/NAME                                  
                                                                                
***********************************************************************         
* DSECT TO COVER DATE LAST LOG ON ELEMENT (X'04')                     *         
***********************************************************************         
SALLOD   DSECT                                                                  
SALLOEL  DS    XL1                 ELEMENT CODE                                 
SALLOELQ EQU   X'04'                                                            
SALLOLEN DS    XL1                 ELEMENT LENGTH (15)                          
*##DATATYPE DATCON3                                                             
SALLODT  DS    XL3                 DATE OF LAST LOG ON (YMD)                    
SALLOADV DS    XL1                 FACPAK                                       
SALLOUSR DS    XL2                 USERID                                       
SALLOSYS DS    XL1                 SYSTEM  TOVSYS                               
SALLOPRG DS    XL1                 PROGRAM TPRG                                 
SALLOFLG DS    XL1                 FLAG BYTE                                    
SALLOMLC EQU   X'80'               MAX LOGON COUNT SECURITY VIOLATION           
SALLOFPW EQU   X'40'               FORGOT PASSWORD INITIATED                    
SALLOSWP EQU   X'20'               ADV SWAP WITH PRE-VALIDATED PASSWORD         
SALLOTME DS    XL3                 INVALID LOGON TIME (1/100 SEC)               
SALLOCNT DS    XL1                 INVALID LOGON COUNT                          
*##ASSOCIATED SALLOLEN                                                          
SALLOLNQ EQU   *-SALLOD                                                         
                                                                                
***********************************************************************         
* DSECT TO COVER LIMIT ACCESS LIST ELEMENT                            *         
***********************************************************************         
SALIMD   DSECT                                                                  
SALIMEL  DS    XL1                 ELEMENT CODE X'05'                           
SALIMELQ EQU   X'05'                                                            
SALIMLEN DS    XL1                 ELEMENT LENGTH                               
*                                                                               
SALIMSUB DS    XL1                 SUB ID - 1=BUYING                            
*                                           2=CREATIVE                          
*                                           3=LIMIT 1                           
*                                           4=LIMIT 2                           
SALIMCHK DS    XL2                 SPARE BYTES FOR CHECKSUM                     
SALIMBIT DS    XL1                 NUMBER OF BITS USED                          
*##DATATYPE RESTOFEL                                                            
SALIMDTA DS    0X                  BIT MASKS FOR ACCESS LISTS                   
                                                                                
***********************************************************************         
* DSECT TO COVER AGENCY ALPHA ID ELEMENT (X'06')                      *         
***********************************************************************         
SAAGYD   DSECT                                                                  
SAAGYEL  DS    XL1                 ELEMENT CODE                                 
SAAGYELQ EQU   X'06'                                                            
SAAGYLEN DS    XL1                 ELEMENT LENGTH (6)                           
SAAGYID  DS    CL2                 AGENCY ALPHA ID                              
SAAGYLNG DS    XL1                 AGENCY LANGUAGE                              
         DS    XL1                 SPARE                                        
*##ASSOCIATED SAAGYLEN                                                          
SAAGYLNQ EQU   *-SAAGYD                                                         
                                                                                
***********************************************************************         
* DSECT TO COVER TEXT LIMIT ACCESS LIST ELEMENT (X'07')               *         
***********************************************************************         
SATLMD   DSECT                                                                  
SATLMEL  DS    XL1                 ELEMENT CODE X'07'                           
SATLMELQ EQU   X'07'                                                            
SATLMLEN DS    XL1                 ELEMENT LENGTH                               
*                                                                               
SATLMTYP DS    XL1                 TYPE                                         
SATLMEDQ EQU   C'M'                MEDIA                                        
SATLCLIQ EQU   C'C'                CLIENT                                       
SATLPROQ EQU   C'P'                PRODUCT                                      
SATLESTQ EQU   C'E'                ESTIMATE                                     
SATLSTAQ EQU   C'S'                STATION                                      
SATLOFFQ EQU   C'O'                OFFICE                                       
SATLBCTQ EQU   C'B'                BOOKING CATEGORY                             
*                                                                               
SATLMCTL DS    X                   CONTROL BITS                                 
SATLMNFQ EQU   X'80'               NEGATIVE FILTER                              
SATLMRDQ EQU   X'40'               READ ONLY MODE                               
SATLMCT2 DS    X                   2ND CONTROL BITS                             
*##DATATYPE RESTOFEL                                                            
SATLMDTA DS    0C                  DATA                                         
                                                                                
***********************************************************************         
* DSECT TO COVER PRINCIPAL ID ELEMENT (X'1F')                         *         
***********************************************************************         
SAPIDD   DSECT                                                                  
SAPIDEL  DS    XL1                 ELEMENT CODE X'1F'                           
SAPIDELQ EQU   X'1F'                                                            
SAPIDLEN DS    XL1                 ELEMENT LENGTH (12)                          
SAPID    DS    CL10                PRINCIPAL ID NAME (LEFT ALIGNED)             
                                                                                
***********************************************************************         
* DSECT TO COVER ID ELEMENT (X'20')                                   *         
***********************************************************************         
SAIDD    DSECT                                                                  
SAIDEL   DS    XL1                 ELEMENT CODE X'20'                           
SAIDELQ  EQU   X'20'                                                            
SAIDLEN  DS    XL1                 ELEMENT LENGTH (12)                          
SAID     DS    CL10                ID NAME (LEFT ALIGNED)                       
         ORG   SAID                NEW ELEMENT HAS TYPE PLUS V/L DATA           
SAIDTYP  DS    XL1                 ELEMENT TYPE                                 
SAIDNEQ  EQU   X'80'               NEW ELEMENT - FIRST BIT MUST BE ZERO         
SAIDROQ  EQU   X'40'               READ ONLY ITEM                               
SAIDNUQ  EQU   X'20'               LAST TWO BYTES OF EL IS AN ID NUMBER         
SAIDAGQ  EQU   X'02'               NAME IS AN AGENCY                            
SAIDLIQ  EQU   X'01'               NAME IS A LIST                               
SAIDNAM  DS    CL8                 ELEMENT NAME (DEPENDS ON TYPE)               
                                                                                
***********************************************************************         
* DSECT TO COVER SYSTEM AUTHORIZATION ELEMENT (X'21')                 *         
***********************************************************************         
SASYSD   DSECT                                                                  
SASYSEL  DS    XL1                 ELEMENT CODE                                 
SASYSELQ EQU   X'21'                                                            
SASYSLN  DS    XL1                 ELEMENT LENGTH (16) OR (80)                  
SASYSNUM DS    XL1                 SYSTEM NUMBER (FOR CALLOV)                   
SASYSSE  DS    XL1                 SE NUMBER (FOR TASK ID)                      
SASYSAGB DS    XL1                 BINARY AGENCY/COMPANY                        
SASYSIND DS    XL1                 INDICATORS                                   
SASYSINF EQU   X'80'               NEW FORMAT ELEMENT                           
SASYSIYP EQU   X'40'               PASSWORD IS REQUIRED FOR SYSTEM              
SASYSINP EQU   X'20'               PASSWORD IS NOT REQUIRED FOR SYSTEM          
*&&UK                                                                           
SASYSBNV EQU   X'08'               BOOK CATS DEFAULT TO NEGATIVE                
SASYSBWR EQU   X'04'               BOOK CATS DEFAULT TO WRITE                   
SASYSBRD EQU   SASYSBNV+SASYSBWR   BOOK CATS DEFAULT TO READ-ONLY               
*&&                                                                             
SASYSLID DS    XL2                 LIMIT ACCESS RECORD ID                       
SASYSLMT DS    CL4                 LIMIT ACCESS CODE                            
         DS    XL2                 N/D                                          
SASYSALL DS    XL2                 ALL AUTHORIZATION LEVEL                      
*##ASSOCIATED SASYSLN                                                           
SASYSLNQ EQU   *-SASYSD            LENGTH FIXED PART                            
SASYSPGM DS    0XL(1+L'SASYSALL)   AUTHORIZATION LEVELS - 3 BYTES/PROG.         
SASYSPNM DS    XL1                 PROGRAM CODE NUMBER                          
SASYSAUT DS    XL(L'SASYSALL)      PROGRAM AUTHORIZATION CODE                   
PAUTHLEN EQU   2                   LENGTH PROGRAM AUTHORIZATION CODE            
                                                                                
***********************************************************************         
* DSECT TO COVER PROGRAM ELEMENT                                      *         
***********************************************************************         
SAPGMD   DSECT                                                                  
SAPGMEL  DS    XL1                 ELEMENT CODE                                 
SAPGMELQ EQU   X'B7'                                                            
SAPGMLN  DS    XL1                 ELEMENT LENGTH                               
SAPGMDSC DS    XL2                 DESCRIPTION TEXT NUMBER                      
SAPGMRIF DS    CL1                 RECORD INPUT FORMAT - SEE BELOW              
SAPGMAIF DS    CL1                 ACTION INPUT FORMAT - SEE BELOW              
SAPGMIFX EQU   C'X'                INPUT FORMAT=HEXADECIMAL  (01-FF)            
SAPGMIFA EQU   C'A'                INPUT FORMAT=ALPHANUMERIC (A-Z, 0-9)         
SAPGMIFN EQU   C'N'                INPUT FORMAT=NUMERIC      (1-255)            
SAPGMIND DS    XL1                 INDICATOR BYTE                               
SAPGMIPC EQU   X'80'               PROGRAM IS PC PROGRAM                        
         DS    XL7                 N/D                                          
*APGMACL DS    XL64                ACTION CODE LIST                             
SAPGMACT DS    XL240               ACTION CODE LIST                             
*##ASSOCIATED SAPGMLN                                                           
SAPGMLNQ EQU   *-SAPGMD                                                         
                                                                                
***********************************************************************         
* DSECT TO COVER ACTION ELEMENT                                       *         
***********************************************************************         
SAACTD   DSECT                                                                  
SAACTEL  DS    XL1                 ELEMENT CODE                                 
SAACTELQ EQU   X'B8'                                                            
SAACTLN  DS    XL1                 ELEMENT LENGTH                               
SAACTWRD DS    XL2                 WORD DICTIONARY NUMBER                       
SAACTDSC DS    XL2                 DESCRIPTION TEXT NUMBER                      
         DS    XL8                 N/D                                          
*##ASSOCIATED SAACTLN                                                           
SAACTLNQ EQU   *-SAACTD                                                         
                                                                                
***********************************************************************         
* DSECT TO COVER RECORD ELEMENT                                       *         
***********************************************************************         
SARCDD   DSECT                                                                  
SARCDEL  DS    XL1                 ELEMENT CODE                                 
SARCDELQ EQU   X'B9'                                                            
SARCDLN  DS    XL1                 ELEMENT LENGTH                               
SARCDWRD DS    XL2                 WORD DICTIONARY NUMBER                       
SARCDDSC DS    XL2                 DESCRIPTION TEXT NUMBER                      
SARCDATT DS    XL1                 ATTACHED RECORD TYPE (OR 0)                  
         DS    XL7                 N/D                                          
*##ASSOCIATED SARCDLN                                                           
SARCDLNQ EQU   *-SARCDD                                                         
                                                                                
***********************************************************************         
* DSECT TO COVER RECORD/ACTIONS ELEMENT                               *         
***********************************************************************         
SAMIXD   DSECT                                                                  
SAMIXEL  DS    XL1                 ELEMENT CODE                                 
SAMIXELQ EQU   X'BA'                                                            
SAMIXLN  DS    XL1                 ELEMENT LENGTH                               
SAMIXRCD DS    XL1                 INTERNAL RECORD CODE                         
SAMIXATT DS    XL1                 RECORD CODE OF ATTACHED RECORD, OR 0         
         DS    XL1                 N/D                                          
*##ASSOCIATED SAMIXLN                                                           
SAMIXLNQ EQU   *-SAMIXD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SAMIXACT DS    0XL32               BIT TABLE FOR INTERNAL ACTION CODES          
                                                                                
***********************************************************************         
* DSECT TO COVER FIELD ELEMENT                                        *         
***********************************************************************         
SAFLDD   DSECT                                                                  
SAFLDEL  DS    XL1                 ELEMENT CODE                                 
SAFLDELQ EQU   X'BB'                                                            
SAFLDLN  DS    XL1                 ELEMENT LENGTH                               
SAFLDWRD DS    XL2                 WORD DICTIONARY NUMBER                       
SAFLDDSC DS    XL2                 DESCRIPTION TEXT NUMBER                      
         DS    XL8                 N/D                                          
*##ASSOCIATED SAFLDLN                                                           
SAFLDLNQ EQU   *-SAFLDD                                                         
                                                                                
***********************************************************************         
* DSECT TO COVER OPTION ELEMENT                                       *         
***********************************************************************         
SAOPTD   DSECT                                                                  
SAOPTEL  DS    XL1                 ELEMENT CODE                                 
SAOPTELQ EQU   X'BC'                                                            
SAOPTLN  DS    XL1                 ELEMENT LENGTH                               
SAOPTWRD DS    XL2                 WORD DICTIONARY NUMBER                       
SAOPTDSC DS    XL2                 DESCRIPTION TEXT NUMBER                      
         DS    XL8                 N/D                                          
*##ASSOCIATED SAOPTLN                                                           
SAOPTLNQ EQU   *-SAOPTD                                                         
                                                                                
***********************************************************************         
* DSECT TO COVER FIELDS CONTROL WRITE/READ ELEMENT                    *         
***********************************************************************         
SAFCWD   DSECT                                                                  
SAFCWEL  DS    XL1                 ELEMENT CODE                                 
SAFCWELQ EQU   X'BD'                                                            
SAFCWLN  DS    XL1                 ELEMENT LENGTH                               
         DS    XL2                 N/D                                          
*##ASSOCIATED SAFCWLN                                                           
SAFCWLNQ EQU   *-SAFCWD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SAFCWTAB DS    0XL32               BIT TABLE FOR READ/WRITE FIELDS              
                                                                                
***********************************************************************         
* DSECT TO COVER FIELDS CONTROL READ ELEMENT                          *         
***********************************************************************         
SAFCRD   DSECT                                                                  
SAFCREL  DS    XL1                 ELEMENT CODE                                 
SAFCRELQ EQU   X'BE'                                                            
SAFCRLN  DS    XL1                 ELEMENT LENGTH                               
         DS    XL2                 N/D                                          
*##ASSOCIATED SAFCRLN                                                           
SAFCRLNQ EQU   *-SAFCRD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SAFCRTAB DS    0XL32               BIT TABLE FOR READ FIELDS                    
                                                                                
***********************************************************************         
* DSECT TO COVER OPTIONS CONTROL ELEMENT                              *         
***********************************************************************         
SAOCTD   DSECT                                                                  
SAOCTEL  DS    XL1                 ELEMENT CODE                                 
SAOCTELQ EQU   X'BF'                                                            
SAOCTLN  DS    XL1                 ELEMENT LENGTH                               
         DS    XL2                 N/D                                          
*##ASSOCIATED SAOCTLN                                                           
SAOCTLNQ EQU   *-SAOCTD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SAOCTTAB DS    0XL32               BIT TABLE FOR VALID OPTIONS                  
                                                                                
***********************************************************************         
* DSECT TO COVER OFFICE ELEMENT                                       *         
***********************************************************************         
SAOFFD   DSECT                                                                  
SAOFFEL  DS    XL1                 ELEMENT CODE                                 
SAOFFELQ EQU   X'C0'                                                            
SAOFFLN  DS    XL1                 ELEMENT LENGTH                               
SAOFFMID DS    CL8                 MANAGER-ID                                   
*##ASSOCIATED SAOFFLN                                                           
SAOFFLNQ EQU   *-SAOFFD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SAOFFNAM DS    0CL30               OFFICE NAME                                  
                                                                                
***********************************************************************         
* DSECT TO COVER DEPARTMENT ELEMENT                                   *         
***********************************************************************         
SADPTD   DSECT                                                                  
SADPTEL  DS    XL1                 ELEMENT CODE                                 
SADPTELQ EQU   X'C1'                                                            
SADPTLN  DS    XL1                 ELEMENT LENGTH                               
SADPTMID DS    CL8                 MANAGER-ID                                   
*##ASSOCIATED SADPTLN                                                           
SADPTLNQ EQU   *-SADPTD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SADPTNAM DS    0CL30               DEPARTMENT NAME                              
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON COUNT ELEMENT                                 *         
***********************************************************************         
SAPCTD   DSECT                                                                  
SAPCTEL  DS    XL1                 ELEMENT CODE                                 
SAPCTELQ EQU   X'C2'                                                            
SAPCTLN  DS    XL1                 ELEMENT LENGTH                               
SAPCTVAL DS    XL2                 PERSON COUNT                                 
         DS    XL4                 N/D                                          
*##ASSOCIATED SAPCTLN                                                           
SAPCTLNQ EQU   *-SAPCTD            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON PERSONAL-ID ELEMENT                           *         
***********************************************************************         
SAPALD   DSECT                                                                  
SAPALEL  DS    XL1                 ELEMENT CODE                                 
SAPALELQ EQU   X'C3'                                                            
SAPALLN  DS    XL1                 ELEMENT LENGTH                               
SAPALPID DS    CL8                 PERSONAL-ID                                  
*##ASSOCIATED SAPALLN                                                           
SAPALLNQ EQU   *-SAPALD            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON PASSWORD ELEMENT                              *         
***********************************************************************         
SAPWDD   DSECT                                                                  
SAPWDEL  DS    XL1                 ELEMENT CODE                                 
SAPWDELQ EQU   X'C4'                                                            
SAPWDLN  DS    XL1                 ELEMENT LENGTH                               
SAPWDNUM DS    XL2                 PASSWORD NUMBER                              
SAPWDCOD DS    CL10                PASSWORD CODE                                
*##ASSOCIATED SAPWDLN                                                           
SAPWDLNQ EQU   *-SAPWDD            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON NAME ELEMENT                                  *         
***********************************************************************         
SANAMD   DSECT                                                                  
SANAMEL  DS    XL1                 ELEMENT CODE                                 
SANAMELQ EQU   X'C5'                                                            
SANAMLN  DS    XL1                 ELEMENT LENGTH                               
         DS    XL8                 N/D                                          
SANAMIND DS    XL1                 INDICATORS                                   
SANAMIFN EQU   X'80'               FIRST NAME PRESENT                           
SANAMIMN EQU   X'40'               MIDDLE NAME PRESENT                          
SANAMILN EQU   X'20'               LAST NAME PRESENT                            
*##ASSOCIATED SANAMLN                                                           
SANAMLNQ EQU   *-SANAMD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SANAMES  DS    0C                  NAME SUB-ELEMENTS FOLLOW                     
SANAMELN DS    XL1                 LENGTH OF NAME                               
SANAME   DS    0CL20               MAXIMUM LENGTH OF NAME                       
                                                                                
***********************************************************************         
* DSECT TO COVER PERSONNEL DETAILS ELEMENT                            *         
***********************************************************************         
SAPERD   DSECT                                                                  
SAPEREL  DS    XL1                 ELEMENT CODE                                 
SAPERELQ EQU   X'C6'                                                            
SAPERLN  DS    XL1                 ELEMENT LENGTH                               
SAPEROFF DS    CL2                 OFFICE ID                                    
SAPERDID DS    CL3                 DEPARTMENT ID                                
SAPEREXT DS    CL5                 TELEPHONE EXTENSION NUMBER                   
SAPERSTA DS    CL7                 STAFF CODE                                   
SAPERPRO DS    CL8                 PROFS ID                                     
SAPERINC DS    CL10                INSURANCE CODE                               
SAPERMAR DS    CL8                 MARITAL STATUS                               
SAPERSEX DS    CL1                 SEX 0 - ?! M - MALE F - FEMALE               
*##DATATYPE DATCON2                                                             
SAPERDHI DS    XP(DT02)L2          HIRE DATE (COMPRESSED BINARY)                
*##DATATYPE DATCON2                                                             
SAPERDTE DS    XP(DT02)L2          TERMINATION DATE (COMPRESSED BINARY)         
*##DATATYPE DATCON2                                                             
SAPERDOB DS    XP(DT02)L2          DATE OF BIRTH (COMPRESSED BINARY)            
SAPERINX DS    CL2                 INSURANCE CODE EXTENSION                     
SAPEROVF DS    XL1                 SECURITY MANAGER OVERIDE FLAG                
SAPERPCN DS    CL1                 PASSWORD CONTROL VALUE                       
SAPERPNQ EQU   C'N'                NO EXPIRY                                    
SAPERPYQ EQU   C'Y'                EXPIRY (DEFAULT)                             
SAPERPAQ EQU   C'A'                AUTOMATIC REMOTE PROCESS                     
SAPERPGQ EQU   C'G'                GENERATE NEW PASSWORDS                       
*##ASSOCIATED SAPERLN                                                           
SAPERLNQ EQU   *-SAPERD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SAPERTIT DS    0CL30               PERSON TITLE                                 
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON ADDRESS ELEMENT                               *         
***********************************************************************         
SAADRD   DSECT                                                                  
SAADREL  DS    XL1                                                              
SAADRELQ EQU   X'C7'               ELEMENT CODE                                 
SAADRLN  DS    XL1                 ELEMENT LENGTH (LINE+4)                      
SAADRTYP DS    XL1                 ADDRESS LINE TYPE                            
SAADLINQ EQU   X'01'               X'0N'=ADDRESS LINE N (1-3)                   
SAADCITQ EQU   X'04'               X'04'=CITY                                   
SAADCODQ EQU   X'05'               X'05'=ZIP/POSTAL CODE                        
SAADCTRQ EQU   X'06'               X'06'=COUNTRY CODE (3 BYTES)                 
SAADSTEQ EQU   X'07'               X'07'=STATE                                  
SAADZIPQ EQU   X'08'               X'08'=ZIP CODE                               
SAADPHOQ EQU   X'11'               X'1N'=TELEPHONE N (1 OR 2)                   
SAADTLXQ EQU   X'20'               X'20'=TELEX                                  
SAADFAXQ EQU   X'30'               X'30'=FAX                                    
         DS    XL1                 SPARE                                        
*##ASSOCIATED SAADRLN                                                           
SAADRLNQ EQU   *-SAADRD                                                         
SAADRDLN DS    XL1                 ADDRESS DATA LINE LENGTH                     
*##DATATYPE RESTOFEL                                                            
SAADRDAT DS    0C                  ADDRESS DATA LINE                            
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON ACCESS GROUP CODE ELEMENT                     *         
***********************************************************************         
SAAGCD   DSECT                                                                  
SAAGCEL  DS    XL1                 ELEMENT CODE                                 
SAAGCELQ EQU   X'C8'                                                            
SAAGCLN  DS    XL1                 ELEMENT LENGTH                               
SAAGCNUM DS    XL2                 ACCESS GROUP NUMBER                          
SAAGCCOD DS    CL8                 ACCESS GROUP CODE                            
*##ASSOCIATED SAAGCLN                                                           
SAAGCLNQ EQU   *-SAAGCD            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON ACCESS GROUP NAME ELEMENT                     *         
***********************************************************************         
SAAGND   DSECT                                                                  
SAAGNEL  DS    XL1                 ELEMENT CODE                                 
SAAGNELQ EQU   X'C9'                                                            
SAAGNLN  DS    XL1                 ELEMENT LENGTH                               
SAAGNNUM DS    XL2                 ACCESS GROUP NUMBER                          
*##ASSOCIATED SAAGNLN                                                           
SAAGNLNQ EQU   *-SAAGND            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SAAGNNAM DS    0CL30               ACCESS GROUP NAME                            
                                                                                
***********************************************************************         
* DSECT TO COVER PASSWORD EFFECTIVE DATE ELEMENT                      *         
***********************************************************************         
SAPEFD   DSECT                                                                  
SAPEFEL  DS    XL1                 ELEMENT CODE                                 
SAPEFELQ EQU   X'CA'                                                            
SAPEFLN  DS    XL1                 ELEMENT LENGTH                               
*##DATATYPE DATCON2                                                             
SAPEFSTA DS    XP(DT02)L2          EFFECTIVE START DATE (COMPRESSED)            
*##DATATYPE DATCON2                                                             
SAPEFEND DS    XP(DT02)L2          EFFECTIVE END DATE (COMPRESSED)              
*##ASSOCIATED SAPEFLN                                                           
SAPEFLNQ EQU   *-SAPEFD            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER DATA ACCESS GROUP NAME ELEMENT                                 
***********************************************************************         
SALAND   DSECT                                                                  
SALANEL  DS    XL1                 ELEMENT CODE                                 
SALANELQ EQU   X'CB'                                                            
SALANLN  DS    XL1                 ELEMENT LENGTH                               
*&&UK*&& DS    XL2                 N/D                                          
*&&US                                                                           
SALANNUM DS    XL2                 DATA ACCESS GROUP NUMBER                     
SALANCOD DS    CL8                 DATA ACCESS GROUP CODE                       
*&&                                                                             
*##ASSOCIATED SALANLN                                                           
SALANLNQ EQU   *-SALAND            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SALANNAM DS    0CL30               DATA ACCESS GROUP NAME                       
                                                                                
***********************************************************************         
* DSECT TO COVER LIMIT ACCESS SYSTEM ELEMENT                          *         
***********************************************************************         
SALASD   DSECT                                                                  
SALASEL  DS    XL1                 ELEMENT CODE                                 
SALASELQ EQU   X'CC'                                                            
SALASLN  DS    XL1                 ELEMENT LENGTH                               
SALASNUM DS    XL1                 SYSTEM NUMBER (FOR CALLOV)                   
         DS    XL8                 N/D                                          
SALASIND DS    XL1                 SYSTEM INDICATOR                             
SALASIDF EQU   X'80'               DEFER ACCESS TO COMPANY ID                   
SALASALL DS    XL4                 ALL LIMIT ACCESS VALUE                       
*##ASSOCIATED SALASLN                                                           
SALASLNQ EQU   *-SALASD            LENGTH FIXED PART                            
*##DATATYPE RESTOFEL                                                            
SALASPGM DS    0XL(1+L'SALASALL)   LIMIT ACCESS VALUES - 5 BYTES/PROG.          
SALASPNM DS    XL1                 PROGRAM CODE NUMBER                          
SALASACD DS    XL(L'SALASALL)      LIMIT ACCESS VALUE                           
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON DATA ACCESS GROUP CODE ELEMENT                *         
***********************************************************************         
SALACD   DSECT                                                                  
SALACEL  DS    XL1                 ELEMENT CODE                                 
SALACELQ EQU   X'CD'                                                            
SALACLN  DS    XL1                 ELEMENT LENGTH                               
SALACNUM DS    XL2                 DATA ACCESS GROUP NUMBER                     
SALACCOD DS    CL8                 DATA ACCESS GROUP CODE                       
*##ASSOCIATED SALACLN                                                           
SALACLNQ EQU   *-SALACD            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER COMMENT/INFORMATION LINE ELEMENT                     *         
***********************************************************************         
SACOMD   DSECT                     COMMENT LINE ELEMENT                         
SACOMEL  DS    XL1                                                              
SACOMELQ EQU   X'CE'               ELEMENT CODE                                 
SACOMLN  DS    XL1                 ELEMENT LENGTH (LINE+4)                      
SACOMOPT DS    XL1                 OPTIONAL SUB CODE                            
SACOMLIN DS    XL1                 LINE SEQUENCE NUMBER                         
*##ASSOCIATED SACOMLN                                                           
SACOMLNQ EQU   *-SACOMD            LENGTH FIXED PART                            
*##DATATYPE RESTOFEL                                                            
SACOMDAT DS    0C                  COMMENT DATA LINE                            
                                                                                
***********************************************************************         
* DSECT TO COVER MANAGER ID ELEMENT                                   *         
***********************************************************************         
SAMAND   DSECT                                                                  
SAMANEL  DS    XL1                 ELEMENT CODE                                 
SAMANELQ EQU   X'CF'                                                            
SAMANLN  DS    XL1                 ELEMENT LENGTH                               
SAMANORD DS    XL1                 MANAGER-ID ENTRY ORDER NUMBER (1..6)         
SAMANID  DS    XL2                 MANAGER-ID PERSON PASSWORD NUMBER            
*##ASSOCIATED SAMANLN                                                           
SAMANLNQ EQU   *-SAMAND            LENGTH OF ELEMENT                            
                                                                                
***********************************************************************         
* DSECT TO COVER OLD PERSON PERSONAL-ID ELEMENT                       *         
***********************************************************************         
SAOPID   DSECT                                                                  
SAOPIEL  DS    XL1                 ELEMENT CODE                                 
SAOPIELQ EQU   X'D0'                                                            
SAOPILN  DS    XL1                 ELEMENT LENGTH                               
SAOPIPID DS    CL8                 PERSONAL-ID                                  
*##DATATYPE DATCON2                                                             
SAOPIDAT DS    XP(DT02)L2          DATE (COMPRESSED BINARY)                     
         DS    XL4                 N/D                                          
*##ASSOCIATED SAOPILN                                                           
SAOPILNQ EQU   *-SAOPID            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER 1R PERSON ACCOUNT CODE ELEMENT                       *         
***********************************************************************         
SA1RPD   DSECT                                                                  
SA1RPEL  DS    XL1                 ELEMENT CODE                                 
SA1RPELQ EQU   X'D1'                                                            
SA1RPLN  DS    XL1                 ELEMENT LENGTH                               
SA1RPPID DS    CL12                1R PERSON ACCOUNT CODE                       
*##ASSOCIATED SA1RPLN                                                           
SA1RPLNQ EQU   *-SA1RPD            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER PASSWORD ACTIVITY ELEMENT                            *         
***********************************************************************         
SAPACD   DSECT                                                                  
SAPACEL  DS    XL1                 ELEMENT CODE                                 
SAPACELQ EQU   X'D2'                                                            
SAPACLN  DS    XL1                 ELEMENT LENGTH                               
SAPACPGM DS    CL1                 ACTIVE PROGRAM                               
SAPACPPQ EQU   C'P'                =PASS/=LOGON                                 
SAPACPMQ EQU   C'M'                CON/SEC MAINTENANCE PROGRAM                  
SAPACTRM DS    XL2                 ACTIVE TERMINAL NUMBER                       
         DS    XL6                 N/D                                          
*##DATATYPE DATCON2                                                             
SAPACDAT DS    XP(DT02)L2          DATE OF ACTIVITY                             
SAPACTIM DS    XL4                 TIME OF ACTIVITY                             
SAPACOPW DS    CL10                OLD PASSWORD CODE                            
*##ASSOCIATED SAPACLN                                                           
SAPACLNQ EQU   *-SAPACD            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER DICTIONARY SUBSTITUTION REF#S                        *         
***********************************************************************         
SADICD   DSECT                                                                  
SADICEL  DS    XL1                 ELEMENT CODE                                 
SADICELQ EQU   X'D3'                                                            
SADICLN  DS    XL1                 ELEMENT LENGTH                               
SADICARC DS    XL2                 ACCESS RECORD 'RECORD' DICT#                 
SADICAAC DS    XL2                 ACCESS RECORD 'ACTION' DICT#                 
SADICFWR DS    XL2                 FCONTROL RECORD 'WRITE' DICT#                
SADICFRD DS    XL2                 FCONTROL RECORD 'READ' DICT#                 
SADICFNO DS    XL2                 FCONTROL RECORD 'NO' DICT#                   
SADICARL DS    XL2                 ACCESS RECORD 'RECORD LIST' TEXT#            
SADICAAL DS    XL2                 ACCESS RECORD 'ACTION LIST' TEXT#            
         DS    XL16                N/D                                          
*##ASSOCIATED SADICLN                                                           
SADICLNQ EQU   *-SADICD                                                         
                                                                                
***********************************************************************         
* DSECT TO COVER DDS PERSON ATTRIBUTES                                *         
***********************************************************************         
SADDSD   DSECT                                                                  
SADDSEL  DS    XL1                 ELEMENT CODE                                 
SADDSELQ EQU   X'DD'                                                            
SADDSLN  DS    XL1                 ELEMENT LENGTH                               
*                                                                               
SADDSAT1 DS    XL1                 ATTRIBUTE BYTE ONE                           
SADDSGOD EQU   X'80'               GLOBAL OVERRIDE                              
*                                                                               
SADDSDEP DS    XL1                 DDS DEPT/LEVEL                               
*                                                                               
SADDSAT3 DS    XL1                 ATTRIBUTE BYTE THREE                         
SADDSAT4 DS    XL1                 ATTRIBUTE BYTE FOUR                          
         DS    XL4                 SPARE                                        
*##ASSOCIATED SADDSLN                                                           
SADDSLNQ EQU   *-SADDSEL                                                        
                                                                                
***********************************************************************         
* DSECT TO COVER DDS AGENCY LIST ELEMENTS                             *         
***********************************************************************         
SADDLD   DSECT                                                                  
SADDLEL  DS    XL1                 ELEMENT CODE                                 
SADDLELQ EQU   X'DE'                                                            
SADDLLN  DS    XL1                 ELEMENT LENGTH                               
SADDLSYS DS    XL1                 SYSTEM CODE                                  
SADDLACC DS    XL1                 ACCESS 01=READ 02=WRITE                      
SADDLLEV DS    XL1                 LEVEL OVERIDE                                
*##DATATYPE RESTOFEL                                                            
SADDLAGL DS    0XL3                LIST OF AGY CODES (CTRY/AGY)                 
                                                                                
***********************************************************************         
* DSECT TO COVER TIME SHEET APPROVER GROUP ELEMENT                    *         
***********************************************************************         
SAAPGD   DSECT                                                                  
SAAPGEL  DS    XL1                 ELEMENT CODE                                 
SAAPGELQ EQU   X'DF'                                                            
SAAPGLN  DS    XL1                 ELEMENT LENGTH                               
SAAPGNUM DS    XL2                 APPROVER GROUP NUMBER                        
*##ASSOCIATED SAAPGLN                                                           
SAAPGLNQ EQU   *-SAAPGD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SAAPGNAM DS    0CL30               APPROVER GROUP NAME                          
                                                                                
***********************************************************************         
* DSECT TO COVER TIME SHEET APPROVER GROUP CODE ELEMENT               *         
***********************************************************************         
SAAPCD   DSECT                                                                  
SAAPCEL  DS    XL1                 ELEMENT CODE                                 
SAAPCELQ EQU   X'E0'                                                            
SAAPCLN  DS    XL1                 ELEMENT LENGTH                               
SAAPCNUM DS    XL2                 APPROVER GROUP NUMBER                        
SAAPCCOD DS    CL8                 APPROVER GROUP CODE                          
*##ASSOCIATED SAAPCLN                                                           
SAAPCLNQ EQU   *-SAAPCD            LENGTH OF FIXED PART                         
                                                                                
***********************************************************************         
* DSECT TO COVER PASSWORD HISTORY ELEMENT                             *         
***********************************************************************         
SAPWHD   DSECT                                                                  
SAPWHEL  DS    XL1                 ELEMENT CODE                                 
SAPWHELQ EQU   X'E4'                                                            
SAPWHLN  DS    XL1                 ELEMENT LENGTH                               
*##DATATYPE DATCON2                                                             
SAPWHDTE DS    XP(DT02)L2          VALID FROM DATE (COMPRESSED)                 
SAPWHTIM DS    0XL4                                                             
SAPWHFLG DS    XL1                 FLAGS                                        
SAPWHEXP EQU   X'80'               PWD RESET BY SEC MGR, EXPIRE NOW             
SAPWHPPS EQU   X'40'               PWD SET BY PPS CONVERSION                    
SAPWHFOR EQU   X'10'               PWD RESET BY FORGOT PASSWORD BUTTON          
SAPWHTME DS    XL3                 VALID FROM TIME (BINARY 1/100 SECS)          
*##ASSOCIATED SAPWHLN                                                           
SAPWHLNQ EQU   *-SAPWHD            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
SAPWHPWD DS    0CL10               PASSWORD                                     
                                                                                
***********************************************************************         
* DSECT TO COVER PERSON EMAIL ID ELEMENT                              *         
***********************************************************************         
SAPEED   DSECT                                                                  
SAPEEEL  DS    XL1                 ELEMENT CODE                                 
SAPEEELQ EQU   X'E5'                                                            
SAPEELN  DS    XL1                 ELEMENT LENGTH                               
*##ASSOCIATED SAPEELN                                                           
SAPEELNQ EQU   *-SAPEED            LENGTH OF FIXED PART                         
*##DATATYPE RESTOFEL                                                            
*&&UK                                                                           
SAPEEID  DS    0XL50               EMAIL ID                                     
*&&                                                                             
*&&US                                                                           
SAPEEID  DS    0XL44               EMAIL ID                                     
*&&                                                                             
                                                                                
***********************************************************************         
* DSECT TO COVER CLIENT CODE LIMIT ACCESS LIST ELEMENT                *         
***********************************************************************         
SACLAD   DSECT                                                                  
SACLAEL  DS    XL1                 ELEMENT CODE                                 
SACLAELQ EQU   X'E1'                                                            
SACLALN  DS    XL1                 ELEMENT LENGTH                               
SACLASYS DS    XL1                 SYSTEM NUMBER (FOR CALLOV)                   
SACLACOD DS    XL3                 CLIENT LIMIT ACCESS CODE                     
*                                  CLPACKED UNLESS PRINT SYSTEM                 
*##ASSOCIATED SACLALN                                                           
SACLALNQ EQU   *-SACLAD            LENGTH                                       
*&&UK                                                                           
         ORG   SACLACOD                                                         
         DS    X                   1ST BYTE SACLACOD NULL IF LAL LIST           
SACLALAL DS    CL3                 LAL LIST CODE                                
SACLAL2Q EQU   *-SACLAD                                                         
         ORG                                                                    
*&&                                                                             
***********************************************************************         
* DSECT TO COVER DDLINK ACCESS EQUIVALENT PERSON PIN ELEMENT (DDLINK) *         
***********************************************************************         
SAAEPD   DSECT                                                                  
SAAEPEL  DS    XL1                 ELEMENT CODE                                 
SAAEPELQ EQU   X'E2'                                                            
SAAEPLN  DS    XL1                 ELEMENT LENGTH                               
SAAEPAEP DS    XL8                 ACCESS EQUIVALENT PERSON PID                 
* NOTE PID, NOT PIN! WE HAVE TO RETURN TEXT EXACTLY AS IT WAS UPLOADED          
*##ASSOCIATED SAAEPLN                                                           
SAAEPLNQ EQU   *-SAAEPD            LENGTH                                       
