*          DATA SET SEACSA0D   AT LEVEL 024 AS OF 08/31/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DA0D      DATE 08/31/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  L  P N             T        Y              
MOLSYSH  DS    XL8                                                              
MOLSYS   DS    CL7      5   10    7  A  U N             T        Y  102         
MOLSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   20   10  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   31    1  L  P N             T        Y              
MOLCODH  DS    XL8                                                              
MOLCOD   DS    CL2      5   33    2  A  U N             T        Y  103         
MOLCODX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     5   37   12  L  P N             T        Y              
MOLDESH  DS    XL8                                                              
MOLDES   DS    CL20     5   50   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   72    4  L  P N             T        Y              
MOLPAGEH DS    XL8                                                              
MOLPAGE  DS    CL1      5   77    1  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    3    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   23    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   43    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   63    8  L  P N             T        Y              
MOLOF11H DS    XL8                                                              
MOLOF11  DS    CL2      8    3    2  A  U N             T        Y              
MOLOF1NH DS    XL8                                                              
MOLOF1N  DS    CL8      8    8    8  A  P N             T        Y              
MOLOF12H DS    XL8                                                              
MOLOF12  DS    CL2      8   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   28    8  A  P N             T        Y              
MOLOF13H DS    XL8                                                              
MOLOF13  DS    CL2      8   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   48    8  A  P N             T        Y              
MOLOF14H DS    XL8                                                              
MOLOF14  DS    CL2      8   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   68    8  A  P N             T        Y              
MOLOF21H DS    XL8                                                              
MOLOF21  DS    CL2      9    3    2  A  U N             T        Y              
MOLOF2NH DS    XL8                                                              
MOLOF2N  DS    CL8      9    8    8  A  P N             T        Y              
MOLOF22H DS    XL8                                                              
MOLOF22  DS    CL2      9   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   28    8  A  P N             T        Y              
MOLOF23H DS    XL8                                                              
MOLOF23  DS    CL2      9   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   48    8  A  P N             T        Y              
MOLOF24H DS    XL8                                                              
MOLOF24  DS    CL2      9   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   48    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   68    8  A  P N             T        Y              
MOLOF01H DS    XL8                                                              
MOLOF01  DS    CL2     23    3    2  A  U N             T        Y              
MOLOFN0H DS    XL8                                                              
MOLOFN0  DS    CL8     23    8    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   23    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   28    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   43    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   48    8  A  P N             T        Y              
MOLOF04H DS    XL8                                                              
MOLOF04  DS    CL2     23   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    24    4   77  L  P H             T        Y  254         
         DS    XL8                                                              
MOLLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
MOLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1976 BYTES                            
