*          DATA SET SEACSE1D   AT LEVEL 006 AS OF 01/25/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DE1D      DATE 01/25/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DSRMSGH  DS    CL8                                                              
DSRMSG   DS    CL68    10    2   68  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   71    4  L  P H             T        Y              
DSRPAGEH DS    CL8                                                              
DSRPAGE  DS    CL3     10   76    3  A  P H             T        Y              
DSRTBARH DS    CL8                                                              
DSRTBAR  DS    CL79    11    2   79  A  P H             T        Y              
DSRWRDH  DS    CL8                                                              
DSRWRD   DS    CL8     12    2    8  A  P N             T        Y              
DSRINPH  DS    CL8                                                              
DSRINP   DS    CL2     12   11    2  A  P N             T        Y              
DSRWRD2H DS    CL8                                                              
DSRWRD2  DS    CL8     12   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   63    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   76    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   11    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   63    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   76    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   11    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   63    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   76    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   11    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   63    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   76    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   11    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   63    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   76    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   11    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   63    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   76    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   11    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   63    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   76    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   11    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   63    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   76    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   11    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   63    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   67    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   76    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   11    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   15    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   24    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   28    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   37    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   41    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   50    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   54    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   63    2  A  P N             T        Y              
DSRWRDLH DS    CL8                                                              
DSRWRDL  DS    CL8     21   67    8  A  P N             T        Y              
DSRINPLH DS    CL8                                                              
DSRINPL  DS    CL2     21   76    2  A  P N             T        Y              
DSRBBARH DS    CL8                                                              
DSRBBAR  DS    CL79    22    2   79  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    24    2   79  L  P N             T        Y              
DSRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DSRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2016 BYTES                            
