*          DATA SET SEACSF7D   AT LEVEL 001 AS OF 08/07/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DF7D      DATE 08/07/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL16     4    2   16  L  P H             T        Y              
PERPIDH  DS    XL8                                                              
PERPID   DS    CL8      4   20    8  A  U N             T        Y  101         
PERPIDX  DS    XL8                                                              
PERPWHH  DS    XL8                                                              
PERPWH   DS    CL16     4   37   16  L  P H             T        Y              
PERPWDH  DS    XL8                                                              
PERPWD   DS    CL10     4   55   10  L  U N             T        Y  102         
PERPWDX  DS    XL8                                                              
PEROVHH  DS    XL8                                                              
PEROVH   DS    CL8      4   68    8  L  P H             T        Y              
PEROVFH  DS    XL8                                                              
PEROVF   DS    CL1      4   78    1  A  U N             T        Y  129         
PEROVFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     5    2   16  L  P N             T        Y              
PERPIDNH DS    XL8                                                              
PERPIDN  DS    CL8      5   20    8  A  U H             T        Y  103         
PERPIDNX DS    XL8                                                              
PERPNHH  DS    XL8                                                              
PERPNH   DS    CL16     5   37   16  L  P N             T        Y              
PERPWDNH DS    XL8                                                              
PERPWDN  DS    CL10     5   55   10  L  U H             T        Y  104         
PERPWDNX DS    XL8                                                              
PERPCHH  DS    XL8                                                              
PERPCH   DS    CL8      5   68    8  L  P H             T        Y              
PERPCNH  DS    XL8                                                              
PERPCN   DS    CL1      5   78    1  A  U N             T        Y  130         
PERPCNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     6    2   16  L  P N             T        Y              
PERDEFH  DS    XL8                                                              
PERDEF   DS    CL10     6   20   10  A  U H             T        Y  110         
PERDEFX  DS    XL8                                                              
PERDEFNH DS    XL8                                                              
PERDEFN  DS    CL30     6   37   30  L  P H             T        Y              
PERPIHH  DS    XL8                                                              
PERPIH   DS    CL6      6   68    6  A  P N             T        Y              
PERPINH  DS    XL8                                                              
PERPIN   DS    CL5      6   75    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     7    2   16  L  P H             T        Y              
PERFNAMH DS    XL8                                                              
PERFNAM  DS    CL15     7   20   15  L  U N             T        Y  105         
PERFNAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     7   37   16  L  P N             T        Y              
PERMNAMH DS    XL8                                                              
PERMNAM  DS    CL15     7   55   15  L  U H             T        Y  106         
PERMNAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     8    2   16  L  P H             T        Y              
PERLNAMH DS    XL8                                                              
PERLNAM  DS    CL58     8   20   58  L  U N             T        Y  107         
PERLNAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     9    2   16  L  P H             T        Y              
PEROFFH  DS    XL8                                                              
PEROFF   DS    CL2      9   20    2  A  U N             T        Y  108         
PEROFFX  DS    XL8                                                              
PEROFFNH DS    XL8                                                              
PEROFFN  DS    CL30     9   37   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    10    2   16  L  P H             T        Y              
PERDIDH  DS    XL8                                                              
PERDID   DS    CL3     10   20    3  A  U N             T        Y  109         
PERDIDX  DS    XL8                                                              
PERDIDNH DS    XL8                                                              
PERDIDN  DS    CL30    10   37   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    11    2   16  L  P N             T        Y              
PERAGRH  DS    XL8                                                              
PERAGR   DS    CL8     11   20    8  A  U H             T        Y  110         
PERAGRX  DS    XL8                                                              
PERAGRNH DS    XL8                                                              
PERAGRN  DS    CL30    11   37   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL17    12    2   17  L  P N             T        Y              
PERAPCH  DS    XL8                                                              
PERAPC   DS    CL8     12   20    8  A  U H             T        Y  111         
PERAPCX  DS    XL8                                                              
PERAPCNH DS    XL8                                                              
PERAPCN  DS    CL30    12   37   30  L  P H             T        Y              
PERDAGH  DS    XL8                                                              
PERDAG   DS    CL16    13    2   16  L  P Z             T        Y              
PERLAGH  DS    XL8                                                              
PERLAG   DS    CL8     13   20    8  A  P Z             T        Y  112         
PERLAGX  DS    XL8                                                              
PERLAGNH DS    XL8                                                              
PERLAGN  DS    CL30    13   37   30  L  P Z             T        Y              
PERUPIDH DS    XL8                                                              
PERUPID  DS    CL16    14    2   16  L  P H             T        Y              
PERUSR1H DS    XL8                                                              
PERUSR1  DS    CL60    14   20   60  A  U N             T        Y  131         
PERUSR1X DS    XL8                                                              
PERUSR2H DS    XL8                                                              
PERUSR2  DS    CL60    15   20   60  A  U N             T        Y  132         
PERUSR2X DS    XL8                                                              
PERROIDH DS    XL8                                                              
PERROID  DS    CL16    16    2   16  L  P Z             T        Y              
PERURR1H DS    XL8                                                              
PERURR1  DS    CL60    16   20   60  A  P N             T        Y  133         
PERURR1X DS    XL8                                                              
PERURR2H DS    XL8                                                              
PERURR2  DS    CL60    17   20   60  A  P N             T        Y  134         
PERURR2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    18    2   14  L  P N             T        Y              
PERDHIH  DS    XL8                                                              
PERDHI   DS    CL10    18   17   10  A  U H             T        Y  114         
PERDHIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    18   30   12  L  P N             T        Y              
PERDTEH  DS    XL8                                                              
PERDTE   DS    CL10    18   43   10  A  U H             T        Y  115         
PERDTEX  DS    XL8                                                              
PERLLOAH DS    XL8                                                              
PERLLOA  DS    CL10    18   56   10  L  P N             T        Y              
PERLLOH  DS    XL8                                                              
PERLLO   DS    CL12    18   68   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    19    2   14  L  P N             T        Y              
PERSTAH  DS    XL8                                                              
PERSTA   DS    CL7     19   17    7  A  U H             T        Y  118         
PERSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    19   30   12  L  P N             T        Y              
PERTITH  DS    XL8                                                              
PERTIT   DS    CL30    19   43   30  L  U H             T        Y  117         
PERTITX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    20    2   14  L  P N             T        Y              
PEREXTH  DS    XL8                                                              
PEREXT   DS    CL4     20   17    4  A  U H             T        Y  122         
PEREXTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20   30   12  L  P N             T        Y              
PERTELEH DS    XL8                                                              
PERTELE  DS    CL12    20   43   12  A  U H             T        Y  128         
PERTELEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    21    2   14  L  P N             T        Y              
PERPROH  DS    XL8                                                              
PERPRO   DS    CL63    21   17   63  A  U H             T        Y  123         
PERPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    22    2   14  L  P N             T        Y              
PERADR1H DS    XL8                                                              
PERADR1  DS    CL26    22   17   26  L  U H             T        Y  124         
PERADR1X DS    XL8                                                              
PERADR2H DS    XL8                                                              
PERADR2  DS    CL26    23   17   26  L  U H             T        Y  124         
PERADR2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     24    2    4  L  P N             T        Y              
PERCITYH DS    XL8                                                              
PERCITY  DS    CL30    24    7   30  A  U H             T        Y  125         
PERCITYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     24   38    5  L  P N             T        Y              
PERSTEH  DS    XL8                                                              
PERSTE   DS    CL2     24   44    2  A  U H             T        Y  126         
PERSTEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     24   47    3  L  P N             T        Y              
PERCODEH DS    XL8                                                              
PERCODE  DS    CL10    24   51   10  A  U H             T        Y  127         
PERCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     24   62    7  L  P N             T        Y              
PERCTRYH DS    XL8                                                              
PERCTRY  DS    CL3     24   70    3  A  U H             T        Y  128         
PERCTRYX DS    XL8                                                              
PERLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
PERWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2064 BYTES                            
