*          DATA SET SEACSC9D   AT LEVEL 001 AS OF 12/12/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DC9D      DATE 12/12/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
IDSIDH   DS    XL8                                                              
IDSID    DS    CL8      5   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   27    6  A  P H             T        Y              
IDSSYSH  DS    XL8                                                              
IDSSYS   DS    CL8      5   41    8  A  U N             T        Y              
IDSIDLH  DS    XL8                                                              
IDSIDL   DS    CL3      5   55    3  A  P H             T        Y              
IDSIDNH  DS    XL8                                                              
IDSIDN   DS    CL5      5   60    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      7    2    9  A  P N             T        Y              
IDSAGYAH DS    XL8                                                              
IDSAGYA  DS    CL2      7   15    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      7   27    8  A  P N             T        Y              
IDSLANGH DS    XL8                                                              
IDSLANG  DS    CL13     7   41   13  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10     7   55   10  A  P N             T        Y              
IDSPEXPH DS    XL8                                                              
IDSPEXP  DS    CL10     7   68   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
IDSPIDH  DS    XL8                                                              
IDSPID   DS    CL10     8   15   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     8   27   12  A  P N             T        Y              
IDSSEIDH DS    XL8                                                              
IDSSEID  DS    CL2      8   41    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
IDSDNAMH DS    XL8                                                              
IDSDNAM  DS    CL33     9   15   33  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
IDSDADDH DS    XL8                                                              
IDSDADD  DS    CL33    10   15   33  A  U H             T        Y              
IDSDAD2H DS    XL8                                                              
IDSDAD2  DS    CL33    11   15   33  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
IDSDAD3H DS    XL8                                                              
IDSDAD3  DS    CL33    12   15   33  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
IDSDLO1H DS    XL8                                                              
IDSDLO1  DS    CL7     13   15    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     13   27    6  A  P N             T        Y              
IDSDLO2H DS    XL8                                                              
IDSDLO2  DS    CL7     13   41    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
IDSDPWRH DS    XL8                                                              
IDSDPWR  DS    CL4     14   15    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  A  P N             T        Y              
IDSONAMH DS    XL8                                                              
IDSONAM  DS    CL33    15   15   33  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11    16    2   11  A  P N             T        Y              
IDSOADDH DS    XL8                                                              
IDSOADD  DS    CL33    16   15   33  A  U H             T        Y              
IDSSHDH  DS    XL8                                                              
IDSSHD   DS    CL78    18    2   78  A  P N             T        Y              
IDSSEHH  DS    XL8                                                              
IDSSEH   DS    CL12    19    2   12  A  P N             T        Y              
IDSSEAGH DS    XL8                                                              
IDSSEAG  DS    CL10    19   15   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
IDSACCSH DS    XL8                                                              
IDSACCS  DS    CL22    20   15   22  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
IDSPA1H  DS    XL8                                                              
IDSPA1   DS    CL65    21   15   65  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11    22    2   11  A  P N             T        Y              
IDSPA2H  DS    XL8                                                              
IDSPA2   DS    CL65    22   15   65  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11    23    2   11  A  P N             T        Y              
IDSPA3H  DS    XL8                                                              
IDSPA3   DS    CL65    23   15   65  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1     24   15    1  A  U N             T        Y              
IDSLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
IDSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1136 BYTES                            
