*          DATA SET SEACSC6D   AT LEVEL 002 AS OF 10/11/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DC6D      DATE 10/11/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      5    2    8  L  P N             T        Y              
GRDFORH  DS    XL8                                                              
GRDFOR   DS    CL8      5   11    8  A  U H             T        Y  198         
GRDFORX  DS    XL8                                                              
GRDSYSNH DS    XL8                                                              
GRDSYSN  DS    CL8      5   22    8  L  P N             T        Y              
GRDSYSH  DS    XL8                                                              
GRDSYS   DS    CL8      5   31    8  A  U H             T        Y  200         
GRDSYSX  DS    XL8                                                              
GRDPGMNH DS    XL8                                                              
GRDPGMN  DS    CL8      5   42    8  L  P N             T        Y              
GRDPGMH  DS    XL8                                                              
GRDPGM   DS    CL8      5   51    8  A  U H             T        Y  201         
GRDPGMX  DS    XL8                                                              
GRDUIDNH DS    XL8                                                              
GRDUIDN  DS    CL8      5   62    8  L  P N             T        Y              
GRDUIDH  DS    XL8                                                              
GRDUID   DS    CL8      5   71    8  A  U H             T        Y  209         
GRDUIDX  DS    XL8                                                              
GRDACGNH DS    XL8                                                              
GRDACGN  DS    CL8      6    2    8  L  P N             T        Y              
GRDACGH  DS    XL8                                                              
GRDACG   DS    CL8      6   11    8  A  U H             T        Y  212         
GRDACGX  DS    XL8                                                              
GRDRECNH DS    XL8                                                              
GRDRECN  DS    CL8      6   22    8  L  P N             T        Y              
GRDRECH  DS    XL8                                                              
GRDREC   DS    CL8      6   31    8  A  U H             T        Y  201         
GRDRECX  DS    XL8                                                              
GRDACTNH DS    XL8                                                              
GRDACTN  DS    CL8      6   42    8  L  P N             T        Y              
GRDACTH  DS    XL8                                                              
GRDACT   DS    CL8      6   51    8  A  U H             T        Y  209         
GRDACTX  DS    XL8                                                              
GRDLIN1H DS    XL8                                                              
GRDLIN1  DS    CL78     7    2   78  A  P N             T        Y              
GRDLIN2H DS    XL8                                                              
GRDLIN2  DS    CL78     8    2   78  A  P N             T        Y              
GRDLIN3H DS    XL8                                                              
GRDLIN3  DS    CL78     9    2   78  A  P N             T        Y              
GRDLIN4H DS    XL8                                                              
GRDLIN4  DS    CL78    10    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
GRDLIN5H DS    XL8                                                              
GRDLIN5  DS    CL78    22    2   78  A  P N             T        Y              
GRDLINLH DS    XL8                                                              
GRDLINL  DS    CL78    23    2   78  A  P N             T        Y              
GRDFOOTH DS    XL8                                                              
GRDFOOT  DS    CL78    24    2   78  L  P H             T        Y              
GRDLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
GRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1832 BYTES                            
