*          DATA SET SEACSAAD   AT LEVEL 009 AS OF 08/27/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DAAD      DATE 08/27/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     5    2   11  L  P H             T        Y              
OFFOIDH  DS    XL8                                                              
OFFOID   DS    CL2      5   14    2  A  U N             T        Y  128         
OFFOIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  L  P H             T        Y              
OFFSYSH  DS    XL8                                                              
OFFSYS   DS    CL10     5   27   10  A  U N             T        Y  136         
OFFSYSX  DS    XL8                                                              
OFFNUBH  DS    XL8                                                              
OFFNUB   DS    CL8      5   63    8  L  P N             T        Y              
OFFNUMH  DS    XL8                                                              
OFFNUM   DS    CL3      5   73    3  A  P N             T        Y  144         
OFFNUMX  DS    XL8                                                              
OFFNOHH  DS    XL8                                                              
OFFNOH   DS    CL11     6    2   11  L  P N             T        Y  150         
OFFNOHX  DS    XL8                                                              
OFFNOFH  DS    XL8                                                              
OFFNOF   DS    CL4      6   14    4  A  U N             T        Y  152         
OFFNOFX  DS    XL8                                                              
OFFPRHH  DS    XL8                                                              
OFFPRH   DS    CL8      6   20    8  L  P Z             T        Y              
OFFPREH  DS    XL8                                                              
OFFPRE   DS    CL2      6   30    2  A  P Z             T        Y  154         
OFFPREX  DS    XL8                                                              
OFFORHH  DS    XL8                                                              
OFFORH   DS    CL8      6   37    8  L  P Z             T        Y              
OFFORGH  DS    XL8                                                              
OFFORG   DS    CL2      6   47    2  A  P Z             T        Y  168         
OFFORGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8    2   10  L  P N             T        Y              
OFFSNMH  DS    XL8                                                              
OFFSNM   DS    CL8      8   14    8  A  U N             T        Y  160         
OFFSNMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   37   10  L  P N             T        Y              
OFFLNMH  DS    XL8                                                              
OFFLNM   DS    CL20     8   49   20  A  U N             T        Y  168         
OFFLNMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10    2   10  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  L  P N             T        Y              
OFFUIDH  DS    XL8                                                              
OFFUID   DS    CL20    11   14   20  L  U N             T        Y  176         
OFFUIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11   37   10  L  P N             T        Y              
OFFPASH  DS    XL8                                                              
OFFPAS   DS    CL20    11   49   20  L  U N             T        Y  184         
OFFPASX  DS    XL8                                                              
OFFSACNH DS    XL8                                                              
OFFSACN  DS    CL11    13    2   11  L  P N             T        Y              
OFFSACH  DS    XL8                                                              
OFFSAC   DS    CL4     13   15    4  A  U N             T        Y  176         
OFFSACX  DS    XL8                                                              
OFFSASNH DS    XL8                                                              
OFFSASN  DS    CL13    13   22   13  L  P N             T        Y              
OFFSASH  DS    XL8                                                              
OFFSAS   DS    CL4     13   36    4  A  U N             T        Y  184         
OFFSASX  DS    XL8                                                              
OFFSAPNH DS    XL8                                                              
OFFSAPN  DS    CL17    13   44   17  L  P N             T        Y              
OFFSAPH  DS    XL8                                                              
OFFSAP   DS    CL10    13   63   10  A  U N             T        Y  184         
OFFSAPX  DS    XL8                                                              
OFFLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
OFFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 584  BYTES                            
