*          DATA SET SEACSFCD   AT LEVEL 009 AS OF 07/11/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DFCD      DATE 07/11/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     5    2   16  A  P H             T        Y              
DSPSYSH  DS    CL8                                                              
DSPSYS   DS    CL7      5   20    7  A  U N             T        Y  200         
DSPSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     6    2   16  A  P H             T        Y              
DSPPGMH  DS    CL8                                                              
DSPPGM   DS    CL7      6   20    7  A  U N             T        Y  201         
DSPPGMX  DS    CL8                                                              
DSPPGMAH DS    CL8                                                              
DSPPGMA  DS    CL48     6   31   48  A  P N             T        Y              
DSPACTWH DS    CL8                                                              
DSPACTW  DS    CL16     7    2   16  A  P H             T        Y              
DSPACTH  DS    CL8                                                              
DSPACT   DS    CL3      7   20    3  A  U N             T        Y  208         
DSPACTX  DS    CL8                                                              
DSPFMTDH DS    CL8                                                              
DSPFMTD  DS    CL15     7   31   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
DSPWRDNH DS    CL8                                                              
DSPWRDN  DS    CL8      9   20    8  A  U H             T        Y              
DSPWRDAH DS    CL8                                                              
DSPWRDA  DS    CL8      9   31    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
DSPDSCNH DS    CL8                                                              
DSPDSCN  DS    CL5     10   20    5  A  U H             T        Y              
DSPDSCAH DS    CL8                                                              
DSPDSCA  DS    CL48    10   31   48  A  P N             T        Y              
DSPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DSPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 368  BYTES                            
