*          DATA SET SEACSAFD   AT LEVEL 009 AS OF 01/25/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DAFD      DATE 01/25/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  L  P H             T        Y              
REPREQH  DS    CL8                                                              
REPREQ   DS    CL3      5   20    3  A  U N             T        Y   50         
REPREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  L  P H             T        Y              
REPWHENH DS    CL8                                                              
REPWHEN  DS    CL10     6   20   10  A  U N             T        Y   51         
REPWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  L  P N             T        Y              
REPDESTH DS    CL8                                                              
REPDEST  DS    CL10     7   20   10  A  U N             T        Y   52         
REPDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  L  P N             T        Y              
REPOTYPH DS    CL8                                                              
REPOTYP  DS    CL6      8   20    6  A  U N             T        Y  150         
REPOTYPX DS    CL8                                                              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 176  BYTES                            
