*          DATA SET SEACSD5D   AT LEVEL 002 AS OF 10/11/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DD5D      DATE 10/11/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     5    2   11  L  P N             T        Y              
LSTPIDH  DS    XL8                                                              
LSTPID   DS    CL8      5   15    8  A  U H             T        Y  101         
LSTPIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      5   27    9  L  P N             T        Y              
LSTSYSH  DS    XL8                                                              
LSTSYS   DS    CL7      5   37    7  A  U H             T        Y  200         
LSTSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      5   57    9  L  P N             T        Y              
LSTPGMH  DS    XL8                                                              
LSTPGM   DS    CL7      5   68    7  A  U H             T        Y  201         
LSTPGMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     6    2   11  L  P N             T        Y              
LSTUSRH  DS    XL8                                                              
LSTUSR   DS    CL8      6   15    8  A  U H             T        Y  209         
LSTUSRX  DS    XL8                                                              
LSTPWHH  DS    XL8                                                              
LSTPWH   DS    CL8      6   27    8  L  P N             T        Y              
LSTPWDH  DS    XL8                                                              
LSTPWD   DS    CL10     6   37   10  A  U H             T        Y  102         
LSTPWDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6   57    9  L  P N             T        Y              
LSTDEFH  DS    XL8                                                              
LSTDEF   DS    CL10     6   68   10  A  U H             T        Y  136         
LSTDEFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     7    2   12  L  P N             T        Y              
LSTAGRH  DS    XL8                                                              
LSTAGR   DS    CL8      7   15    8  A  U H             T        Y  111         
LSTAGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      7   27    9  L  P N             T        Y              
LSTOFFH  DS    XL8                                                              
LSTOFF   DS    CL2      7   37    2  A  U H             T        Y  108         
LSTOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   57    7  L  P N             T        Y              
LSTDIDH  DS    XL8                                                              
LSTDID   DS    CL3      7   68    3  A  U H             T        Y  109         
LSTDIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     8    2   12  L  P N             T        Y              
LSTAPCH  DS    XL8                                                              
LSTAPC   DS    CL8      8   15    8  A  U H             T        Y  136         
LSTAPCX  DS    XL8                                                              
LSTSH1H  DS    XL8                                                              
LSTSH1   DS    CL79    10    2   79  L  P H             T        Y              
LSTSH2H  DS    XL8                                                              
LSTSH2   DS    CL79    11    2   79  L  P H             T        Y              
LSTACT1H DS    XL8                                                              
LSTACT1  DS    CL3     12    2    3  A  U N             T        Y    1         
LSTACT1X DS    XL8                                                              
LSTLIN1H DS    XL8                                                              
LSTLIN1  DS    CL74    12    6   74  A  P N             T        Y              
LSTACT2H DS    XL8                                                              
LSTACT2  DS    CL3     13    2    3  A  U N             T        Y    1         
LSTACT2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
LSTFOOTH DS    XL8                                                              
LSTFOOT  DS    CL78    24    2   78  L  P H             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1888 BYTES                            
