*          DATA SET SEACSB4D   AT LEVEL 008 AS OF 01/25/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DB4D      DATE 01/25/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     5    2   11  L  P H             T        Y              
REPREQH  DS    CL8                                                              
REPREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
REPREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     6    2   11  L  P H             T        Y              
REPWHENH DS    CL8                                                              
REPWHEN  DS    CL10     6   27   10  A  U N             T        Y   51         
REPWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    2   11  L  P N             T        Y              
REPDESTH DS    CL8                                                              
REPDEST  DS    CL10     7   27   10  A  U H             T        Y   52         
REPDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  L  P N             T        Y              
REPOTYPH DS    CL8                                                              
REPOTYP  DS    CL6      8   27    6  A  U H             T        Y  150         
REPOTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
REPKAGRH DS    CL8                                                              
REPKAGR  DS    CL8     10   27    8  A  U H             T        Y  111         
REPKAGRX DS    CL8                                                              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
