*          DATA SET SEACSFDD   AT LEVEL 011 AS OF 07/28/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DFDD      DATE 07/28/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     5    2   17  A  P H             T        Y              
DSPSYSH  DS    CL8                                                              
DSPSYS   DS    CL7      5   20    7  A  U N             T        Y  200         
DSPSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     6    2   17  A  P H             T        Y              
DSPPGMH  DS    CL8                                                              
DSPPGM   DS    CL7      6   20    7  A  U N             T        Y  201         
DSPPGMX  DS    CL8                                                              
DSPPCDH  DS    CL8                                                              
DSPPCD   DS    CL48     6   31   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     8    2   17  A  P N             T        Y              
DSPDSCNH DS    CL8                                                              
DSPDSCN  DS    CL5      8   20    5  A  U H             T        Y  203         
DSPDSCNX DS    CL8                                                              
DSPDSCAH DS    CL8                                                              
DSPDSCA  DS    CL48     8   31   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    10    2   17  A  P N             T        Y              
DSPRCDFH DS    CL8                                                              
DSPRCDF  DS    CL1     10   20    1  A  U H             T        Y  204         
DSPRCDFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    10   31   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    10   46   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    10   61   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    11    2   17  A  P N             T        Y              
DSPACTFH DS    CL8                                                              
DSPACTF  DS    CL1     11   20    1  A  U H             T        Y  205         
DSPACTFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11   31   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    11   46   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    11   61   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    13    2   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17    14    2   17  A  P N             T        Y              
DSPARCQH DS    CL8                                                              
DSPARCQ  DS    CL8     14   20    8  A  U N             T        Y              
DSPARCWH DS    CL8                                                              
DSPARCW  DS    CL16    14   31   16  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    15    2   17  A  P N             T        Y              
DSPARLQH DS    CL8                                                              
DSPARLQ  DS    CL8     15   20    8  A  U N             T        Y              
DSPARLWH DS    CL8                                                              
DSPARLW  DS    CL32    15   31   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    16    2   17  A  P N             T        Y              
DSPAACQH DS    CL8                                                              
DSPAACQ  DS    CL8     16   20    8  A  U N             T        Y              
DSPAACWH DS    CL8                                                              
DSPAACW  DS    CL16    16   31   16  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    17    2   17  A  P N             T        Y              
DSPAALQH DS    CL8                                                              
DSPAALQ  DS    CL8     17   20    8  A  U N             T        Y              
DSPAALWH DS    CL8                                                              
DSPAALW  DS    CL32    17   31   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    19    2   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17    20    2   17  A  P N             T        Y              
DSPFWRQH DS    CL8                                                              
DSPFWRQ  DS    CL8     20   20    8  A  U N             T        Y              
DSPFWRWH DS    CL8                                                              
DSPFWRW  DS    CL8     20   31    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    21    2   17  A  P N             T        Y              
DSPFRDQH DS    CL8                                                              
DSPFRDQ  DS    CL8     21   20    8  A  U N             T        Y              
DSPFRDWH DS    CL8                                                              
DSPFRDW  DS    CL8     21   31    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    22    2   17  A  P N             T        Y              
DSPFNOQH DS    CL8                                                              
DSPFNOQ  DS    CL8     22   20    8  A  U N             T        Y              
DSPFNOWH DS    CL8                                                              
DSPFNOW  DS    CL8     22   31    8  L  P N             T        Y              
DSPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DSPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 992  BYTES                            
