*          DATA SET SEACSF9D   AT LEVEL 011 AS OF 07/05/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DF9D      DATE 07/05/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     5    2   16  L  P H             T        Y              
OFFOIDH  DS    CL8                                                              
OFFOID   DS    CL2      5   27    2  A  U N             T        Y  108         
OFFOIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     7    2   16  L  P H             T        Y              
OFFOIDNH DS    CL8                                                              
OFFOIDN  DS    CL30     7   27   30  L  U N             T        Y  129         
OFFOIDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     9    2   16  L  P N             T        Y              
OFFAPCH  DS    CL8                                                              
OFFAPC   DS    CL8      9   27    8  A  U H             T        Y  129         
OFFAPCX  DS    CL8                                                              
OFFAPCNH DS    CL8                                                              
OFFAPCN  DS    CL30     9   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    11    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   23    1  L  P N             T        Y              
OFFPIDH  DS    CL8                                                              
OFFPID   DS    CL8     11   27    8  A  U H             T        Y  130         
OFFPIDX  DS    CL8                                                              
OFFPIDNH DS    CL8                                                              
OFFPIDN  DS    CL30    11   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    12    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   23    1  L  P N             T        Y              
OFFPI2H  DS    CL8                                                              
OFFPI2   DS    CL8     12   27    8  A  U H             T        Y  130         
OFFPI2X  DS    CL8                                                              
OFFPI2NH DS    CL8                                                              
OFFPI2N  DS    CL30    12   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    13    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   23    1  L  P N             T        Y              
OFFPI3H  DS    CL8                                                              
OFFPI3   DS    CL8     13   27    8  A  U H             T        Y  130         
OFFPI3X  DS    CL8                                                              
OFFPI3NH DS    CL8                                                              
OFFPI3N  DS    CL30    13   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    14    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   23    1  L  P N             T        Y              
OFFPI4H  DS    CL8                                                              
OFFPI4   DS    CL8     14   27    8  A  U H             T        Y  130         
OFFPI4X  DS    CL8                                                              
OFFPI4NH DS    CL8                                                              
OFFPI4N  DS    CL30    14   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    15    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   23    1  L  P N             T        Y              
OFFPI5H  DS    CL8                                                              
OFFPI5   DS    CL8     15   27    8  A  U H             T        Y  130         
OFFPI5X  DS    CL8                                                              
OFFPI5NH DS    CL8                                                              
OFFPI5N  DS    CL30    15   37   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   23    1  L  P N             T        Y              
OFFPI6H  DS    CL8                                                              
OFFPI6   DS    CL8     16   27    8  A  U H             T        Y  130         
OFFPI6X  DS    CL8                                                              
OFFPI6NH DS    CL8                                                              
OFFPI6N  DS    CL30    16   37   30  L  P H             T        Y              
OFFLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
OFFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 800  BYTES                            
