*          DATA SET SEACSB0D   AT LEVEL 001 AS OF 02/12/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DB0D      DATE 02/12/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL17     5    2   17  L  P H             T        Y              
REPREQH  DS    XL8                                                              
REPREQ   DS    CL3      5   20    3  A  U N             T        Y   50         
REPREQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     6    2   17  L  P H             T        Y              
REPWHENH DS    XL8                                                              
REPWHEN  DS    CL10     6   20   10  A  U N             T        Y   51         
REPWHENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     7    2   17  L  P N             T        Y              
REPDESTH DS    XL8                                                              
REPDEST  DS    CL10     7   20   10  A  U N             T        Y   52         
REPDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     8    2   17  L  P N             T        Y              
REPOTYPH DS    XL8                                                              
REPOTYP  DS    CL6      8   20    6  A  U N             T        Y  150         
REPOTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     9    2   17  L  P N             T        Y              
REPREQPH DS    XL8                                                              
REPREQP  DS    CL12     9   20   12  A  U N             T        Y  220         
REPREQPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    11    2   17  L  P N             T        Y              
REPSYSH  DS    XL8                                                              
REPSYS   DS    CL7     11   20    7  A  U H             T        Y  200         
REPSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    12    2   17  L  P N             T        Y              
REPPGMH  DS    XL8                                                              
REPPGM   DS    CL7     12   20    7  A  U H             T        Y  201         
REPPGMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    13    2   17  L  P N             T        Y              
REPUIDH  DS    XL8                                                              
REPUID   DS    CL8     13   20    8  A  U H             T        Y  209         
REPUIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    14    2   17  L  P N             T        Y              
REPACGH  DS    XL8                                                              
REPACG   DS    CL8     14   20    8  A  U H             T        Y  111         
REPACGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    16    2   17  L  P N             T        Y              
REPVALH  DS    XL8                                                              
REPVAL   DS    CL1     16   20    1  A  U N             T        Y  219         
REPVALX  DS    XL8                                                              
REPLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 488  BYTES                            
