*          DATA SET SEACSD7D   AT LEVEL 002 AS OF 10/11/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0DD7D      DATE 10/11/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     5    2   11  L  P N             T        Y              
LSTPIDH  DS    XL8                                                              
LSTPID   DS    CL8      5   15    8  A  U H             T        Y  101         
LSTPIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15     5   25   15  L  P N             T        Y              
LSTOPIH  DS    XL8                                                              
LSTOPI   DS    CL8      5   41    8  A  U H             T        Y  130         
LSTOPIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     5   57   12  L  P N             T        Y              
LSTAPCH  DS    XL8                                                              
LSTAPC   DS    CL8      5   70    8  A  U H             T        Y  136         
LSTAPCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     6    2   12  L  P N             T        Y              
LSTAGRH  DS    XL8                                                              
LSTAGR   DS    CL8      6   15    8  A  U H             T        Y  111         
LSTAGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6   25    9  L  P N             T        Y              
LSTOFFH  DS    XL8                                                              
LSTOFF   DS    CL2      6   35    2  A  U H             T        Y  108         
LSTOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   57    7  L  P N             T        Y              
LSTDIDH  DS    XL8                                                              
LSTDID   DS    CL3      6   70    3  A  U H             T        Y  109         
LSTDIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  L  P N             T        Y              
LSTUSRH  DS    XL8                                                              
LSTUSR   DS    CL8      7   15    8  A  U H             T        Y  113         
LSTUSRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      7   25    9  L  P N             T        Y              
LSTNAMEH DS    XL8                                                              
LSTNAME  DS    CL20     7   35   20  A  U H             T        Y  107         
LSTNAMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      7   57    9  L  P N             T        Y              
LSTDEFH  DS    XL8                                                              
LSTDEF   DS    CL10     7   68   10  A  U H             T        Y  136         
LSTDEFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79     9    2   79  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  L  P H             T        Y              
LSTACT1H DS    XL8                                                              
LSTACT1  DS    CL3     11    2    3  A  U N             T        Y    1         
LSTACT1X DS    XL8                                                              
LSTLIN1H DS    XL8                                                              
LSTLIN1  DS    CL74    11    6   74  A  P N             T        Y              
LSTACT2H DS    XL8                                                              
LSTACT2  DS    CL3     12    2    3  A  U N             T        Y    1         
LSTACT2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
LSTFOOTH DS    XL8                                                              
LSTFOOT  DS    CL78    24    2   78  L  P H             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1968 BYTES                            
