*          DATA SET SEDDSDEPT  AT LEVEL 006 AS OF 03/03/04                      
DEPTTAB  DS    CL9                                                              
         DC    X'00',CL8'CLI SERV'                                              
         DC    X'10',CL8'CLI SOL '                                              
         DC    X'20',CL8'CORP COM'                                              
         DC    X'30',CL8'FINANCE '                                              
         DC    X'40',CL8'HUMAN RE'                                              
         DC    X'50',CL8'IS      '                                              
         DC    X'60',CL8'MANGEMNT'                                              
         DC    X'70',CL8'OPS     '                                              
         DC    X'80',CL8'OPSSUP  '                                              
         DC    X'90',CL8'PRODUCT '                                              
         DC    X'A0',CL8'PTS     '                                              
         DC    X'B0',CL8'SYSPROGS'                                              
         DC    X'C0',CL8'SSC     '                                              
         DC    X'D0',CL8'TELECOMS'                                              
         DC    X'E0',CL8'........'                                              
         DC    X'F0',CL8'........'                                              
         DC    X'FF',CL8'NONE    '                                              
