*          DATA SET SFCODFLG   AT LEVEL 012 AS OF 09/12/02                      
*              MISCELLANEOUS STORAGE FOR CODESWIT IN SFM                        
MISFLGS  DSECT                                                                  
ASCRNFLD DS    A                   A(SCREEN FIELD GLOBBERING)                   
MISFLAGS DS    C                   MISCELLANEOUS FLAGS                          
*                                  X'80'  =  RETURN FROM GLOBBER                
*                                  X'40'  =  INVOICE PERMITTED                  
*                                  X'20'  =  DAILY PACING SET AS                
*                                            REPPROF+27 = Y                     
*                                  LANDMARK                                     
CNTLDMRK DS    CL8                 'CONPROFS'                                   
*                                                                               
CNTPROFS DS    0CL12               CONTRACT PROFILES                            
CNTGREP  DS    CL2                 REP/AGENCY/USER POWER CODE                   
CNTGP#   DS    CL1                 SFM PROGRAM NUMBER (18)                      
         DS    CL1                                                              
CNTGPBIT DS    CL8                 64 PROFILES                                  
*                                                                               
ALTCAL   DS    C                   ALTERNATE CALENDAR FLAG                      
SINVTAK  DS    C                   SOURCE INVOICE TAKEOVER FLAG                 
TINVTAK  DS    C                   TARGET INVOICE TAKEOVER FLAG                 
OFFFILT  DS    CL2                                                              
ADVFILT  DS    CL4                                                              
AGYFILT  DS    CL6                                                              
SPFILT   DS    CL3                                                              
DATEFILT DS    XL3                                                              
*                                                                               
*                                                                               
