*          DATA SET SILELEM    AT LEVEL 002 AS OF 06/20/73                      
SILELEM  DS    0C                  *** POOL LETTER ELEMENT ***                  
SILCODE  DS    X'13'               ELEMENT CODE                                 
SILLEN   DS    CL1 . B             ELEMENT LENGTH                               
SILDATE  DS    CL3 . B             LETTER DATE                                  
SILSTRT  DS    CL3 . B             LETTER START DATE                            
SILEND   DS    CL3 . B             LETTER END DATE                              
         DS    CL4 . X             SPARE                                        
