*          DATA SET SILNKEL    AT LEVEL 001 AS OF 11/21/74                      
SILNKEL  DS    0C                  ***STATION INV LINK ELEMENT                  
SILKCODE DS    X'21'               ELEMENT CODE                                 
SILKLEN  DS    CL1 . B             ELEMENT LENGTH                               
SILKPRD  DS    CL2 . C             PRODUCT CODE                                 
SILKRNO  DS    CL1 . B             RECORD NUMBER                                
