*          DATA SET SIPELEM    AT LEVEL 004 AS OF 07/02/74                      
SIPELEM  DS    0C                  *** STATION INV PIGGY ELEMENT ***            
SIPCODE  DS    CL1 . B             ELEMENT CODE X'12'                           
SIPLEN   DS    CL1 . B             ELEMENT LENGTH                               
SIPLDTE  DS    CL3 . B             LETTER DATE                                  
SIPLSTRT DS    CL3 . B             LETTER START DATE                            
SIPLEND  DS    CL3 . B             LETTER END DATE                              
SIPPRDA  DS    CL2 . A             PRODUCT A                                    
SIPPRDB  DS    CL2 . A             PRODUCT B                                    
SIPDATE  DS    CL2 . B             STATION START DATE                           
         DS    CL2 . X             SPARE                                        
*        VARIABLE NUMBER OF 6 BYTE FIELDS                                       
SIPSTAT  DS    CL1 . B             STATUS BYTE                                  
*                                  BIT 0 DELETE                                 
*                                   BIT 1 - SHIP                                
*                                     BIT 2  -SIMULATION FILM NUMBER            
*                                    BIT 3-7 SPARE                              
SIPFNOA  DS    CL2 . B             FILM NUMBER A                                
SIPLENP  DS    CL1 . B             PARTNER LENGTH                               
SIPFNOB  DS    CL2 . B             FILM NUMBER B                                
*                                      BIT 1     0=JOINED A/B                   
*                                                1=JOINED B/A                   
