*          DATA SET SISELEM    AT LEVEL 003 AS OF 07/01/74                      
SISELEM  DS    0C                  *** STATION INV SOLO ELEMENT ***             
SISCODE  DS    X'11'               ELEMENT CODE                                 
SISLEN   DS    CL1 . B             ELEMENT LENGTH                               
SISLDTE  DS    CL3 . B             LETTER DATE                                  
SISLSTRT DS    CL3 . B             LETTER START DATE                            
SISLEND  DS    CL3 . B             LETTER END DATE                              
SISPRD   DS    CL2 .  A            PRODUCT CODE                                 
         DS    CL2 . X             SPARE                                        
SISDATE  DS    CL2 . B             STATION START DATE                           
*        VARIABLE NUMBER OF 3 BYTE FIELDS                                       
SISSTAT  DS    CL1 . B             STATUS BYTE                                  
*                                    BIT 0 - DELETE                             
*                                    BIT 1 - SHIP                               
*                                     BIT 2  -SIMULATION FILM NUMBER            
*                                    BIT 3-7 SPARE                              
SISFNO   DS    CL2 . B             FILM NUMBER                                  
