*          DATA SET SPA8WWBLK  AT LEVEL 009 AS OF 12/16/88                      
SPWWD    DSECT      **** WUNDERMAN BILLING INTERFACE BLOCK *****                
*                                                                               
SPWWHOOK DS    A         IN                                                     
SPWWAIO  DS    A         IN                                                     
*                                                                               
SPWWAGMD DS    XL1       IN                                                     
SPWWCLT  DS    XL2       IN                                                     
SPWWPRD  DS    XL1       IN                                                     
SPWWEST  DS    XL1       IN                                                     
*                                                                               
SPWWPRDO DS    XL1       OUT       PRODUCT                                      
SPWWESTO DS    XL1       OUT       ESTIMATE NUMBER                              
SPWWMKT  DS    XL2       OUT                                                    
SPWWSTA  DS    XL3       OUT                                                    
SPWWCMT  DS    CL15      OUT       SOME DESCRIPTIVE COMMENT                     
SPWWSDT  DS    XL2       OUT       SERVICE DATE YM                              
SPWWPDT  DS    XL3       OUT       PAYMENT DATE YMD                             
*                                                                               
SPWWGRS  DS    F         OUT                                                    
SPWWNET  DS    F         OUT                                                    
SPWWTAX  DS    F         OUT                                                    
*                                                                               
SPWWLEN  EQU   *-SPWWD                                                          
