*          DATA SET SPADDD7D   AT LEVEL 004 AS OF 07/15/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212D7D      DATE 07/15/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL1      5   10    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL3      5   28    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   38    8  A   P    N         T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   47    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL30     6   10   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A   P    N         T        Y              
TRATYPH  DS    CL8                                                              
TRATYP   DS    CL40     7   15   40  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    N         T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1      9    2    1  A   P    N         T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 216  BYTES                            
