*          DATA SET SPADDF4D   AT LEVEL 017 AS OF 11/06/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212F4D      DATE 11/06/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
AVMREFNH DS    CL8                                                              
AVMREFN  DS    CL7      6   11    7  A   U    N         T    I   Y   20         
AVMREFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   20    6  A   P    H         T        Y              
AVMMKTH  DS    CL8                                                              
AVMMKT   DS    CL4      6   28    4  N   U    N         T        Y   41         
AVMMKTX  DS    CL8                                                              
AVMMKXPH DS    CL8                                                              
AVMMKXP  DS    CL24     6   34   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
AVMINFOH DS    CL8                                                              
AVMINFO  DS    CL76     7    4   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A   P    N         T        Y              
AVMBUYRH DS    CL8                                                              
AVMBUYR  DS    CL3      8   11    3  A   U    N         T        Y   45         
AVMBUYRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      8   20    5  A   P    N         T        Y              
AVMASSTH DS    CL8                                                              
AVMASST  DS    CL3      8   28    3  A   U    N         T        Y   45         
AVMASSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A   P    N         T        Y              
AVMOPTNH DS    CL8                                                              
AVMOPTN  DS    CL34     8   46   34  A   U    N         T        Y   50         
AVMOPTNX DS    CL8                                                              
AVMFILLH DS    CL8                                                              
AVMFILL  DS    CL78    10    2   78  A   P    N         T        Y              
AVMFLINH DS    CL8                                                              
AVMFLIN  DS    CL78    11    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    12    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    13    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    14    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    15    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    16    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    17    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    18    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    19    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    20    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL78    21    2   78  L   U    N         T        N              
AVMLLINH DS    CL8                                                              
AVMLLIN  DS    CL78    22    2   78  L   U    N         T        N              
         DS    CL8                                                              
         DS    CL50    24    2   50  A   P    H         T        Y              
AVMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AVMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1512 BYTES                            
