*          DATA SET SPADDF3D   AT LEVEL 042 AS OF 08/22/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212F3D      DATE 08/22/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
AVMREFNH DS    CL8                                                              
AVMREFN  DS    CL7      6   11    7  A   U    N         T    I   Y   20         
AVMREFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A   P    H         T        Y              
AVMBUYRH DS    CL8                                                              
AVMBUYR  DS    CL3      7   11    3  A   U    N         T        Y   25         
AVMBUYRX DS    CL8                                                              
AVMBYXPH DS    CL8                                                              
AVMBYXP  DS    CL24     7   18   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A   P    H         T        Y              
AVMCLTH  DS    CL8                                                              
AVMCLT   DS    CL3      8   11    3  A   U    N         T        Y   30         
AVMCLTX  DS    CL8                                                              
AVMCLXPH DS    CL8                                                              
AVMCLXP  DS    CL22     8   18   22  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    H         T        Y              
AVMPRDH  DS    CL8                                                              
AVMPRD   DS    CL3      9   11    3  A   U    N         T        Y   35         
AVMPRDX  DS    CL8                                                              
AVMPRXPH DS    CL8                                                              
AVMPRXP  DS    CL24     9   18   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A   P    N         T        Y              
AVMESTH  DS    CL8                                                              
AVMEST   DS    CL3     10   11    3  N   U    N         T        Y   40         
AVMESTX  DS    CL8                                                              
AVMESXPH DS    CL8                                                              
AVMESXP  DS    CL54    10   18   54  A   P    N         T        Y              
AVMTAG1H DS    CL8                                                              
AVMTAG1  DS    CL1     11    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12    2   11  A   P    N         T        Y              
AVMASSTH DS    CL8                                                              
AVMASST  DS    CL3     12   17    3  A   U    N         T        Y   26         
AVMASSTX DS    CL8                                                              
AVMASXPH DS    CL8                                                              
AVMASXP  DS    CL24    12   25   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A   P    N         T        Y              
AVMDUEDH DS    CL8                                                              
AVMDUED  DS    CL8     13   17    8  A   U    N         T        Y   45         
AVMDUEDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    14    2   12  A   P    N         T        Y              
AVMFLTSH DS    CL8                                                              
AVMFLTS  DS    CL8     14   17    8  A   U    N         T        Y   50         
AVMFLTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14   32   10  A   P    N         T        Y              
AVMFLTEH DS    CL8                                                              
AVMFLTE  DS    CL8     14   44    8  A   U    N         T        Y   51         
AVMFLTEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15    2    8  A   P    N         T        Y              
AVMDAYPH DS    CL8                                                              
AVMDAYP  DS    CL62    15   17   62  A   U    N         T        Y   55         
AVMDAYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16    2   12  A   P    N         T        Y              
AVMSPLNH DS    CL8                                                              
AVMSPLN  DS    CL62    16   17   62  A   U    N         T        Y   56         
AVMSPLNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    17    2   14  A   P    N         T        Y              
AVMRSRVH DS    CL8                                                              
AVMRSRV  DS    CL3     17   17    3  A   U    N         T        Y   60         
AVMRSRVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17   22   11  A   P    N         T        Y              
AVMRBOKH DS    CL8                                                              
AVMRBOK  DS    CL28    17   34   28  A   U    N         T        Y   61         
AVMRBOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17   64   11  A   P    N         T        Y              
AVMSURVH DS    CL8                                                              
AVMSURV  DS    CL3     17   76    3  A   U    N         T        Y   62         
AVMSURVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     18    2    5  A   P    N         T        Y              
AVMDEMOH DS    CL8                                                              
AVMDEMO  DS    CL62    18   17   62  A   U    N         T        Y   65         
AVMDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19    2   12  A   P    N         T        Y              
AVMSTD1H DS    CL8                                                              
AVMSTD1  DS    CL8     19   17    8  A   U    N         T        Y   70         
AVMSTD1X DS    CL8                                                              
AVMSTD2H DS    CL8                                                              
AVMSTD2  DS    CL8     19   30    8  A   U    N         T        Y   70         
AVMSTD2X DS    CL8                                                              
AVMSTD3H DS    CL8                                                              
AVMSTD3  DS    CL8     19   43    8  A   U    N         T        Y   70         
AVMSTD3X DS    CL8                                                              
AVMSTD4H DS    CL8                                                              
AVMSTD4  DS    CL8     19   56    8  A   U    N         T        Y   70         
AVMSTD4X DS    CL8                                                              
AVMSTD5H DS    CL8                                                              
AVMSTD5  DS    CL8     19   69    8  A   U    N         T        Y   70         
AVMSTD5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    21    2   16  A   P    N         T        Y              
AVMCREAH DS    CL8                                                              
AVMCREA  DS    CL8     21   19    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   29    7  A   P    N         T        Y              
AVMCHNGH DS    CL8                                                              
AVMCHNG  DS    CL8     21   38    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     21   48    9  A   P    N         T        Y              
AVMLSNTH DS    CL8                                                              
AVMLSNT  DS    CL20    21   59   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    22   11   15  A   P    N         T        Y              
AVMNMKTH DS    CL8                                                              
AVMNMKT  DS    CL4     22   27    4  A   P    N         T        Y              
AVMCOMSH DS    CL8                                                              
AVMCOMS  DS    CL35    22   45   35  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL47    24    2   47  A   P    H         T        Y              
AVMSCOMH DS    CL8                                                              
AVMSCOM  DS    CL22    24   49   22  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    24   71   10  A   P    H         T        Y              
AVMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AVMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1400 BYTES                            
