*          DATA SET SPADDE3D   AT LEVEL 021 AS OF 06/19/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212E3D      DATE 06/19/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
AVLREFNH DS    CL8                                                              
AVLREFN  DS    CL7      6   11    7  A   U    N         T    I   Y   20         
AVLREFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    2   11  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      7   20    5  A   P    N         T        Y              
AVLBUYRH DS    CL8                                                              
AVLBUYR  DS    CL3      7   29    3  A   U    N         T        Y   25         
AVLBUYRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   38    6  A   P    N         T        Y              
AVLCLTH  DS    CL8                                                              
AVLCLT   DS    CL3      7   46    3  A   U    N         T        Y   30         
AVLCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   56    7  A   P    N         T        Y              
AVLPRDH  DS    CL8                                                              
AVLPRD   DS    CL3      7   64    3  A   U    N         T        Y   35         
AVLPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8   20    8  A   P    N         T        Y              
AVLESTH  DS    CL8                                                              
AVLEST   DS    CL3      8   29    3  N   U    N         T        Y   40         
AVLESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8   38    6  A   P    N         T        Y              
AVLPERDH DS    CL8                                                              
AVLPERD  DS    CL17     8   46   17  A   U    N         T        Y   41         
AVLPERDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   14    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   23    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   28    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   33    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    10   38   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10   57    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10   67    6  A   P    N         T        Y              
AVLSELH  DS    CL8                                                              
AVLSEL   DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    24    2   79  A   P    H         T        Y              
AVLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AVLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1584 BYTES                            
