*          DATA SET SPADDF1D   AT LEVEL 012 AS OF 07/19/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212F1D      DATE 07/19/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
BUYMEDH  DS    CL8                                                              
BUYMED   DS    CL1      5   10    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8      5   20    8  A   P    H         T        Y              
BUYIDH   DS    CL8                                                              
BUYID    DS    CL3      5   30    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9      7    2    9  A   P    H         T        Y              
BUYNAMEH DS    CL8                                                              
BUYNAME  DS    CL24     7   18   24  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A   P    H         T        Y              
BUYOFIDH DS    CL8                                                              
BUYOFID  DS    CL2      8   18    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      9    2    9  A   P    H         T        Y              
BUYTELEH DS    CL8                                                              
BUYTELE  DS    CL12     9   18   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      9   32    4  A   P    N         T        Y              
BUYEXTH  DS    CL8                                                              
BUYEXT   DS    CL4      9   37    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  A   P    N         T        Y              
BUYASSTH DS    CL8                                                              
BUYASST  DS    CL3     10   18    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A   P    N         T        Y              
BUYMKG1H DS    CL8                                                              
BUYMKG1  DS    CL10    11   18   10  A   U    N         T        Y              
BUYMKG2H DS    CL8                                                              
BUYMKG2  DS    CL10    11   30   10  A   U    N         T        Y              
BUYMKG3H DS    CL8                                                              
BUYMKG3  DS    CL10    11   42   10  A   U    N         T        Y              
BUYMKG4H DS    CL8                                                              
BUYMKG4  DS    CL10    11   54   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    13    2   11  A   P    N         T        Y              
BUYMLSH  DS    CL8                                                              
BUYMLS   DS    CL70    14    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    15    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    16    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    17    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    18    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    19    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    20    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    21    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    22    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    23    2   70  A   P    N         T        Y              
BUYMLSLH DS    CL8                                                              
BUYMLSL  DS    CL70    24    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A   P    N         T        Y              
BUYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BUYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1216 BYTES                            
