*          DATA SET SPADDF8D   AT LEVEL 004 AS OF 07/17/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212F8D      DATE 07/17/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
AVMREFNH DS    CL8                                                              
AVMREFN  DS    CL7      6   11    7  A   U    N         T    I   Y   20         
AVMREFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
AVMINFOH DS    CL8                                                              
AVMINFO  DS    CL76     7    4   76  A   P    N         T        Y              
AVMFILLH DS    CL8                                                              
AVMFILL  DS    CL78     9    2   78  A   P    N         T        Y              
AVMFLINH DS    CL8                                                              
AVMFLIN  DS    CL78    10    2   78  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  L   U    N         T        Y              
AVMLLINH DS    CL8                                                              
AVMLLIN  DS    CL78    19    2   78  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    24    2   50  A   P    H         T        Y              
AVMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AVMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1144 BYTES                            
