*          DATA SET SPADDE4D   AT LEVEL 013 AS OF 08/05/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212E4D      DATE 08/05/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
AVLREFNH DS    CL8                                                              
AVLREFN  DS    CL7      6   11    7  A   U    N         T    I   Y   20         
AVLREFNX DS    CL8                                                              
AVLINFOH DS    CL8                                                              
AVLINFO  DS    CL76     7    4   76  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
AVLOPTNH DS    CL8                                                              
AVLOPTN  DS    CL69     8   11   69  A   U    N         T        Y   50         
AVLOPTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10    6    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   37    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     10   46    4  A   P    N         T        Y              
AVLSELH  DS    CL8                                                              
AVLSEL   DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL65    24    2   65  A   P    H         T        Y              
AVLNMKTH DS    CL8                                                              
AVLNMKT  DS    CL12    24   69   12  A   P    H         T        Y              
AVLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AVLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1496 BYTES                            
