*          DATA SET SPADDF6D   AT LEVEL 004 AS OF 06/05/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212F6D      DATE 06/05/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
COMMEDH  DS    CL8                                                              
COMMED   DS    CL1      5   10    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL12     5   20   12  A   P    H         T        Y              
COMIDH   DS    CL8                                                              
COMID    DS    CL8      5   34    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
COMFILLH DS    CL8                                                              
COMFILL  DS    CL75     6    2   75  A   P    N         T        Y              
COMTXTH  DS    CL8                                                              
COMTXT   DS    CL75     7    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75     8    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75     9    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    10    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    11    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    12    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    13    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    14    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    15    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    16    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    17    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    18    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    19    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    20    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    21    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    22    2   75  L   U    N         T        Y              
COMTXTLH DS    CL8                                                              
COMTXTL  DS    CL75    23    2   75  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    24    2   75  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A   P    N         T        Y              
COMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1656 BYTES                            
