*          DATA SET SPADDFFD   AT LEVEL 012 AS OF 06/08/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212FFD      DATE 06/08/94                 
         SPACE 1                                                                
T212FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CONHEADH DS    CL8                                                              
CONHEAD  DS    CL60     1    2   60  L  P N             T        Y              
CONSERVH DS    CL8                                                              
CONSERV  DS    CL17     1   63   17  A  U N             T        Y              
CONHED2H DS    CL8                                                              
CONHED2  DS    CL79     2    2   79  L  P N             T        Y    1         
CONHED2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      3    2    7  L  P N             T        Y              
CONRECH  DS    CL8                                                              
CONREC   DS    CL8      3   10    8  A  U N             T    I   Y    2         
CONRECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      3   20    7  L  P N             T        Y              
CONACTH  DS    CL8                                                              
CONACT   DS    CL8      3   28    8  A  U N             T        Y    4         
CONACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      3   38    7  L  P N             T        Y              
CONKEYH  DS    CL8                                                              
CONKEY   DS    CL34     3   46   34  A  U N             T        Y    6         
CONKEYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4    2    7  L  P N             T        Y              
CONWHENH DS    CL8                                                              
CONWHEN  DS    CL8      4   10    8  A  U N             T        Y    8         
CONWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4   20    7  L  P N             T        Y              
CONOUTH  DS    CL8                                                              
CONOUT   DS    CL8      4   28    8  A  U N             T        Y   10         
CONOUTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4   38    7  L  P N             T        Y              
CONDESTH DS    CL8                                                              
CONDEST  DS    CL8      4   46    8  A  U N             T        Y   12         
CONDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4   56    7  L  P N             T        Y              
CONOTHH  DS    CL8                                                              
CONOTH   DS    CL16     4   64   16  A  U N             T        Y   14         
CONOTHX  DS    CL8                                                              
CONTAGH  DS    CL8                                                              
CONTAG   DS    CL1      5    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL40     7   10   40  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL40     8   10   40  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL40     9   10   40  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL40    10   10   40  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL40    11   10   40  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL40    12   10   40  L  P N             T        Y              
CONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 880  BYTES                            
