*          DATA SET SPADDF2D   AT LEVEL 027 AS OF 07/23/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212F2D      DATE 07/23/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
MRKMEDH  DS    CL8                                                              
MRKMED   DS    CL1      5   10    1  A   U    H         T        Y   10         
MRKMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15     5   20   15  A   P    N         T        Y              
MRKMKTH  DS    CL8                                                              
MRKMKT   DS    CL8      5   38    8  A   U    N         T        Y   11         
MRKMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL34     7   35   34  A   P    N         T        Y              
MRKL1H   DS    CL8                                                              
MRKL1    DS    CL4      8    2    4  A   P    N         T        Y              
MRKNAMEH DS    CL8                                                              
MRKNAME  DS    CL24     8    9   24  A   P    N         T        Y              
MRKCEL1H DS    CL8                                                              
MRKCEL1  DS    CL17     8   35   17  A   U    H         T        Y   12         
MRKCEL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     8   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24     9    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     9   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17     9   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     10    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    10    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    10   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    10   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     11    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    11    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    11   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    11   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    12    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    12   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    12   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    13    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    13   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    13   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    14    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    14   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    14   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    15    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    15   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    15   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    16    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    16   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    16   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    17    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    17   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    17   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    18    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    18   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    18   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    19    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    19   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    19   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    20    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    20   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    20   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     21    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    21    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    21   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    21   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     22    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    22    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    22   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    22   55   17  A   P    N         T        Y              
MRKEND1H DS    CL8                                                              
MRKEND1  DS    CL4     23    2    4  A   P    N         T        Y              
MRKEND2H DS    CL8                                                              
MRKEND2  DS    CL24    23    9   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    23   35   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL17    23   55   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     24    2    8  A   P    H         T        Y              
MRKLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
MRKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
