*          DATA SET SPADDC3D   AT LEVEL 008 AS OF 08/28/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T212C3D      DATE 08/28/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL20     6    2   20  A   P    N         T        Y              
AVCFRSTH DS    CL8                                                              
AVCFRST  DS    CL1      7    3    1  A   U    N         T    I   Y              
AVCCMNTH DS    CL8                                                              
AVCCMNT  DS    CL8      7    7    8  A   P    N         T        N              
AVCLINEH DS    CL8                                                              
AVCLINE  DS    CL60     7   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60     8   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60     9   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    10   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    11   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    12   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    13   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    14   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    15   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    16   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    17   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    18   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     19    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    19   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    20   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     21    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    21   18   60  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    22   18   60  L   P    N         T        Y              
AVCLSTLH DS    CL8                                                              
AVCLSTL  DS    CL1     23    3    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     23    7    8  A   P    N         T        N              
         DS    CL8                                                              
         DS    CL60    23   18   60  L   P    N         T        Y              
AVCTAGH  DS    CL8                                                              
AVCTAG   DS    CL1     23   80    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    24   25   30  A   P    H         T        Y              
AVCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AVCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1664 BYTES                            
