*          DATA SET SPB1WIREC  AT LEVEL 008 AS OF 12/16/97                      
WIREC    DS    0D                                                               
*                                                                               
WIKEY    DS    0C                                                               
WIKEST   DS    XL1                 ESTIMATE                                     
WIKMKT   DS    XL2                 MARKET                                       
WIKSTA   DS    XL3                 X'000000'=MARKET TOTALS                      
WIKYM    DS    XL2                 YEAR/MONTH                                   
WIKEYL   EQU   *-WIKEY                                                          
*                                                                               
WISPTS   DS    F                   SPOTS                                        
WISPT0   DS    F                   BONUS SPOTS                                  
WICLTG   DS    F                   CLIENT GROSS                                 
WICLTN   DS    F                   CLIENT NET                                   
WITAX    DS    F                   TAX                                          
WIWIMG   DS    F                   WIM GROSS                                    
WIWIMN   DS    F                   WIM NET                                      
WIWIMX   DS    F                   WIM TAX                                      
WIWIMGD  DS    F                   WIM GROSS DIFFERENCE                         
WIWIMND  DS    F                   NET                                          
WIWIMTD  DS    F                   TAX                                          
WICLADJG DS    F                   CLIENT ADJ GROSS                             
WICLADJN DS    F                   CLIENT ADJ NET                               
WICLADJS DS    F                   CLIENT ADJ SPSOTS                            
WICLOVDG DS    F                   CLIENT OVERRIDE DIFFERENCE - GROSS           
WISTATUS DS    X                   STATUS                                       
WISADJQ  EQU   X'80'               - ADJUSTMENT PRESENT (DETAIL ONLY)           
WIRECL   EQU   *-WIREC                                                          
