*          DATA SET SPB1WWBLK  AT LEVEL 009 AS OF 01/30/89                      
SPWWD    DSECT      **** WUNDERMAN BILLING INTERFACE BLOCK *****                
*                                                                               
SPWWHOOK DS    A         IN                                                     
SPWWAIO  DS    A         IN                                                     
*                                                                               
SPWWAGMD DS    XL1       IN                                                     
SPWWCLT  DS    XL2       IN                                                     
SPWWPRD  DS    XL1       IN                                                     
SPWWEST  DS    XL1       IN                                                     
SPWWSYM  DS    XL2       IN        START YEAR/MONTH                             
SPWWEYM  DS    XL2       IN        END YEAR/MONTH                               
SPWWIMKT DS    XL2       IN        REQUESTED MKT                                
SPWWISTA DS    XL3       IN        REQUESTED STATION                            
SPWWDATA DS    CL1       IN        C'O'=ORD, C'P'=PAID                          
*                                                                               
SPWWESTO DS    XL1       OUT                                                    
SPWWMKT  DS    XL2       OUT                                                    
SPWWSTA  DS    XL3       OUT                                                    
SPWWYM   DS    XL2       OUT       YEAR/MONTH                                   
SPWWCMT  DS    CL15      OUT       SOME DESCRIPTIVE COMMENT                     
*                                                                               
SPWWSPTS DS    F         OUT                                                    
SPWWGRS  DS    F         OUT                                                    
SPWWNET  DS    F         OUT                                                    
SPWWTAX  DS    F         OUT                                                    
*                                                                               
SPWWLEN  EQU   *-SPWWD                                                          
