*          DATA SET SPBUYF1D   AT LEVEL 001 AS OF 04/09/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T211F1D      DATE 04/09/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
STAHL1H  DS    CL8                                                              
STAHL1   DS    CL40     9    1   40  A  P N             T        Y              
STAHL2H  DS    CL8                                                              
STAHL2   DS    CL40     9   41   40  A  P N             T        Y              
STAINP1H DS    CL8                                                              
STAINP1  DS    CL78    10    2   78  A  U N        M    T        Y              
STAOUTH  DS    CL8                                                              
STAOUT   DS    CL80    12    1   80  A  P N             N        Y              
STALAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
STAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 280  BYTES                            
