*          DATA SET SPBUYF2D   AT LEVEL 002 AS OF 05/07/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T211F2D      DATE 05/07/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MORHL1H  DS    XL8                                                              
MORHL1   DS    CL40     9    1   40  A  P N             T        Y              
MORHL2H  DS    XL8                                                              
MORHL2   DS    CL40     9   41   40  A  P N             T        Y              
MORINP1H DS    XL8                                                              
MORINP1  DS    CL78    10    2   78  A  U N        M    T        Y              
MORLINH  DS    XL8                                                              
MORLIN   DS    CL3     11    1    3  A  P N             T        Y              
MORDATEH DS    XL8                                                              
MORDATE  DS    CL11    11    5   11  A  P N             T        Y              
MORDAYSH DS    XL8                                                              
MORDAYS  DS    CL7     11   17    7  A  P N             T        Y              
MORNPWH  DS    XL8                                                              
MORNPW   DS    CL2     11   25    2  A  P N             T        Y              
MORTIMEH DS    XL8                                                              
MORTIME  DS    CL11    11   28   11  A  P N             T        Y              
MORDPTH  DS    XL8                                                              
MORDPT   DS    CL1     11   42    1  A  P N             T        Y              
MORSLNH  DS    XL8                                                              
MORSLN   DS    CL3     11   44    3  A  P N             T        Y              
MORPROGH DS    XL8                                                              
MORPROG  DS    CL17    11   48   17  A  P N             T        Y              
MORCOSTH DS    XL8                                                              
MORCOST  DS    CL9     11   66    9  A  P N             T        Y              
MORADJH  DS    XL8                                                              
MORADJ   DS    CL2     11   77    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    3    8  A  P N             T        Y              
MORORB1H DS    XL8                                                              
MORORB1  DS    CL32    13   14   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    3    8  A  P N             T        Y              
MORORB2H DS    XL8                                                              
MORORB2  DS    CL32    14   14   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    3    8  A  P N             T        Y              
MORORB3H DS    XL8                                                              
MORORB3  DS    CL32    15   14   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    3    8  A  P N             T        Y              
MORORB4H DS    XL8                                                              
MORORB4  DS    CL32    16   14   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    3    8  A  P N             T        Y              
MORORB5H DS    XL8                                                              
MORORB5  DS    CL32    17   14   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    3    8  A  P N             T        Y              
MORORB6H DS    XL8                                                              
MORORB6  DS    CL32    18   14   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    3    8  A  P N             T        Y              
MORORB7H DS    XL8                                                              
MORORB7  DS    CL32    19   14   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    3    8  A  P N             T        Y              
MORORB8H DS    XL8                                                              
MORORB8  DS    CL32    20   14   32  A  U N             T        Y              
MORPFKH  DS    XL8                                                              
MORPFK   DS    CL30    24    3   30  A  P N             T        Y              
MORLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
MORWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 824  BYTES                            
