*          DATA SET SPBUYF0D   AT LEVEL 004 AS OF 02/04/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T211F0D      DATE 02/04/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MGAHL1H  DS    XL8                                                              
MGAHL1   DS    CL46     9    1   46  A  P N             T        Y              
MGAHL2H  DS    XL8                                                              
MGAHL2   DS    CL34     9   47   34  A  P N             T        Y              
MGAINP1H DS    XL8                                                              
MGAINP1  DS    CL78    10    2   78  A  U N        M    T        Y              
MGALN1H  DS    XL8                                                              
MGALN1   DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
MGALSTLH DS    XL8                                                              
MGALSTL  DS    CL78    22    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    23    2   11  A  P N             T        Y              
MGATOTLH DS    XL8                                                              
MGATOTL  DS    CL40    23   38   40  A  P N             T        Y              
MGAPFKH  DS    XL8                                                              
MGAPFK   DS    CL25    24    2   25  A  P N             T        Y              
MGAGTOTH DS    XL8                                                              
MGAGTOT  DS    CL40    24   38   40  A  P N             T        Y              
MGALAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
MGAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1368 BYTES                            
