*          DATA SET SPBUYF4D   AT LEVEL 001 AS OF 10/12/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T211F4D      DATE 10/12/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MKOHL1H  DS    XL8                                                              
MKOHL1   DS    CL40     9    1   40  A  P N             T        Y              
MKOHL2H  DS    XL8                                                              
MKOHL2   DS    CL40     9   41   40  A  P N             T        Y              
MKOINP1H DS    XL8                                                              
MKOINP1  DS    CL78    10    2   78  A  U N        M    T        Y              
MKOLINH  DS    XL8                                                              
MKOLIN   DS    CL3     11    1    3  A  P N             T        Y              
MKODATEH DS    XL8                                                              
MKODATE  DS    CL11    11    5   11  A  P N             T        Y              
MKODAYSH DS    XL8                                                              
MKODAYS  DS    CL7     11   17    7  A  P N             T        Y              
MKONPWH  DS    XL8                                                              
MKONPW   DS    CL2     11   25    2  A  P N             T        Y              
MKOTIMEH DS    XL8                                                              
MKOTIME  DS    CL11    11   28   11  A  P N             T        Y              
MKODPTH  DS    XL8                                                              
MKODPT   DS    CL1     11   42    1  A  U H             T        Y              
MKOSLNH  DS    XL8                                                              
MKOSLN   DS    CL3     11   44    3  A  P N             T        Y              
MKOPROGH DS    XL8                                                              
MKOPROG  DS    CL17    11   48   17  A  U H             T        Y              
MKOCOSTH DS    XL8                                                              
MKOCOST  DS    CL9     11   66    9  A  P N             T        Y              
MKOADJH  DS    XL8                                                              
MKOADJ   DS    CL2     11   77    2  A  U H             T        Y              
MKOPURTH DS    XL8                                                              
MKOPURT  DS    CL12    12    1   12  A  P N             T        Y              
MKOPURH  DS    XL8                                                              
MKOPUR   DS    CL6     12   14    6  A  U N             T        Y              
MKORSCTH DS    XL8                                                              
MKORSCT  DS    CL12    12   22   12  A  P N             T        Y              
MKORSCH  DS    XL8                                                              
MKORSC   DS    CL6     12   35    6  A  U N             T        Y              
MKORSTTH DS    XL8                                                              
MKORSTT  DS    CL4     12   42    4  A  P N             T        Y              
MKORSTH  DS    XL8                                                              
MKORST   DS    CL32    12   47   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    1   12  A  P N             T        Y              
MKOUPGDH DS    XL8                                                              
MKOUPGD  DS    CL32    13   14   32  A  U N             T        Y              
MKOCS2TH DS    XL8                                                              
MKOCS2T  DS    CL13    13   52   13  A  P N             T        Y              
MKOCOS2H DS    XL8                                                              
MKOCOS2  DS    CL9     13   66    9  A  U N             T        Y              
MKORPCTH DS    XL8                                                              
MKORPCT  DS    CL8     14   57    8  A  P N             T        Y              
MKORPCDH DS    XL8                                                              
MKORPCD  DS    CL3     14   66    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    1    5  A  P N             T        Y              
MKODN1H  DS    XL8                                                              
MKODN1   DS    CL6     15   18    6  A  P N             T        Y              
MKODM1H  DS    XL8                                                              
MKODM1   DS    CL7     15   26    7  A  U H             T        Y              
MKODN2H  DS    XL8                                                              
MKODN2   DS    CL6     15   34    6  A  P N             T        Y              
MKODM2H  DS    XL8                                                              
MKODM2   DS    CL7     15   42    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     15   50    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   58    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     15   66    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   74    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   10    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     16   18    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   26    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     16   34    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   42    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     16   50    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   58    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     16   66    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   74    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   10    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     17   18    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   26    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     17   34    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   42    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     17   50    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   58    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     17   66    6  A  P N             T        Y              
MKODMLH  DS    XL8                                                              
MKODML   DS    CL7     17   74    7  A  U H             T        Y              
MKOCTTLH DS    XL8                                                              
MKOCTTL  DS    CL8     19    1    8  A  P N             T        Y              
MKOCOM1H DS    XL8                                                              
MKOCOM1  DS    CL70    19   10   70  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    1    8  A  P N             T        Y              
MKOCOM2H DS    XL8                                                              
MKOCOM2  DS    CL70    20   10   70  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    1    8  A  P N             T        Y              
MKOCOM3H DS    XL8                                                              
MKOCOM3  DS    CL70    21   10   70  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22    1    8  A  P N             T        Y              
MKOCOM4H DS    XL8                                                              
MKOCOM4  DS    CL70    22   10   70  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23    1    8  A  P N             T        Y              
MKOCOM5H DS    XL8                                                              
MKOCOM5  DS    CL70    23   10   70  A  U N             T        Y              
MKOSTATH DS    XL8                                                              
MKOSTAT  DS    CL8     24    1    8  A  P N             T        Y              
MKOPFKH  DS    XL8                                                              
MKOPFK   DS    CL30    24   10   30  A  P N             T        Y              
MKOLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
MKOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1520 BYTES                            
