*          DATA SET SPBUYF7D   AT LEVEL 023 AS OF 09/20/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T211F7D      DATE 09/20/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MOVHL1AH DS    XL8                                                              
MOVHL1A  DS    CL40     9    1   40  A  P N             T        Y              
MOVHL1BH DS    XL8                                                              
MOVHL1B  DS    CL40     9   41   40  A  P N             T        Y              
MOVINP1H DS    XL8                                                              
MOVINP1  DS    CL78    10    2   78  A  U N        M    T        Y              
MOVHL2AH DS    XL8                                                              
MOVHL2A  DS    CL36    11    1   36  A  P N             T        Y              
MOVHL2BH DS    XL8                                                              
MOVHL2B  DS    CL42    11   38   42  A  P N             T        Y              
MOVHL3BH DS    XL8                                                              
MOVHL3B  DS    CL42    12   38   42  A  P N             T        Y              
MOVDS1AH DS    XL8                                                              
MOVDS1A  DS    CL36    13    1   36  A  P N             T        Y              
MOVDS1BH DS    XL8                                                              
MOVDS1B  DS    CL42    13   38   42  A  P N             T        Y              
MOVDS2AH DS    XL8                                                              
MOVDS2A  DS    CL36    14    1   36  A  P N             T        Y              
MOVDS2BH DS    XL8                                                              
MOVDS2B  DS    CL42    14   38   42  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    15    1   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42    15   38   42  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    16    1   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42    16   38   42  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    17    1   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42    17   38   42  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    18    1   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42    18   38   42  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    19    1   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42    19   38   42  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    20    1   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42    20   38   42  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    21    1   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42    21   38   42  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    22    1   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42    22   38   42  A  U N             T        Y              
MOVPFKH  DS    XL8                                                              
MOVPFK   DS    CL78    24    1   78  A  P N             T        Y              
MOVLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
MOVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
