*          DATA SET SPBUYF3D   AT LEVEL 002 AS OF 07/25/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T211F3D      DATE 07/25/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MGEHL1H  DS    XL8                                                              
MGEHL1   DS    CL39     9    1   39  A  P N             T        Y              
MGEHL2H  DS    XL8                                                              
MGEHL2   DS    CL41     9   40   41  A  P N             T        Y              
MGEINP1H DS    XL8                                                              
MGEINP1  DS    CL78    10    2   78  A  U N        M    T        Y              
MGESEL1H DS    XL8                                                              
MGESEL1  DS    CL2     11    2    2  A  U N             T        Y              
MGELIN1H DS    XL8                                                              
MGELIN1  DS    CL75    11    5   75  A  U N             T        Y              
MGESEL2H DS    XL8                                                              
MGESEL2  DS    CL2     12    2    2  A  U N             T        Y              
MGELIN2H DS    XL8                                                              
MGELIN2  DS    CL75    12    5   75  A  U N             T        Y              
MGESEL3H DS    XL8                                                              
MGESEL3  DS    CL2     13    2    2  A  U N             T        Y              
MGELIN3H DS    XL8                                                              
MGELIN3  DS    CL75    13    5   75  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    14    5   75  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    15    5   75  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    16    5   75  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    17    5   75  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    18    5   75  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    19    5   75  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    20    5   75  A  U N             T        Y              
MGESELLH DS    XL8                                                              
MGESELL  DS    CL2     21    2    2  A  U N             T        Y              
MGELINLH DS    XL8                                                              
MGELINL  DS    CL75    21    5   75  A  U N             T        Y              
MGETOTMH DS    XL8                                                              
MGETOTM  DS    CL79    22    1   79  A  P N             T        Y              
MGETOTOH DS    XL8                                                              
MGETOTO  DS    CL79    23    1   79  A  P N             T        Y              
MGESTUSH DS    XL8                                                              
MGESTUS  DS    CL8     24    1    8  A  P N             T        Y              
MGEPFKH  DS    XL8                                                              
MGEPFK   DS    CL33    24   10   33  A  P N             T        Y              
MGEPF2H  DS    XL8                                                              
MGEPF2   DS    CL17    24   44   17  A  P N             T        Y              
MGEPF3H  DS    XL8                                                              
MGEPF3   DS    CL16    24   62   16  A  P N             T        Y              
MGELAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
MGEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1488 BYTES                            
