*          DATA SET SPBUYSTAB  AT LEVEL 014 AS OF 08/20/93                      
         SPACE 2                                                                
*              SUB SCREEN TABLE                                                 
         SPACE 1                                                                
SSCRTAB  DS    0CL5                                                             
         DC    AL1(2),CL3'CCL',AL1(SBUYCCLR)                                    
         DC    AL1(2),CL3'CDI',AL1(SBUYCDIS)                                    
         DC    AL1(2),CL3'COM',AL1(SBUYCOM)                                     
         DC    AL1(2),CL3'COP',AL1(SBUYCOPY)                                    
         DC    AL1(2),CL3'CPY',AL1(SBUYCOPY)                                    
         DC    AL1(2),CL3'CSE',AL1(SBUYCSET)                                    
         DC    AL1(2),CL3'CUT',AL1(SBUYCUT)                                     
         DC    AL1(2),CL3'DEM',AL1(SBUYDEM)                                     
         DC    AL1(2),CL3'MOV',AL1(SBUYMOV)                                     
         DC    AL1(2),CL3'NCL',AL1(SBUYNCLR)                                    
         DC    AL1(2),CL3'NDI',AL1(SBUYNDIS)                                    
         DC    AL1(2),CL3'NSE',AL1(SBUYNSET)                                    
         DC    AL1(2),CL3'ORB',AL1(SBUYORB)                                     
         DC    AL1(2),CL3'PDX',AL1(SBUYPDX)                                     
         DC    AL1(2),CL3'PKG',AL1(SBUYPKG)                                     
         DC    AL1(2),CL3'REF',AL1(SBUYREF)                                     
         DC    AL1(2),CL3'RSV',AL1(SBUYRSV)                                     
         DC    AL1(2),CL3'SEN',AL1(SBUYSEND)                                    
         DC    AL1(2),CL3'XCH',AL1(SBUYXCH)                                     
         DC    AL1(1),CL3'DS ',AL1(SBUYDS)                                      
         DC    AL1(1),CL3'DT ',AL1(SBUYDT)                                      
         DC    AL1(1),CL3'LI ',AL1(SBUYLI)                                      
         DC    AL1(1),CL3'PD ',AL1(SBUYPD)                                      
         DC    AL1(1),CL3'SD ',AL1(SBUYSD)                                      
         DC    AL1(1),CL3'SP ',AL1(SBUYSP)                                      
         DC    AL1(1),CL3'ST ',AL1(SBUYST)                                      
         DC    AL1(0),CL3'A  ',AL1(SBUYA)                                       
         DC    AL1(0),CL3'B  ',AL1(SBUYB)                                       
         DC    AL1(0),CL3'C  ',AL1(SBUYC)                                       
         DC    AL1(0),CL3'D  ',AL1(SBUYDE)                                      
         DC    AL1(0),CL3'F  ',AL1(SBUYF)                                       
         DC    AL1(0),CL3'I  ',AL1(SBUYI)                                       
         DC    AL1(0),CL3'N  ',AL1(SBUYN)                                       
         DC    AL1(0),CL3'O  ',AL1(SBUYO)                                       
         DC    AL1(0),CL3'P  ',AL1(SBUYP)                                       
         DC    AL1(0),CL3'R  ',AL1(SBUYR)                                       
         DC    AL1(0),CL3'S  ',AL1(SBUYS)                                       
         DC    AL1(0),CL3'U  ',AL1(SBUYU)                                       
         DC    AL1(0),CL3'X  ',AL1(SBUYX)                                       
         DC    X'FF'                                                            
*                                                                               
SBUYCCLR EQU   1                                                                
SBUYCDIS EQU   2                                                                
SBUYCOM  EQU   3                                                                
SBUYCOPY EQU   4                                                                
SBUYCSET EQU   5                                                                
SBUYCUT  EQU   6                                                                
SBUYDEM  EQU   7                                                                
SBUYNCLR EQU   8                                                                
SBUYNDIS EQU   9                                                                
SBUYNSET EQU   10                                                               
SBUYORB  EQU   11                                                               
SBUYPDX  EQU   12                                                               
SBUYPKG  EQU   13                                                               
SBUYREF  EQU   14                                                               
SBUYRSV  EQU   15                                                               
SBUYSEND EQU   16                                                               
SBUYXCH  EQU   17                                                               
SBUYDS   EQU   18                                                               
SBUYDT   EQU   19                                                               
SBUYLI   EQU   20                                                               
SBUYPD   EQU   21                                                               
SBUYSD   EQU   22                                                               
SBUYSP   EQU   23                                                               
SBUYST   EQU   24                                                               
SBUYA    EQU   25                                                               
SBUYB    EQU   26                                                               
SBUYC    EQU   27                                                               
SBUYDE   EQU   28                                                               
SBUYF    EQU   29                                                               
SBUYI    EQU   30                                                               
SBUYN    EQU   31                                                               
SBUYO    EQU   32                                                               
SBUYP    EQU   33                                                               
SBUYR    EQU   34                                                               
SBUYS    EQU   35                                                               
SBUYU    EQU   36                                                               
SBUYX    EQU   37                                                               
SBUYMOV  EQU   38                                                               
