*          DATA SET SPBUYWORK  AT LEVEL 156 AS OF 11/19/19                      
*          DATA SET SPBUYWORK  AT LEVEL 104 AS OF 10/05/06                      
*                                                                               
MAXBUYS  EQU   499                                                              
*                                                                               
CCUSAID  EQU   797                 *** CCUSAID ***                              
*                                                                               
MISSINP  EQU   001                 MISSING INPUT FIELD                          
INVERR   EQU   002                 INVALID INPUT FIELD                          
CANCLMOR EQU   003                 MAKEGOOD CANCELLED-MORE FOLLOWS              
CANCL    EQU   004                 MAKEGOOD CANCELLED BY REP                    
INVALDPT EQU   005                 APPROVAL INVALID W/OUT DAYPART               
NEEDNMG  EQU   006                 EST REC MUST BE NEW MAKEGOOD                 
FINDMISS EQU   007                 MUST FIND MISS SPOTS PRIOR TO APP            
DARMGPND EQU   009                 DARE MAKEGOOD PENDING                        
DPTVSHOW EQU   016                 DPT NOT MATCH PROGRAM                        
MKTERR   EQU   017                 INVALID MARKET                               
MOVESERR EQU   018                 CANNOT MOVE POL/NON POL BUYS                 
INVBKTY  EQU   019                 BOOKTYPE NOT VALID                           
PERERR   EQU   020                 PERIOD ENTRY NOT VALID                       
SKEDERR1 EQU   021                 BAD DAILY SKED - BUY NOT A ROT               
SKEDERR2 EQU   022                 DAILY SKED DATA NOT VALID                    
SKEDERR3 EQU   023                 BAD DAILY SKED -TOO MANY WEEKS               
SKEDERR4 EQU   024                 BAD DAILY SKED - NO DATA INPUT               
NOSTADIS EQU   025                 LAST RECALL NOT STATION PCTS                 
NONETDIS EQU   026                 LAST RECALL NOT NETWORK PCTS                 
STPCTERR EQU   027                 STATION PCTS DO NOT SUM TO 100               
NODTLST  EQU   028                 DAY/TIME DISPLAY NOT AVAILABLE               
NOCUTDTA EQU   029                 NO CUT IN DATA FOR THIS REQUEST              
STNETERR EQU   030                 STATION NOT IN CURRENT NETWORK               
NOCLSTDS EQU   031                 LAST RECALL NOT CUT-IN LIST                  
NORCLCUT EQU   032                 LAST RECALL NOT CUT-IN DATA                  
NOTMINUS EQU   033                 CAN ONLY REVERSE -OTO                        
NOTINEST EQU   034                 PERIOD NOT IN ESTIMATE                       
PDTOOBIG EQU   035                 BAD PERIOD - TOO MANY WEEKS                  
NEEDPER  EQU   036                 PERIOD INPUT NEEDED                          
CBLNETER EQU   037                 CABLE NETWORK NOT ON MASTER RECORD           
BADREAS  EQU   038                 INVALID REASON CODE                          
UPLDSKD  EQU   039                 UPLOAD ERROR - ROT* AND SKD*                 
OVERWERR EQU   040                 CANNOT WRITE OVER EXISTING LINE              
REPPKERR EQU   041                 CANNOT REPLACE BUY LINE IN PACKAGE           
REPBPERR EQU   042                 CANNOT REPLACE BUY W BILLS/PAYS              
REPMTERR EQU   043                 CANNOT REPLACE BUY W MATCHED SPOTS           
REPMSERR EQU   044                 CANNOT REPLACE BUY W MADE-GOOD SPOTS         
REPMGERR EQU   045                 CANNOT REPLACE MAKEGOOD BUY LINE             
PAIDERR  EQU   046                 CANNOT MOVE PAID BUY                         
PCKGERR  EQU   047                 CANNOT MOVE PACKAGE BUY                      
INVESTDT EQU   048                 INVALID ESTIMATE DATES                       
DEMOMAT  EQU   049                 DEMOS DON'T MATCH                            
ESTFLTER EQU   050                 ESTIMATE FILTERS DONT MATCH F0 PROF          
COST2ERR EQU   051                 SECOND COST NOT VALID                        
NEWERRS  EQU   052                 2 CHAR ERROR NUMBER                          
NOTFOUND EQU   053                 RECORD NOT FOUND                             
INVF94   EQU   054                 ARBF94 OPTION SHOULD BE N OR A               
CANTUNLK EQU   055                 UNABLE TO UNLOCK OLD DATE/TIME               
NOMGRREC EQU   056                 UNABLE TO FIND MGREQ RECORD                  
INFRESP  EQU   057                 RESPONSES PRIOR TO BUY DATE                  
INVMGCD  EQU   058                 INVALID MAKEGOOD CODE                        
NOTSAME  EQU   061                 BUY NETWORK NOT SAME AS CURRENT              
INVPTNR  EQU   062                 PARTNER ENTRY NOT VALID                      
PTNRMAX  EQU   063                 PARTNER SECS EXCEED SPOTLENGTH               
PTNRLEN  EQU   064                 P/B LENGTHS NOT VALID SLNS                   
PTNRDTS  EQU   065                 BUY PERIOD NOT IN PARTNER EST                
NORECS   EQU   066                 NO RECORDS ON FILE                           
MATCHED  EQU   067                 BUY HAS BEEN MATCHED - NO CHANGE             
MADEGOOD EQU   068                 MG ON NEW LINE - NO CHANGE                   
BLLDPAID EQU   069                 BUY HAS BEEN BILLED OR PAID - NO CHG         
NORECALL EQU   070                 NO LINE RECALLED                             
TRCDERR  EQU   071                 INVALID TRANSACTION CODE                     
BADKEYWD EQU   072                 INVALID OR DUPLICATE KEYWORD                 
PRDERR   EQU   073                 INVALID PRODUCT                              
INVDATE  EQU   074                 INVALID DATE                                 
INVBRPOL EQU   075                 INVALID BRAND POOL BUYING FUNCTION           
NOBOOK   EQU   076                 RATING BOOK NOT ON FILE                      
BADRTGSV EQU   077                 NO RATING SERVICE AUTH                       
ODDSECS  EQU   078                 CANNOT SPLIT SECONDS EVENLY                  
ALLOCTOT EQU   079                                                              
STENDERR EQU   080                 START DATE AFTER END DATE                    
REFERR   EQU   081                 INVALID REFERENCE LINE                       
MGDTERR  EQU   082                 MAKE-GOOD DATE NOT VALID                     
MGSPTNUM EQU   083                 INVALID MG SPOT NUM                          
BOOKERR  EQU   084                 INVALID RATING BOOK                          
CMREFERR EQU   085                 INVALID COMMENT NUM                          
BADBRDEM EQU   086                 BRAND DEMO NOT IN POL DEMO LIST              
REPERR   EQU   087                 INVALID REP NUM                              
MULTCHG  EQU   088                 ONLY ONE DATA FIELD CHANGE PER LINE          
NOSTPROF EQU   089                 MISSISNG ST PROFILE                          
PKGMSTR  EQU   090                 CANNOT DELETE PKG/REF MASTER                 
XRTRERR  EQU   091                 EXCHANGE RATE RECORD MISSING                 
INVACTN  EQU   092                 INVALID TRANSACTION CODE                     
NEGSPOTS EQU   093                 CHANGE CAUSES NEGATIVE SPOTS                 
NOTREFD  EQU   094                 LINE IS NOT A REV OR PKG LINE                
TAXERR   EQU   095                                                              
BADOTO   EQU   096                 OTO MUST BE + OR -                           
BADOPOL  EQU   097                 POL +OTO MUST BE ALLOCATED                   
BADOPRD  EQU   098                 BRD POL ALLOC MUST BE MASPRD                 
BADONUM  EQU   099                 POL OTO FORMATS  +JAN01XXX, -4AN01-1         
BADSPOT  EQU   100                 SPOT REFERENCED NOT FOUND                    
BADOREG  EQU   101                 NON-POL OTO EXAMPLES  +JAN1, +JAN6*8         
MISSED   EQU   102                 CANNOT RE-ALLOCATE MISSED SPOT               
BADMGPER EQU   103                 MAKEGOOD CAN BE ONE SPOT ONLY                
NOCOSTOR EQU   104                 MAY NOT ENTER COST OVRD THIS SPOT            
NOMASPKG EQU   105                 MAY NOT CHANGE REF ON MASTER LINE            
NOCHGMG  EQU   106                 MAY NOT CHANGE REF TYPE OF MG LINE           
NOTACHG  EQU   107                 NEW REF LINE IS OLD REF LINE                 
NOMGPKG  EQU   108                 MAY NOT PACKAGE MAKEGOOD MASTER              
MAXELEMS EQU   109                 TOO MANY SPOTS THIS BUY LINE                 
DSPCMNT  EQU   110                 MUST DISPLAY COMMENT BEFORE CHANGE           
HUTERR   EQU   111                 INVALID ADJ MONTH                            
ALLOCOTO EQU   112                 MAY NOT UNALL OR HIAT +OTO OR MG             
MAXOVRD  EQU   113                 MAX COST OVRD IS C. $167000                  
NOCHGREF EQU   114                 CANT CHANGE REF TYPE                         
NOMGUNAL EQU   115                 NO MAKE-GOOD TO UNALL OR HIATUS SPOT         
BADMEQL  EQU   116                 INVALID USE OF M = FUNCTION                  
NOCOPYPB EQU   117                 CANNOT COPY NON-POL P/B TO NEW EST           
NONPOLMG EQU   118                 NO NON-POL MAKE-GOODS                        
CPYEXMPL EQU   119                 COPY FMT IS (STA,EST,LIN),M=..,DEM=          
BADMAS   EQU   120                 INVALID MASTER PRODUCT                       
STAERR   EQU   121                 STATION NOT VALID                            
ESTERR   EQU   122                 ESTIMATE NOT VALID                           
LINERR   EQU   123                 LINE NUMBER NOT VALID                        
POLESERR EQU   124                 NO NON-POOL BUYS ON POOL EST                 
BRPOLERR EQU   125                 NO POOL EST OPEN FOR BRD POOL CLT            
BADLINE  EQU   126                 INVALID LINE NUMER                           
BADOPTN  EQU   127                 INVALID RECALL OPTION                        
BADFLTR  EQU   128                 INVALID FILTER OPTION                        
DAYERR   EQU   129                 DAY(S) ENTRY NOT VALID                       
ROTATERR EQU   130                 OUT OF WEEK ROTATORS                         
STDTERR  EQU   131                 START DATE AND DAY OF WEEK NOT EQ            
ENDDTERR EQU   132                 END DATE AND DAY OF WEEK NOT EQ              
NOELEMS  EQU   133                 NO SPOTS IN DISPLAY PERIOD                   
NPWERR   EQU   134                 NUMBER PER WEEK ENTRY NOT VALID              
TIMERR   EQU   135                 TIME ENTRY NOT VALID                         
PGMERR   EQU   136                 PROGRAM ENTRY NOT VALID                      
ADJERR   EQU   137                 ADJACENCY CODE NOT VALID                     
COSTERR  EQU   138                 COST ENTRY NOT VALID                         
MAXCOST  EQU   139                 COST FIELD EXCEEDS MAXIMUM VALUE             
CPCOSERR EQU   140                 CLT PROFILE COST TYPE NOT VALID              
MAXDEMS  EQU   141                 TOO MANY DEMO OVERRIDES                      
MAXLINES EQU   142                 TOO MANY LINES ON STATION/EST                
BADCOMMA EQU   143                 CONTINUATION DATA NOT VALID                  
NOMASPRD EQU   144                 NO MASTER PRODUCT ENTERED                    
MASSPLT  EQU   145                 SUM OF PARTNERS NOT EQUAL SPTLEN             
DEMERR   EQU   146                 INVALID DEMO ENTRY                           
NOPRDEST EQU   147                 BRAND ESTIMATE NOT FOUND                     
NOADJPRF EQU   148                 NO SPOT ADJACENCY PROFILE (AJ)               
NOMDEMOS EQU   149                 NO MORE DEMOS TO DISPLAY                     
DPTERR   EQU   150                 DAYPART NOT VALID                            
SLNERR   EQU   151                 SPOT LENGTH NOT VALID                        
NOTINPER EQU   152                 NO OTO'S OUTSIDE BUY DESC DATES              
MASNOTEQ EQU   153                 BUY LINE HAS DIFFERENT MASPRD                
NODELMG  EQU   154                 CANNOT DELETE MG LINE                        
ESPERERR EQU   155                 BUY PERIOD NOT IN ESTIMATE PERIOD            
NOALLHIA EQU   156                 M=HIAT IS INVALID WITHOUT DATES              
BADPCTCH EQU   157                 FORMAT IS DEMPCT=+10 OR DEM%=-25             
WRPKGREP EQU   158                 MSTR/SLV LINES MUST HAVE SAME REP            
ESTLOCK  EQU   159                 ESTHDR LOCKED - NO INPUT ALLOWED             
BADNEQ   EQU   160                 N= MUST SPECIFY 1-9 COPIES                   
BADCOST  EQU   161                 COST OVERRIDE NOT VALID                      
RGNERR   EQU   162                 MARKET NOT IN ALL RGNS/DISTRICTS             
NOCOSHIA EQU   163                 NO COST OVERRIDE ON HIATUS SPOT              
NORCLINV EQU   164                 LAST ACTION NOT INVOICE DATA DISPLAY         
NEEDMON  EQU   165                 AFFID REQUIRES MONTH                         
RGNNOTEQ EQU   166                 BUY LINE HAS DIFFERENT REGION CODE           
NOTPOL   EQU   167                 CANAD TV/NTWK MUST BUY POL                   
NTWKPCTS EQU   168                 NETWRK PERCENTS DO NOT SUM TO 100            
NOSTATNS EQU   169                 NO STATIONS IN REGION                        
TIMNOTEQ EQU   170                 TIME DOES NOT AGREE WITH PGM REC             
DAYNOTEQ EQU   171                 DAY DOES NOT AGREE WITH PGM REC              
PGMNOTFD EQU   172                 PROGRAM REC NOT FOUND                        
NOSPLL   EQU   173                 SPILL MARKET NOT IN BUYREC                   
NOTNETWK EQU   174                 NOT A NETWORK BUY - NO STATION LIST          
MAXSZERR EQU   175                 MAXIMUM REC SIZE EXCEEDED                    
CPYSPLL  EQU   176                 CANNOT COPY SPILL DEMOS TO NEW STA           
NODAYCHG EQU   177                 CNAT CHANGE DAY ON CANAD NTWK SHOW           
SCRTYERR EQU   178                 ACCESS TO THIS CLIENT NOT AUTH               
NOHUTREC EQU   179                 NO HUT RECORD                                
NOPKGREF EQU   180                 NO C,PKG=                                    
DPTNOTEQ EQU   181                 DPT NOT SAME AS PKG MSTR                     
CANTSKED EQU   182                 SKED ONLY WEEKLY ROTATORS                    
SKEDERR  EQU   183                 SKED DATA NOT VALID                          
NOSKEDWK EQU   184                 SKED WEEK NOT IN BUY                         
NOPBPKG  EQU   185                 PACKAGE LINES MUST HAVE SAME PTNRS           
PKGLOCK  EQU   186                 PACKAGE IS LOCKED - NO CHANGES               
PKGFRZN  EQU   187                 PACKAGE IS FROZEN                            
NOMKTACC EQU   188                 ACCESS TO MKT NOT AUTH                       
NNETMSTR EQU   189                 NOT NETPAK PKG MSTR BUY                      
NOSTATCH EQU   190                 NEW STATUS IS OLD STATUS                     
NOCCUSA  EQU   191                 CCUSA SYSTEM NOT OPERATIONAL                 
BADSTAT  EQU   192                 INVALID STATUS OPTION                        
NOTINPKG EQU   193                 STARTING LINE NOT IN PACKAGE                 
NOTMSTR  EQU   194                 LINE NOT A PACKAGE MASTER LINE               
NOCHGPCD EQU   195                 CANT CHANGE NETPAK PROGRAM CODE              
SHOWKLLD EQU   196                 BUY START AFTER KILL DATE                    
BADPCTG  EQU   197                 PERCENTAGE NOT VALID                         
NOTINBUY EQU   198                 DATA  NOT IN BUYREC                          
BADHUT   EQU   199                 HUT NOT VALID                                
BADHPCT  EQU   200                 HUT PCT CHANGE FORMAT IS +25 OR -50          
ORBDROP  EQU   201                 FEWER ORBIT ENTRIES THAN BEFORE              
NORCLINT EQU   202                 LAST ACTION NOT LI=N+G                       
NORCLFLM EQU   203                 LAST ACTION NOT LI=N+F                       
NOFILM   EQU   204                 FILM RECORD NOT FOUND                        
FLMPRERR EQU   205                 MUST HAVE 1 FILM PER PRD                     
NO2FOR1  EQU   206                 NO 2 FOR 1 MAKEGOODS                         
NODELIND EQU   207                 INDIRECT PKG REF - NO DELETE                 
NOMALLO  EQU   208                 NO MASTER ALLOC FOR NETPAK MG'S              
NOIDERR  EQU   209                 ID IS REQUIRED                               
BADIDERR EQU   210                 ID SHOULD BE 1-12 CHARS                      
NOMTCHID EQU   211                 BUY LINES HAVE DIFFERENT ID'S                
BADSLVID EQU   212                 CANT CHANGE ID OF PKG SLAVE                  
NONETFND EQU   213                 NETWORK NOT FOUND                            
NOAFFL   EQU   214                 NO AFFILIATE IN STATN MASTER REC             
NORCLNTI EQU   215                 LAST RECALL NOT NTI CODES                    
NONTCD   EQU   216                 NO NETWORK CODE ON BUY-LINE                  
NORCLHMS EQU   217                 LAST RECALL NOT HMS OVRDS                    
SAMEREF  EQU   218                 SAME MAKE-GOOD REFERENCE                     
BADESTRQ EQU   219                 NOT A VALID ESTIMATE SERIES                  
BADESTDT EQU   220                 ESTIMATES HAVE DIFFERENT DATES               
NORCLSCH EQU   221                 LAST RECALL NOT SCHEDULE                     
NORCLDSK EQU   222                 LAST RECALL NOT DAILY SCHEDULE               
DSKEDOTO EQU   223                 DAILY SKED OTO MUST BE IN ROTATION           
DSKEDNG  EQU   224                 CAN'T DISPLAY-SPOTS OUTSIDE BUY PER          
SDNEQPGM EQU   225                 START DATE NOT MONDAY OR PGM DAY             
NOMGALWD EQU   226                 NO MG TO POL NPW BUYS                        
NORCLRSV EQU   227                 RSVP DATA NOT RECALLED                       
RSVPPOL  EQU   228                 RSVP DATA FOR POL BUYS ONLY                  
BADCOPY  EQU   229                 CANT COPY POL TO NON-POL                     
RSVPONLY EQU   230                 RSVP DATA PRESENT - NO AFFID RECALL          
BADMGRP  EQU   231                 MARKET GROUP NOT VALID                       
NOFLTREC EQU   232                 NO FLIGHT RECORD FOUND                       
MAXFLT16 EQU   233                 MORE THAN 16 FLIGHTS                         
NOTINFLT EQU   234                 DATE(S) NOT WITHIN ANY FLIGHT                
BADUSSPL EQU   235                 US SPILL FOR SPOT TV ONLY                    
BADFLMTY EQU   236                 INVALID FILM TYPE                            
PAIDOTO  EQU   237                 CAN'T -OTO PAID SPOT                         
UNPDOTO  EQU   238                 CAN'T XOTO UNPAID SPOT                       
BADUPGD  EQU   239                 INVALID UPGRADE DATA                         
NOUPDEMS EQU   240                 NO UPGRADE DEMOS FOUND                       
NOUPOPTS EQU   241                 NO DEFAULT UPGRADE SPECIFIED                 
NODEMREC EQU   242                 NO DEMO OVRD RECORD                          
NOPOLWKS EQU   243                 NO TRUE POL IF CHKNG WKLY GOALS              
DEM2LTTL EQU   244                 DEMO VALUE LESS THAN MINIMUM                 
NOGOALS  EQU   245                 NO GOALS FOR THIS DPT/SLN                    
DPTSLNMX EQU   246                 TOO MANY DPT/SLN 'S FOR TABLE                
MSSNGDPT EQU   247                 BUY DPT NOT IN DPT MENU                      
NOMKTEQU EQU   248                 NO RTG SVC MARKET EQUATE                     
OVERSPL  EQU   249                 TOO MANY SPILL MARKETS                       
BADWEEK  EQU   250                 INVALID HIATUS WEEK NUMBER                   
NOFNACCS EQU   251                 ACCESS TO THIS FUNCTION NOT ALLOWED          
BADINTR  EQU   252                 INVALID CLIENT INTERFACE NUMBER              
NORTGSVC EQU   253                 NO RATING SERVICE AUTHORIZATION              
BADOVRD  EQU   254                 NO MATCH ON ACN/MGR EQUIVALENCE              
NOMGAV   EQU   256                 NO MAKEGOOD CODES AVAILBLE                   
MGTABFUL EQU   257                 MAKEGOOD TABLE FULL                          
DUPMGENT EQU   258                 DUPLICATE MAKEGOOD ENTRIES                   
SPOTMG   EQU   259                 SPOT ALREADY  MADEGOOD                       
SPTALLOC EQU   260                 SPOT MUST BE ALLOCATED                       
MGNTFND  EQU   261                 MAKEGOOD NOT FOUND                           
NOCHMGCD EQU   262                 CAN'T CHANGE MAKEGOOD CODE TO ITSELF         
HAVECNTS EQU   263                 CAN'T -OTO IF INFO COUNTS PRESENT            
LSTMGGRP EQU   264                 CAN'T CHANGE LAST MG OF GROUP                
SPTNOTMG EQU   265                 SPOT HAS NOT BEEN MADEGOOD                   
UNMGLAST EQU   266                 CANNOT UNMAKEGOOD LAST MISSED SPOT           
DELMAX   EQU   267                 CAN ONLY DELETE MAX 24 LINES                 
UPLMINER EQU   268                 MINIO ERROR  IN UPLOAD                       
BADSTA   EQU   269                 INVALID STATION                              
NOTVADDS EQU   270                 ADDS TV ORDERS DISABLED                      
MGNOSMRP EQU   271                 MAKEGOOD LINES MUST HAVE SAME REP            
NOTLCLST EQU   272                 NOT FOR NETWORK LOCAL LEVEL STATION          
PBSLNERR EQU   273                 PIGGYBACK LENGTH CANNOT BE SPLIT             
OFFCHANG EQU   274                 OFFER HAS CHANGED - TRY AGAIN                
DATAOFLO EQU   275                 DATA OVERFLOW - CONTACT DDS                  
*                                                                               
DAREFMT  EQU   499                 DARE INPUT FORMAT IS ...                     
NODARBYR EQU   498                 DARE BUYER CODE IS REQUIRED                  
NODARPRD EQU   497                 DARE PRODUCT CODE(S) REQUIRED                
DARELOCK EQU   496                 DARE DATA IS LOCKED                          
PWLOCK   EQU   495                 PW BUY DATA IS LOCKED                        
INVDARPR EQU   494                 INVALID DARE PRODUCT                         
DARPRREQ EQU   493                 DARE PRODUCT CODE(S) REQUIRED                
MGEPRREQ EQU   492                 PRODUCT CODE REQUIRED FOR MGE                
CHGPRGE1 EQU   666                 CAN'T CHANGE LIVE PROGRAM IND (=)            
CHGPRGE2 EQU   667                 CAN'T CHANGE SHOW TO LIVE PROGRAM            
BADPFKEY EQU   668                 INVALID PFKEY                                
BADCONTR EQU   669                 CTA CONTRACT NOT VALID                       
OVERMAX  EQU   670                 RESERVED DOLLARS EXCEED CONT VALUE           
BADGCI   EQU   671                 GCI OUT OF BALANCE - THEY MUST FIX           
NOACCCON EQU   672                 NO ACC CONTRACT ON FILE                      
NOCTAID  EQU   674                 CAN'T DO ID= FOR NON-TRADE BUYS              
NOCHGID  EQU   675                 TRADE BUY IS PAID - CAN'T CHANGE ID          
NODELID  EQU   676                 CAN'T REMOVE ID FROM TRADE BUY               
NOMGRID  EQU   677                 CAN'T USE IDR FEATURE UNLESS MKTGRPS         
BADMGRID EQU   678                 BAD ID ELEMENT IN BUY RECORD                 
BADIDR   EQU   679                 ID REFERENCE DATA IS INVALID                 
NOCLTREC EQU   680                 CLIENT NOT FOUND                             
NOPRDREC EQU   681                                                              
NOESTREC EQU   682                                                              
NOSTAREC EQU   683                                                              
NOMKTREC EQU   684                                                              
SPACNER1 EQU   701                 INVALID INTERFACE NUMBER                     
SPACNER2 EQU   702                 INVALID ACN NUMBER                           
SPACNER3 EQU   703                 ACC SYSTEM NOT OPERATIONAL                   
SPACNER4 EQU   704                 VEHICLE NOT VALID ON 3M LEDGER               
SPACNER5 EQU   705                 NO ACN ON VEHICLE (SE)                       
SPACNER6 EQU   706                 INVALID ACN/AGENCY PAIR                      
SPACNER7 EQU   707                 SPARE                                        
SPACNER8 EQU   708                 SPARE                                        
SPACNER9 EQU   709                 SPARE                                        
INVWRKNO EQU   720                 INVALID WORKER FILE NUMBER                   
BADFRRDR EQU   721                 FREE RIDERS FOR PIGGYBACKS ONLY              
NOTTRADE EQU   722                 TRADE PRODUCTS MUST END IN 'T'               
RTGBKNA  EQU   723                 RATING BOOK NOT AUTHORIZED                   
NOMASREC EQU   724                 MISSING STATION MASTER RECORD                
HOWTODEL EQU   725                 ENTER DD, DEL, OR DM TO DELETE               
JAN01ISA EQU   726                 HARD CODED IN SPBUY10 !                      
BADDSKED EQU   727                 HARD CODED IN SPBUY00                        
FLTREQD  EQU   728                 ESTIMATE FLIGHT NUMBER REQD                  
INVFLIGT EQU   729                 INVALID ESTIMATE FLIGHT NUMBER               
FLTREQDD EQU   730                 ESTIMATE FLIGHT NUMBER REQD (DD##)           
NOMKTOV  EQU   731                 MARKET OVERRIDE BUY NOT ALLOWED              
ACNCHGER EQU   732                 BUY DATES CONFLICT WITH ACN CHANGE           
STANTMKT EQU   733                 STATION NOT IN THIS MARKET                   
STANDHST EQU   734                 BUY HAS SALES TAX AND HST - NO !             
DRMGPNDG EQU   736                 DARE MAKEGOOD PENDING                        
NETNOTON EQU   737                 NETWORK NOT TURNED ON                        
AINTNONE EQU   738                 NO NETWORK BUYS THIS STATION                 
ZEROMKT  EQU   739                 CANNOT BUY FOR MARKET 0000                   
DOVERR   EQU   740                 FIX DEMO OVERRIDE RECORD                     
UNREF1ST EQU   741                 UNREF PACKAGE BEFORE DELETE BUY              
NOMISSED EQU   742                 CAN'T FIND MISSED SPOT                       
NOUPDTNG EQU   743                 CAN'T CONTINUE NOT UPDATING (DARE)           
BADIDREC EQU   744                 ID RECORD PROBLEM (DARE)                     
NOPWPOL  EQU   745                 PW CLIENT CANNOT DO PRD=POL                  
CLTFRZN  EQU   747                 CLT FROZEN- NO NEW SPOTS                     
OUTOFEST EQU   748                 SPOTS OUT OF EST PERIOD                      
OUTOFWK  EQU   749                 SPOTS OUT OF BDCST WEEK                      
OUTOFTIM EQU   750                 CAN'T CHANGE TIME ON LOCAL STA               
BADSPLDT EQU   751                 INVALID SPLIT DATE                           
BADSPLNO EQU   752                 INVALID SPLIT SPOT NUMBER                    
BADSPLT1 EQU   753                 NO SPOTS IN OLD BUY                          
BADSPLT2 EQU   754                 NO SPOTS IN NEW BUY                          
BADSPLT3 EQU   755                 CAN'T MOVE DARE MG TO NEW BUYLINE            
FLTLCKD  EQU   756                 SPOT IS IN A LOCKED PERIOD                   
ONLY1SLN EQU   757                 ONLY ONE SLN ALLOWED - GUESS AGAIN           
LKUPERR  EQU   758                 DEMO LOOKUP ERROR - CALL DDS                 
USECASH  EQU   759                 CANNOT BUY UNDER TRADE PRODUCT               
NOSPLIT  EQU   761                 CANNOT SPLIT NETWORK BUYS                    
MSMGSTAS EQU   762                 MISSED/MG LINES NOT SAME STATIONS            
NOGLWK   EQU   763                 NO GOALS FOR WEEK OF &1                      
CANTRMVE EQU   764                 CAN'T REMOVE SPOTS FROM WEEK OF ...          
NOTENUF  EQU   765                 NOT ENOUGH UNPAID SPOTS TO CHANGE            
REGELPD  EQU   766                                                              
REGELMAT EQU   767                                                              
NOCBLNET EQU   768                                                              
DATALOCK EQU   769                 DATA LOCKED FOR OFFLINE PROCESSING           
BADSPOT2 EQU   770                 SPOT REFERENCED NOT FOUND &T                 
NONETCPY EQU   771                 CANNOT COPY NETWORK BUYS IDIOT               
CHGIDPD  EQU   772                 PAID - NO ID CHANGE                          
CHGIDMAT EQU   773                 MATCHED - NO ID CHANGE                       
TABLFULL EQU   774                 TOO MANY SPOTS IN MAKEGOOD TABLE             
C2LOCK   EQU   775                 C2 BUY DATA IS LOCKED                        
NOC2CHG  EQU   776                 CANNOT CHANGE COST2 FACTOR                   
NOROUTE  EQU   777                 MISSING ROUTING CODE IN IDI RECORD           
NOTMRKED EQU   778                 AT LEAST ONE MISSED SPOT NOT MARKED          
NOTMGE   EQU   779                 INPUT SHOULD BEGIN WITH MGE OR *MGE          
NOTAPRJ  EQU   780                 INPUT SHOULD BE MGEAPP OR MGEREJ             
BADFLITE EQU   781                 FLIGHT IS NOT VALID                          
BADGROUP EQU   782                 MAKEGOOD GROUP NOT VALID                     
BADMGPRD EQU   783                 MAKEGOOD PRODUCT NOT VALID                   
BADMGPR2 EQU   784                 MAKEGOOD PARTNER NOT VALID                   
NOORDER  EQU   785                 CAN'T FIND THIS ORDER                        
NOXMTEL  EQU   786                 MISSING DARE XMT ELEMENT                     
NEEDRJCM EQU   787                 NEED A REJECTION COMMENT                     
NOTXPCTD EQU   788                 UNEXPECTED INPUT                             
ALRDYAPP EQU   789                 ALREADY APPROVED                             
ALRDYOK  EQU   790                 ALREADY OKAYED                               
ALRDYREJ EQU   791                 ALREADY REJECTED                             
BADMGEPF EQU   792                 UNEXPECTED PFKEY                             
BADSEL   EQU   793                 UNEXPECTED SELECT CODE                       
BADINPUT EQU   794                 UNEXPECTED INPUT                             
BADREPCD EQU   795                 MISS SPTS HAVE MULTI-REPCODES, RJCT          
BADORDER EQU   796                 ORDER RECORD NOT FOUND                       
DELPDINV EQU   797                 CAN'T DELETE PAID INV                        
BADMSSD  EQU   798                 MISSED SPOT NOT FOUND                        
BADDPT   EQU   799                 NOT ALL OFFERS HAVE DAYPARTS                 
BADSPTS  EQU   800                 SOME OFFERS HAVE > 169 SPOTS                 
TOOMUCH  EQU   801                 TOO MUCH MAKEGOOD DATA                       
NOCHNGS  EQU   802                 YOU NEED TO CHANGE AT LEAST 1 FIELD          
NXPLERR  EQU   803                 NXPLOD=LINE,LINE                             
NOREJCOM EQU   804                 MUST ENTER COMMENT TO REJECT                 
BADRSN   EQU   805                 REASON CODE NOT VALID                        
NORSNTXT EQU   806                 REASON TEXT IS REQUIRED                      
NORSN    EQU   807                 REASON CODE REQUIRED FOR CHANGE              
RCTXTERR EQU   808                 REASON CODE TEXT IS TOO LONG                 
NODELLK  EQU   809                 CANNOT DELETE - LOCKED BUYS EXIST            
NORSNCOD EQU   810                 NEED A REASON CODE TO DO THIS                
NODPTSPL EQU   811                 DPT SUMMARY SPILL NOT SUPPORTED              
BADPURP  EQU   812                 PURPOSE CODE NOT VALID                       
CANTDOID EQU   813                 CAN'T USE ID= IF PURPOSE CODES REQ           
NOPURCOD EQU   814                 NEED A PURPOSE CODE TO DO THIS               
PURCODNF EQU   815                 PURPOSE CODE NOT FOUND                       
NOPUROPT EQU   816                 OPTION TO USE PURPOSE CODES OFF              
APPRJERR EQU   817                 APPROVE/REJECT ONLY IF NEW/AMENDED           
ACCPTERR EQU   818                 ACCEPT ONLY IF HOLD OR TOBEOK                
UNPNDERR EQU   819                 CAN'T UNPEND IN THIS ORDER STATUS            
MGCHGERR EQU   820                 CAN CHANGE ONLY IF NEW OR AMENDED            
MGPURPNE EQU   821                 MSSD PURP CODE NOT SAME AS MKGD              
BADMGGRP EQU   822                 CAN'T FIND THIS MAKEGOOD GROUP               
NOHIST   EQU   823                 NO HISTORY RECORD EXISTS                     
NOCSHTRD EQU   824                 USE /C OR /T FOR CASH/TRADE ORDER            
NOTRDORD EQU   825                 DO NOT SPECIFY /C OR /T THIS ORDER           
NODPTMNU EQU   827                 MISSING DAYPART MENU                         
NETCHGD  EQU   828                 STATION NOT IN OLD NTWK                      
TSAROVFL EQU   829                 TSAR OVERFLOW                                
NOSORT   EQU   830                 NO SORT SEQUENCE                             
BADSORT  EQU   831                 BAD SORT SEQUENCE                            
DUPSORT  EQU   832                 DUPLICATE SORT ENTRY                         
BADSTART EQU   833                 BAD LINE NUMBER                              
NOBUYS   EQU   834                 NO BUYS TO DISPLAY                           
BADFILT  EQU   835                 FILTER NOT AVAILABLE                         
ONLYMGE  EQU   836                 ACTION ONLY AVAILABLE FROM MGE SCRN          
WHATNET  EQU   837                 NEED TO SAY WHAT NETWORK                     
CBLNETNF EQU   838                 CAN'T FIND THIS CABLE NETWORK                
NOTCABLE EQU   839                 ONLY CABLE NETWORKS CAN HAVE /MKT            
NOCBLMKT EQU   840                 MARKET NOT IN CBLDEF                         
MSSNGSTA EQU   841                 STATION NOT IN NETWORK ANYMORE               
AUTORCL  EQU   842                 HIT PF2 FOR AUTO RECALL                      
ADDBYCOM EQU   843                 HIT PF10 TO ADD BUYER COMMENTS               
BADRCLPF EQU   844                 THAT PFKEY ISN'T VALID                       
MISSPURP EQU   845                 MSSD BUYS HAVE DFFRNT PURP CODES             
MKGDPURP EQU   846                 MKGD HAS DIFF PURP CODE THAN MSSD            
MISSDEMO EQU   847                 MISSING DEMO VALUES                          
BADMVLIN EQU   901                 INVALID STARTING MOVE LINE NUMBER            
NOMVBUYS EQU   902                 NO BUYS TO MOVE                              
BADMVCLT EQU   903                 MOVE TO CLIENT NOT VALID                     
MVCLTNF  EQU   904                 MOVE TO CLIENT NOT FOUND                     
BADMVPRD EQU   905                 MOVE TO PRODUCT NOT VALID                    
MVPRDNF  EQU   906                 MOVE TO PRODUCT NOT FOUND                    
BADMVEST EQU   907                 MOVE TO ESTIMATE NOT VALID                   
MVESTNF  EQU   908                 MOVE TO ESTIMATE NOT FOUND                   
MVLSTMAX EQU   909                 TOO MANY MOVELIST ENTRIES                    
MVDTERR  EQU   910                 MOVE EST DATES MUST OVERLAP                  
MVCPEERR EQU   911                 MOVE TO CLT/EST CANNOT BE SAME               
MVSKDERR EQU   912                 INVALID SKED DATA FOR MOVE                   
MVNOSPTS EQU   913                 NOT ENOUGH SPOTS TO MOVE                     
NOMOVEFR EQU   914                 CANNOT MOVE FROM THIS LINE                   
BADMVFMT EQU   915                 INPUT SHOULD BE MOVE,CL/PR/ES,...            
DIFFDAYS EQU   916                 FROM/TO BUYS ARE DIFFERENT DAYS              
OUTOFBUY EQU   917                 SPOTS OUTSIDE BUY DESC PERIOD                
BADCRSR  EQU   918                 POSN CURSOR TO MOVE TO LINE                  
NOREASON EQU   919                 NO REASON CODE SHOULD BE ENTERED             
NOMSSDEM EQU   920                 NO MISSED DEMOS TO SPLIT                     
BADDMPCT EQU   921                 DEMO PERCENTAGE NOT VALID                    
DIFFTIME EQU   922                 FROM/TO BUYS ARE DIFF TIMES                  
SPODBAD  EQU   923                 SPOD INPUT NOT VALID NUMERIC                 
SOFBDP   EQU   924                 SPOTS OUTSIDE BUY DESC PERIOD                
NOMVUNPD EQU   925                 CAN'T MOVE UNPAID SPOTS HERE                 
NOMVPAID EQU   926                 CAN'T MOVE PAID SPOTS HERE                   
NOBUYER  EQU   927                 CAN'T FIND THIS BUYER                        
NONPWCHG EQU   928                 CAN'T CHANGE NPW - SPODS IN BUY              
BADSPOD  EQU   929                 SPODS NOT SLN MULTIPLE                       
NOSLNCHG EQU   930                 CAN'T CHANGE SLN - SPODS IN BUY              
BADSKED  EQU   931                 BAD SCHEDULE DATA IN BUY                     
NONETCBL EQU   933                 NO NET= OPT FOR SPECIALTY CABLE              
MNTHPAID EQU   934                 CLEARED SPOTS IN OFFER MONTH                 
BADRCL   EQU   935                 INVALID RECALL OPTION                        
LKDOLREQ EQU   936                 LOCKIN DOLLARS REQUIRED                      
LKDEMREQ EQU   937                 LOCKIN POINTS REQUIRED                       
LKBRDMON EQU   938                 BROADCAST MONTH NOT VALID                    
NOT1MON  EQU   939                 BUY IS NOT IN ONE BROADCAST MONTH            
NORCLSTA EQU   941                 CAN'T FIND STARTING STATION                  
RECISDEL EQU   942                 RECORD IS DELETED                            
SPLTPKG  EQU   943                 PLEASE REMOVE PKG REF BEFORE SPLIT           
NOBUYMAS EQU   944                 CAN'T BUY ON CSO MASTER EST                  
NONEWORB EQU   945                 CAN'T ADD ORBIT NOT SENT BY REP              
ORBPRG7  EQU   946                 ORBIT PROGRAM LIMIT 7 CHARS                  
NOORBCHG EQU   947                 CAN'T CHANGE ORBIT DAYS/TIMES                
NOPCTCHG EQU   948                 CAN'T CHANGE PCTS IF COST OVRDS              
ONLY1AMT EQU   949                 ONLY ONE COST OVRD AMT PER TRANS             
NOTFOR2  EQU   950                 CAN'T DO FOR EXTENDED BUY NUMBERS            
DARMGERR EQU   999                 DARE MAKEGOOD PROCESSING ERROR               
ONLY1PST EQU   1361                ONLY ONE PST VALUE ALLOWED                   
STALCKED EQU   1362                NO NEW BUYS! VENDOR IS LOCKED                
NOPGPROF EQU   1363                CAN'T FIND PG PROFILE FOR THIS YEAR          
NOPGGOAL EQU   1364                NO GOALS FOR THIS PRD/SLN/WEEK               
LOSTCNTS EQU   1365                CENTS ON COST WILL GO AWAY                   
COSTSIGN EQU   1366                COST AND COST2 MUST HAVE SAME SIGN           
PGMGUNAL EQU   1367                MAKEGOOD SPOT UNALLOCATED                    
NOSTAINP EQU   1368                DON'T ENTER STATION                          
ZWMGOFFR EQU   1369                ZERO WEEK MAKEGOOD OFFER IS INVALID          
LASTERR  EQU   *                   PROVIDE TSO SEARCH ARG                       
           EJECT                                                                
* EQUATES FOR BUY DESC EDIT VALUES                                              
*                                                                               
PEREDT   EQU   X'00'                                                            
NPWEDT   EQU   X'04'                                                            
TIMEDT   EQU   X'08'                                                            
DPTEDT   EQU   X'0C'                                                            
SLNEDT   EQU   X'10'                                                            
PGMEDT   EQU   X'14'                                                            
ADJEDT   EQU   X'18'                                                            
COSTEDT  EQU   X'1C'                                                            
DEMEDT   EQU   X'20'                                                            
PTNREDT  EQU   X'24'                                                            
REFEDT   EQU   X'28'                                                            
ALLOEDT  EQU   X'2C'                                                            
DAYEDT   EQU   X'30'                                                            
ORBEDT   EQU   X'34'                                                            
CFMEDT   EQU   X'38'                                                            
BOOKEDT  EQU   X'3C'                                                            
ELDTEDT  EQU   X'40'                                                            
COMEDT   EQU   X'44'                                                            
REPEDT   EQU   X'48'                                                            
TAXEDT   EQU   X'4C'                                                            
PCDEDT   EQU   X'50'                                                            
SKEDEDT  EQU   X'54'                                                            
FLMEDT   EQU   X'78'                                                            
UPEDT    EQU   X'8C'                                                            
LKUPEDT  EQU   X'90'                                                            
CTYPEDT  EQU   X'94'                                                            
STYPEDT  EQU   X'98'                                                            
C58EDT   EQU   X'9C'                                                            
XRTEDT   EQU   X'A0'                                                            
DSKEDT   EQU   X'A4'                                                            
SPCTEDT  EQU   X'A8'                                                            
SDTEDT   EQU   X'AC'               EXPL STAT DAYS/TIMES                         
CUTEDT   EQU   X'B0'               CANNET CUT-INS                               
UPIDEDT  EQU   X'B4'               UPLOAD UNIQUE BUY ID                         
COS2EDT  EQU   X'B8'               COST 2 EDIT                                  
         EJECT                                                                  
*=======================================================*                       
* EQUATES FOR DISPLAY OPTIONS                           *                       
* THESE VALUES APPEAR IN AT LEAST TWO TABLES            *                       
* ONE IN SPBUY00 AND ONE IN SPBUY20 (RCLTAB)            *                       
*=======================================================*                       
         SPACE 1                                                                
RCLROT   EQU   01                                                               
RCLPAY   EQU   02                                                               
RCLPAYDT EQU   03                                                               
RCLINV   EQU   04                                                               
RCLREF   EQU   05                                                               
RCLCOM   EQU   06                                                               
RCLDEM   EQU   07                                                               
RCLACTV  EQU   08                                                               
RCLORB   EQU   09                                                               
RCLSPILL EQU   10                                                               
RCLSTA   EQU   11                                                               
RCLHUT   EQU   12                                                               
RCLPCD   EQU   13                                                               
RCLINT   EQU   14                                                               
RCLINTX  EQU   15                                                               
RCLFLM   EQU   16                                                               
RCLSCH   EQU   19                                                               
RCLRSVP  EQU   21                                                               
RCLDEMS  EQU   22                                                               
RCLPDEM  EQU   23                                                               
RCLPDEMX EQU   24                                                               
RCLXCH   EQU   25                                                               
RCLDSK   EQU   26                                                               
RCLDROT  EQU   26                                                               
RCLNET   EQU   27                                                               
RCLDT    EQU   28                                                               
RCLCUT   EQU   29                                                               
RCLCLST  EQU   30                                                               
RCLNLST  EQU   31                                                               
RCLZCUT  EQU   32                                                               
RCLHIST  EQU   33                                                               
RCLLKIN  EQU   34                  SPECIAL LCI LOCKIN INPUT                     
RCLMULT  EQU   C'N'                MULTIPLE LINE RECALL                         
RCLSORT  EQU   C'S'                SORTED LINE RECALL                           
RCLAUTA  EQU   C'A'                CAN HIT PF2 TO DO AUTO-RECALL                
RCLAUTB  EQU   C'B'                RETURN FROM AUTO-RECALL PENDING              
         SPACE 1                                                                
*================================================================*              
* ACTION EQUATES FOR 'SECRET' SECURITY CHECKS                    *              
*================================================================*              
         SPACE 1                                                                
SECADD   EQU   22                                                               
SECCOPY  EQU   23                                                               
SECOTO   EQU   24                                                               
SECXOTO  EQU   25                                                               
SECALLO  EQU   26                                                               
SECINV   EQU   27                                                               
SECFILM  EQU   28                                                               
SECDEMOS EQU   29                                                               
SECSKED  EQU   30                                                               
SECCUT   EQU   31                                                               
SECPAYX  EQU   32                                                               
SECSEND  EQU   33                                                               
         SPACE 1                                                                
       ++INCLUDE DDFLDIND                                                       
         EJECT                                                                  
SPBUYWKD DSECT                                                                  
GENOLD   EQU   *                                                                
*                                                                               
BASERB   DS    A                                                                
BASERD   DS    A                                                                
*                                                                               
DMCB     DS    CL24                                                             
*                                                                               
KEY      DS    CL20                                                             
KEYSAVE  DS    CL20                                                             
COMMAND  DS    CL8                                                              
AREC     DS    A                                                                
DMWORK   DS    12D                                                              
DMINBTS  DS    C                                                                
DMOUTBTS DS    C                                                                
BYTE     DS    C                                                                
BYTE2    DS    C                                                                
WORK     DS    CL48                                                             
SPACES   DS    CL80                INITIALIZED TO SPACES                        
WORK2    DS    CL56 <==== NOTE REDEFINED BY SPBUY04 =====> WATCH OUT !          
FULL     DS    F                                                                
DUB      DS    D                                                                
HALF     DS    H                                                                
HALF2    DS    H                                                                
NEWHEADS DS    C                                                                
UPDFLAG  DS    C                   NON-ZERO IF ANY UPDATES                      
AGYALPHA DS    H                                                                
ERRCD    DS    C                                                                
ELCODE   DS    C                                                                
VGOBUY32 DS    A                                                                
VSPAUTH  DS    A                                                                
ERRAREA  DS    A                                                                
*                                                                               
VTWA     DS    A                                                                
VDATAMGR DS    A                                                                
VCALLOV  DS    A                                                                
VCASHVAL DS    A                                                                
VDATVAL  DS    A                                                                
VADDAY   DS    A                                                                
VDTCNV   DS    A                                                                
VGETDAY  DS    A                                                                
VRECUP   DS    A                                                                
VGETMSG  DS    A                                                                
VDATCON  DS    A                                                                
VSCANNER DS    A                                                                
VGLOBBER DS    A                                                                
VUNTIME  DS    A                                                                
VDAYUNPK DS    A                                                                
MSUNPK   DS    A                                                                
USER15   DS    A                                                                
USER16   DS    A                                                                
USER17   DS    A                                                                
USER18   DS    A                                                                
BASER9   DS    A         *** NOTE T21100 2ND BASE REGISTER ***                  
*                                                                               
ERROR    DS    A                                                                
ANY      DS    A                                                                
MOVE     DS    A                                                                
PACK     DS    A                                                                
*                                                                               
READ     DS    A                                                                
SEQ      DS    A                                                                
HIGH     DS    A                                                                
ADD      DS    A                                                                
DIR      DS    A                                                                
RDSTA    DS    A                                                                
STA      DS    A                                                                
GETREC   DS    A                                                                
PUTREC   DS    A                                                                
ADDREC   DS    A                                                                
FIL      DS    A                                                                
*                                                                               
USER10   DS    A                                                                
USER11   DS    A                                                                
USER12   DS    A                                                                
USER13   DS    A                                                                
USER14   DS    A                                                                
*                                                                               
USER1    DS    A                                                                
USER2    DS    A                                                                
USER3    DS    A                                                                
USER4    DS    A                                                                
USER5    DS    A                                                                
USER6    DS    A                                                                
USER7    DS    A                                                                
USER8    DS    A                                                                
USER9    DS    A                                                                
*                                                                               
FLDVAL   EQU   USER1                                                            
MSPACK   EQU   USER2                                                            
STAPACK  EQU   USER2                                                            
DEMLKUP  EQU   USER3                                                            
CALLEDT  EQU   USER4                                                            
CALLDSP  EQU   USER5                                                            
CALLCHA  EQU   USER6                                                            
SETCHGDT EQU   USER7                                                            
DEMUPGD  EQU   USER8                                                            
RECUP    EQU   USER9                                                            
VGETSPLL EQU   USER10                                                           
VBLDDEM  EQU   USER11                                                           
VBLDEL   EQU   USER12                                                           
MOVEREC  EQU   USER13                                                           
TESTGLS  EQU   USER14                                                           
VBLDQLST EQU   USER15                                                           
CALLADDS EQU   USER16                                                           
CALLSCRT EQU   USER17                                                           
VCHKSLN  EQU   USER18                                                           
         EJECT                                                                  
*                                                                               
* FLDVAL WORK AREA                                                              
*                                                                               
FADDR    DS    A                   FIELD ADDRESS                                
FLAST    DS    A                   LAST FLDHDR THAT MAY BE CONT'D               
FLEN     DS    H                   FIELD LENGTH                                 
FVAL     DS    C                   VALIDATION BITS                              
FSTOP    DS    C                   ACTUAL STOP CHAR (X'FF'=END OF DATA)         
FSTOPS   DS    CL6                 VALID STOP CHARS                             
*                                                                               
SLNTAB   DS    CL20                                                             
ADRSVKEY DS    A                   A(SVKEY)                                     
BUYOVLY  DS    A                                                                
VBUYSAVE DS    A                   A(TWA1 SAVE AREA)                            
VBUYTWA  EQU   VTWA                A(BUYTWA)                                    
VBUYTWAX DS    A                   A(BUYTWA+2304)                               
RESTOROV DS    C                                                                
UPDSW    DS    XL1                                                              
ROTDAYS  DS    H                                                                
ABUYINPH DS    A                                                                
AREC2    DS    A                                                                
AREC3    DS    A                                                                
AREC4    DS    A                                                                
ADBLOCK  DS    A                                                                
AREC1    DS    A                                                                
AREC5    DS    A                                                                
AOVWORK  DS    A                                                                
VDSKED   DS    A                                                                
ASECBLK  DS    A                                                                
VCOMFACS DS    A                                                                
VCLPACK  DS    A                                                                
SVRECUP  DS    A                                                                
ASVNOLD  DS    A                                                                
ASVCLIST DS    A                                                                
AUPLOVLY DS    A                                                                
VTIA     DS    A                                                                
VDEMOVAL DS    A                                                                
VGETBROD DS    A                                                                
VMOBILE  DS    A                                                                
VGETBUY  DS    A                                                                
VTSAR    DS    A                                                                
ASVDARE  DS    A                                                                
VSTAPACK DS    A                                                                
VMONPARM DS    A                   MONITORS CALLING PARMS                       
*                                                                               
         EJECT                                                                  
BUSVSTB  DS    CL3                                                              
BUSVENDB DS    CL3                                                              
BUSVSTP  DS    CL2                                                              
BUSVENDP DS    CL2                                                              
BUSVWKIN DS    CL1                                                              
BUSVDAYS DS    CL1                                                              
TODAYP   DS    XL2                                                              
GLHALF   DS    XL2                                                              
VTIOB    DS    A                   A(TRANSLATOR IO BLOCK)                       
ERRNDX   DS    X                   INDEX INTO ERROR FIELD FOR CURSOR            
*                                  0=CURSOR POSITIONING INACTIVE                
CMPASS   DS    X                   CHANGE MULTIPLE PASS (1 OR 2)                
BUSVSEDY DS    X                                                                
BUSVELDT DS    XL2                                                              
SECREC   DS    XL1                                                              
SECACT   DS    XL2                                                              
NERRCD   DS    XL2                 2 CHAR ERROR CODE                            
SVSTAT   DS    XL1                 STATUS BYTE                                  
SVSTFLSH EQU   X'80'               SIGNED ON VIA FLASHPOINT                     
QLIST    DS    XL32                REQLIST BUILD AREA                           
CHGLIST  DS    F                                                                
CHGADDR  DS    A                                                                
SUBESADR DS    A                   A(CURRENT SUBEST ENTRY)                      
BUTRCODE DS    XL3                                                              
*                                                                               
BUDATA   DS    CL128                                                            
         ORG   BUDATA                                                           
*                                                                               
BUSTART  DS    CL6                 YYMMDD - START                               
BUEND    DS    CL6                 YYMMDD - END                                 
BUSTARTB DS    XL3                 YMD - BINARY                                 
BUENDB   DS    XL3                 YMD - BINARY                                 
BUSTARTP DS    XL2                 YMD - COMPRESSED                             
BUENDP   DS    XL2                 YMD - COMPRESSED                             
BUPERIND DS    XL1                 PERIOD INPUT CODE (1,2,3)                    
BUDAYS   DS    XL1                 DAY BITS (X'40'=M,X'01'=SU) INPT DAY         
BUDAYNUM DS    XL1                 START/END DAYS (4 BITS) INPUT DAY            
BUDAY1IN DS    XL1                 START DAY NUMBER OF INPUT DAY                
BUDAYXIN DS    XL1                 END DAY NUMBER OF INPUT DAY                  
BUDAY1   DS    XL1                 DAY NUMBER OF START DATE                     
BUDAYX   DS    XL1                 DAY NUMBER OF END DATE                       
BUWKIND  DS    XL1                 NON-CONSEC WEEK IND                          
BUWKS    DS    XL1                 NUMBER OF WEEKS (OCCURRENCES)                
*                                                                               
BUNPW    DS    XL1                                                              
BUDPT    DS    XL1                                                              
BUSLN    DS    XL1                                                              
BUTIME   DS    XL4                                                              
BUPROG   DS    CL18                                                             
BUADJ    DS    CL1                                                              
BUCOST   DS    XL3                                                              
BUCIND   DS    XL1                                                              
BUMASPRD DS    XL4                 MASTER PRD CODES/TIME PORTIONS               
BUREP    DS    XL2                                                              
BUBOOK   DS    XL2                                                              
BUCFD    DS    XL1                                                              
BUCIND2  DS    XL1                                                              
BUCHGOV  DS    CL2                                                              
BUDEMSW  DS    C                                                                
DEMLKSW  DS    C                                                                
MAXCOSLN DS    H                                                                
MAXNPW   DS    C                                                                
BUWHY    DS    C                                                                
BUINDREF DS    CL2                                                              
BUHUTADJ DS    C                                                                
BUELEMNO DS    CL1                                                              
BUWHY2   DS    CL1                                                              
PRVTRCD  DS    C                                                                
PRVEND   DS    F                                                                
PRVDSPLN DS    XL2                                                              
PRVROW   DS    XL4                                                              
BUSTAT   DS    CL1                                                              
BUSVMAS  DS    CL2                                                              
BUWHY3   DS    CL1                                                              
BUNTAX   DS    CL2                                                              
BUNEWDEM DS    F                                                                
BUXSW    DS    X                                                                
BUBKTYPE DS    CL1                                                              
BUCOST2  DS    XL4                                                              
BUXTFLAG DS    XL1                                                              
BUDLUSW  DS    XL1                                                              
BUCOS2IND DS    XL1                                                             
         DS    XL1                                                              
*                                                                               
         DS    0H                                                               
BUREF    DS    0XL10                                                            
BUREFDA  DS    XL4                 DISK ADDRESS OF MASTER LINE                  
BUREFMAS DS    XL2                 MASTER LINE REFERENCE                        
BUREFTYP DS    XL1                 REFERENCE TYPE (AS IN PKGELEM)               
BUMGSPOT DS    XL1                 SPOT REF NUM OF SPOT MADE GOOD               
BUMGDATE DS    XL2                 DATE OF SPOT MADE GOOD                       
*                                                                               
BUPSSV   DS    0XL13                                                            
*                                                                               
BUPSVCD  DS    XL1                 PRD CODE                                     
BUPSVEST DS    XL1                 ESTIMATE                                     
BUPSVTIM DS    XL1                 TIME SHARE                                   
BUPSVCOS DS    XL1                 COST SHARE (= TIME SHARE)                    
BUPSVPRD DS    CL3                 PRD MNEMONIC                                 
BUPSVDTS DS    CL6                                                              
*                                                                               
BUACTV   DS    0XL2                                                             
*                                                                               
BUACTTIM DS    XL1                                                              
BUACTCOS DS    XL1                                                              
*                                                                               
         ORG   BUPSSV                                                           
BUORB    DS    0XL13                                                            
BUORBDAY DS    XL1                                                              
BUORBTIM DS    XL4                                                              
BUORBDES DS    XL7                                                              
BUORBDEM DS    XL2                                                              
         ORG                                                                    
*                                                                               
         EJECT                                                                  
BUELDATA DS    0XL12                                                            
BUELDT   DS    XL2                                                              
BUELPRD  DS    XL1                                                              
BUELPR2  DS    XL1                                                              
BUELSEC  DS    XL1                                                              
BUELSEC2 DS    XL1                                                              
BUELPRSW DS    XL1                                                              
BUELNUM  DS    XL1                                                              
BUELNPW  DS    XL1                                                              
BUELCOS  DS    XL3                                                              
*                                                                               
BUDEM    DS    H                                                                
*                                                                               
         ORG                                                                    
PRDLIST  DS    CL128                                                            
*                                                                               
BUEXPDTA DS    0CL40                                                            
BUEXPEL  DS    A                                                                
BUEXPSUB DS    A                                                                
BUEXPKEY DS    XL20                                                             
BUEXPSV  DS    XL4                                                              
BUEXPDAY DS    H                   SIGNED RELATIVE DAY                          
         ORG   PRDLIST                                                          
BUDEMS   DS    CL256                                                            
BUHIATS  DS    XL20                LIST OF HIATUS WEEK NUMBERS                  
BUCUTSTA DS    XL3                 CUT-IN DISPLAY - FIRST STATION               
BUCUTDT  DS    XL2                 CUT-IN DISPLAY - START DATE                  
BUCUTFLG DS    XL1                 CUT-IN DISPLAY FLAG                          
*                                  X'80'= CUT-IN LIST ACTIVE                    
         DS    0H                                                               
BUMGDATA DS    0XL14               WE ALREADY HAVE DATE & SPOT                  
BUMGLINE DS    H                   MG LINE                                      
BUMGDTA  DS    0XL13               DON'T CLEAR LINE NUMBER                      
BUMGMKT  DS    XL2                    MARKET                                    
BUMGSTA  DS    XL3                    STATION                                   
BUMGFLAG DS    XL1                    FLAG                                      
BUMGCODE DS    CL2                    CODE                                      
BUMGBCOD DS    XL1                    BINARY CODE                               
BUMGPRD1 DS    XL1                    PRODUCT 1                                 
BUMGSLN1 DS    XL1                    SLN 1                                     
BUMGPRD2 DS    XL1                    PRODUCT 2                                 
BUMGSLN2 DS    XL1                    SLN 2                                     
*                                                                               
BUMGFLG  DS    CL1                                                              
BUMGCLR EQU    C'C'                                                             
BUMGNEG EQU    C'-'                                                             
*                                                                               
BUYLOW   DS    H                                                                
BUYHI    DS    H                                                                
LINENUM  DS    H                                                                
         DS    XL4                                                              
*                                                                               
BUXDATA  DS    0XL7                                                             
BUXDATE  DS    XL2                 PREVIOUS SPOT DATE                           
BUXTIME  DS    XL4                 PREVIOUS SPOT TIME                           
BUXSEC   DS    XL1                 PREVIOUS SPOTLENGTH                          
*                                                                               
BUESTDAT DS    CL6                 INFOMERCIAL EASTERN STD TIME                 
BUESTTIM DS    XL2                 INFOMERCIAL EASTERN STD DATE                 
BUCTYPE  DS    CL1                 CLIENT COUNTRY C/U                           
BUSTYPE  DS    CL1                 STATION COUNTRY C/U                          
BUXRATE  DS    XL2                 EXCHANGE RATE                                
BUC58TAX DS    XL2                 CANADIAN C58 TAX                             
BUCOSTYP DS    CL1                 COST TYPE                                    
BUDUB    DS    D                                                                
BUDSKED  DS    CL98                DAILY SKED DATA                              
         ORG   BUDSKED                                                          
BUMGCOM  DS    CL50                MAKEGOOD COMMENT - REASON CODE               
BUMGRSCD DS    CL6                 REASON CODE                                  
BUMGRSOF DS    CL1                        OFFICE                                
*                                                                               
BUMVDATA DS    XL7                                                              
         ORG   *-7                                                              
BUMVDATE DS    XL2                                                              
BUMVMKT  DS    XL2                                                              
BUMVSTA  DS    XL3                                                              
         DS    CL34                                                             
*                                                                               
         DS    0F                                                               
BLDLIST  DS    XL44                MAX 5 FIELDS + 4X'00'                        
BLDROW   DS    H                                                                
BLDCOL   DS    H                                                                
*                                                                               
EDTVAL   DS    C                                                                
TWA1FLAG DS    XL1                 NON-ZERO IF TWA1 WRITE REQ'D                 
BUYPRD   DS    XL1                                                              
BUYMKT   DS    XL2                                                              
BUYSTA   DS    XL3                                                              
BUYEST   DS    XL1                                                              
*                                                                               
STDTB    DS    XL3                                                              
ENDDTB   DS    XL3                                                              
STDTP    DS    XL2                                                              
ENDDTP   DS    XL2                                                              
ELCDLO   DS    C                                                                
ELCDHI   DS    C                                                                
ELEMNO   DS    XL1                                                              
ELEMDT   DS    XL2                                                              
DSPCNTR  DS    C                                                                
LDOPT    DS    X                                                                
RCLOPT   DS    C                                                                
DSPOPT   DS    C                                                                
         SPACE 2                                                                
DSPAREA  DS    0CL80                                                            
DSPBIGDT DS    CL3                 FOR POL NPW, EXTRA DATE DSPLY AREA           
DSPDATE  DS    CL9                 +FEB01-01                                    
DSPCOST  DS    CL9                 $99999.99                                    
DSPPRD   DS    CL15                (AAA)-BBB/40-20                              
         DS    CL1                                                              
DSPPBIND DS    CL3                 PBB                                          
         DS    CL1                                                              
DSPPAYDT DS    CL11                PD=MAY15/78                                  
         DS    CL1                                                              
DSPCHECK DS    CL27                                                             
DSPAREAX EQU   *                                                                
         DS    0D                                                               
*                                                                               
ELEM     DS    CL256                                                            
MSTRBUY  DS    CL256               SAVE AREA FOR MSTR EST BUY                   
*                                  USED BY SPBUY30 (MGA)                        
SPLLWRK  EQU   MSTRBUY                                                          
*                                                                               
UPSW     DS    XL1                 UPLOAD SWITCH                                
UPON     EQU   X'80'               UPLOAD ACTIVE                                
UPHDR    EQU   X'40'               PROCESSING HDR OBJECT                        
UPNEWBUY EQU   X'20'               PROCESSING BUY OBJECT                        
UPBADSTA EQU   X'10'               INVALID STATION                              
UPRCL    EQU   X'08'               RECALLING A BUYLINE                          
UPCHA    EQU   X'04'               CHANGING A BUY IN THIS TRANSACTION           
UPORB    EQU   X'02'               ADDING AN ORBIT                              
UPNOERR  EQU   X'01'               NO SPOTS IS NOT AN ERROR                     
UPMODE   DS    XL1                 UPLOAD MODE                                  
UPMINIT  EQU   1                   INITIALIZATION                               
UPMNEXT  EQU   2                   GET NEXT OBJECT                              
UPMERR   EQU   10                  ERROR PROCESSING                             
UPMNSTA  EQU   254                 NEW STATION (RETURNED FROM SPBUYUPL)         
UPMEND   EQU   255                 END OF FILE (RETURNED FROM SPBUYUPL)         
UPNDX    DS    XL1                 OBJECT FIELD INDEX NUMBER                    
UPCURTWA DS    XL1                 CURRENT TEMPSTOR NUMBER                      
UPACUROB DS    A                   A(CURRENT OBJECT)                            
UPANXTBY DS    A                   A(NEXT BUY OBJECT)                           
UPSTART  DS    CL6                 PERIOD START DATE                            
UPEND    DS    CL6                 PERIOD END DATE                              
UPSTDAY  DS    XL1                 START DAY OF WEEK                            
UPPRD2   DS    CL3                 PIGGYBACK PRODUCT                            
UPSVSTA  DS    CL8                 SAVED STATION                                
         DS    XL43                SPARE                                        
UPBYLINE DS    XL2                                                              
UPUID    DS    CL8                 UNIQUE BUY ID                                
UPSTAERR DS    XL1                 STATION ERROR CODE                           
         DS    XL1                                                              
UPCOM    DS    XL1                 COMMENT NUMBER                               
UPACURBY DS    A                   A(CURRENT BUY OBJECT)                        
UPBUYSW  DS    XL1                 BUY SWITCH                                   
UPBCOM   EQU   X'80'               BUY HAS COM* OBJECT                          
UPBSKD   EQU   X'40'               BUY HAS SKD* OBJECT                          
UPBROT   EQU   X'20'               BUY HAS ROT* OBJECT                          
UPBORB   EQU   X'10'               BUY HAS ORB* OBJECT                          
UPBDEM   EQU   X'08'               BUY HAS DEM* OBJECT                          
UPBCOMNX EQU   X'01'               BUY HAS MORE THAN 3 COM* OBJECTS             
UPDATES  DS    XL30                DATES LIST                                   
UPDAY1IN DS    XL1                 START DAY NUMBER OF INPUT DAY                
UPDAYXIN DS    XL1                 END DAY NUMBER OF INPUT DAY                  
UPELSEC  DS    XL1                 SPOT LENGTH 1 FOR PIGGYBACKS                 
UPELSEC2 DS    XL1                 SPOT LENGTH 2 FOR PIGGYBACKS                 
UPDAYS   DS    CL8                 DAYS                                         
UPACTN   DS    CL1                 A=ADD,C=CHANGE                               
UPBUYSW2 DS    XL1                 BUY SWITCH 2                                 
UPBREGEL EQU   X'80'               REGELEMS SUCCESSFULLY ADDED                  
UPBORADD EQU   X'40'               ADDING ORBITS                                
UPORBNDX DS    XL1                 ORBIT INDEX                                  
*                                                                               
DDPRD1   DS    CL1                 DARE DISPLAY PRODUCT 1                       
DDPRD2   DS    CL1                 DARE DISPLAY PRODUCT 2                       
DDSTLIN  DS    XL1                 DARE DISPLAY STARTING LINE NUMBER            
*                                                                               
ERRTEXT  DS    CL7                 ERROR TEXT TO BE APPENDED TO MESSAGE         
AUPLWORK DS    A                                                                
WRKRUPSW DS    XL1                 WORKER STYLE UPLOAD FLAGS                    
WRKRUPSW_NOIO   EQU  X'80'          NO GETREC/PUTREC ON CHANGES                 
WRKRUPSW_NODMER EQU  X'40'          IGNORE DEMO ERRORS                          
WRKRUPSW_NEWDRMG EQU X'04'          NEW SPBUY31/32                              
WRKRUPSW_ISDRMG EQU  X'02'          THIS IS DARE MG                             
WRKRUPSW_ISME   EQU  X'01'          THIS IS A WORKER UPLOAD                     
*                                                                               
DDFLIGHT DS    XL1                 DARE DISPLAY FLIGHT NUMBER                   
ELEMDTX  DS    XL2                                                              
ATESTDAR DS    A                                                                
AGLDATA  DS    A                   FOR TSTGOAL CALL TO BASE                     
ASETSCRN DS    A                   FOR SETSCRN CALL TO BASE                     
*                                  DPT/SLN/PB ACTV LNE                          
LKUPKEY  DS    XL16                LOCKUP KEY                                   
OLDSVKEY DS    XL13                BASE SAVES SVKEY HERE                        
SPLINKSW DS    XL2                 SPLINK INPUT MAP CODE                        
SPDEMTYP DS    CL1                 DEMO TYPE FOR DEMEDT CALL                    
BY39RD   DS    CL4                 T21139'S RD!                                 
CBLFLAG  DS    C                                                                
         DS    CL8                 FOR CANADIAN CABLE                           
PBDFLAG  DS    XL1                 FLAG FOR SPBUY08 PBD                         
SVNDINDX DS    XL1                                                              
LOCKFLAG DS    CL1                 OFFLINE LOCK HAS BEEN CHECKED                
OLDBUYLN DS    XL2                 LENGTH OF BUY ON GETREC                      
*                                                                               
         DS    0H                                                               
BMGEDATA DS    0XL6                                                             
BMGELINE DS    H                   MGE MAKEGOOD BUYLINE NUMBER                  
BMGEMGCD DS    CL2                 MGE MAKEGOOD CODE                            
BMGEERR  DS    XL2                 MGE ERROR                                    
*                                                                               
*                                                                               
VCALLBAS DS    A                                                                
CALLBSRD DS    A                   SAVED RD ON CALLBASE ENTRY                   
AMGWORK  DS    A                   A(MGWORK)                                    
GOGETCTA DS    A  <<==NOT USED==>  ALWAYS 0                                     
ACIBBLK  DS    0AL4                                                             
ABLOCK   DS    A                                                                
VGETCTA  DS    0AL4                                                             
VSPDEMEXT DS   A                   A(SPDEMEXT)                                  
VBLDFLD  DS    A                                                                
*                                                                               
         DS    0F                                                               
REC      DS    6000C                                                            
REC2     DS    6000C                                                            
REC3     DS    6000C               ADDRESSABLE VIA AREC3                        
REC4     DS    6000C               ADDRESSABLE VIA AREC4                        
REC4X    EQU   *                                                                
REC5     DS    6000C               ADDRESSABLE VIA AREC5                        
REC5X    EQU   *                                                                
WSGLTAB  DS    4200C               USED FOR WSGLTAB                             
WSGLTABX EQU   *                                                                
BUDBLOCK DS    XL256               ADDRESSABLE VIA ADBLOCK                      
OVWORK   DS    XL512               OVERLAY WORKING STORAGE-AOVWORK              
STAWORK  DS    XL32                WORK AREA FOR STAPACK CALLS                  
CIBBLK   DS    0XL64                                                            
BLOCK    DS    XL64                                                             
         DS    D                   ROOM FOR '*MGEWORK' (FOR ABS)                
MGWORK   DS    XL1024              ADDRESSABLE VIA AMGWORK                      
         ORG   MGWORK+862                                                       
SVMGDEMU DS    XL28                UPGRADE FORMULA                              
SVMGDEMV DS    XL70                14 X (1 BYTE HUT ADJ + 4 BYTE DEMO)          
SVMGFRST DS    XL2                                                              
SVMGLAST DS    XL2                                                              
SVUPLDEL DS    XL17                                                             
SVMGPRD1 DS    CL3                                                              
SVMGPRD2 DS    CL3                                                              
SVMGBPR1 DS    XL1                                                              
SVMGBPR2 DS    XL1                                                              
SVMGFLAG DS    XL1                 X'80'=COST OVERRIDE PRESENT                  
SVMGCOST DS    XL3                                                              
MGWORKX  EQU   *                                                                
         ORG                                                                    
*                                                                               
SVTIA    DS    CL(18*1024)         SV AREA FOR TIA (DESKTOP MODE ONLY)          
*                                                                               
SPBUYWKX EQU   *-1                                                              
         EJECT                                                                  
         ORG   REC                                                              
       ++INCLUDE SPGENBUY                                                       
         EJECT                                                                  
       ++INCLUDE SPBUYFFD                                                       
         EJECT                                                                  
         ORG   BUYHL1H                                                          
       ++INCLUDE SPBUYFED                                                       
         EJECT                                                                  
         ORG   BUYHL1H                                                          
       ++INCLUDE SPBUYF0D                                                       
         EJECT                                                                  
         ORG   BUYHL1H                                                          
       ++INCLUDE SPBUYF3D                                                       
         EJECT                                                                  
         ORG   BUYHL1H                                                          
       ++INCLUDE SPBUYF4D                                                       
         ORG   BUYHL1H                                                          
       ++INCLUDE SPBUYF2D                                                       
         EJECT                                                                  
         ORG   BUYHL1H                                                          
       ++INCLUDE SPBUYF5D                                                       
         ORG   BUYHL1H                                                          
       ++INCLUDE SPBUYF8D                                                       
         EJECT                                                                  
*                                                                               
TWASAGN  EQU   T211FFD+4,2        ACCESS GROUP# (IF PGMIND2=PGMISECA)           
TWANOGO  EQU   T211FFD+X'4000'                                                  
*                                                                               
         ORG   T211FFD+16                                                       
SVKEY    DS    0CL18                                                            
         ORG   SVKEY                                                            
SVAGYMD  DS    XL1                                                              
SVCLT    DS    XL2                                                              
SVPRD    DS    XL1                                                              
SVMKT    DS    XL2                                                              
SVSTA    DS    XL3                                                              
SVEST    DS    XL1                                                              
         DS    XL1                                                              
SVLIN    DS    XL2                                                              
         DS    XL1                                                              
         DS    XL4                 DISK ADDRESS                                 
*                                                                               
SV1WPROF DS    CL30                SP1W PROFILE SAVE AREA                       
         ORG                                                                    
*                                                                               
         ORG   T211FFD+2304  ******* ORIGIN TO END OF DISPLAY AREA              
*                                                                               
SVHILN   DS    H                                                                
SVRCLOPT DS    CL1                 LAST RECALL OPTION                           
SVQPRDS  DS    XL2                                                              
SVSPLMKT DS    H                                                                
SVXFRCOM DS    XL1                                                              
SVXFRSYS DS    XL1                                                              
SVXFRAGY DS    CL3                                                              
SVXFREST DS    CL1                 HIGH INTERFACE EST NUM (CCUSA)               
SVXFRNAM DS    CL20                                                             
SVQLIST  DS    XL32                REQ LIST SAVE AREA FOR BRD T/A'S             
*                                   ON TRUE POL BUYS                            
SVDFLTID DS    CL12                DEFAULT ID FOR STATION                       
SVDFLTXP DS    CL21                DEFAULT STATION EXPANSION                    
SVDFLTMK DS    XL2                 DEFAULT MARKET NUMBER                        
SVDFLTRT DS    CL1                 DEFAULT RATING SERVICE                       
SVDFLTSW DS    CL1                 DEFAULT SWEEP CLASS                          
*                                                                               
SVADJLST DS    CL16                ADJACENCY CODE LIST                          
SV1OR2   DS    XL1                 2 FOR 2-BYTE LINE NUMBERS                    
SVPCVRSN DS    XL4                 PC VERSION FOR DESKTOP                       
SVMIDAS  DS    CL1                 SAVED MIDAS FLAG                             
         DS    XL3                 SPARE                                        
*                                                                               
         DS    0D                  DEMO EXTENSION AREA FOR SVNDEF               
SVNDDEM  DS    60XL12              DEMO CALL LETTERS/FLAGS/MARKET               
SVNDDEMX EQU   *                                                                
*                                                                               
SVBUYDA  DS    XL4                 D/A OF LAST BUY HIGH/GETREC/PUTREC           
SVDATABP DS    XL4                 A(NEXT AVAIL ENTRY IN DA TAB)                
*                                  DA TAB SUPPLIED BY OVLY                      
*                                  LAST ENTRY=X'FFFFFFFF'                       
*                                                                               
SVRCLSTA DS    CL4                 RCLSTA STARTING STATION                      
*                                                                               
* FIELDS BELOW FOR CANADIAN DEMOS                                               
*                                                                               
SVDMLFLG DS    XL1                 FLAGS FOR DEMO LOOKUP                        
*                                  X'80' = SUPPRESS IMPS                        
*                                  X'01' = BBM LOOKUP                           
SVDMLST0 DS    CL4                 NSI LOOKUP CALL LETTERS                      
SVDMLST1 DS    CL4                 BBM LOOKUP CALL LETTERS                      
SVLPMDAT DS    XL2                 LPM START DATE FROM MKT REC                  
*                                                                               
SVBUY31  DS    0184C               USED BY BUY31WK FOR TSAR DATA                
         DS    XL1                                                              
         DS    0A                  ALIGNMENT                                    
GETBLK   DS    XL64                FOR SPGETBUYD                                
         ORG   GETBLK                                                           
       ++INCLUDE SPGETBUYD                                                      
         ORG   GETBLK+L'GETBLK                                                  
         DS    0A                  ALIGNMENT                                    
*                                                                               
VGOBUY38 DS    A                                                                
SVPGPROF DS    CL16                                                             
         DS    1096C                                                            
         EJECT                                                                  
         ORG   T211FFD+4200                                                     
NBUYSAVE DS    0D                                                               
BUYSAVE  DS    0D             ***** DSECT FOR TWA1 SAVE AREA *****              
*                                                                               
*                                                                               
SVADVAGY DS    XL1                                                              
SVOFFC   DS    XL1                                                              
SVSTARTP DS    XL2                                                              
SVENDP   DS    XL2                                                              
SVSTART  DS    CL6                                                              
SVEND    DS    CL6                                                              
SVSTARTB DS    CL3                                                              
SVENDB   DS    CL3                                                              
SVMGDATP DS    XL2                                                              
SVMGDATB DS    XL3                                                              
SVPOLONL DS    CL1                                                              
SVECNTRL DS    XL1                                                              
SVPST    DS    XL10                PST CODES                                    
SVSECAGY DS    CL2                 SECURITY AGENCY                              
SVDFLTBT DS    CL1                 DEFAULT BOOKTYPE                             
SVBKTYPE DS    CL1                 CURRENT BOOKTYPE                             
SVBOOK   DS    XL2                                                              
SVHUTADJ DS    XL1                                                              
SVRTGSVC DS    XL1                 RTG SVC OVERRIDE                             
SVDSTFLG DS    CL1                 C'N' = NO DST THIS STATION                   
SVMZONE  DS    CL1                 MARKET  DAYLIGHT TIME DSPL                   
SVPWFLG  DS    XL1                 X'80'=SUP LK/X'40'=BL LK/X'20'=$LOCK         
*                                  X'01'=PW EST                                 
STSPLMKT DS    XL2                 STARTING SPILL MARKET                        
SVSTAMKT DS    CL3                 MARKET ALPHA FROM STATION RECORD             
SVMKTMKT DS    CL3                 MARKET ALPHA FROM MARKET RECORD              
PFKEYADR DS    A                                                                
         ORG   PFKEYADR                                                         
PFKEYLEN DS    XL1                                                              
         ORG                                                                    
         DS    0H                                                               
SVSELST  DS    CL12                DARE MAKEGOOD SELECT LIST                    
SVRECNO  DS    XL1                 DARE MAKEGOOD KEY REC NO                     
SAVSEQ   DS    XL1                 DARE MAKEGOOD SEQUENCE #                     
SAVLIN   DS    H                   DARE MAKEGOOD LINE/OFFR NO.                  
DRMGFLG  DS    CL1                 DARE  MAKEGOOD FLAGS                         
BLDONE   EQU   X'80'               - BUILD ONLY ONE BUYLINE                     
OKAYED   EQU   X'40'               - BUYLINES ALREADY BUILT                     
REJAPP   EQU   X'20'               - THE LAST ACTION WAS REJ OR APP             
OTOOK    EQU   X'10'               - ALLOW OTO EVEN IF MAKEGOOD PENDING         
*                                    BECUASE THERE WERE NO OFFERS               
DRMG_NOSTAR EQU   X'08'            - DO NOT MOVE * TO INPUT LINE                
DRMG_ONEDPT EQU   X'04'            - ONE UNIQUE DAYPART ACROSS MISSED           
DRMG_1MISSL EQU   X'02'            - ONE MISSED LINE FOR DEMOS                  
*                                                                               
SVDDAYPT DS    CL1                                                              
*                                                                               
SVCLOCK  DS    XL2                 CLTHDR LOCK Y/M + PRIOR/SUBS                 
SVCLKSDT DS    XL2                                                              
SVCLKNDT DS    XL2                                                              
SVAFLAG2 DS    XL1                                                              
SVCOPT3  DS    XL1                                                              
SVOTOCHR DS    CL1                                                              
SVXFRSID DS    CL2                 CALLER/CALLEE SESSION                        
SVANYLOK DS    CL1                 C'Y' IF LOCKED BUYS EXIST                    
SVEBKTYP DS    CL1                                                              
SVBUTRCD DS    CL4                                                              
SVDARRCL DS    XL3                 DARE RECALL PRDS/FLT                         
SVDCORT  DS    XL1                 X'80'= TRADE LOCKED                          
SVDARENT DS    XL4                 DISPLACEMENT TO DARE RECALL ENTRY            
SVCACCS  DS    XL3                 CLIENT LIMIT ACCESS CODES                    
SVMACCS  DS    XL3                 MARKET LIMIT ACCESS CODES                    
SVDPTOPT DS    CL1                 DAYPART FROM OPTIONS                         
SVSPLALP DS    CL3                 ALPHA SPILL MARKET                           
SVDSPMOD DS    CL1                 DISPLAY MODE (NORMAL/SKEVAL)                 
SVMVTYPE DS    CL1                                                              
SVOPTBT  DS    CL1                 BOOKTYPE FROM OPTIONS                        
         DS    XL9                 SPARE                                        
SVMAXSPT DS    XL1                 MAX SPOTS PER RECORD                         
SVBIGMAX DS    XL1                 C'Y' FOR 4K RECORDS (PATCH)                  
SVNTI    DS    CL4                 NTI STATION CODE (E.G., ESPN)                
SVSPOMAK DS    XL1                 SPO/MAK OPTIONS                              
SVSPOMAK_NOBUY EQU  X'80'          DO NOT ADD BUY RECORD THIS CALL              
SVPRATE  DS    XL1                                                              
SVTRDPR  DS    XL1                 TRADE PRD FROM ESTHDR                        
SVCSHPR  DS    XL1                 CASH PRD FROM ESTHDR                         
*                                                                               
SVELOCK  DS    XL2                 ESTHDR LOCK Y/M + PRIOR/SUBS                 
SVELKSDT DS    XL2                                                              
SVELKNDT DS    XL2                                                              
*                                                                               
SVCCOST2 DS    A                                                                
SVECOST2 DS    A                                                                
SVESLN   DS    XL1                                                              
SVORIGNL DS    CL1                                                              
SVCOPT2  DS    XL1                                                              
*                                                                               
SVXFRCTL DS    XL1                                                              
SVXFR_DARE EQU    X'80'                                                         
SVXFR_MAK  EQU    X'40'                                                         
SVXFR_SDT  EQU    X'20'                                                         
SVOLDACN DS    CL5                 IF SVACNDT <> 0, OLD ACN NUMBER              
*                                                                               
SVOPT1   DS    X                                                                
SVOPT1_PAIDOTO EQU X'80'                                                        
SVOPT1_NONOCHG EQU X'40'                                                        
SVOPT1_NOBYVAL EQU X'20'           DON'T CALL BUYVAL                            
SVOPT1_VNDRLCK EQU X'10'           VENDOR LOCKED (MASTER RECORD)                
*                                                                               
SVACNDT  DS    XL3                 IF NEW ACN NUMBER, DATE OF CHANGE            
SVOLDMKT DS    2XL2                OLD MARKET NUMBERS                           
SVCTAFLG DS    XL1                                                              
SVCTA_BBYES EQU X'80'                                                           
SVCTA_BBNO  EQU X'40'                                                           
*                                                                               
SVCLTIFC DS    CL8                                                              
QFRMSTA  DS    CL5                                                              
SVCTACON DS    CL5                 LAST CTA CONTRACT NUMBER USED                
SVRCLEND DS    XL3                 LAST RECALL END - LINE OR DATE/NUM           
*                                                                               
SVSTVRSN DS    C                   STAPAK VERSION                               
SVESTFL1 DS    XL1                 ESTIMATE FLAG1                               
*                                                                               
SVSCR    DS    CL1                 LAST SCREEN                                  
PFKEY    DS    CL1                 PFKEY                                        
*                                                                               
LSTTAB   DS    8XL2                                                             
LSTTABLN EQU   *-LSTTAB                                                         
SVLSTREC DS    XL2                 LAST TSAR REC NUMBER READ                    
SVMGASW  DS    CL1                 00 CALLED FROM MGA SCREEN                    
MGADISP  EQU   X'80'               WE'RE IN MGA SCREEN                          
MGACALL  EQU   X'40'               WE CALLED 00 FROM MGA PROGRAM                
*                                                                               
SVMGINIT DS    CL1                 TSAR INITIALIZED                             
SVSTCODE DS    CL2                 START AT CODE                                
*                                                                               
SVESTREP DS    XL2                 SPECIAL REP FROM ESTHDR                      
SVPRDEST DS    XL32                1 BIT FOR EACH PRD WITH EST OPEN             
SVPOLPRD DS    XL1                 BRAND CODE FOR BRAND POL                     
SVPOLPR2 DS    XL1                  PARTNER BRAND CODE FOR BRAND POL            
SVOPTS   DS    XL1                                                              
SVDEMOS  DS    XL118                                                            
         ORG   SVDEMOS                                                          
SVDEMLST DS    CL63                60 BYTE LIST + 3X'00'                        
SVWGTLST DS    CL20                                                             
SVUSRNMS DS    CL28                                                             
SVWGTNM  DS    CL7                                                              
*                                                                               
SVDEMMIN DS    CL2                 MINIMUM TARGET DEMO VALUE                    
SVCOPY   DS    CL1                 COPY CODE                                    
SVERATE  DS    CL1                 MANDATORY RATE TYPE (FROM ESTHDR)            
SVEOWSDY DS    XL1                 OUT OF WEEK ROT START DAY                    
SVSENDER DS    CL3                                                              
SVCOPT1  DS    XL1                 X'80' = ALLOW 2 COSTS                        
*                                  X'40' = INFOMERCIAL CLIENT                   
*                                                                               
SVBRDEMS DS    XL127               BRAND DEMOS FOR BRAND POOL                   
SVSECUR  DS    XL1                 SECURITY LEVEL                               
SVUPD    DS    XL1                 ALLOWED TO UPDATE                            
SVNETYM  DS    CL2                 START BDCST Y/M FOR NETPAK                   
SVNPCTG  DS    CL4                 TOTAL PCT OF STAS IN RGN (CANAD)             
SVEST1   DS    C                                                                
SVEST2   DS    C                                                                
SVCXTRA  DS    CL15                                                             
SVID     DS    CL12                                                             
*                                                                               
SVNEWDEM DS    C                   C'Y' FOR CONVERTED DEMOS                     
SVEDEMLN DS    H                   LENGTH OF DEMO ENTRY IN ESTHDR               
SVDEMDSP DS    H                   DISPLACEMENT TO DEMO TYPE (FOR RTGS)         
SVBILFML DS    CL3                 ESTHDR BILL FORMULA                          
SVFNPROF DS    CL16                                                             
* SAVE AREA FOR UPGRADE DETAILS FROM OPTIONS FIELD *                            
SVUPDTA  DS    0XL25                                                            
SVUPFIL  DS    XL1                 UPGRADE FILE                                 
SVUPOPTS DS    XL8                 UPGRADE ELEMENT DETAILS                      
SVUPIN   DS    CL16                UPGRADE ELEMENT INPUT                        
*                                                                               
SVNOVRD  DS    0XL9                SAVE AREA FOR NTWK OVRD                      
SVNOVSET DS    XL1                 0 = SVNDEF NOT RE-DISTIBUTED                 
SVNOVPRV DS    XL3                 PREVIOUS OVRD EST-LIN                        
SVNOVEST DS    XL1                 CURRENT OVRD EST                             
SVNOVLIN DS    XL2                 CURRENT OVRD LINE                            
SVNDA    DS    XL4                 NETDEF RECORD DISK ADDRESS                   
*                                                                               
SVARBF94 DS    XL1                                                              
QARBF94  EQU   X'80'               FEATURE ON IN STATION RECORD                 
QF94NSI  EQU   X'01'               OPTION INPUT = NSI                           
QF94ARB  EQU   X'02'               OPTION INPUT = ARB                           
SVAGYLK  DS    XL3                 AGENCY LOCK DATE                             
SVSNDST  DS    XL2                 SEND START DATE                              
SVSNDEND DS    XL2                 SEND END DATE                                
SVSNDAP1 DS    CL3                                                              
SVSNDP1  DS    XL1                                                              
SVSNDAP2 DS    CL3                                                              
SVSNDP2  DS    XL1                                                              
SVSTAMSF DS    XL2                 STATION'S MEDIA SERVICE FEE                  
SVXRATE  DS    XL2                 CANADIAN AGENCY'S EXCHANGE RATE              
SVSTACTX DS    XL2                 STATION'S C58 TAX RATE                       
SVSTACNT DS    CL1                 STATION COUNTRY (U/C)                        
SVNTAX   DS    XL2                                                              
SVTODAYB DS    XL3                                                              
SVTODAYP DS    XL2                                                              
SVPASSWD DS    CL2                                                              
SVSTADOL DS    CL1                 STATION DOLLAR TYPE (U/C)                    
SVOPT2   DS    C                                                                
SVOPT2_NOSPILL EQU  X'80'                                                       
SVOPT2_NOTAX   EQU  X'40'                                                       
SVOPT2_NOGOAL  EQU  X'20'                                                       
SVOPT2_NOMIN   EQU  X'10'                                                       
SVOPT2_OVERW   EQU  X'08'                                                       
SVOPT2_NOUNLK  EQU  X'04'          FOR INFOMERCIAL CLIENTS                      
SVOPT2_NOUPGD  EQU  X'02'          TO SUPPRESS UPGRADE ON MGE=                  
SVOPT2_MKTOV   EQU  X'01'          MARKET OVERRIDE                              
SVPOLNPW DS    XL1                                                              
SVGSTCOD DS    CL1                                                              
SVNETBTS DS    XL1                                                              
*                                                                               
QCLT     DS    CL3                 EBCDIC CLIENT                                
QPRD     DS    CL3                 EBCDIC PRD                                   
QSTA     DS    CL5                 EBCDIC STA                                   
SVAPROF  DS    CL20                                                             
SVCPROF  DS    XL15                                                             
SVOPTBK  DS    CL2                                                              
SVOPTHUT DS    CL1                                                              
SVSWPCLS DS    CL1                                                              
SVFLTPRD DS    XL1                                                              
SVFLTDTS DS    XL65                MAX 16 2-BYTE PAIRS + X'00'                  
SVKGPROF DS    XL16                SPCL DPT ADJ PROF                            
SVOLDNET DS    XL9                 NET(4)/RGN(1)/CLT(2)/EST(1)                  
SVAFLAG1 DS    XL1                 AGYFLAG1 FROM AGYHDR                         
SVUPDATE DS    XL1                 REASON FOR CHANGE THIS EST/STA               
SVMCLCOD DS    XL2                 MASTER CLIENT CODE                           
SVMCLUNQ DS    XL1                 MASTER CLIENT CODE UNIQUE SEQNUM             
SVMCLPRD DS    XL1                 MASTER CLIENT OVERRIDE PRODUCT               
SVRSMKT  DS    XL2                 RATING SERVICE MARKET NUMBER                 
QCBLNET  DS    CL3                 CABLE NETWORK                                
*                                                                               
SVNDEF   DS    60CL26              SAVE AREA FOR CANADA NETWRK DEF              
SVNDEFX  EQU   *                   MKT-STA(5)/PCT(4)/OFFST(2)/TAX(2)/           
*                                  INDEX(1)/GST(1)/STATUS(1)/PST(10)            
*                                                                               
         ORG   SVNDEF                                                           
SVMVDATA DS    0D                                                               
SVMVID   DS    CL8'*SVMOVE*'                                                    
SVMVNUM  DS    X                   NUMBER OF ACTIVE MOVE ENTRIES                
SVMVSDAY DS    X                   START DAY OF MOVE FROM EST                   
SVMVBUYS DS    10XL8               LINES/DA'S OF BUYS DISPLAYED                 
SVMVBUYX EQU   *                                                                
SVMVDTS  DS    15XL2               DATE LIST (14 WEEKS + 2X'00')                
SVMVEND  DS    XL2                 START DATE OF 15TH WEEK (IF ANY)             
SVMVLIST DS    6XL64               SEE SPBUY37 FOR DSECT                        
SVMVDATX EQU   *                                                                
*==========================================================                     
         ORG                                                                    
*==========================================================                     
SVNRGN   DS    CL1                 NETWK RGN CODE                               
SVESTWKS DS    XL108               2 BYTE EST WEEK DATES                        
*                                                                               
SVSPLKEY DS    0XL6                KEY FOR DATA IN SVSPLLST                     
SVSPLSTA DS    XL3                 STATION (PACKED)                             
SVSPLCLT DS    XL2                 CLIENT CODE                                  
SVSPLDPT DS    CL1                 DAYPART CODE                                 
         DS    XL48                                                             
*                                                                               
SVMENU   DS    XL37                NEW DAYPART MENU (X'00'=EOT)                 
SVGLDPEQ DS    CL72                36X2 BYTE SLAVE/MASTER DPT ENTRIES           
* CANADIAN NETWORK CUT-IN DATA                                                  
SVCUTDTA DS    0D                                                               
SVCUTLST DS    8XL56               STA(5)/SPARE(3)/8*(FLGS(1)/PRDS(5))          
         ORG   SVCUTLST+116                                                     
SVZCUTDT DS    18XL2               18*2 + 2X'00'                                
SVZCUTDX DS    XL2                                                              
SVZCUTST DS    40XL5                                                            
SVZCUTSX DS    XL2                                                              
         ORG                                                                    
SVCUTDTS DS    9XL2                8*2 + 2X'00'                                 
SVCUTEL  DS    XL1                 STARTING NTWK ELEMENT NUMBER                 
SVCUTELX DS    XL1                 ENDING NTWK ELEMENT NUMBER                   
SVCUTLOW DS    XL1                 LOW ELEMENT NUMBER FIRST DAY                 
SVCUTDTX EQU   *                                                                
*                                                                               
SVMAKEDT DS    XL2                 MATCHMAKER ELEM DATE                         
SVMAKENO DS    XL1                 AND NUMBER                                   
SVRFPGRP DS    CL8                                                              
SVDARPRF DS    CL16                                                             
SVOPTREP DS    CL2                                                              
SVRFPID  DS    XL2                                                              
SVC2CONV DS    XL2                                                              
SVHFLAGS DS    XL4                 SAVE AREA FOR XBHIST                         
SV00PROF DS    CL16                                                             
SVOMPROF DS    CL16                                                             
SVSKPER  DS    XL4                 START/END DATES FOR SKEVAL                   
SVSORTST DS    XL1                 FIRST LINE ON SORTED SCREEN                  
SVCOPT4  DS    X                                                                
SVWSGLIN DS    C                   WSGLTAB RESTORED FLAG                        
         DS    XL427               SVLICST ORGS OVER SOME OF THIS!!!!           
*                                                                               
** NOTE THAT THINGS DOWN HERE ARE NOT DIRECTLY ADDRESSABLE. SORRY **            
*                                                                               
         ORG   BUYSAVE+3600                                                     
         DS    0D                                                               
SVCLIST  DS    220CL4                                                           
SVOLDDEF DS    60CL26              BUYLINE NETWORK DEF                          
SVSECRET DS    1024C                                                            
*                                                                               
SVF0PROF DS    CL16                FO PROFILE                                   
SVDARE   DS    1024C               DARE LOCK VALUES (PRD1/PRD2/FLIGHT)          
SVDAREX  EQU   *                                                                
*                                                                               
SVTSAR   DS    XL10                VALUE OF SVKEY WHEN TSAR INTLZD              
SVB0PROF DS    XL16                B0 PROFILE                                   
SVBPPROF DS    XL16                BP PROFILE                                   
SVSDEKEY DS    XL11                KEY FOR DATE TABLE BELOW                     
         DS    0F                                                               
SVSDEDTS DS    XL128               SUPERDESK AUTHORIZATION DATES                
         DS    0D                                                               
SPAUTHWK DS    XL64                                                             
VRCPACK  DS    A                                                                
ALINKIO  DS    A                                                                
VSLNTAB  DS    A                                                                
VEDITBTY DS    A                                                                
SVNTDMS  DS    CL160               NON-TRAD DEMO NAMES 20*CL8                   
BUUPGD   DS    CL16                                                             
         DS    240C                SPARE                                        
SV00APRF DS    XL16                                                             
SVD0PROF DS    XL16                                                             
SVMKPROF DS    XL16                                                             
SVBUYOPH DS    XL32                SAVE AREA FOR SPBUY32 BUYOPS                 
*                                                                               
SVRSNEL  DS    0XL68                                                            
         DS    XL1                 ROOM FOR ELEM CODE                           
SVRSNELN DS    XL1                 ELEM LEN                                     
SVRSNCOD DS    CL6                 REASON CODE                                  
SVRSNFLD DS    XL1                 FIELD ID OF LAST CHANGE                      
SVRSNTXT DS    CL60                ASSOCIATED TEXT IF REQUIRED                  
                                                                                
SVSPLLST DS    10XL8               SAVE AREA FOR DPT SUMMARY SPILL              
         DS    XL1                 ROOM FOR EOL FLAG                            
SVSPILLX EQU   *                                                                
*                                                                               
SVDAROPT DS    X                                                                
SVDAROPT_MSSD   EQU X'80'                                                       
SVDAROPT_NOERRS EQU X'40'                                                       
*                                                                               
SVUPTXT  DS    CL64                UPGRADE TEXT AS INPUT                        
SVSORT   DS    XL256               BUYLINES FOR SORTED DISPLAY                  
         ORG   SVSORT                                                           
SVCOMFLG DS    CL1                                                              
SVCOMNMS DS    CL160               COMSCORE DEMO NAMES FOR BUYUPL               
         ORG   SVSORT+L'SVSORT                                                  
*                                                                               
         DS    0D                                                               
SVMGSAVE DS    XL728                                                            
SVMGSAVX EQU   *                                                                
*                                                                               
         DS    0D                  SAVE AREA FOR OLD SVNDDEM VALUES             
SVNDDOLD DS    60XL12                                                           
SVNDDOLX EQU   *                                                                
*                                                                               
UPDEMS   DS    XL(21*3)            DEMOS (UP TO 20)                             
UPBY2UID DS    CL12                UNIQUE SBY2 ID                               
*===================================================================            
*                                                                               
SVSPARE  DS    XL(TWANOGO-*)                                                    
         ORG                                                                    
**************************************************************                  
* THE PRECEDING ORG + VALUE OF NBUYSAVE MUST BE < X'4000'    *                  
* BECAUSE TWA0 HAS A USER LENGTH OF 18K-2K (16384)           *                  
* LOVE TO ALL YOU FUTURE GENERATIONS -- LISA AND MEL         *                  
**************************************************************                  
                                                                                
* AREAS BELOW NOW SAVED AND RESTORED IN WSSVR/UTL MHER 4/2/13                   
WSGLTABD DS    0D                                                               
WSGLWKS  DS    XL108               53 2-BYTE SUNDAY DATES + X'FFFF'             
WSGLDPTS DS    0XL10               DPT(1)/SLN(1)/WEEK INDS(8)                   
                                                                                
SVDARED  DSECT                                                                  
SVDRFLAG DS    XL1                 C'Y' = TABLE BY FLIGHT                       
SVDRFLG2 DS    XL1                                                              
SVDRFLG2_IGN EQU X'80'             DO NOT CALL TESTDARE                         
SVDRFLG2_MRK EQU X'40'             MARK ORDER THAT A MKGD WAS UNWOUND           
SVDRFLG2_ROE EQU X'20'             RETURN TO CALLER ON ERROR                    
SVDRFLG2_ERR EQU X'FF'             INDICATE ERROR TO CALLER IF _ROE SET         
SVDRFLT0 DS    XL2                 DATE OF FLIGHT 0                             
SVDRELEM DS    AL4                 A(BUY ELEM) TO BE CHECKED OR 0               
SVDRSTR1 DS    XL2                 FLIGHT 1 START DATE                          
SVDREND1 DS    XL2                 FLIGHT 1 END DATE                            
         DS    15XL4               FLIGHTS 2-16 START/END DATES                 
* PRODUCT ENTRIES FOLLOW UP TO TABLE LENGTH                                     
* ENTRIES HAVE LOWEST PRODUCT NUMBER FIRST (OR ZERO)                            
SVDRTBL  DS    0X                  START OF PRODUCT TABLE                       
         DS    XL1                 PRODUCT 1                                    
         DS    XL1                 PRODUCT 2                                    
         DS    XL1                 FLIGHT NUMBER                                
         EJECT                                                                  
SVNDEFD  DSECT                 *** DSECT FOR SVNDEF AREA ***                    
SVNDMKST DS    0XL5                                                             
SVNDMKT  DS    XL2                 MARKET                                       
SVNDSTA  DS    XL3                 STATION                                      
SVNDPCT  DS    XL4                 PERCENTAGE                                   
SVNDOFF  DS    XL2                 OFFSET                                       
SVNDTAX  DS    XL2                 TAX RATE                                     
SVNDSEQ  DS    XL1                 STATION SEQNUM IN SVNDEF                     
SVNDGST  DS    CL1                 GST CODE                                     
SVNDSTAT DS    XL1                 STATUS BYTE                                  
SVNDCUTQ EQU   X'80'               INCLUDE IN CUT DISPLAY                       
SVNDPST  DS    CL10                PST CODES                                    
*                                                                               
SVNDDEMD DSECT                                                                  
SVNDDST0 DS    CL4                 STATION FOR NSI LOOKUP                       
SVNDDST1 DS    CL4                 STATION FOR BBM LOOKUP                       
SVNDDFLG DS    XL1                 IMPS FLAGS                                   
*                                  X'80'=NO RS IMPS                             
*                                  X'01'=BBM LOOKUP (0=NSI)                     
SVNDDMKT DS    CL3                 MARKET FOR DEMO LOOKUP                       
*                                                                               
SVNPGMD  DSECT                 *** DSECT FOR TABLE BUILT IN AREC3 ***           
SVNPMKST DS    XL5                 MARKET/STATION                               
SVNPDAY  DS    XL2                 RELATIVE DAY                                 
SVNPTIM  DS    XL2                 RELATIVE TIME                                
SVNPDPT  DS    CL1                 OVERRIDE DAYPART CODE                        
SVNPSHR  DS    XL4                 X'C0' BITS FLAG DEMO ERRORS                  
SVNPTAX  DS    XL2                 TAX RATE                                     
SVNPST   DS    CL10                PST CODES                                    
SVNPSEQ  DS    XL1                 SEQ NUMBER TO SVNDDEM                        
SVNPLEN  EQU   *-SVNPGMD                                                        
*                                                                               
SKEDTABD DSECT                 *** DSECT FOR TABLE BUILT IN AREC5 ***           
*                                                                               
SKEDTAB  DS    0XL8                                                             
SKEDDATE DS    XL2                 DATE                                         
SKEDFLAG DS    XL1                 X'80' = NO SPOTS THIS DATE                   
SKEDOLD  DS    XL1                 TOTAL OLD SPOTS                              
SKEDPAID DS    XL1                 OLD PAID SPOTS                               
SKEDUNPD DS    XL1                 OLD UNPD SPOTS                               
SKEDNEW  DS    XL1                 NEW SPOTS                                    
         DS    XL1                 SPARE                                        
SKEDNEXT DS    0X                                                               
         SPACE 2                                                                
*                                                                               
VTIAD    DSECT                 *** DSECT FOR TABLE BUILT IN AREC3 ***           
*                                                                               
DEFTAB   DS    52XL6                                                            
*                                                                               
STATAB   DS    52XL11              STATION TABLE                                
*                                                                               
BUYLNTAB DS    999XL9              BUYLINE TABLE                                
*                                                                               
BUYLNTABD DSECT                                                                 
BUYLNTAB_LIN DS XL2                                                             
BUYLNTAB_DOL DS XL3                                                             
BUYLNTAB_PCT DS XL4                                                             
*                                                                               
STATABD  DSECT                                                                  
STATAB_MS  DS  0XL5                                                             
STATAB_PCT DS  0XL4                                                             
STATAB_LIN DS  0XL2                                                             
*                                                                               
GLDATAD    DSECT                                                                
GLDATA_DPT DS  CL1                 DAYPART                                      
GLDATA_SLN DS  XL1                 TOTAL SLN OR ACTIVE PB LEN                   
         EJECT                                                                  
*                                                                               
       ++INCLUDE SPTUPLOADD                                                     
         EJECT                                                                  
       ++INCLUDE SPCIBBLK                                                       
         EJECT                                                                  
       ++INCLUDE SPSTAPACKD                                                     
         EJECT                                                                  
       ++INCLUDE DDCOMFACS                                                      
         EJECT                                                                  
       ++INCLUDE FASECRETD                                                      
         EJECT                                                                  
       ++INCLUDE FAGETTXTD                                                      
