*          DATA SET SPBUY23MSG AT LEVEL 013 AS OF 10/30/02                      
MOREMSG  BASR  R1,RE               POINT R1 TO MESSAGE                          
         DC    CL40'Data displayed. Hit PF8 for more.'                          
NOMORMSG BASR  R1,RE                                                            
         DC    CL40'Data displayed. Hit PF6 for first.'                         
GETPFK1  BASR  R1,RE                                                            
         DC    CL34'PF2=MIS 5=Sked 6=Top 7=Demo 8=Fwd '                         
GETPFK2  BASR  R1,RE                                                            
         DC    CL30'9=Cpp 10=-7Wk 11=+7Wk             '                         
GETHL1A  BASR  R1,RE                                                            
         DC    CL40'=== Multiline Schedule Evaluation ==='                      
