*          DATA SET SPBUY20PFK AT LEVEL 006 AS OF 10/09/02                      
*==============================================================*                
* PFKEY DEFINITIONS BY RCLOPT                                  *                
*==============================================================*                
         SPACE 1                                                                
PFKEYN   DC    C'N',AL1(PFKEYNX-PFKEYN-2)                                       
         DC    C'PF6=Top, PF8=Forward'                                          
PFKEYNX  EQU   *                                                                
*                                                                               
PFKEYS   DC    C'S',AL1(PFKEYSX-PFKEYS-2)                                       
         DC    C'PF5=Sked PF6=Top, PF8=Forward'                                 
PFKEYSX  EQU   *                                                                
*                                                                               
PFKEYND  DC    C'N',AL1(PFKEYNDX-PFKEYND-2)                                     
         DC    C'PF6=Top, PF8=Forward, PF12=Return'                             
PFKEYNDX EQU   *                                                                
*                                                                               
PFKEYP   DC    C'P',AL1(PFKEYPX-PFKEYP-2)                                       
         DC    C'PF6=Top, PF8=Forward'                                          
PFKEYPX  EQU   *                                                                
*                                                                               
PFKEYR   DC    C'R',AL1(PFKEYRX-PFKEYR-2)                                       
         DC    C'PF6=Top, PF8=Forward'                                          
PFKEYRX  EQU   *                                                                
*                                                                               
PFKEYX   DC    C'X',AL1(PFKEYXX-PFKEYX-2)                                       
         DC    C'PF6=Top, PF8=Forward'                                          
PFKEYXX  EQU   *                                                                
