*          DATA SET SPBUYFFD   AT LEVEL 003 AS OF 06/29/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T211FFD      DATE 06/29/01                 
         SPACE 1                                                                
T211FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BUYMSGH  DS    XL8                                                              
BUYMSG   DS    CL60     1    2   60  A  P N             T        Y              
BUYSERVH DS    XL8                                                              
BUYSERV  DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      3    2    8  A  P N             T        Y              
BUYMDH   DS    XL8                                                              
BUYMD    DS    CL4      3   11    4  A  U N             T    I   Y              
BUYMDXPH DS    XL8                                                              
BUYMDXP  DS    CL10     3   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      3   43    7  A  P N             T        Y              
BUYBUH   DS    XL8                                                              
BUYBU    DS    CL12     3   51   12  A  U N             T        Y              
BUYBUXPH DS    XL8                                                              
BUYBUXP  DS    CL12     3   65   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      4    2    8  A  P N             T        Y              
BUYCLH   DS    XL8                                                              
BUYCL    DS    CL4      4   11    4  A  U N             T        Y              
BUYCLXPH DS    XL8                                                              
BUYCLXP  DS    CL22     4   20   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   43    7  A  P N             T        Y              
BUYPRH   DS    XL8                                                              
BUYPR    DS    CL4      4   51    4  A  U N             T        Y              
BUYPRXPH DS    XL8                                                              
BUYPRXP  DS    CL24     4   56   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P N             T        Y              
BUYESH   DS    XL8                                                              
BUYES    DS    CL4      5   11    4  A  U N             T        Y              
BUYESXPH DS    XL8                                                              
BUYESXP  DS    CL54     5   20   54  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
BUYSTH   DS    XL8                                                              
BUYST    DS    CL8      6   11    8  A  U N             T        Y              
BUYSTXPH DS    XL8                                                              
BUYSTXP  DS    CL22     6   20   22  A  P N             T        Y              
BUYCBLH  DS    XL8                                                              
BUYCBL   DS    CL24     6   43   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
BUYOPH   DS    XL8                                                              
BUYOP    DS    CL69     7   11   69  A  U N             T        Y              
BUYINFH  DS    XL8                                                              
BUYINF   DS    CL78     8    1   78  A  P N             T        Y              
BUYHL1H  DS    XL8                                                              
BUYHL1   DS    CL40     9    1   40  A  P N             T        Y              
BUYHL2H  DS    XL8                                                              
BUYHL2   DS    CL40     9   41   40  A  P N             T        Y              
BUYINP1H DS    XL8                                                              
BUYINP1  DS    CL78    10    2   78  A  U N        M    T        Y              
BUYINP2H DS    XL8                                                              
BUYINP2  DS    CL78    11    2   78  A  U N        M    T        Y              
BUYINP3H DS    XL8                                                              
BUYINP3  DS    CL78    12    2   78  A  U N        M    T        Y              
BUYINP4H DS    XL8                                                              
BUYINP4  DS    CL78    13    2   78  A  U N        M    T        Y              
BUYOUTH  DS    XL8                                                              
BUYOUT   DS    CL80    15    1   80  A  P N             N        Y              
BUYLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
BUYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1272 BYTES                            
