*          DATA SET SPCANTAB   AT LEVEL 008 AS OF 07/25/94                      
SPCANTAB DS    0XL8                                                             
         DC    CL4'AATN',XL3'000001',X'4'                                       
         DC    CL4'ACCN',XL3'000002',X'4'                                       
         DC    CL4'ACHA',XL3'000003',X'4'                                       
         DC    CL4'ACNN',XL3'000004',X'4'                                       
         DC    CL4'ACTM',XL3'000005',X'4'                                       
         DC    CL4'ADL ',XL3'000006',X'3'                                       
         DC    CL4'AESP',XL3'000007',X'4'                                       
         DC    CL4'AHAL',XL3'000008',X'4'                                       
         DC    CL4'AHLN',XL3'000009',X'4'                                       
         DC    CL4'ALOT',XL3'00000A',X'4'                                       
         DC    CL4'APD ',XL3'00000B',X'3'                                       
         DC    CL4'ARCD',XL3'00000C',X'4'                                       
         DC    CL4'ARTS',XL3'00000D',X'4'                                       
         DC    CL4'ASJM',XL3'00000E',X'4'                                       
         DC    CL4'ASN ',XL3'00000F',X'3'                                       
         DC    CL4'ASNC',XL3'000010',X'4'                                       
         DC    CL4'ASND',XL3'000011',X'4'                                       
         DC    CL4'ASNH',XL3'000012',X'4'                                       
         DC    CL4'ASNJ',XL3'000013',X'4'                                       
         DC    CL4'ASNM',XL3'000014',X'4'                                       
         DC    CL4'ASNN',XL3'000015',X'4'                                       
         DC    CL4'ASNS',XL3'000016',X'4'                                       
         DC    CL4'ASNY',XL3'000017',X'4'                                       
         DC    CL4'ASPN',XL3'000018',X'4'                                       
         DC    CL4'ASPR',XL3'000019',X'4'                                       
         DC    CL4'ASTV',XL3'00001A',X'4'                                       
         DC    CL4'ASYD',XL3'00001B',X'4'                                       
         DC    CL4'ATNN',XL3'00001C',X'4'                                       
         DC    CL4'ATNT',XL3'00001D',X'4'                                       
         DC    CL4'ATV ',XL3'00001E',X'3'                                       
         DC    CL4'ATVD',XL3'00001F',X'4'                                       
         DC    CL4'ATVH',XL3'000020',X'4'                                       
         DC    CL4'ATVN',XL3'000021',X'4'                                       
         DC    CL4'AUSA',XL3'000022',X'4'                                       
         DC    CL4'BABA',XL3'000023',X'4'                                       
         DC    CL4'BASN',XL3'000024',X'4'                                       
         DC    CL4'BAT ',XL3'000025',X'3'                                       
         DC    CL4'BBS ',XL3'000026',X'3'                                       
         DC    CL4'BBSS',XL3'000027',X'4'                                       
         DC    CL4'BCCN',XL3'000028',X'4'                                       
         DC    CL4'BCI ',XL3'000029',X'3'                                       
         DC    CL4'BCIT',XL3'00002A',X'4'                                       
         DC    CL4'BCPG',XL3'00002B',X'4'                                       
         DC    CL4'BCTK',XL3'00002C',X'4'                                       
         DC    CL4'BCTV',XL3'00002D',X'4'                                       
         DC    CL4'BJET',XL3'00002E',X'4'                                       
         DC    CL4'BSPN',XL3'00002F',X'4'                                       
         DC    CL4'BSUS',XL3'000030',X'4'                                       
         DC    CL4'BTNT',XL3'000031',X'4'                                       
         DC    CL4'BTSN',XL3'000032',X'4'                                       
         DC    CL4'BUSS',XL3'000032',X'4'                                       
         DC    CL4'CAAE',XL3'000033',X'4'                                       
         DC    CL4'CABC',XL3'000034',X'4'                                       
         DC    CL4'CAHA',XL3'000035',X'4'                                       
         DC    CL4'CAMP',XL3'000036',X'4'                                       
         DC    CL4'CAMP',XL3'000037',X'4'                                       
         DC    CL4'CARL',XL3'000038',X'4'                                       
         DC    CL4'CATH',XL3'000039',X'4'                                       
         DC    CL4'CATV',XL3'00003A',X'4'                                       
         DC    CL4'CBAF',XL3'00003B',X'4'                                       
         DC    CL4'CBAR',XL3'00003C',X'4'                                       
         DC    CL4'CBC ',XL3'00003D',X'3'                                       
         DC    CL4'CBCA',XL3'00003E',X'4'                                       
         DC    CL4'CBCB',XL3'00003F',X'4'                                       
         DC    CL4'CBCC',XL3'000040',X'4'                                       
         DC    CL4'CBCF',XL3'000041',X'4'                                       
         DC    CL4'CBCG',XL3'000042',X'4'                                       
         DC    CL4'CBCK',XL3'000043',X'4'                                       
         DC    CL4'CBCL',XL3'000044',X'4'                                       
         DC    CL4'CBCM',XL3'000045',X'4'                                       
         DC    CL4'CBCN',XL3'000046',X'4'                                       
         DC    CL4'CBCO',XL3'000047',X'4'                                       
         DC    CL4'CBCP',XL3'000048',X'4'                                       
         DC    CL4'CBCR',XL3'000049',X'4'                                       
         DC    CL4'CBCT',XL3'00004A',X'4'                                       
         DC    CL4'CBCW',XL3'00004B',X'4'                                       
         DC    CL4'CBET',XL3'00004C',X'4'                                       
         DC    CL4'CBF ',XL3'00004D',X'3'                                       
         DC    CL4'CBFR',XL3'00004E',X'4'                                       
         DC    CL4'CBFT',XL3'00004F',X'4'                                       
         DC    CL4'CBGA',XL3'000050',X'4'                                       
         DC    CL4'CBHT',XL3'000051',X'4'                                       
         DC    CL4'CBIT',XL3'000052',X'4'                                       
         DC    CL4'CBKE',XL3'000053',X'4'                                       
         DC    CL4'CBKR',XL3'000054',X'4'                                       
         DC    CL4'CBKS',XL3'000055',X'4'                                       
         DC    CL4'CBKT',XL3'000056',X'4'                                       
         DC    CL4'CBKW',XL3'000057',X'4'                                       
         DC    CL4'CBLF',XL3'000058',X'4'                                       
         DC    CL4'CBLK',XL3'000059',X'4'                                       
         DC    CL4'CBLL',XL3'00005A',X'4'                                       
         DC    CL4'CBLN',XL3'00005B',X'4'                                       
         DC    CL4'    ',XL3'000050',X'4'                                       
         DC    X'FF'                                                            
         EJECT                                                                  
