*          DATA SET SPCBLEQUIV AT LEVEL 030 AS OF 03/30/05                      
*====================================================================*          
*= DO NOT USE THIS BOOK==============================================*          
*= IT HAS BEEN REPLACED WITH SPCBLLIST ==============================*          
*= WHICH NOW INCLUDES BOTH NCC AND DDS NETWORK CODES ================*          
*====================================================================*          
* CABLE EQUIVALANCE TABLE                                                       
NTWKCONV DC    XL4'C150C540',CL4'AE'       A&E                                  
         DC    CL4'ANPL',CL4'ANP'                                               
         DC    CL4'CH12',CL4'C12'                                               
         DC    CL4'E!TV',CL4'ETV'                                               
         DC    CL4'VH-1',CL4'VH1'                                               
         DC    CL4'ESP2',CL4'ES2'                                               
         DC    CL4'INSP',CL4'ISP'                                               
         DC    CL4'SCF ',CL4'SPF'                                               
         DC    CL4'SPSN',CL4'SSN'                                               
         DC    CL4'CLAS',CL4'CSN'                                               
         DC    CL4'ODSY',CL4'ODY'                                               
         DC    CL4'SCNY',CL4'SPN'                                               
         DC    CL4'FSW2',CL4'FS2'                                               
         DC    CL4'SCB ',CL4'SPB'                                               
         DC    CL4'SPH ',CL4'SPP'                                               
         DC    CL4'SCPC',CL4'CCP'                                               
         DC    CL4'SCNE',CL4'SPE'                                               
         DC    CL4'SCPF',CL4'SCA'                                               
         DC    CL4'ZON1',CL4'ZN1'                                               
         DC    CL4'ZON2',CL4'ZN2'                                               
         DC    CL4'ZON3',CL4'ZN3'                                               
         DC    CL4'ZON4',CL4'ZN4'                                               
         DC    CL4'ZON5',CL4'ZN5'                                               
         DC    CL4'ZON6',CL4'ZN6'                                               
         DC    CL4'FSNE',CL4'FNE'                                               
         DC    CL4'FSNY',CL4'FNY'                                               
         DC    CL4'FSO ',CL4'FXO'                                               
         DC    CL4'SPRE',CL4'SNP'                                               
         DC    CL4'CSNT',CL4'SNE'                                               
         DC    CL4'BAY9',CL4'BY9'                                               
         DC    CL4'COX3',CL4'CX3'                                               
         DC    CL4'MO3 ',CL4'CH1'                                               
         DC    CL4'FSWD',CL4'FXS'                                               
         DC    CL4'DKID',CL4'DSK'                                               
         DC    CL4'FSWE',CL4'FSE'                                               
         DC    CL4'TV33',CL4'T33'                                               
         DC    CL4'SOAP',CL4'SOP'                                               
         DC    CL4'FLNC',CL4'FNC'                                               
         DC    CL4'DHLT',CL4'HLT'                                               
         DC    CL4'LNC5',CL4'LC5'                                               
         DC    CL4'NWBX',CL4'NBX'                                               
         DC    CL4'NWCT',CL4'NCT'                                               
         DC    CL4'NWNJ',CL4'NNJ'                                               
         DC    CL4'NWS8',CL4'AUN'                                               
         DC    CL4'BN9 ',CL4'BAY'                                               
         DC    CL4'FMC ',CL4'FXM'                                               
         DC    CL4'BBCA',CL4'BBA'                                               
         DC    CL4'DSCI',CL4'TDI'                                               
         DC    CL4'DWNG',CL4'TDW'                                               
         DC    CL4'MTV2',CL4'M2 '                                               
         DC    CL4'TVGH',CL4'HRN'                                               
         DC    CL4'ESPD',CL4'ESD'                                               
***  THE FOLLOWING WERE ADDED BECAUSE AMS STARTED TO USED NIELSEN CODES         
         DC    CL4'CNNE',CL4'CNE'   <===  WAS ORIGINALLY CNE                    
         DC    CL4'FSAM',CL4'FXA'   <===  WAS ORIGINALLY FOXA                   
         DC    CL4'FSNW',CL4'FNW'   <===  WAS ORIGINALLY FNW                    
         DC    CL4'FSSO',CL4'FSO'   <===  WAS ORIGINALLY FFSO                   
         DC    CL4'SDNC',CL4'SCN'   <===  WAS ORIGINALLY SCNC                   
*                                                                               
         DC    CL4'FSNO',CL4'FST'                                               
         DC    CL4'FSWI',CL4'FSI'                                               
         DC    CL4'MET2',CL4'ME2'                                               
         DC    CL4'TV13',CL4'T13'                                               
         DC    CL4'B9ES',CL4'BYS'                                               
         DC    CL4'INTL',CL4'INT'                                               
         DC    CL4'NWS9',CL4'NW9'                                               
         DC    CL4'OUT ',CL4'OLC'   <===  WAS ORIGINALLY OLC                    
         DC    CL4'FSRP',CL4'FRP'                                               
         DC    CL4'NW24',CL4'N24'                                               
         DC    CL4'NC14',CL4'N14'                                               
         DC    CL4'OC16',CL4'O16'                                               
         DC    CL4'ICN6',CL4'IC6'                                               
         DC    CL4'DHOM',CL4'DHO'                                               
         DC    CL4'SINO',CL4'SIV'                                               
         DC    CL4'CSTV',CL4'CXT'                                               
         DC    CL4'CCIN',CL4'CCT'                                               
         DC    CL4'REAL',CL4'REC'                                               
         DC    CL4'FSWA',CL4'FXW'                                               
         DC    CL4'NW10',CL4'NSY'                                               
         DC    CL4'CSNC',CL4'CSC'                                               
         DC    CL4'HESP',CL4'HSP'                                               
         DC    CL4'CMCC',CL4'CMC'                                               
         DC    CL4'CMCB',CL4'CMB'                                               
         DC    CL4'CMCU',CL4'CMU'                                               
         DC    CL4'CSNW',CL4'CSW'                                               
         DC    CL4'FSC ',CL4'FXC'                                               
         DC    CL4'AZN ',CL4'AZE'                                               
*                                                                               
         DC    X'00'               END OF TABLE                                 
