*          DATA SET SPCBLLST   AT LEVEL 074 AS OF 03/30/05                      
*====================================================================*          
*= DO NOT USE THIS BOOK==============================================*          
*= IT HAS BEEN REPLACED WITH SPCBLLIST ==============================*          
*====================================================================*          
*                                                                               
* 22AUG01 MHER DO NOT -- UNDER ANY CIRCUMSTANCE --                              
*              PUT ANYTHING IN FRONT OF THIS TABLE                              
*              DDSTAPACK ASSUMES THAT CABLETAB IS AT THE TOP !                  
* 20MAR00 MHER CHANGE ALL COMPARE LENGTHS TO X'03' SO                *          
*             THAT FX AND LN (AMONG OTHERS) ARE DISTINGUISHABLE      *          
*====================================================================*          
         SPACE 1                                                                
*====================================================================*          
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
* BE SURE TO NOTIFY STRATA WHEN NEW ENTRIES ARE ADDED TO THIS TABLE             
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           
*====================================================================*          
*                                                                               
**** NOTE RE-LINK THE FOLLOWING BOOKS ON ANY CHANGES:                           
****              DDSTAVAL                                                      
****              DDSTAPACK                                                     
****              SPREPUP02N                                                    
****              SPREPUP02P                                                    
****              SPREPUP02U                                                    
****              SPSFM5C                                                       
***************************************                                         
***************************************                                         
*                                                                               
*         CL3 - NETWORK CODE                                                    
*         XL1 - NUMBER OF BIT ON IN 8 BYTE SSYSNET IN MASTER REC                
*         XL1 - L'NETWORK CODE                                                  
*         XL1 - FLAG BYTE (X'80'=UNUSED NETWORK)                                
*                               =TURN OFF TO ACTIVATE NETWORK                   
*                         (X'40'=TOP 24 NETWORK)                                
*                         REMAINING BITS USED FOR TOP 24 SEQ NUM                
***************************************                                         
CABLETAB DS    0CL7                                                             
         DC    C'AZN',XL2'01',X'03',X'00' ARIZONA NEWS CHANNEL                  
         DC    C'ZN1',XL2'02',X'03',X'00' ZONE 1 NEWS                           
AE       DC    C'AE ',XL2'03',X'03',X'41' ARTS & ENTERTAINMENT                  
         DC    C'ZN2',XL2'04',X'03',X'00' ZONE 2 NEWS                           
         DC    C'ASP',XL2'05',X'03',X'00' ARIZONA SPORTS PROGRAMMING            
         DC    C'NC8',XL2'06',X'03',X'00' NEWS CH 8 WASH   <REUSED AT>          
BET      DC    C'BET',XL2'07',X'03',X'42' BLACK ENTERTAINMENT TV                
         DC    C'ZN3',XL2'08',X'03',X'00' ZONE 3 NEWS                           
         DC    C'FSW',XL2'09',X'03',X'00' FOX SPORTS WEST                       
         DC    C'C12',XL2'0A',X'03',X'00' CH 12                                 
         DC    C'FSA',XL2'0B',X'03',X'00' FOX SPORTS ARIZONA                    
         DC    C'CAN',XL2'0C',X'03',X'00' CANAL DE NOTICIAS                     
CMT      DC    C'CMT',XL2'0D',X'03',X'43' COUNTRY MUSIC TELEVISION              
CNB      DC    C'CNB',XL2'0E',X'03',X'44' CNBC                                  
CNN      DC    C'CNN',XL2'0F',X'03',X'45' CNN                                   
*                                                                               
COM      DC    C'COM',XL2'10',X'03',X'46' COMEDY CENTRAL                        
         DC    C'FXA',XL2'11',X'03',X'00' FOX AMERICA                           
         DC    C'COR',XL2'12',X'03',X'00' COURTROOM TELEVISION                  
         DC    C'FSN',XL2'13',X'03',X'00' FOX SPORTS NETWORK                    
         DC    C'FXN',XL2'14',X'03',X'00' FOX NEWS CHANNEL                      
         DC    C'EMP',XL2'15',X'03',X'00' EMPIRE SPORTS NETWK (ANOTHER)         
         DC    C'ESN',XL2'16',X'03',X'00' EMPIRE SPORTS NETWORK                 
ESP      DC    C'ESP',XL2'17',X'03',X'47' ESPN                                  
         DC    C'ETV',XL2'18',X'03',X'00' ENTERTAINMENT TELEVISION              
ES2      DC    C'ES2',XL2'19',X'03',X'48' ESPN2                                 
FAM      DC    C'FAM',XL2'1A',X'03',X'49' FAMILY NETWORK                        
         DC    C'FOX',XL2'1B',X'03',X'00' FOX                                   
FX       DC    C'FX ',XL2'1C',X'03',X'4A' FX CABLE NETWORK                      
         DC    C'NY1',XL2'1D',X'03',X'00' NY ONE NEWS  <RESUED FVC>             
         DC    C'GAL',XL2'1E',X'03',X'00' GALAVISION                            
         DC    C'GEM',XL2'1F',X'03',X'00' GEMVISION                             
*                                                                               
         DC    C'GOL',XL2'20',X'03',X'00' GOLF CHANNEL                          
         DC    C'GAC',XL2'21',X'03',X'00' GREAT AMERICAN COUNTRY                
HLN      DC    C'HLN',XL2'22',X'03',X'4B' HEADLINE NEWS                         
         DC    C'HSE',XL2'23',X'03',X'00' HOME SPORTS ENTERTAINMENT             
         DC    C'HTS',XL2'24',X'03',X'00' HOME TEAM SPORTS                      
         DC    C'HNL',XL2'25',X'03',X'00' HEADLINE NEWS LOCAL                   
HGT      DC    C'HGT',XL2'26',X'03',X'4C' HOME AND GARDEN TELEVISION            
         DC    C'JCN',XL2'27',X'03',X'00' JONES COMPUTER NETWORK                
         DC    C'JUK',XL2'28',X'03',X'00' JUKEBOX NETWORK  <REUSED ISP>         
         DC    C'RDB',XL2'29',X'03',X'00' ROADBLOCK NTWK   <REUSED INF>         
         DC    C'KBL',XL2'2A',X'03',X'00' KBL                                   
         DC    C'CNS',XL2'2B',X'03',X'00' CNN SI           <REUSED KCB>         
         DC    C'JAZ',XL2'2C',X'03',X'00' JAZZ NETWORK                          
         DC    C'MON',XL2'2D',X'03',X'00' MEDIA ONE NEWS                        
         DC    C'LCD',XL2'2E',X'03',X'00' LA CADENA DEPORTIVA                   
LIF      DC    C'LIF',XL2'2F',X'03',X'4D' LIFETIME                              
*                                                                               
         DC    C'LN ',XL2'30',X'03',X'00' LN                                    
         DC    C'LO ',XL2'31',X'03',X'00' LOCAL ORIGIN                          
         DC    C'MNB',XL2'32',X'03',X'00' MICROSOFT NATIONAL BDCSTG             
         DC    C'MIA',XL2'33',X'03',X'00' MIAVISION LOCAL SPANISH CH            
         DC    C'MSC',XL2'34',X'03',X'00' MIDWEST SPORTS CHANNEL                
         DC    C'MSG',XL2'35',X'03',X'00' MADISON SQUARE GARDEN NETWORK         
MTV      DC    C'MTV',XL2'36',X'03',X'4E' MUSIC TELEVISION                      
         DC    C'FNW',XL2'37',X'03',X'00' FOX SPORTS NTWK <REUSED MTL>          
         DC    C'MVC',XL2'38',X'03',X'00' MIAMI VALLEY CHANNEL                  
         DC    C'NAT',XL2'39',X'03',X'00' NORTH AMERICAN TV                     
         DC    C'NES',XL2'3A',X'03',X'00' NEW ENGLAND SPORTS NETWORK            
         DC    C'NEW',XL2'3B',X'03',X'00' NEWS                                  
NIC      DC    C'NIC',XL2'3C',X'03',X'4F' NICKELODEON                           
         DC    C'FSS',XL2'3D',X'03',X'00' FOX SPORTS NTWK SOUTHWEST             
TBS      DC    C'TBS',XL2'3E',X'03',X'50' TURNER BRDCT SYS <REUSED NOS>         
         DC    C'CNI',XL2'3F',X'03',X'00' CNN INTL         <REUSED NT >         
*                                                                               
         DC    C'NBC',XL2'40',X'03',X'00' NATIONAL BROADCAST COMPANY            
         DC    C'OCN',XL2'41',X'03',X'00' OCEAN COUNTY NEWS                     
         DC    C'HAL',XL2'42',X'03',X'00' ODYSSEY IS NOW HALLMARK               
         DC    C'OLC',XL2'43',X'03',X'00' OUTDOOR LIFE CHANNEL                  
         DC    C'PAD',XL2'44',X'03',X'00' PADR                                  
         DC    C'PAS',XL2'45',X'03',X'00' PASS                                  
         DC    C'PRT',XL2'46',X'03',X'00' PRIME TICKET                          
         DC    C'PRV',XL2'47',X'03',X'00' PREVIEW GUIDE                         
PSN      DC    C'PSN',XL2'48',X'03',X'51' PRIME SPORTS NETWORK                  
         DC    C'FSD',XL2'49',X'03',X'00' FOX SPOTS DETROIT<REUSED GUI>         
         DC    C'MET',XL2'4A',X'03',X'00' METRO SPORTS     <REUSED PAT>         
         DC    C'QVC',XL2'4B',X'03',X'00' SHOPPING CHANNEL                      
         DC    C'ANP',XL2'4C',X'03',X'00' ANMIMAL PLANET                        
         DC    C'BAY',XL2'4D',X'03',X'00' BAY TV NEWS                           
         DC    C'SPD',XL2'4E',X'03',X'00' SPEEDVISION NETWORK                   
         DC    C'CNE',XL2'4F',X'03',X'00' CNN EN ESPANOL   <REUSED RBC>         
*                                                                               
         DC    C'FIT',XL2'50',X'03',X'00' FIT TELEVISION                        
         DC    C'SCN',XL2'51',X'03',X'00' SAN DIEGO NEWS                        
         DC    C'SCC',XL2'52',X'03',X'00' SPORTSCHANNEL CHICAGO                 
         DC    C'CXS',XL2'53',X'03',X'00' COX SPORTS CHANNEL                    
         DC    C'SCF',XL2'54',X'03',X'00' SCIFI NETWORK                         
SPC      DC    C'SPC',XL2'55',X'03',X'52' SPORTSCHANNEL                         
         DC    C'SSN',XL2'56',X'03',X'00' SPORTS SOUTH NETWORK                  
         DC    C'SUN',XL2'57',X'03',X'00' SUNSHINE NETWORK                      
         DC    C'SPO',XL2'58',X'03',X'00' REGIONAL SPORTS                       
         DC    C'SPF',XL2'59',X'03',X'00' SPORTSCHANNEL FLORIDA                 
         DC    C'SPN',XL2'5A',X'03',X'00' SPORTSCHANNEL NEW YORK                
         DC    C'TVL',XL2'5B',X'03',X'00' NICKELODEON TV LAND                   
         DC    C'SCA',XL2'5C',X'03',X'00' SPORTS CH PACIFIC<RESUED TIV>         
         DC    C'FSB',XL2'5D',X'03',X'00' FOX SPT BAY AREA <REUSED TVM>         
         DC    C'TLC',XL2'5E',X'03',X'00' THE LEARNING CHANNEL                  
TDC      DC    C'TDC',XL2'5F',X'03',X'53' THE DISCOVERY CHANNEL                 
*                                                                               
         DC    C'TEL',XL2'60',X'03',X'00' TELEMUNDO                             
TNN      DC    C'TNN',XL2'61',X'03',X'54' TNN                                   
TNT      DC    C'TNT',XL2'62',X'03',X'55' TNT                                   
         DC    C'TOO',XL2'63',X'03',X'00' CARTOON CHANNEL                       
         DC    C'TTC',XL2'64',X'03',X'00' THE TRAVEL CHANNEL                    
TWC      DC    C'TWC',XL2'65',X'03',X'56' THE WEATHER CHANNEL                   
         DC    C'FOO',XL2'66',X'03',X'00' FOOD NETWORK                          
         DC    C'THC',XL2'67',X'03',X'00' THE HISTORY CHANNEL                   
         DC    C'UNI',XL2'68',X'03',X'00' UNIVISION                             
USA      DC    C'USA',XL2'69',X'03',X'57' USA                                   
         DC    C'FSC',XL2'6A',X'03',X'00' FOX SPRT CHICAGO <REUSED TWI>         
VH1      DC    C'VH1',XL2'6B',X'03',X'58' VIDEO HITS                            
         DC    C'SDN',XL2'6C',X'03',X'00' SAN DIEGO NEWSCHANNEL 15              
         DC    C'FSM',XL2'6D',X'03',X'00' FOX SPORTS MIDWEST                    
         DC    C'FSP',XL2'6E',X'03',X'00' FOX SPORTS PITTSBURGH                 
         DC    C'FSR',XL2'6F',X'03',X'00' FOX SPORTS ROCKY MOUNTAIN             
*                                                                               
         DC    C'WOR',XL2'70',X'03',X'00' WOR                                   
         DC    C'WSN',XL2'71',X'03',X'00' WISCONSIN SPORTS NETWORK              
         DC    C'WBN',XL2'72',X'03',X'00' WARNER BROTHERS NETWORK               
         DC    C'FSO',XL2'73',X'03',X'00' FOX SPORTS SOUTH                      
         DC    C'FS2',XL2'74',X'03',X'00' FOX SPORTS WEST 2                     
         DC    C'SCO',XL2'75',X'03',X'00' SPORTS CHANNEL OHIO                   
         DC    C'SCP',XL2'76',X'03',X'00' SPORTS CHANNEL PLUS                   
         DC    C'SPB',XL2'77',X'03',X'00' SPORTS CHANNEL BAY AREA               
         DC    C'SPP',XL2'78',X'03',X'00' SPORTS CH PHILADELPHIA                
         DC    C'CCP',XL2'79',X'03',X'00' SPORTS CH CHICAGO PLUS                
         DC    C'SPE',XL2'7A',X'03',X'00' SPORTS CHANNEL NEW ENGLAND            
         DC    C'KNO',XL2'7B',X'03',X'00' KNOWLEDGE NETWORK                     
         DC    C'PPV',XL2'7C',X'03',X'00' PAY-PER-VIEW                          
         DC    C'COX',XL2'7D',X'03',X'00' COX SPORTS PHOENIX                    
         DC    C'GAM',XL2'7E',X'03',X'00' GAME SHOW NETWORK                     
         DC    C'CAS',XL2'7F',X'03',X'00' CASA                                  
***********************************************************************         
***  THE FOLLOWING NETWORKS WERE ADDED TO THE LIST AFTER THE CABLE              
***  CONVERSION FOR THE NEW STAPACK  - WHOA 14MAY98                             
***********************************************************************         
         DC    C'SNE',XL2'80',X'03',X'00' COMCAST SPORTSNET (CSNT)              
         DC    C'FNE',XL2'81',X'03',X'00' FOX SPORTS NEW ENGLAND                
         DC    C'FNY',XL2'82',X'03',X'00' FOX SPORTS NEW YORK                   
         DC    C'FXO',XL2'83',X'03',X'00' FOX SPORTS OHIO                       
         DC    C'ZN4',XL2'84',X'03',X'00' ZONE 4 NEWS                           
         DC    C'ZN5',XL2'85',X'03',X'00' ZONE 5 NEWS                           
         DC    C'ZN6',XL2'86',X'03',X'00' ZONE 6 NEWS                           
         DC    C'BOX',XL2'87',X'03',X'00' THE VIDEO JUKEBOX                     
         DC    C'SNP',XL2'88',X'03',X'00' SNEAK PREVIEW                         
         DC    C'CNF',XL2'89',X'03',X'00' CNN FINANCIAL NEWS                    
         DC    C'AAT',XL2'8A',X'03',X'00' ASIAN AMERICAN TV                     
         DC    C'AHN',XL2'8B',X'03',X'00' AMERICAN HEALTH NETWORK               
         DC    C'CSN',XL2'8C',X'03',X'00' CLASSIC SPORTS CHANNEL                
         DC    C'KAL',XL2'8D',X'03',X'00' KALEIDOSCOPE                          
         DC    C'OLN',XL2'8E',X'03',X'00' OUTDOOR LIFE NETWORK                  
         DC    C'UPN',XL2'8F',X'03',X'00' UNITED PARAMOUNT NETWORK              
*                                                                               
         DC    C'NEC',XL2'90',X'03',X'00' NEW ENGLAND CABLE NEWS                
         DC    C'TWP',XL2'91',X'03',X'00' TIME WARNER PROGRAMMING NTWK          
         DC    C'TRC',XL2'92',X'03',X'00' LOCAL WEATHER RADAR TRACK             
         DC    C'LWW',XL2'93',X'03',X'00' NEWS WATCH CHANNEL 15                 
         DC    C'AMC',XL2'94',X'03',X'00' AMERICA MOVIE CLASSIC                 
         DC    C'WOL',XL2'95',X'03',X'00' CHICAGO WOLVES HOCKEY NTWK            
         DC    C'KAK',XL2'96',X'03',X'00' ABC CH 51                             
         DC    C'BRV',XL2'97',X'03',X'00' BRAVO                                 
         DC    C'PAX',XL2'98',X'03',X'00' PAX                                   
         DC    C'RIN',XL2'99',X'03',X'00' RHODE ISLAND NEWS CHANNEL             
         DC    C'GTV',XL2'9A',X'03',X'00' GOODLIFE TELEVISION NETWORK           
         DC    C'ZDT',XL2'9B',X'03',X'00' ZIFF DAVIS TV                         
         DC    C'TVG',XL2'9C',X'03',X'00' TV GUIDE CHANNEL                      
         DC    C'BY9',XL2'9D',X'03',X'00' BAY NEWS 9                            
         DC    C'CX3',XL2'9E',X'03',X'00' COX SPORTSCHANNEL CHANNEL 3           
         DC    C'RSO',XL2'9F',X'03',X'00' RED SOX CHANNEL                       
*                                                                               
         DC    C'NWC',XL2'A0',X'03',X'00' NORTH WEST NEWS CHANNEL               
         DC    C'TSO',XL2'A1',X'03',X'00' TURNER SOUTH NTWK- FORM TSN           
         DC    C'CH1',XL2'A2',X'03',X'00' MEDIA 1 CHANNEL 3                     
         DC    C'LNC',XL2'A3',X'03',X'00' LOCAL NEWS ON CABLE                   
         DC    C'DSN',XL2'A4',X'03',X'00' DISNEY CHANNEL                        
         DC    C'FXS',XL2'A5',X'03',X'00' FOX SPORT WORLD(SENT AS FSWD)         
         DC    C'CMK',XL2'A6',X'03',X'00' CABLE MARKETPLACE                     
         DC    C'STY',XL2'A7',X'03',X'00' THE STYLE NETWORK                     
         DC    C'ECL',XL2'A8',X'03',X'00' ESPN CLASSIC                          
         DC    C'CN8',XL2'A9',X'03',X'00' THE COMCAST NETWORK                   
         DC    C'HSN',XL2'AA',X'03',X'00' HOME SHOPPING NETWORK                 
         DC    C'HLT',XL2'AB',X'03',X'00' DISCOVERY HEALTH NETWORK              
         DC    C'RNW',XL2'AC',X'03',X'00' ROCHESTER LOCAL NEWS                  
         DC    C'DSK',XL2'AD',X'03',X'00' DISCOVERY KIDS LATIN AMERICA          
         DC    C'FSE',XL2'AE',X'03',X'00' FOX SPORTS WORLD EN ESPANOL           
         DC    C'OXY',XL2'AF',X'03',X'00' OXYGEN                                
*                                                                               
         DC    C'FNN',XL2'B0',X'03',X'00' FINANCIAL NEWS NETWORK                
         DC    C'CLT',XL2'B1',X'03',X'00' CHICAGOLAND TV                        
         DC    C'FXM',XL2'B2',X'03',X'00' FOX MOVIES                            
         DC    C'TCM',XL2'B3',X'03',X'00' TURNER CLASSIC MOVIES                 
         DC    C'OVT',XL2'B4',X'03',X'00' OVATION                               
         DC    C'FSF',XL2'B5',X'03',X'00' FOX SPORTS FLA SENT AS FSFL           
         DC    C'ENN',XL2'B6',X'03',X'00' ESPNEWS                               
         DC    C'MTR',XL2'B7',X'03',X'00' METRO GUIDE                           
         DC    C'AUN',XL2'B8',X'03',X'00' NEWS 8 AUSTIN                         
         DC    C'T33',XL2'B9',X'03',X'00' TV33                                  
         DC    C'SOP',XL2'BA',X'03',X'00' SOAP                                  
         DC    C'AJS',XL2'BB',X'03',X'00' AM JEWLERY STORE                      
         DC    C'ATN',XL2'BC',X'03',X'00' AMERICA'S TALKING NETWORK             
         DC    C'FNC',XL2'BD',X'03',X'00' FLORIDA NEWS CHANNEL                  
         DC    C'TEC',XL2'BE',X'03',X'00' TECH TV                               
         DC    C'ATT',XL2'BF',X'03',X'00' ATT3                                  
*                                                                               
         DC    C'NWT',XL2'C0',X'03',X'00' NEWS 12 LONG ISLAND                   
         DC    C'STC',XL2'C1',X'03',X'00' ST. CLOUD STATE UNIVERSITY            
         DC    C'MAS',XL2'C2',X'03',X'00' MAS! ARIZONA                          
         DC    C'TCC',XL2'C3',X'03',X'00' THE COMEDY CHANNEL                    
         DC    C'CAB',XL2'C4',X'03',X'00' CABLE LOCAL SPORTS (CH 65)            
         DC    C'MTW',XL2'C5',X'03',X'00' METRO TRAFFIC AND WEATHER             
         DC    C'NOS',XL2'C6',X'03',X'00' NOSTAGLIA                             
         DC    C'CFN',XL2'C7',X'03',X'00' CENTRAL FLORIDA NEWS 13               
         DC    C'LC5',XL2'C8',X'03',X'00' NEWS CHANNEL 5 PLUS                   
         DC    C'LV1',XL2'C9',X'03',X'00' LAS VEGAS ONE NEWS                    
         DC    C'MSN',XL2'CA',X'03',X'00' MIDSOUTH NEWS NET                     
         DC    C'N53',XL2'CB',X'03',X'00' NEWS NOW 53                           
         DC    C'NO1',XL2'CC',X'03',X'00' NEWS ON ONE                           
         DC    C'NBX',XL2'CD',X'03',X'00' NEWS 12 BRONX                         
         DC    C'NCT',XL2'CE',X'03',X'00' NEWS 12 CONNECTICUT                   
         DC    C'NNJ',XL2'CF',X'03',X'00' NEWS 12 NEW JERSEY                    
*                                                                               
         DC    C'NWW',XL2'D0',X'03',X'00' NEWS 12 WESTCHESTER                   
         DC    C'ONN',XL2'D1',X'03',X'00' OHIO NEWS NET                         
         DC    C'TXC',XL2'D2',X'03',X'00' TEXAS CABLE NEWS                      
         DC    C'WRN',XL2'D3',X'03',X'00' WRNN                                  
         DC    C'PCN',XL2'D4',X'03',X'00' PITTSBURG CABLE NEWS                  
         DC    C'TDS',XL2'D5',X'03',X'00' TOON DISNEY CHANNEL                   
         DC    C'LMN',XL2'D6',X'03',X'00' LIFETIME MOVIE NETWORK                
         DC    C'KUS',XL2'D7',X'03',X'00' KUSI SAN DIEGO                        
         DC    C'HRN',XL2'D8',X'03',X'00' THE HORSE RACING NETWORK              
         DC    C'MUC',XL2'D9',X'03',X'00' MUCH MUSIC                            
         DC    C'ESD',XL2'DA',X'03',X'00' ESPN DEPORTES                         
         DC    C'BBA',XL2'DB',X'03',X'00' BBC AMERICA                           
         DC    C'BTV',XL2'DC',X'03',X'00' BLOOMBERG TV                          
         DC    C'TDI',XL2'DD',X'03',X'00' DISCOVERY SCIENCE                     
         DC    C'TDW',XL2'DE',X'03',X'00' DISCOVERY WINGS                       
         DC    C'M2 ',XL2'DF',X'03',X'00' MTV2                                  
*                                                                               
         DC    C'CXX',XL2'E0',X'03',X'00' LOCAL NET FOR 0228                    
         DC    C'MTL',XL2'E1',X'03',X'00' MTV LATIN                             
         DC    C'CH8',XL2'E2',X'03',X'00' CHANNEL 8 KVBA                        
         DC    C'TIN',XL2'E3',X'03',X'00' TELEMUNDO INTERNATIONAL               
         DC    C'NGC',XL2'E4',X'03',X'00' NATIONAL GEOGRAPHIC CHANNEL           
         DC    C'MUN',XL2'E5',X'03',X'00' MUNDOS CABLE                          
         DC    C'FST',XL2'E6',X'03',X'00' FOX SPORTS NET - NORTH                
         DC    C'FSI',XL2'E7',X'03',X'00' FOX SPORTS NET - WISCONSIN            
         DC    C'PTL',XL2'E8',X'03',X'00' PORTLAND LONG FORMAT                  
         DC    C'BIO',XL2'E9',X'03',X'00' A&E BIOGRAPHY                         
* NCC DOES NOT SUPPORT NEXT ENTRY, BUT LCI IS BUYING IT                         
         DC    C'KAW',XL2'EA',X'03',X'00' LCI CONVERSIONI !                     
         DC    C'T13',XL2'EB',X'03',X'00' TV13                                  
         DC    C'BYS',XL2'EC',X'03',X'00' BAY NEWS 9 EN ESPANOL                 
         DC    C'WE ',XL2'ED',X'03',X'00' WOMEN'S ENTERTAINMENT                 
         DC    C'INT',XL2'EE',X'03',X'00' INTERNATIONAL CHANNEL                 
         DC    C'LWC',XL2'EF',X'03',X'00' LOCAL WEATHER CHANNEL                 
*                                                                               
         DC    C'HST',XL2'F0',X'03',X'00' HISTORY CHANNEL INTERNATIONAL         
         DC    C'TDE',XL2'F1',X'03',X'00' TOON DISNEY EN ESPANOL                
         DC    C'YES',XL2'F2',X'03',X'00' YANKEE ENTERT. SPORTS NETWK           
         DC    C'ME2',XL2'F3',X'03',X'00' METRO STORIES CHANNEL                 
* NCC DOES NOT SUPPORT NEXT ENTRY BUT LCI IS BUYING IT !                        
         DC    C'ASN',XL2'F4',X'03',X'00' ACTION SPORTS (LCI CONV)              
         DC    C'DIY',XL2'F5',X'03',X'00' DO IT YOURSELF NTWK                   
         DC    C'NW9',XL2'F6',X'03',X'00' NEWS 9 ALBANY                         
         DC    C'SNN',XL2'F7',X'03',X'00' SARASOTA NEWS                         
         DC    C'LRW',XL2'F8',X'03',X'00' LIFETIME REAL WOMEN                   
         DC    C'FRP',XL2'F9',X'03',X'00' FOX SPORTS NET - ROHNERT PARK         
         DC    C'N24',XL2'FA',X'03',X'00' NEWS 24 HOUSTON                       
         DC    C'CCT',XL2'FB',X'03',X'00' CHARTER COMM. INFO. NETWORK           
         DC    C'N14',XL2'FC',X'03',X'00' NEWS CAROLINA 14                      
         DC    C'O16',XL2'FD',X'03',X'00' OCEANIC CABLE 16                      
         DC    C'CSS',XL2'FE',X'03',X'00' COMCAST/CHARTER                       
         DC    C'IC6',XL2'FF',X'03',X'00' LOCAL NEWS/TRAFFC NORTHERN KY         
*                                                                               
         DC    C'N9S',X'0100',X'03',X'00' NEWS 9 SAN ANTONIO                    
         DC    C'DHO',X'0101',X'03',X'00' DISCOVERY HOME & LEISURE              
         DC    C'SIV',X'0102',X'03',X'00' SINOVISION                            
         DC    C'CXT',X'0103',X'03',X'00' COX SPORTS TELEVISION 37              
         DC    C'FUS',X'0104',X'03',X'00' FUSE, FORMER MUC - MUCH MUSIC         
         DC    C'BLZ',X'0105',X'03',X'00' BLAZERVISION                          
         DC    C'NYN',X'0106',X'03',X'00' NEW YORK 1 NOTICIAS                   
         DC    C'SPK',X'0107',X'03',X'00' SPIKE TV                              
         DC    C'KBE',X'0108',X'03',X'00' UPN AFFIL AUSTN,SAN ANTONIO           
         DC    C'BSN',X'0109',X'03',X'00' BIG SKY NETWORK                       
         DC    C'JNW',X'010A',X'03',X'00' JAMESTOWN NEWS 8                      
         DC    C'TWS',X'010B',X'03',X'00' TIME WARNER SPORTS CHANNEL            
*                                                                               
         DC    X'FF'                                                            
