*          DATA SET SPCNCBLTAB AT LEVEL 021 AS OF 11/24/09                      
*====================================================================*          
*  SUFXTAB IS IN ALPHA SEQUENCE ON 2-BYTE ALPHA CODES                *          
*      ENTRIES ARE 2-BYTE ALPHA MARKET                                          
*                  1-BYTE BINARY MARKET                                         
*                  3-BYTE SPILL MARKET                                          
*  SUFXTAB2 IS IN SEQUENCE ON 1-BYTE BINARY CODES                               
*====================================================================*          
                                                                                
*===>                                                                           
*===> IF YOU ADD AN ENTRY, BE SURE TO UPDATE BOTH TABLES !!!!                   
*===>                                                                           
                                                                                
SETSFX   BASR  R1,RE               SET ADDRESS OF TABLE BELOW                   
*                                                                               
SUFXTAB  DS    0CL6                                                             
         DC    C'BA',X'C0',C'BAR'      EST 0                                    
         DC    C'BR',X'C1',C'BRA'      CST -1                                   
         DC    C'CA',X'C2',C'CAL'      MST -2                                   
         DC    C'CE',X'FD',C'CLE'      MST -2                                   
         DC    C'CH',X'C3',C'CHA'      AST +1                                   
         DC    C'CJ',X'C4',C'CHI'      EST 0                                    
         DC    C'CL',X'C5',C'CAR'      EST 0                                    
         DC    C'CR',X'C6',C'COR'      NST +1.5                                 
         DC    C'DA',X'C7',C'DAW'      PST -3                                   
         DC    C'ED',X'C8',C'EDM'      MST -2                                   
         DC    C'HA',X'C9',C'HAL'      AST +1                                   
         DC    C'HM',X'CA',C'HAM'      EST 0                                    
         DC    C'KA',X'FA',C'KAM'      PST -3                                   
         DC    C'KE',X'CB',C'KEL'      PST -3                                   
         DC    C'KI',X'CC',C'KIN'      EST 0                                    
         DC    C'KL',X'CD',C'KTL'      EST 0                                    
         DC    C'KN',X'CE',C'KEN'      EST 0                                    
         DC    C'KO',X'FE',C'KOO'      PST -3                                   
         DC    C'KP',X'B2',C'PGK'                                               
         DC    C'KT',X'CF',C'KIT'      EST 0                                    
         DC    C'KW',X'B3',C'KLW'                                               
         DC    C'LE',X'D0',C'LET'      MST -2                                   
         DC    C'LL',X'D1',C'LLO'      MST -2                                   
         DC    C'LO',X'D2',C'LON'      EST 0                                    
         DC    C'ME',X'D3',C'MHT'      MST -2                                   
         DC    C'MF',X'D4',C'MOF'      MST -2                                   
         DC    C'MO',X'D5',C'MON'      EST 0                                    
         DC    C'NB',X'D6',C'NBY'      EST 0                                    
         DC    C'NE',X'B0',C'   '                                               
         DC    C'NF',X'B1',C'   '                                               
         DC    C'OF',X'D7',C'OTF'      EST 0                                    
         DC    C'OK',X'FB',C'OKA'                                               
         DC    C'OT',X'D8',C'OTT'      EST 0                                    
         DC    C'PA',X'D9',C'PAL'      CST -1                                   
         DC    C'PE',X'DA',C'PET'      EST 0                                    
         DC    C'PG',X'DB',C'PGE'      PST -3                                   
         DC    C'PK',X'DC',C'PGT'      PST -3                                   
         DC    C'PM',X'DD',C'PEM'      EST 0                                    
         DC    C'QU',X'DE',C'QUE'      EST 0                                    
         DC    C'RD',X'DF',C'RED'      MST -2                                   
         DC    C'RE',X'E0',C'REG'      CST -1                                   
         DC    C'RI',X'E1',C'RIM'      EST 0                                    
         DC    C'RN',X'E2',C'ROU'      EST 0                                    
         DC    C'RO',X'E3',C'RIV'      EST 0                                    
         DC    C'SA',X'E4',C'SAS'      CST -1                                   
         DC    C'SF',X'E5',C'SMF'      AST +1                                   
         DC    C'SH',X'E6',C'SHR'      EST 0                                    
         DC    C'SJ',X'E7',C'STJ'      NST +1.5                                 
         DC    C'SM',X'E8',C'SJM'      AST +1                                   
         DC    C'SN',X'E9',C'SUD'      EST 0                                    
         DC    C'SS',X'FC',C'SSM'      EST 0                                    
         DC    C'ST',X'EA',C'SSM'      EST 0                                    
         DC    C'SU',X'EB',C'SUD'      EST 0                                    
         DC    C'SW',X'EC',C'SWC'      CST -1                                   
         DC    C'SY',X'ED',C'SYD'      AST +1                                   
         DC    C'TB',X'EE',C'THB'      EST 0                                    
         DC    C'TK',X'EF',C'TER'      PST -3                                   
         DC    C'TM',X'F0',C'TIM'      EST 0                                    
         DC    C'TO',X'F1',C'TOR'      EST 0                                    
         DC    C'TR',X'F2',C'TRV'      EST 0                                    
         DC    C'VA',X'F3',C'VAN'      PST -3                                   
         DC    C'VI',X'F4',C'VIC'      PST -3                                   
         DC    C'WH',X'F5',C'WHI'      PST -3                                   
         DC    C'WI',X'F6',C'WND'      EST 0                                    
         DC    C'WP',X'F7',C'WPG'      CST -1                                   
         DC    C'YE',X'F8',C'YEL'      MST -2                                   
         DC    C'YO',X'F9',C'YOR'      CST -1                                   
         DC    C'ZA',X'B9',C'XXX'                                               
         DC    C'ZB',X'BA',C'XXX'                                               
         DC    C'ZC',X'BB',C'XXX'                                               
         DC    C'ZD',X'BC',C'XXX'                                               
         DC    C'ZE',X'BD',C'XXX'                                               
         DC    C'ZF',X'BE',C'XXX'                                               
         DC    C'ZG',X'BF',C'XXX'                                               
         DC    C'Z5',X'B4',C'XXX'                                               
         DC    C'Z6',X'B5',C'XXX'                                               
         DC    C'Z7',X'B6',C'XXX'                                               
         DC    C'Z8',X'B7',C'XXX'                                               
         DC    C'Z9',X'B8',C'XXX'                                               
SUFXTABN EQU   (*-SUFXTAB)/L'SUFXTAB   NUMBER OF TABLE ENTRIES                  
*                                                                               
         DS    0D                                                               
SETSFX2  BASR  R1,RE               SET ADDRESS OF TABLE BELOW                   
SUFXTAB2 DS    0CL3                                                             
         DC    C'NE',X'B0'                                                      
         DC    C'NF',X'B1'                                                      
         DC    C'KP',X'B2'                                                      
         DC    C'KW',X'B3'                                                      
         DC    C'Z5',X'B4'                                                      
         DC    C'Z6',X'B5'                                                      
         DC    C'Z7',X'B6'                                                      
         DC    C'Z8',X'B7'                                                      
         DC    C'Z9',X'B8'                                                      
         DC    C'ZA',X'B9'                                                      
         DC    C'ZB',X'BA'                                                      
         DC    C'ZC',X'BB'                                                      
         DC    C'ZD',X'BC'                                                      
         DC    C'ZE',X'BD'                                                      
         DC    C'ZF',X'BE'                                                      
         DC    C'ZG',X'BF'                                                      
         DC    C'BA',X'C0'                                                      
         DC    C'BR',X'C1'                                                      
         DC    C'CA',X'C2'                                                      
         DC    C'CH',X'C3'                                                      
         DC    C'CJ',X'C4'                                                      
         DC    C'CL',X'C5'                                                      
         DC    C'CR',X'C6'                                                      
         DC    C'DA',X'C7'                                                      
         DC    C'ED',X'C8'                                                      
         DC    C'HA',X'C9'                                                      
         DC    C'HM',X'CA'                                                      
         DC    C'KE',X'CB'                                                      
         DC    C'KI',X'CC'                                                      
         DC    C'KL',X'CD'                                                      
         DC    C'KN',X'CE'                                                      
         DC    C'KT',X'CF'                                                      
         DC    C'LE',X'D0'                                                      
         DC    C'LL',X'D1'                                                      
         DC    C'LO',X'D2'                                                      
         DC    C'ME',X'D3'                                                      
         DC    C'MF',X'D4'                                                      
         DC    C'MO',X'D5'                                                      
         DC    C'NB',X'D6'                                                      
         DC    C'OF',X'D7'                                                      
         DC    C'OT',X'D8'                                                      
         DC    C'PA',X'D9'                                                      
         DC    C'PE',X'DA'                                                      
         DC    C'PG',X'DB'                                                      
         DC    C'PK',X'DC'                                                      
         DC    C'PM',X'DD'                                                      
         DC    C'QU',X'DE'                                                      
         DC    C'RD',X'DF'                                                      
         DC    C'RE',X'E0'                                                      
         DC    C'RI',X'E1'                                                      
         DC    C'RN',X'E2'                                                      
         DC    C'RO',X'E3'                                                      
         DC    C'SA',X'E4'                                                      
         DC    C'SF',X'E5'                                                      
         DC    C'SH',X'E6'                                                      
         DC    C'SJ',X'E7'                                                      
         DC    C'SM',X'E8'                                                      
         DC    C'SN',X'E9'                                                      
         DC    C'ST',X'EA'                                                      
         DC    C'SU',X'EB'                                                      
         DC    C'SW',X'EC'                                                      
         DC    C'SY',X'ED'                                                      
         DC    C'TB',X'EE'                                                      
         DC    C'TK',X'EF'                                                      
         DC    C'TM',X'F0'                                                      
         DC    C'TO',X'F1'                                                      
         DC    C'TR',X'F2'                                                      
         DC    C'VA',X'F3'                                                      
         DC    C'VI',X'F4'                                                      
         DC    C'WH',X'F5'                                                      
         DC    C'WI',X'F6'                                                      
         DC    C'WP',X'F7'                                                      
         DC    C'YE',X'F8'                                                      
         DC    C'YO',X'F9'                                                      
         DC    C'KA',X'FA'                                                      
         DC    C'OK',X'FB'                                                      
         DC    C'SS',X'FC'                                                      
         DC    C'CE',X'FD'                                                      
         DC    C'KO',X'FE'                                                      
