*          DATA SET SPCSOE1D   AT LEVEL 006 AS OF 01/27/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T218E1D      DATE 01/27/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL8      5   10    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    N         T        Y              
PROCLTH  DS    CL8                                                              
PROCLT   DS    CL8      5   28    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A   P    N         T        Y              
PROSTAH  DS    CL8                                                              
PROSTA   DS    CL8      5   46    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL3      5   56    3  A   P    N         T        Y              
PROESTH  DS    CL8                                                              
PROEST   DS    CL5      5   60    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL3      5   67    3  A   P    N         T        Y              
PROREFH  DS    CL8                                                              
PROREF   DS    CL3      5   71    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
PROOPTH  DS    CL8                                                              
PROOPT   DS    CL63     6   10   63  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    7    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     8   14   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   37    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      8   47    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8   77    1  A   P    N         T        Y              
PROSELH  DS    CL8                                                              
PROSEL   DS    CL3      9    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A   P    N         T        Y              
PROTAGH  DS    CL8                                                              
PROTAG   DS    CL1     24    2    1  A   P    N         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1704 BYTES                            
