*          DATA SET SPCSOF3D   AT LEVEL 009 AS OF 06/23/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T218F3D      DATE 06/23/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
ALLMEDH  DS    CL8                                                              
ALLMED   DS    CL8      5   10    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    N         T        Y              
ALLCLTH  DS    CL8                                                              
ALLCLT   DS    CL8      5   28    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A   P    N         T        Y              
ALLSTAH  DS    CL8                                                              
ALLSTA   DS    CL8      5   46    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL3      5   56    3  A   P    N         T        Y              
ALLESTH  DS    CL8                                                              
ALLEST   DS    CL5      5   60    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
ALLDATAH DS    CL8                                                              
ALLDATA  DS    CL26     6   10   26  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  A   P    N         T        Y              
ALLOPTH  DS    CL8                                                              
ALLOPT   DS    CL30     6   46   30  A   U    H         T        Y              
ALLL1H   DS    CL8                                                              
ALLL1    DS    CL78     7    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78     8    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78     9    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    10    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    11    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    12    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    13    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    14    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    15    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    16    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    17    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    18    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    19    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    20    1   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    21    1   78  A   P    N         T        Y              
ALLQUA1H DS    CL8                                                              
ALLQUA1  DS    CL78    22    1   78  A   P    N         T        Y              
ALLQUA2H DS    CL8                                                              
ALLQUA2  DS    CL78    23    1   78  A   P    N         T        Y              
ALLTOTSH DS    CL8                                                              
ALLTOTS  DS    CL78    24    1   78  A   P    H         T        Y              
ALLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
ALLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1784 BYTES                            
