*          DATA SET SPCSOE3D   AT LEVEL 006 AS OF 07/25/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T218E3D      DATE 07/25/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
MOVMEDH  DS    CL8                                                              
MOVMED   DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
MOVCLTH  DS    CL8                                                              
MOVCLT   DS    CL8      5   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
MOVMKTH  DS    CL8                                                              
MOVMKT   DS    CL8      5   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
MOVFESTH DS    CL8                                                              
MOVFEST  DS    CL8      6   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
MOVTESTH DS    CL8                                                              
MOVTEST  DS    CL8      6   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
MOVFWKH  DS    CL8                                                              
MOVFWK   DS    CL8      7   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   20    5  A  P N             T        Y              
MOVTWKH  DS    CL8                                                              
MOVTWK   DS    CL8      7   28    8  A  U N             T        Y              
MOVTAGH  DS    CL8                                                              
MOVTAG   DS    CL1      8    2    1  A  P N             T        Y              
MOVLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
MOVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
