*          DATA SET SPCSOC1D   AT LEVEL 006 AS OF 08/27/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T218C1D      DATE 08/27/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P N             T        Y              
SHOCODEH DS    CL8                                                              
SHOCODE  DS    CL10     5   12   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      7    7    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      7   20    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7   52    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   77    1  A  P N             T        Y              
SHOSELH  DS    CL8                                                              
SHOSEL   DS    CL3      8    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74     8    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
SHOTAGH  DS    CL8                                                              
SHOTAG   DS    CL1     23    2    1  A  P N             T        Y              
SHOLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SHOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1512 BYTES                            
