*          DATA SET SPCSOF2D   AT LEVEL 018 AS OF 08/02/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T218F2D      DATE 08/02/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
PERMEDH  DS    CL8                                                              
PERMED   DS    CL8      5   10    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
PERCLTH  DS    CL8                                                              
PERCLT   DS    CL8      5   28    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
PERMKTH  DS    CL8                                                              
PERMKT   DS    CL8      5   46    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      5   56    3  A  P N             T        Y              
PERESTH  DS    CL8                                                              
PEREST   DS    CL5      5   60    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PEROPTH  DS    CL8                                                              
PEROPT   DS    CL63     6   10   63  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   20   10  A  P N             T        Y              
PERL1H   DS    CL8                                                              
PERL1    DS    CL8      9    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60     9   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    10   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    11   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    12   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    13   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    14   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    15   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    16   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    17   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    18   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    19   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    20   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    21   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    22   20   60  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     23    2    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL60    23   20   60  A  U H             T        Y              
PERLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
PERWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1520 BYTES                            
