*          DATA SET SPCSOF8D   AT LEVEL 008 AS OF 10/29/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T218F8D      DATE 10/29/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
BUYMEDH  DS    CL8                                                              
BUYMED   DS    CL8      5   10    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
BUYCLTH  DS    CL8                                                              
BUYCLT   DS    CL8      5   28    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
BUYSTAH  DS    CL8                                                              
BUYSTA   DS    CL8      5   46    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      5   56    3  A  P N             T        Y              
BUYESTH  DS    CL8                                                              
BUYEST   DS    CL5      5   60    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     6    2   10  A  P N             T        Y              
BUYRETRH DS    CL8                                                              
BUYRETR  DS    CL5      6   13    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10     6   20   10  A  P N             T        Y              
BUYDATEH DS    CL8                                                              
BUYDATE  DS    CL9      6   33    9  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL9      6   46    9  A  P N             T        Y              
BUYOPTH  DS    CL8                                                              
BUYOPT   DS    CL20     6   56   20  A  U H             T        Y              
BUYLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
BUYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 240  BYTES                            
