*          DATA SET SPCSOFED   AT LEVEL 001 AS OF 04/29/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T218FED      DATE 04/29/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
REQMEDH  DS    CL8                                                              
REQMED   DS    CL8      5   10    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
REQCLTH  DS    CL8                                                              
REQCLT   DS    CL8      5   28    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
REQSTAH  DS    CL8                                                              
REQSTA   DS    CL8      5   46    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12     6    2   12  A  P N             T        Y              
REQCSH3H DS    CL8                                                              
REQCSH3  DS    CL4      6   20    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12     6   28   12  A  P N             T        Y              
REQCSH6H DS    CL8                                                              
REQCSH6  DS    CL5      6   46    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REQEST3H DS    CL8                                                              
REQEST3  DS    CL4      7   20    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12     7   28   12  A  P N             T        Y              
REQEST6H DS    CL8                                                              
REQEST6  DS    CL5      7   46    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
REQL1H   DS    CL8                                                              
REQL1    DS    CL78     9    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    11    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    1   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    1   78  A  P N             T        Y              
REQTOTSH DS    CL8                                                              
REQTOTS  DS    CL78    24    1   78  A  P N             T        Y              
REQLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
REQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1616 BYTES                            
