*          DATA SET SPCSOFDD   AT LEVEL 011 AS OF 03/01/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T218FDD      DATE 03/01/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
REQMEDH  DS    CL8                                                              
REQMED   DS    CL8      5   10    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    N         T        Y              
REQCLTH  DS    CL8                                                              
REQCLT   DS    CL8      5   28    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  A   P    N         T        Y              
REQMKTH  DS    CL8                                                              
REQMKT   DS    CL8      5   46    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL12     5   56   12  A   P    N         T        Y              
REQESTH  DS    CL8                                                              
REQEST   DS    CL5      5   70    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
REQOPTH  DS    CL8                                                              
REQOPT   DS    CL25     6   10   25  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL18     6   38   18  A   P    N         T        Y              
REQTGLH  DS    CL8                                                              
REQTGL   DS    CL10     6   58   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      8   22    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8   62    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A   P    N         T        Y              
REQGL30H DS    CL8                                                              
REQGL30  DS    CL16     9   22   16  A   P    N         T        Y              
REQGL3XH DS    CL8                                                              
REQGL3X  DS    CL16     9   42   16  A   P    N         T        Y              
REQGL60H DS    CL8                                                              
REQGL60  DS    CL16     9   62   16  A   P    N         T        Y              
REQGLXH  DS    CL8                                                              
REQGLX   DS    CL4     11    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   22    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   42    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   62    3  A   P    N         T        Y              
REQL1H   DS    CL8                                                              
REQL1    DS    CL16    12    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    12   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    12   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    12   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    13    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    13   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    13   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    13   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    14    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    14   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    14   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    14   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    15    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    15   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    15   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    15   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    16   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    16   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    16   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    17    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    17   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    17   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    17   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    18    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    18   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    18   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    18   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    19    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    19   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    19   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    19   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    20    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    20   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    20   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    20   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    21    2   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    21   22   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    21   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    21   62   16  A   P    N         T        Y              
REQDSHH  DS    CL8                                                              
REQDSH   DS    CL16    22   22   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    22   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    22   62   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     23    2    9  A   P    N         T        Y              
REQTNTPH DS    CL8                                                              
REQTNTP  DS    CL16    23   22   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    23   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    23   62   16  A   P    N         T        Y              
REQTNTXH DS    CL8                                                              
REQTNTX  DS    CL14    24    2   14  A   P    N         T        Y              
REQTAVCH DS    CL8                                                              
REQTAVC  DS    CL16    24   22   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    24   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    24   62   16  A   P    N         T        Y              
REQLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
REQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1616 BYTES                            
