*          DATA SET SPCSOE5D   AT LEVEL 002 AS OF 08/17/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T218E5D      DATE 08/17/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL8      5   10    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
PROCLTH  DS    CL8                                                              
PROCLT   DS    CL8      5   28    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
PROSTAH  DS    CL8                                                              
PROSTA   DS    CL8      5   46    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      5   56    3  A  P N             T        Y              
PROESTH  DS    CL8                                                              
PROEST   DS    CL5      5   60    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      5   67    3  A  P N             T        Y              
PROREFH  DS    CL8                                                              
PROREF   DS    CL3      5   71    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
PROFTDH  DS    CL8                                                              
PROFTD   DS    CL20     6   11   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
PROLTDH  DS    CL8                                                              
PROLTD   DS    CL20     7   11   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
PRODURH  DS    CL8                                                              
PRODUR   DS    CL20     8   11   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
PROSEGH  DS    CL8                                                              
PROSEG   DS    CL20     9   11   20  A  U H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
