*          DATA SET SPDARERROR AT LEVEL 064 AS OF 11/03/20                      
ERRORLST DS    0H                                                               
***********************************************************************         
* COMMON ERRORS (1-100)                                                         
***********************************************************************         
ERR001   DC    AL1(ERR001X-ERR001),CL3'001'                                     
         DC    C'Actual/trailer counts not equal'                               
ERR001X  DS    0H                                                               
*                                                                               
ERR002   DC    AL1(ERR002X-ERR002),CL3'002'                                     
         DC    C'Unknown record type in transmission'                           
ERR002X  DS    0H                                                               
*                                                                               
ERR003   DC    AL1(ERR003X-ERR003),CL3'003'                                     
         DC    C'Header record missing'                                         
ERR003X  DS    0H                                                               
*                                                                               
ERR004   DC    AL1(ERR004X-ERR004),CL3'004'                                     
         DC    C'Trailer record missing'                                        
ERR004X  DS    0H                                                               
*                                                                               
ERR005   DC    AL1(ERR005X-ERR005),CL3'005'                                     
         DC    C'Unknown destination id'                                        
ERR005X  DS    0H                                                               
*                                                                               
ERR006   DC    AL1(ERR006X-ERR006),CL3'006'                                     
         DC    C'Unknown station'                                               
ERR006X  DS    0H                                                               
*                                                                               
ERR007   DC    AL1(ERR007X-ERR007),CL3'007'                                     
         DC    C'Unknown agency'                                                
ERR007X  DS    0H                                                               
*                                                                               
ERR008   DC    AL1(ERR008X-ERR008),CL3'008'                                     
         DC    C'No Buys added'                                                 
ERR008X  DS    0H                                                               
*                                                                               
ERR009   DC    AL1(ERR009X-ERR009),CL3'009'                                     
         DC    C'Please send on Monday'                                         
ERR009X  DS    0H                                                               
*                                                                               
ERR010   DC    AL1(ERR010X-ERR010),CL3'010'                                     
         DC    C'Null record'                                                   
ERR010X  DS    0H                                                               
*                                                                               
ERR011   DC    AL1(ERR011X-ERR011),CL3'011'                                     
         DC    C'Missing Version flag'                                          
ERR011X  DS    0H                                                               
*                                                                               
ERR012   DC    AL1(ERR012X-ERR012),CL3'012'                                     
         DC    C'Record too long'                                               
ERR012X  DS    0H                                                               
*                                                                               
ERR013   DC    AL1(ERR013X-ERR013),CL3'013'                                     
         DC    C'Station not setup for Local DARE'                              
ERR013X  DS    0H                                                               
*                                                                               
ERR014   DC    AL1(ERR014X-ERR014),CL3'014'                                     
         DC    C'Local Inbox is not a DDS Inbox'                                
ERR014X  DS    0H                                                               
*                                                                               
ERR015   DC    AL1(ERR015X-ERR015),CL3'015'                                     
         DC    C'Incorrect Rep'                                                 
ERR015X  DS    0H                                                               
*                                                                               
ERR016   DC    AL1(ERR016X-ERR016),CL3'016'                                     
         DC    C'Specified Rep is not a DDS Rep'                                
ERR016X  DS    0H                                                               
*                                                                               
ERR017   DC    AL1(ERR017X-ERR017),CL3'017'                                     
         DC    C'DARE Station record issue'                                     
ERR017X  DS    0H                                                               
*                                                                               
ERR018   DC    AL1(ERR018X-ERR018),CL3'018'                                     
         DC    C'No 2nd rep for this station'                                   
ERR018X  DS    0H                                                               
*                                                                               
ERR019   DC    AL1(ERR019X-ERR019),CL3'019'                                     
         DC    C'Does not match 2nd rep for station'                            
ERR019X  DS    0H                                                               
*                                                                               
ERR020   DC    AL1(ERR020X-ERR020),CL3'020'                                     
         DC    C'DARE Station record issue'                                     
ERR020X  DS    0H                                                               
*******************************************                                     
* SPECIAL ERRORS                                                                
*******************************************                                     
ERR097   DC    AL1(ERR097X-ERR097),CL3'097'                                     
         DC    C'Error 97'                                                      
ERR097X  DS    0H                                                               
*                                                                               
ERR099   DC    AL1(ERR099X-ERR099),CL3'099'                                     
         DC    C'Error 99'  Received MKGCAN, but spots weren't unpended         
ERR099X  DS    0H                                                               
*                                                                               
ERR100   DC    AL1(ERR100X-ERR100),CL3'100'                                     
         DC    C'OK'        Actually an 'OK' response to Esperanto              
ERR100X  DS    0H                                                               
***********************************************************************         
* JDS ERRORS (101-200)                                                          
***********************************************************************         
ERR101   DC    AL1(ERR101X-ERR101),CL3'101'                                     
         DC    C'Number of spots in all buylines not = '                        
         DC    C'total AGYTLR spots'                                            
ERR101X  DS    0H                                                               
*                                                                               
ERR102   DC    AL1(ERR102X-ERR102),CL3'102'                                     
         DC    C'Dollars in all buylines not = total AGYTLR dollars'            
ERR102X  DS    0H                                                               
*                                                                               
ERR103   DC    AL1(ERR103X-ERR103),CL3'103'                                     
         DC    C'Start or end time given not valid for REPLINE system'          
ERR103X  DS    0H                                                               
*                                                                               
ERR104   DC    AL1(ERR104X-ERR104),CL3'104'                                     
         DC    C'A different ord# found within this set of order '              
         DC    C'records'                                                       
ERR104X  DS    0H                                                               
*                                                                               
ERR105   DC    AL1(ERR105X-ERR105),CL3'105'                                     
         DC    C'Status of this order indicates that it was already '           
         DC    C'received'                                                      
ERR105X  DS    0H                                                               
*                                                                               
ERR106   DC    AL1(ERR106X-ERR106),CL3'106'                                     
         DC    C'Station is not a valid dare station'                           
ERR106X  DS    0H                                                               
*                                                                               
ERR107   DC    AL1(ERR107X-ERR107),CL3'107'                                     
         DC    C'Maximum number of buylines exceeded'                           
ERR107X  DS    0H                                                               
*                                                                               
ERR108   DC    AL1(ERR108X-ERR108),CL3'108'                                     
         DC    C'Daily flag encountered within the order'                       
ERR108X  DS    0H                                                               
*                                                                               
ERR109   DC    AL1(ERR109X-ERR109),CL3'109'                                     
         DC    C'Different rates within a buyline were detected'                
ERR109X  DS    0H                                                               
*                                                                               
*                                                                               
*                                                                               
*                                                                               
*                                                                               
*                                                                               
ERR112   DC    AL1(ERR112X-ERR112),CL3'112'                                     
         DC    C'Revision is not linked to a confirmed headline'                
ERR112X  DS    0H                                                               
*                                                                               
ERR113   DC    AL1(ERR113X-ERR113),CL3'113'                                     
         DC    C'Active Makegood, cannot send revision'                         
ERR113X  DS    0H                                                               
***********************************************************************         
* KATZ ERRORS (201-300)                                                         
***********************************************************************         
ERR208   DC    AL1(ERR208X-ERR208),CL3'208'                                     
         DC    C'Grid > 14 weeks'                                               
ERR208X  DS    0H                                                               
*                                                                               
ERR209   DC    AL1(ERR209X-ERR209),CL3'209'                                     
         DC    C'Media code invalid'                                            
ERR209X  DS    0H                                                               
*                                                                               
ERR210   DC    AL1(ERR210X-ERR210),CL3'210'                                     
         DC    C'Office invalid'                                                
ERR210X  DS    0H                                                               
*                                                                               
ERR211   DC    AL1(ERR211X-ERR211),CL3'211'                                     
         DC    C'Duplicate order'                                               
ERR211X  DS    0H                                                               
*                                                                               
ERR212   DC    AL1(ERR212X-ERR212),CL3'212'                                     
         DC    C'AGYDS1 Missing'                                                
ERR212X  DS    0H                                                               
*                                                                               
ERR213   DC    AL1(ERR213X-ERR213),CL3'213'                                     
         DC    C'AGYDS2 Missing'                                                
ERR213X  DS    0H                                                               
*                                                                               
ERR214   DC    AL1(ERR214X-ERR214),CL3'214'                                     
         DC    C'AGYDS3 Missing'                                                
ERR214X  DS    0H                                                               
*                                                                               
ERR215   DC    AL1(ERR215X-ERR215),CL3'215'                                     
         DC    C'AGYDS4 Missing'                                                
ERR215X  DS    0H                                                               
*                                                                               
ERR216   DC    AL1(ERR216X-ERR216),CL3'216'                                     
         DC    C'BUYHDR Missing'                                                
ERR216X  DS    0H                                                               
*                                                                               
ERR217   DC    AL1(ERR217X-ERR217),CL3'217'                                     
         DC    C'BUYDTL Missing'                                                
ERR217X  DS    0H                                                               
*                                                                               
ERR218   DC    AL1(ERR218X-ERR218),CL3'218'                                     
         DC    C'Order number not numeric'                                      
ERR218X  DS    0H                                                               
*                                                                               
ERR219   DC    AL1(ERR219X-ERR219),CL3'219'                                     
         DC    C'Transmission date invalid'                                     
ERR219X  DS    0H                                                               
*                                                                               
ERR220   DC    AL1(ERR220X-ERR220),CL3'220'                                     
         DC    C'Transmission time invalid'                                     
ERR220X  DS    0H                                                               
*                                                                               
ERR221   DC    AL1(ERR221X-ERR221),CL3'221'                                     
         DC    C'Estimate start date invalid'                                   
ERR221X  DS    0H                                                               
*                                                                               
ERR222   DC    AL1(ERR222X-ERR222),CL3'222'                                     
         DC    C'Estimate end date invalid'                                     
ERR222X  DS    0H                                                               
*                                                                               
ERR223   DC    AL1(ERR223X-ERR223),CL3'223'                                     
         DC    C'Cash/Trade invalid'                                            
ERR223X  DS    0H                                                               
*                                                                               
ERR224   DC    AL1(ERR224X-ERR224),CL3'224'                                     
         DC    C'Total spots invalid'                                           
ERR224X  DS    0H                                                               
*                                                                               
ERR225   DC    AL1(ERR225X-ERR225),CL3'225'                                     
         DC    C'Total dollars invalid'                                         
ERR225X  DS    0H                                                               
*                                                                               
ERR226   DC    AL1(ERR226X-ERR226),CL3'226'                                     
         DC    C'Total record number invalid'                                   
ERR226X  DS    0H                                                               
*                                                                               
ERR227   DC    AL1(ERR227X-ERR227),CL3'227'                                     
         DC    C'Rotation start day invalid'                                    
ERR227X  DS    0H                                                               
*                                                                               
ERR228   DC    AL1(ERR228X-ERR228),CL3'228'                                     
         DC    C'Start time invalid'                                            
ERR228X  DS    0H                                                               
*                                                                               
ERR229   DC    AL1(ERR229X-ERR229),CL3'229'                                     
         DC    C'End time invalid'                                              
ERR229X  DS    0H                                                               
*                                                                               
ERR230   DC    AL1(ERR230X-ERR230),CL3'230'                                     
         DC    C'Total spot length invalid'                                     
ERR230X  DS    0H                                                               
*                                                                               
ERR231   DC    AL1(ERR231X-ERR231),CL3'231'                                     
         DC    C'Length units invalid'                                          
ERR231X  DS    0H                                                               
*                                                                               
ERR232   DC    AL1(ERR232X-ERR232),CL3'232'                                     
         DC    C'Cost invalid'                                                  
ERR232X  DS    0H                                                               
*                                                                               
ERR233   DC    AL1(ERR233X-ERR233),CL3'233'                                     
         DC    C'Spot cost invalid'                                             
ERR233X  DS    0H                                                               
*                                                                               
ERR234   DC    AL1(ERR234X-ERR234),CL3'234'                                     
         DC    C'Number of weeks invalid'                                       
ERR234X  DS    0H                                                               
*                                                                               
ERR235   DC    AL1(ERR235X-ERR235),CL3'235'                                     
         DC    C'Spots per week is invalid'                                     
ERR235X  DS    0H                                                               
*                                                                               
ERR236   DC    AL1(ERR236X-ERR236),CL3'236'                                     
         DC    C'Detail start date invalid'                                     
ERR236X  DS    0H                                                               
*                                                                               
ERR237   DC    AL1(ERR237X-ERR237),CL3'237'                                     
         DC    C'Total spots invalid'                                           
ERR237X  DS    0H                                                               
*                                                                               
ERR238   DC    AL1(ERR238X-ERR238),CL3'238'                                     
         DC    C'Total dollars invalid'                                         
ERR238X  DS    0H                                                               
*                                                                               
ERR239   DC    AL1(ERR239X-ERR239),CL3'239'                                     
         DC    C'Detail cost invalid'                                           
ERR239X  DS    0H                                                               
*                                                                               
ERR240   DC    AL1(ERR240X-ERR240),CL3'240'                                     
         DC    C'Cross foot error - overlapping spots per week'                 
ERR240X  DS    0H                                                               
*                                                                               
ERR241   DC    AL1(ERR241X-ERR241),CL3'241'                                     
         DC    C'Station is in a pitch market'                                  
ERR241X  DS    0H                                                               
*                                                                               
ERR242   DC    AL1(ERR242X-ERR242),CL3'242'                                     
         DC    C'Invalid buyline ID'                                            
ERR242X  DS    0H                                                               
*                                                                               
ERR243   DC    AL1(ERR243X-ERR243),CL3'243'                                     
         DC    C'Invalid demo code'                                             
ERR243X  DS    0H                                                               
*                                                                               
ERR244   DC    AL1(ERR244X-ERR244),CL3'244'                                     
         DC    C'Order has more than 143 detail lines'                          
ERR244X  DS    0H                                                               
*                                                                               
ERR245   DC    AL1(ERR245X-ERR245),CL3'245'                                     
         DC    C'Flight date is past 12/31/96'                                  
ERR245X  DS    0H                                                               
*                                                                               
ERR246   DC    AL1(ERR246X-ERR246),CL3'246'                                     
         DC    C'Uneven bookends'                                               
ERR246X  DS    0H                                                               
*                                                                               
ERR247   DC    AL1(ERR247X-ERR247),CL3'247'                                     
         DC    C'Bad Call Letter Switch'                                        
ERR247X  DS    0H                                                               
***********************************************************************         
* REP ERRORS (301-400)                                                          
***********************************************************************         
ERR301   DC    AL1(ERR301X-ERR301),CL3'301'                                     
         DC    C'Number of spots do not match'                                  
ERR301X  DS    0H                                                               
*                                                                               
ERR302   DC    AL1(ERR302X-ERR302),CL3'302'                                     
         DC    C'Total dollars do not match'                                    
ERR302X  DS    0H                                                               
*                                                                               
ERR303   DC    AL1(ERR303X-ERR303),CL3'303'                                     
         DC    C'Makegood offer not found in the REP system'                    
ERR303X  DS    0H                                                               
*                                                                               
ERR304   DC    AL1(ERR304X-ERR304),CL3'304'                                     
         DC    C'Estimate number not found'                                     
ERR304X  DS    0H                                                               
*                                                                               
ERR305   DC    AL1(ERR305X-ERR305),CL3'305'                                     
         DC    C'XML order already confirmed'                                   
ERR305X  DS    0H                                                               
*                                                                               
ERR307   DC    AL1(ERR307X-ERR307),CL3'307'                                     
         DC    C'Maximum number of buylines exceeded on Reppak system'          
ERR307X  DS    0H                                                               
*                                                                               
ERR308   DC    AL1(ERR308X-ERR308),CL3'308'                                     
         DC    C'Maximum buy number exceeded on Reppak system'                  
ERR308X  DS    0H                                                               
*                                                                               
ERR309   DC    AL1(ERR309X-ERR309),CL3'309'                                     
         DC    C'Rep system is not up'                                          
ERR309X  DS    0H                                                               
*                                                                               
ERR310   DC    AL1(ERR310X-ERR310),CL3'310'                                     
         DC    C'Buyline is missing UUID'                                       
ERR310X  DS    0H                                                               
*                                                                               
ERR311   DC    AL1(ERR311X-ERR311),CL3'311'                                     
         DC    C'Partial weeks not supported'                                   
ERR311X  DS    0H                                                               
***********************************************************************         
* DATATRAK ERRORS (401,402,501-600)                                             
***********************************************************************         
ERR401   DC    AL1(ERR401X-ERR401),CL3'401'                                     
         DC    C'Makegood buyline rotation crosses estimate start day'          
ERR401X  DS    0H                                                               
*                                                                               
ERR402   DC    AL1(ERR402X-ERR402),CL3'402'                                     
         DC    C'Makegood buyline spans more than 16 weeks'                     
ERR402X  DS    0H                                                               
*                                                                               
ERR501   DC    AL1(ERR501X-ERR501),CL3'501'                                     
         DC    C'No fax number found for this station'                          
ERR501X  DS    0H                                                               
*                                                                               
ERR502   DC    AL1(ERR502X-ERR502),CL3'502'                                     
         DC    C'Unknown DDS Inbox user'                                        
ERR502X  DS    0H                                                               
*                                                                               
ERR503   DC    AL1(ERR503X-ERR503),CL3'503'                                     
         DC    C'Unable to send file'                                           
ERR503X  DS    0H                                                               
*                                                                               
ERR504   DC    AL1(ERR504X-ERR504),CL3'504'                                     
         DC    C'File deleted from DDS Inbox server'                            
ERR504X  DS    0H                                                               
***********************************************************************         
* Katz/strata errors (700-799)                                                  
***********************************************************************         
ERR700   DC    AL1(ERR700X-ERR700),CL3'700'                                     
         DC    C'Research Impressions (D) Demo Modifier Code is not sup*        
               ported'                                                          
ERR700X  DS    0H                                                               
***********************************************************************         
* $SPTDARE ERRORS  (901-999)                                                    
***********************************************************************         
ERR901   DC    AL1(ERR901X-ERR901),CL3'901'                                     
         DC    C'Order number not valid'                                        
ERR901X  DS    0H                                                               
*                                                                               
ERR902   DC    AL1(ERR902X-ERR902),CL3'902'                                     
         DC    C'Order does not exist'                                          
ERR902X  DS    0H                                                               
*                                                                               
ERR903   DC    AL1(ERR903X-ERR903),CL3'903'                                     
         DC    C'Order was not transmitted'                                     
ERR903X  DS    0H                                                               
*                                                                               
ERR904   DC    AL1(ERR904X-ERR904),CL3'904'                                     
         DC    C'Order not linked to this contract'                             
ERR904X  DS    0H                                                               
*                                                                               
ERR905   DC    AL1(ERR905X-ERR905),CL3'905'                                     
         DC    C'Trailer for the wrong record'                                  
ERR905X  DS    0H                                                               
*                                                                               
ERR906   DC    AL1(ERR906X-ERR906),CL3'906'                                     
         DC    C'Agency ID not valid'                                           
ERR906X  DS    0H                                                               
*                                                                               
ERR907   DC    AL1(ERR907X-ERR907),CL3'907'                                     
         DC    C'REP ID not valid'                                              
ERR907X  DS    0H                                                               
*                                                                               
ERR908   DC    AL1(ERR908X-ERR908),CL3'908'                                     
         DC    C'REP contract does not exist'                                   
ERR908X  DS    0H                                                               
*                                                                               
ERR909   DC    AL1(ERR909X-ERR909),CL3'909'                                     
         DC    C'Bad rep contract number'                                       
ERR909X  DS    0H                                                               
*                                                                               
ERR910   DC    AL1(ERR910X-ERR910),CL3'910'                                     
         DC    C'Invalid agency buyline number'                                 
ERR910X  DS    0H                                                               
*                                                                               
ERR911   DC    AL1(ERR911X-ERR911),CL3'911'                                     
         DC    C'Can not change the status of this order'                       
ERR911X  DS    0H                                                               
*                                                                               
ERR912   DC    AL1(ERR912X-ERR912),CL3'912'                                     
         DC    C'Order was not confirmed'                                       
ERR912X  DS    0H                                                               
*                                                                               
ERR913   DC    AL1(ERR913X-ERR913),CL3'913'                                     
         DC    C'Makegood offer not in sequence'                                
ERR913X  DS    0H                                                               
*                                                                               
ERR914   DC    AL1(ERR914X-ERR914),CL3'914'                                     
         DC    C'Invalid number field'                                          
ERR914X  DS    0H                                                               
*                                                                               
ERR915   DC    AL1(ERR915X-ERR915),CL3'915'                                     
         DC    C'Dare order record does not exist'                              
ERR915X  DS    0H                                                               
*                                                                               
ERR916   DC    AL1(ERR916X-ERR916),CL3'916'                                     
         DC    C'Inconsistent data'                                             
ERR916X  DS    0H                                                               
*                                                                               
ERR917   DC    AL1(ERR917X-ERR917),CL3'917'                                     
         DC    C'Invalid length type'                                           
ERR917X  DS    0H                                                               
*                                                                               
ERR918   DC    AL1(ERR918X-ERR918),CL3'918'                                     
         DC    C'Invalid record count'                                          
ERR918X  DS    0H                                                               
*                                                                               
ERR919   DC    AL1(ERR919X-ERR919),CL3'919'                                     
         DC    C'Invalid total makegood dollars'                                
ERR919X  DS    0H                                                               
*                                                                               
ERR920   DC    AL1(ERR920X-ERR920),CL3'920'                                     
         DC    C'Makegood already okayed by the rep'                            
ERR920X  DS    0H                                                               
*                                                                               
ERR921   DC    AL1(ERR921X-ERR921),CL3'921'                                     
         DC    C'Makegood notice should be approved first'                      
ERR921X  DS    0H                                                               
*                                                                               
ERR922   DC    AL1(ERR922X-ERR922),CL3'922'                                     
         DC    C'Makegood sequence numbers are not the same'                    
ERR922X  DS    0H                                                               
*                                                                               
ERR923   DC    AL1(ERR923X-ERR923),CL3'923'                                     
         DC    C'Makegood offer already cancelled'                              
ERR923X  DS    0H                                                               
*                                                                               
ERR924   DC    AL1(ERR924X-ERR924),CL3'924'                                     
         DC    C'Makegood offer does not exist'                                 
ERR924X  DS    0H                                                               
*                                                                               
ERR925   DC    AL1(ERR925X-ERR925),CL3'925'                                     
         DC    C'Cannot accept Makegood offer due to pending revision'          
ERR925X  DS    0H                                                               
*                                                                               
ERR926   DC    AL1(ERR926X-ERR926),CL3'926'                                     
         DC    C'Makegood offer cancelled/recalled by Rep'                      
ERR926X  DS    0H                                                               
*                                                                               
ERR927   DC    AL1(ERR927X-ERR927),CL3'927'                                     
         DC    C'Offer was not cancelled w/ more before the resend'             
ERR927X  DS    0H                                                               
*                                                                               
ERR928   DC    AL1(ERR928X-ERR928),CL3'928'                                     
         DC    C'Revisions cannot be UNDAREd'                                   
ERR928X  DS    0H                                                               
*                                                                               
ERR929   DC    AL1(ERR929X-ERR929),CL3'929'                                     
         DC    C'Too many missed spots or missed comments'                      
ERR929X  DS    0H                                                               
*                                                                               
ERR930   DC    AL1(ERR930X-ERR930),CL3'930'                                     
         DC    C'Limit of 8 orbits per offered line'                            
ERR930X  DS    0H                                                               
*                                                                               
ERR931   DC    AL1(ERR931X-ERR931),CL3'931'                                     
         DC    C'Confirm type doesnt match send type'                           
ERR931X  DS    0H                                                               
*                                                                               
ERR932   DC    AL1(ERR932X-ERR932),CL3'932'                                     
         DC    C'Too many spots per week, Split!'                               
ERR932X  DS    0H                                                               
*                                                                               
ERR933   DC    AL1(ERR933X-ERR933),CL3'933'                                     
         DC    C'Too many spots on buyline, Split!'                             
ERR933X  DS    0H                                                               
*                                                                               
ERR934   DC    AL1(ERR934X-ERR934),CL3'934'                                     
         DC    C'Cable makegoods not supported yet'                             
ERR934X  DS    0H                                                               
*                                                                               
ERR935   DC    AL1(ERR935X-ERR935),CL3'935'                                     
         DC    C'Invalid cable station'                                         
ERR935X  DS    0H                                                               
*                                                                               
ERR936   DC    AL1(ERR936X-ERR936),CL3'936'                                     
         DC    C'Duplicate MKGDTL date'                                         
ERR936X  DS    0H                                                               
*                                                                               
ERR937   DC    AL1(ERR937X-ERR937),CL3'937'                                     
         DC    C'Dates in the MKGDTLs are not sorted'                           
ERR937X  DS    0H                                                               
*                                                                               
ERR938   DC    AL1(ERR938X-ERR938),CL3'938'                                     
         DC    C'Invalid station'                                               
ERR938X  DS    0H                                                               
*                                                                               
ERR940   DC    AL1(ERR940X-ERR940),CL3'940'                                     
         DC    C'Missing MKGDS2 record for MKGDEM'                              
ERR940X  DS    0H                                                               
*                                                                               
ERR941   DC    AL1(ERR941X-ERR941),CL3'941'                                     
         DC    C'Missing MKGMNW record for Cable MKGMSS'                        
ERR941X  DS    0H                                                               
*                                                                               
ERR942   DC    AL1(ERR942X-ERR942),CL3'942'                                     
         DC    C'Missing MKGONW record for Cable MKGBUY'                        
ERR942X  DS    0H                                                               
*                                                                               
ERR943   DC    AL1(ERR943X-ERR943),CL3'943'                                     
         DC    C'Network is not defined for this syscode'                       
ERR943X  DS    0H                                                               
*                                                                               
ERR944   DC    AL1(ERR944X-ERR944),CL3'944'                                     
         DC    C'Makegood is not cable'                                         
ERR944X  DS    0H                                                               
*                                                                               
ERR945   DC    AL1(ERR945X-ERR945),CL3'945'                                     
         DC    C'Duplicate MKGMNW record'                                       
ERR945X  DS    0H                                                               
*                                                                               
ERR946   DC    AL1(ERR946X-ERR946),CL3'946'                                     
         DC    C'Duplicate MKGONW record'                                       
ERR946X  DS    0H                                                               
*                                                                               
ERR947   DC    AL1(ERR947X-ERR947),CL3'947'                                     
         DC    C'Missing MKGMNW record'                                         
ERR947X  DS    0H                                                               
*                                                                               
ERR948   DC    AL1(ERR948X-ERR948),CL3'948'                                     
         DC    C'Missing MKGONW record'                                         
ERR948X  DS    0H                                                               
*                                                                               
ERR949   DC    AL1(ERR949X-ERR949),CL3'949'                                     
         DC    C'Invalid MKGDS2 record'                                         
ERR949X  DS    0H                                                               
*                                                                               
ERR950   DC    AL1(ERR950X-ERR950),CL3'950'                                     
         DC    C'Invalid MKGDEM record'                                         
ERR950X  DS    0H                                                               
*                                                                               
ERR951   DC    AL1(ERR951X-ERR951),CL3'951'                                     
         DC    C'Invalid time period'                                           
ERR951X  DS    0H                                                               
*                                                                               
ERR952   DC    AL1(ERR952X-ERR952),CL3'952'                                     
         DC    C'Invalid MKGBUY day rotation'                                   
ERR952X  DS    0H                                                               
*                                                                               
ERR953   DC    AL1(ERR953X-ERR953),CL3'953'                                     
         DC    C'Invalid MKGDTL number of weeks'                                
ERR953X  DS    0H                                                               
*                                                                               
ERR954   DC    AL1(ERR954X-ERR954),CL3'954'                                     
         DC    C'Invalid MKGCDC comScore demo category'                         
ERR954X  DS    0H                                                               
*                                                                               
ERR955   DC    AL1(ERR955X-ERR955),CL3'955'                                     
         DC    C'Invalid MKGDEM comScore demo value'                            
ERR955X  DS    0H                                                               
*                                                                               
ERR956   DC    AL1(ERR956X-ERR956),CL3'956'                                     
         DC    C'Mismatch MKGBUY rotation vs MKGDTL spot date'                  
ERR956X  DS    0H                                                               
*                                                                               
ERR957   DC    AL1(ERR957X-ERR957),CL3'957'                                     
         DC    C'Invalid MKGDTL number of spots'                                
ERR957X  DS    0H                                                               
*                                                                               
ERR958   DC    AL1(ERR958X-ERR958),CL3'958'                                     
         DC    C'Can not change the status of this makegood'                    
ERR958X  DS    0H                                                               
***********************************************************************         
* END OF ERROR ENTRIES                                                          
***********************************************************************         
         DC    X'00'                                                            
