*          DATA SET SPDARDARED AT LEVEL 098 AS OF 03/12/19                      
***********************************************************************         
* WARNING BY DECREE OF DAVID:                                                   
* - IF THE RECORD LENGTHS CHANGE THEN RELINK: DDDARERAP/DDARERMQ                
***********************************************************************         
***********************************************************************         
* AGENCY HEADER LINE                                                            
***********************************************************************         
PAGYHDRD DSECT                                                                  
PAHDTID  DS    CL6                 TRANSMISSION ID  'AGYHDR'                    
PAHDORDR DS    CL8                 ORDER NUMBER                                 
PAHDVERS DS    CL1                 DATA VERSION NUMBER                          
PAHDV0   EQU   C'0'                -DFLT: DARE DISP'R ROUTES ORDERS             
PAHDV1   EQU   C'1'                -SENDER SET RECEIVER                         
PAHDV2   EQU   C'2'                -ESPERANTO NATIONAL                          
PAHDV3   EQU   C'3'                -ESPERANTO LOCAL                             
PAHDV4   EQU   C'4'                -SPARE                                       
PAHDV5   EQU   C'5'                -SPARE                                       
PAHDV6   EQU   C'6'                -DIRECT TO 2ND REP, SENDER SETS REP          
PAHDV7   EQU   C'7'                -SPARE                                       
PAHDV8   EQU   C'8'                -DIRECT TO STATION, DD SETS ROUTE            
PAHDV9   EQU   C'9'                -DARE DISP'R SETS SB3VS ROUTE                
PAHDFRID DS    CL10                ID OF SENDER                                 
PAHDTOID DS    CL10                ID OF RECEIVER                               
PAHDROUT DS    CL5                 ROUTING CODE: AGY(3)/AGY OFFICE(2)           
PAHDDATE DS    CL6                 DATE                                         
PAHDTIME DS    CL4                 TIME                                         
PAHDQMED DS    CL1                 MEDIA                                        
PAHDQCLT DS    CL6                 CLIENT CODE                                  
PAHDQSTA DS    CL6                 STATION                                      
PAHDQPRD DS    CL4                 PRODUCT CODE                                 
PAHDQPR2 DS    CL4                 PIGGYBACK PRODUCT CODE                       
PAHDQEST DS    CL6                 ESTIMATE NUMBER                              
PAHDESTS DS    CL6                 ESTIMATE START DATE                          
PAHDESTN DS    CL6                 ESTIMATE END DATE                            
PAHDRPCN DS    CL8                 REP CONTRACT  (0=NEW, ELSE REVISION)         
PAHDRTRN DS    CL16                FLD TO RETURN IN DELVRY NOTIFICATION         
*************************************FIELDS ONLY IN $ETI FILE**********         
         ORG   PAHDRTRN                                                         
PAHDPQUR DS    CL4                 HEX ID # OF USER FOR PQ ENTRY                
PAHDPQSB DS    CL3                 SUB ID           FOR PQ ENTRY                
PAHDPQRE DS    CL4                 HEX REPORT #     FOR PQ ENTRY                
         ORG                                                                    
*************************************FIELDS ONLY IN $ETI FILE**********         
PAHDCTRD DS    CL1                 (C)ASH/(T)RADE INDICATOR, DEFAULT=C          
PAHDSTYP DS    CL1                 D FOR DAILY SCHEDULE, ELSE WEEKLY            
PAHDAIRD DS    CL6                 FIRST AIR DATE (YYMMDD)                      
PAHDSDAY DS    CL1                 OUT OF WEEK ROTATOR (DEFAULT=1  MON)         
PAHDVARN DS    CL8                 FOR VAR BRAND ORDS = VAR ORDER #             
PAHDOLDS DS    CL6                 OLD STATION IF CALL LETTER CHANGE            
PAHDREVN DS    CL3                 REVISION NUMBER                              
PAHDSLNQ EQU   *-PAGYHDRD                                                       
* NEW FIELDS THAT MEDIABANK AND HARRIS NEVER SENT                               
PAHDFSNT DS    CL6                 FIRST EDI SEND DATE                          
PAHDFSTA DS    CL6                 FIRST EDI SEND STATION                       
PAGYHDRL EQU   *-PAGYHDRD                                                       
***********************************************************************         
* AGENCY DESCRIPTION LINE 1                                                     
***********************************************************************         
PAGYDS1D DSECT                                                                  
PAD1TID  DS    CL6                 TRANSMISSION ID  'AGYDS1'                    
PAD1ORDR DS    CL8                 ORDER NUMBER                                 
PAD1AGNM DS    CL40                AGENCY NAME                                  
PAD1AGAD DS    CL40                AGENCY ADDRESS                               
PAGYDS1L EQU   *-PAGYDS1D                                                       
***********************************************************************         
* AGENCY DESCRIPTION LINE 2                                                     
***********************************************************************         
PAGYDS2D DSECT                                                                  
PAD2TID  DS    CL6                 TRANSMISSION ID  'AGYDS2'                    
PAD2ORDR DS    CL8                 ORDER NUMBER                                 
PAD2CLTN DS    CL34                CLIENT NAME                                  
PAD2ESTN DS    CL32                ESTIMATE DESCRIPTION                         
PAD2TDEM DS    CL4                 TARGET DEMO                                  
PAD2TDM2 DS    CL4                 2ND TARGET DEMO                              
PAD2TDM3 DS    CL4                 3RD TARGET DEMO                              
PAD2TDM4 DS    CL4                 4TH TARGET DEMO                              
PAGYDS2L EQU   *-PAGYDS2D                                                       
***********************************************************************         
* AGENCY LIST OF COMSCORE DEMO CATEGORIES                                       
*                                                                               
* FORMAT OF THE COMSCORE DEMO CATEGORY                                          
* 1ST CHAR      - DEMO MODIFIER                                                 
* 2ND-11TH CHAR - COMSCORE TAG NUMBER (DECIMAL DIGITS)                          
***********************************************************************         
PAGYCDCD DSECT                                                                  
PCDCTID  DS    CL6                 TRANSMISSION ID  'AGYCDC'                    
PCDCORDR DS    CL8                 ORDER NUMBER                                 
PCDCDEM1 DS    CL11                1ST COMSCORE DEMO CATEGORY                   
PCDCDEM2 DS    CL11                2ND COMSCORE DEMO CATEGORY                   
PCDCDEM3 DS    CL11                3RD COMSCORE DEMO CATEGORY                   
PCDCDEM4 DS    CL11                4TH COMSCORE DEMO CATEGORY                   
PCDCDEM5 DS    CL11                5TH COMSCORE DEMO CATEGORY                   
PCDCDEM6 DS    CL11                6TH COMSCORE DEMO CATEGORY                   
PCDCDEM7 DS    CL11                7TH COMSCORE DEMO CATEGORY                   
PCDCDEM8 DS    CL11                8TH COMSCORE DEMO CATEGORY                   
PCDCDEM9 DS    CL11                9TH COMSCORE DEMO CATEGORY                   
PCDCDEMA DS    CL11                10TH COMSCORE DEMO CATEGORY                  
PAGYCDCL EQU   *-PAGYCDCD                                                       
***********************************************************************         
* AGENCY LIST OF TARGET DEMOS                                                   
*                                                                               
* FORMAT OF THE TARGET DEMO                                                     
* 1ST-6TH CHAR - WHICH RECORD TO FIND DEMO CATEGORY (AGYDS2/AGYCDC)             
* 7TH-8TH CHAR - 2 DIGIT NUMBER TO IDENTIFY WHICH DEMO IN THAT RECORD           
***********************************************************************         
PAGYTDMD DSECT                                                                  
PTDMTID  DS    CL6                 TRANSMISSION ID  'AGYTDM'                    
PTDMORDR DS    CL8                 ORDER NUMBER                                 
PTDMDEM1 DS    CL8                 PRIMARY DEMO CATEGORY                        
         ORG   PTDMDEM1                                                         
PTDMDREC DS    CL6                 RECORD TO FIND DEMO CATEGORY                 
PTDMDIND DS    CL2                 2 DIGIT INDEX TO ID WHICH DEMO               
*                                                                               
PTDMDEM2 DS    CL8                 ADDITIONAL DEMO CATEGORIES                   
PTDMDEM3 DS    CL8                                                              
PTDMDEM4 DS    CL8                                                              
PTDMDEM5 DS    CL8                                                              
PTDMDEM6 DS    CL8                                                              
PTDMDEM7 DS    CL8                                                              
PTDMDEM8 DS    CL8                                                              
PTDMDEM9 DS    CL8                                                              
PTDMDEMA DS    CL8                                                              
PTDMDEMB DS    CL8                                                              
PTDMDEMC DS    CL8                                                              
PTDMDEMD DS    CL8                                                              
PTDMDEME DS    CL8                                                              
PAGYTDML EQU   *-PAGYTDMD                                                       
***********************************************************************         
* AGENCY DESCRIPTION LINE 3                                                     
***********************************************************************         
PAGYDS3D DSECT                                                                  
PAD3TID  DS    CL6                 TRANSMISSION ID  'AGYDS3'                    
PAD3ORDR DS    CL8                 ORDER NUMBER                                 
PAD3PRDN DS    CL34                PRODUCT NAME                                 
PAD3PR2N DS    CL34                PIGGYBACK PRODUCT NAME                       
PAGYDS3L EQU   *-PAGYDS3D                                                       
***********************************************************************         
* AGENCY DESCRIPTION LINE 4                                                     
***********************************************************************         
PAGYDS4D DSECT                                                                  
PAD4TID  DS    CL6                 TRANSMISSION ID  'AGYDS4'                    
PAD4ORDR DS    CL8                 ORDER NUMBER                                 
PAD4BUYR DS    CL3                 BUYER CODE                                   
PAD4BYRN DS    CL24                BUYER NAME                                   
PAD4BYRT DS    CL10                BUYER TELEPHONE                              
PAD4BYRX DS    CL6                 BUYER EXTENSION                              
PAGYDS4L EQU   *-PAGYDS4D                                                       
***********************************************************************         
* AGENCY DESCRIPTION LINE 5                                                     
***********************************************************************         
PAGYDS5D DSECT                                                                  
PAD5TID  DS    CL6                 TRANSMISSION ID  'AGYDS5'                    
PAD5ORDR DS    CL8                 ORDER NUMBER                                 
PAD5SALP DS    CL3                 SALESPERSON CODE                             
PAD5UNWR DS    CL1                 UNWIRED Y/N                                  
PAGYDS5L EQU   *-PAGYDS5D                                                       
***********************************************************************         
* AGENCY TESTING LINE                                                           
***********************************************************************         
PAGYTSTD DSECT                                                                  
PATSTID  DS    CL6                 TRANSMISSION ID  'AGYTST'                    
PATSORDR DS    CL8                 ORDER NUMBER                                 
PATSTEXT DS    CL80                TEXT FOR THE TESTING LINE                    
PAGYTSTL EQU   *-PAGYTSTD                                                       
***********************************************************************         
* AGENCY XML DESCRIPTION LINE 1 - SELLER DATA                                   
***********************************************************************         
PAGYXM1D DSECT                                                                  
PAX1TID  DS    CL6                 TRANSMISSION ID  'AGYXM1'                    
PAX1ORDR DS    CL8                 ORDER NUMBER                                 
PAX1COMN DS    CL40                COMPANY NAME                                 
PAX1COMC DS    CL5                 COMPANY CODE                                 
PAX1OFFN DS    CL20                OFFICE NAME                                  
PAX1OFFC DS    CL5                 OFFICE CODE                                  
PAX1OFFM DS    CL5                 OFFICE NSI MARKET CODE                       
PAX1FIRN DS    CL25                SALESPERSON FIRST NAME                       
PAX1LASN DS    CL25                SALESPERSON LAST NAME                        
PAX1SALC DS    CL5                 SALESPERSON CODE                             
PAX1HUB  DS    CL10                HUB ADDRESS                                  
PAGYXM1L EQU   *-PAGYXM1D                                                       
***********************************************************************         
* AGENCY XML DESCRIPTION LINE 2 - BUYER DATA                                    
***********************************************************************         
PAGYXM2D DSECT                                                                  
PAX2TID  DS    CL6                 TRANSMISSION ID  'AGYXM2'                    
PAX2ORDR DS    CL8                 ORDER NUMBER                                 
PAX2COMN DS    CL40                COMPANY NAME                                 
PAX2AGID DS    CL3                 DDS ROUTING CODE (AGENCY PORTION)            
PAX2OFFC DS    CL2                 DDS ROUTING CODE (OFFICE PORTION)            
PAX2OFFN DS    CL20                OFFICE NAME                                  
PAX2OFFM DS    CL5                 OFFICE NSI MARKET CODE                       
PAX2VER# DS    CL5                 VERSION NUMBER OF THE ORDER                  
PAGYXM2L EQU   *-PAGYXM2D                                                       
***********************************************************************         
* AGENCY XML DESCRIPTION LINE 2 - BUYER DATA                                    
***********************************************************************         
PAGYXM3D DSECT                                                                  
PAX3TID  DS    CL6                 TRANSMISSION ID  'AGYXM3'                    
PAX3ORDR DS    CL8                 ORDER NUMBER                                 
PAX3QSTA DS    CL6                 STATION CALL LETTERS                         
PAX3MESG DS    CL6                 MESSAGE THAT CAUSED THE ERROR                
         DS    CL54                SPARE                                        
PAGYXM3L EQU   *-PAGYXM3D                                                       
***********************************************************************         
* SALESPERSON ASSIGNED TO THIS ORDER                                            
***********************************************************************         
PAGYSALD DSECT                                                                  
PASLTID  DS    CL6                 TRANSMISSION ID  'AGYSAL'                    
PASLORDR DS    CL8                 ORDER NUMBER                                 
PASLNAME DS    CL25                FREEFORM NAME OF SALESPERSON                 
PAGYSALL EQU   *-PAGYSALD                                                       
***********************************************************************         
* AGENCY STANDARD COMMENT LINE                                                  
***********************************************************************         
PAGYSTDD DSECT                                                                  
PASTTID  DS    CL6                 TRANSMISSION ID  'AGYSTD'                    
PASTORDR DS    CL8                 ORDER NUMBER                                 
PASTCONT DS    CL1                 * MEANS MORE FOLLOW                          
PASTTEXT DS    CL78                COMMENT TEXT                                 
PAGYSTDL EQU   *-PAGYSTDD                                                       
***********************************************************************         
* AGENCY COMMENT LINE                                                           
***********************************************************************         
PAGYCOMD DSECT                                                                  
PACMTID  DS    CL6                 TRANSMISSION ID  'AGYCOM'                    
PACMORDR DS    CL8                 ORDER NUMBER                                 
PACMCONT DS    CL1                 * MEANS MORE FOLLOW                          
PACMTEXT DS    CL78                COMMENT TEXT                                 
PAGYCOML EQU   *-PAGYCOMD                                                       
***********************************************************************         
* AGENCY HIATUS WEEK LINE                                                       
***********************************************************************         
PAGYHIAD DSECT                                                                  
PAHITID  DS    CL6                 TRANSMISSION ID  'AGYHIA'                    
PAHIORDR DS    CL8                 ORDER NUMBER                                 
PAHICONT DS    CL1                 * MEANS MORE FOLLOW                          
PAHIWKDT DS    CL60                YYMMDDYYMMDD..YYMMDD (MAX OF 10)             
PAGYHIAL EQU   *-PAGYHIAD                                                       
***********************************************************************         
* AGENCY VARIOUS PRODUCT LINE                                                   
***********************************************************************         
PAGYPROD DSECT                                                                  
PAPDTID  DS    CL6                 TRANSMISSION ID  'VARPRD'                    
PAPDORDR DS    CL8                 ORDER NUMBER                                 
PAPDCONT DS    CL1                 * MEANS MORE FOLLOW                          
PAPDCOD1 DS    CL4                 PRODUCT CODE FOR SOLO OR FIRST               
PAPDNAM1 DS    CL34                PRODUCT NAME                                 
PAPDCOD2 DS    CL4                 PRODUCT CODE FOR SECOND PIGGYBACK            
PAPDNAM2 DS    CL34                PRODUCT NAME                                 
PAGYPROL EQU   *-PAGYPROD                                                       
***********************************************************************         
* AGENCY CANCELLATION LINE (NOTDARE)                                            
***********************************************************************         
PAGYCAND DSECT                                                                  
PACNTID  DS    CL6                 TRANSMISSION ID  'AGYCAN'                    
PACNORDR DS    CL8                 ORDER NUMBER                                 
PACNFRID DS    CL10                ID OF SENDER                                 
PACNTOID DS    CL10                ID OF RECEIVER                               
PACNROUT DS    CL5                 ROUTING CODE: AGY(3)/AGY OFFICE(2)           
PACNDATE DS    CL6                 DATE                                         
PACNTIME DS    CL4                 TIME                                         
PACNQSTA DS    CL6                 STATION                                      
PACNRPCN DS    CL8                 REP CONTRACT                                 
PACNRTRN DS    CL16                FLD SENDER ASKED TO HAVE RETURNED            
*************************************FIELDS ONLY IN $ETI FILE**********         
         ORG   PACNRTRN                                                         
PACNPQUR DS    CL4                 HEX ID # OF USER FOR PQ ENTRY                
PACNPQSB DS    CL3                 SUB ID           FOR PQ ENTRY                
PACNPQRE DS    CL4                 HEX REPORT #     FOR PQ ENTRY                
         ORG                                                                    
*************************************FIELDS ONLY IN $ETI FILE**********         
PACNOLDS DS    CL6                 OLD STATION IF CALL LETTER CHANGE            
PACNCFLG DS    CL1                 CANCELLATION FLAG (R - REVISION)             
PAGYCANL EQU   *-PAGYCAND                                                       
PACNFSNT DS    CL6                 FIRST EDI SEND DATE                          
PACNFSTA DS    CL6                 FIRST EDI SEND STATION                       
PAGYCALN EQU   *-PAGYCAND                                                       
***********************************************************************         
* AGENCY TRAILER LINE                                                           
***********************************************************************         
PAGYTLRD DSECT                                                                  
PATLTID  DS    CL6                 TRANSMISSION ID  'AGYTLR'                    
PATLORDR DS    CL8                 ORDER NUMBER                                 
PATLNMRC DS    CL6                 NUMBER OF RECORDS                            
PATLSPTS DS    CL6                 TOTAL SPOTS                                  
PATLTOTL DS    CL10                TOTAL DOLLARS (IN PENNIES)                   
PAGYTLRL EQU   *-PAGYTLRD                                                       
***********************************************************************         
* BUY CABLE NETWORK - PRECEDES THE GROUP OF BUYLINES FOR THAT NETWORK           
***********************************************************************         
PBUYNWKD DSECT                                                                  
PBNWTID  DS    CL6                 TRANSMISSION ID  'BUYNWK'                    
PBNWORDR DS    CL8                 ORDER NUMBER                                 
PBNWNTWK DS    CL4                 NCC NETWORK CODE                             
PBUYNWKL EQU   *-PBUYNWKD                                                       
***********************************************************************         
* BUY HEADER LINE                                                               
***********************************************************************         
PBUYHDRD DSECT                                                                  
PBHDTID  DS    CL6                 TRANSMISSION ID  'BUYHDR'                    
PBHDORDR DS    CL8                 ORDER NUMBER                                 
PBHDBLIN DS    CL4                 LINE NUMBER                                  
PBHDROTN DS    CL7                 ROTATION              MTWTFSS                
PBHDRSDT DS    CL1                 ROTATION START DAY    1-7                    
PBHDSTIM DS    CL4                 START TIME            0600-3000              
PBHDETIM DS    CL4                 END   TIME            0600-3000              
PBHDTSLN DS    CL3                 SPOTLENGTH  (PR1+PR2) 999                    
PBHDLUNT DS    CL1                 LENGTH UNITS          S=SEC,M=MIN            
PBHDPGNM DS    CL34                PROGRAM NAME                                 
PBHDCOST DS    CL9                 IN PENNIES, 2 DEC IMPLIED                    
PBHDCSQL DS    CL1                 COST QUALIFIER                               
PBHDTMSH DS    CL3                 PRODUCT1 TIME SHARE   (FOR PB ONLY)          
PBHDSTYP DS    CL1                 D FOR DAILY SCHEDULE, ELSE WEEKLY            
PBHDMGBL DS    CL3                 MAKEGOOD FOR THE SPOT BUYLINE                
PBUYHDRL EQU   *-PBUYHDRD                                                       
***********************************************************************         
* BUY DEMO LINE                                                                 
***********************************************************************         
PBUYDEMD DSECT                                                                  
PBDMTID  DS    CL6                 TRANSMISSION ID 'BUYDEM'                     
PBDMORDR DS    CL8                 ORDER NUMBER                                 
PBDMVAL  DS    CL7                 IN THE SEQUENCE FROM AGYDS2                  
PBDMVAL2 DS    CL7                 1 DECIMAL IMPLIED                            
PBDMVAL3 DS    CL7                                                              
PBDMVAL4 DS    CL7                                                              
PBUYDEML EQU   *-PBUYDEMD                                                       
***********************************************************************         
* BUY 2 DECIMAL RATINGS LINE                                                    
***********************************************************************         
PBUYDM2D DSECT                                                                  
PBD2TID  DS    CL6                 TRANSMISSION ID 'BUYDM2'                     
PBD2ORDR DS    CL8                 ORDER NUMBER                                 
PBD2VAL  DS    CL8                 IN THE SEQUENCE FROM AGYDS2                  
PBD2VAL2 DS    CL8                 2 DECIMAL RATINGS IMPLIED                    
PBD2VAL3 DS    CL8                 1 DECIMAL IMPRESSIONS IMPLIED                
PBD2VAL4 DS    CL8                                                              
PBUYDM2L EQU   *-PBUYDM2D                                                       
***********************************************************************         
* BUY DEMO VALUES LINE - ALL DEMO VALUES ARE AT 2 DECIMALS OF PRECISION         
***********************************************************************         
PBUYDV2D DSECT                                                                  
PBDV2TID  DS    CL6                 TRANSMISSION ID 'BUYDV2'                    
PBDV2ORDR DS    CL8                 ORDER NUMBER                                
PBDV2VAL  DS    CL8                 IN THE SEQUENCE FROM AGYDS2                 
PBDV2VAL2 DS    CL8                 2 DECIMAL RATINGS IMPLIED                   
PBDV2VAL3 DS    CL8                 2 DECIMAL IMPRESSIONS IMPLIED               
PBDV2VAL4 DS    CL8                                                             
PBUYDV2L EQU   *-PBUYDV2D                                                       
***********************************************************************         
* BUY COMSCORE DEMO VALUES LINE                                                 
*                                                                               
* THE DEMO VALUES ARE DECIMAL STRINGS WITH LEADING AND TRAILING ZEROES          
* I.E.  02134.6790                                                              
***********************************************************************         
PBUYCDVD DSECT                                                                  
PBCDVTID  DS    CL6                 TRANSMISSION ID 'BUYCDV'                    
PBCDVORDR DS    CL8                 ORDER NUMBER                                
PBCDVVAL1 DS    CL10                IN THE SEQUENCE FROM AGYCDC                 
PBCDVVAL2 DS    CL10                                                            
PBCDVVAL3 DS    CL10                                                            
PBCDVVAL4 DS    CL10                                                            
PBCDVVAL5 DS    CL10                                                            
PBCDVVAL6 DS    CL10                                                            
PBCDVVAL7 DS    CL10                                                            
PBCDVVAL8 DS    CL10                                                            
PBCDVVAL9 DS    CL10                                                            
PBCDVVALA DS    CL10                                                            
PBUYCDVL EQU   *-PBUYCDVD                                                       
***********************************************************************         
* BUY ORBIT LINE                                                                
***********************************************************************         
PBUYORBD DSECT                                                                  
PBORTID  DS    CL6                 TRANSMISSION ID  'BUYORB'                    
PBORORDR DS    CL8                 ORDER NUMBER                                 
PBORCONT DS    CL1                 * MEANS MORE FOLLOW                          
PBORROTN DS    CL7                 ORBIT POSITION DAYS         MTWTFSS          
PBORRSDT DS    CL1                 ORBIT POSITION START DAY    1-7              
PBORSTIM DS    CL4                 START TIME            0600-3000              
PBORETIM DS    CL4                 END   TIME            0600-3000              
PBORPGNM DS    CL14                PROGRAM NAME                                 
PBUYORBL EQU   *-PBUYORBD                                                       
***********************************************************************         
* BUY COMMENT LINE                                                              
***********************************************************************         
PBUYCOMD DSECT                                                                  
PBCMTID  DS    CL6                 TRANSMISSION ID  'BUYCOM'                    
PBCMORDR DS    CL8                 ORDER NUMBER                                 
PBCMCONT DS    CL1                 * MEANS MORE FOLLOW                          
PBCMTEXT DS    CL70                COMMENT TEXT                                 
PBUYCOML EQU   *-PBUYCOMD                                                       
***********************************************************************         
* BUY TESTING LINE                                                              
***********************************************************************         
PBUYTSTD DSECT                                                                  
PBTSTID  DS    CL6                 TRANSMISSION ID  'BUYTST'                    
PBTSORDR DS    CL8                 ORDER NUMBER                                 
PBTSTEXT DS    CL80                TEXT FOR THE TESTING LINE                    
PBUYTSTL EQU   *-PBUYTSTD                                                       
***********************************************************************         
* BUY AUTOMATED AVAIL UUID                                                      
***********************************************************************         
PBUYAAUD DSECT                                                                  
PAAUTID  DS    CL6                 TRANSMISSION ID 'BUYAAU'                     
PAAUORDR DS    CL8                 ORDER NUMBER                                 
PAAUCONT DS    CL1                 * MEANS MORE FOLLOW                          
PAAUTEXT DS    CL150                                                            
PBUYAAUL EQU   *-PBUYAAUD                                                       
***********************************************************************         
* BUY DETAIL LINE                                                               
***********************************************************************         
PBUYDTLD DSECT                                                                  
PBDTTID  DS    CL6                 TRANSMISSION ID  'BUYDTL'                    
PBDTORDR DS    CL8                 ORDER NUMBER                                 
PBDTCONT DS    CL1                 * MEANS MORE FOLLOW                          
PBDTCOST DS    CL9                 IN PENNIES                                   
PBDTSTDT DS    CL6                 START DATE       YYMMDD                      
PBDTNOWK DS    CL2                 NUMBER OF WEEKS                              
PBDTSPTS DS    CL2                 # OF SPOTS PER WK                            
PBUYDTLL EQU   *-PBUYDTLD                                                       
***********************************************************************         
* AGENCY RECALL LINE                                                            
***********************************************************************         
PAGYRCLD DSECT                                                                  
PARCTID  DS    CL6                 TRANSMISSION ID  'AGYRCL'                    
PARCORDR DS    CL8                 ORDER NUMBER                                 
PARCFRID DS    CL10                ID OF SENDER                                 
PARCTOID DS    CL10                ID OF RECEIVER                               
PARCROUT DS    CL5                 ROUTING CODE: AGY(3)/AGY OFFICE(2)           
PARCDATE DS    CL6                 DATE                                         
PARCTIME DS    CL4                 TIME                                         
PARCQSTA DS    CL6                 STATION                                      
PARCRPCN DS    CL8                 REP CONTRACT                                 
PARCRTRN DS    CL16                FLD SENDER ASKED TO HAVE RETURNED            
PARCOLDS DS    CL6                 OLD STATION IF CALL LETTER CHANGE            
PARCAPPL EQU   *-PAGYRCLD                                                       
PARCFSNT DS    CL6                 FIRST EDI SEND DATE                          
PARCFSTA DS    CL6                 FIRST EDI SEND STATION                       
PAGYRCLL EQU   *-PAGYRCLD                                                       
***********************************************************************         
* DELIVERY NOTICE LINE                                                          
***********************************************************************         
RDLNNOTD DSECT                                                                  
RDNTTID  DS    CL6                 TRANSMISSION ID 'DLNNOT' OR 'ERRNOT'         
RDNTORDR DS    CL8                 ORDER NUMBER                                 
RDNTFRID DS    CL10                ID OF SENDER                                 
RDNTTOID DS    CL10                ID OF RECEIVER                               
RDNTDATE DS    CL6                 DATE                                         
RDNTTIME DS    CL4                 TIME                                         
RDNTTDTE DS    CL6                 DATE OF RECEIVED TRANSMISSION                
RDNTTTIM DS    CL4                 TIME OF RECEIVED TRANSMISSION                
RDNTRPCN DS    CL8                 REP CONTRACT                                 
RDNTRTRN DS    CL16                FLD SENDER ASKED TO HAVE RETURNED            
RDNTEFLG DS    CL3                 ERROR FLAG  (SEE SPDARERROR)                 
RDLNNOTL EQU   *-RDLNNOTD                                                       
         SPACE 2                                                                
REFBDORD EQU   901                 BAD ORDER NUMBER                             
REFORDNE EQU   902                 ORDER NUMBER DOES NOT EXIST                  
REFORDNT EQU   903                 ORDER WAS NOT TRANSMITTED                    
REFORNTL EQU   904                 ORDER NOT LINKED TO THIS CONTRACT            
REFTLRWR EQU   905                 TRAILER FOR THE WRONG RECORD                 
REFAIDNV EQU   906                 AGENCY ID NOT VALID                          
REFRIDNV EQU   907                 REP ID NOT VALID                             
REFRCNNE EQU   908                 REP CONTRACT DOES NOT EXIST                  
REFBDCON EQU   909                 BAD REP CONTRACT NUMBER                      
REFBDABL EQU   910                 AGENCY BUYLINE NOT IN ORDER                  
REFCCHNG EQU   911                 CAN'T CHANGE STATUS OF THIS ORDER            
*                                                                               
DMGORNCN EQU   912                 ORDER WAS NOT CONFIRMED                      
DMGBADSQ EQU   913                 MAKEGOOD OFFER NOT IN SEQUENCE               
DMGINVNM EQU   914                 INVALID NUMBER FIELD                         
DMGNDROR EQU   915                 DARE ORDER RECORD DOESN'T EXIST              
DMGINCDT EQU   916                 INCON DATA (ORDER, SEQ#, GROUP ID)           
DMGINVUN EQU   917                 INVALID LENGTH UNIT TYPE                     
DMGINREC EQU   918                 INVALID RECORD COUNT                         
DMGTOTDL EQU   919                 INVALID TOTAL MAKEGOOD DOLLARS               
DMGORDOK EQU   920                 ORDER ALREADY OKAYED                         
*                                                                               
REFMNAPP EQU   921                 MAKEGOOD NOTICE SHOULD HAVE APPRVD           
REFMOSEQ EQU   922                 MAKEGOOD OFFER SEQ NUMBER NOT SAME           
DMGCANCL EQU   923                 MAKEGOOD OFFER CANCELLED W/ NO MORE          
REFMGDNE EQU   924                 MAKEGOOD OFFER DOES NOT EXIST                
PNDINGRV EQU   925                 PENDING REVISION, DON'T ALLOW MGS            
DMGNCANC EQU   927                 OFFER NOT CANCELLED BEFORE RESEND            
LMT8ORBS EQU   930                 LIMIT OF 8 ORBITS PER OFFER LINE             
BADCFMTP EQU   931                 CONFIRM TYPE DOESN'T MATCH SEND TYPE         
DMGTMSPW EQU   932                 MAKEGOOD HAS TOO MANY SPOTS/WEEK             
DMGTMSPB EQU   933                 MAKEGOOD HAS TOO MANY SPOTS/BUY              
DMGNOCBL EQU   934                 CABLE MAKEGOODS NOT SUPPORTED YET            
INVCABLE EQU   935                 INVALID CABLE STATION                        
DMGDPDTL EQU   936                 DUPLICATE MKGDTL DATE                        
DMGDTLSQ EQU   937                 MKGDTL DATES NON-CHRONOLIGICAL               
INVSTATN EQU   938                 INVALID STATION                              
DMGNMDS2 EQU   940                 MISSING MKGDS2 RECORD FOR MKGDEM             
DMGNMMNW EQU   941                 MISSING MKGMNW RECORD FOR MKGMSS             
DMGNMONW EQU   942                 MISSING MKGONW RECORD FOR MKGBUY             
DMGNNTWK EQU   943                 NETWORK IS NOT DEFINED FOR SYSCODE           
DMGNOTCB EQU   944                 MAKEGOOD IS NOT CABLE                        
DMGDUPMN EQU   945                 DUPLICATE MKGMNW CABLE RECORD                
DMGDUPON EQU   946                 DUPLICATE MKGONW CABLE RECORD                
DMGMSMNW EQU   947                 MISSING MKGMNW                               
DMGMSONW EQU   948                 MISSING MKTONW                               
DMGINVD2 EQU   949                 INVALID MKGDS2 RECORD                        
DMGINVDM EQU   950                 INVALID MKGDEM RECORD                        
DMGINVTM EQU   951                 INVALID TIME PERIOD                          
DMGINVDY EQU   952                 INVALID DAY ROTATION                         
DMGINVWK EQU   953                 INVALID NUMBER OF WEEKS                      
DMGINCDC EQU   954                 INVALID COMSCORE DEMO CATEGORY               
DMGINCDV EQU   955                 INVALID COMSCORE DEMO VALUE                  
DMGINVRO EQU   956                 INVALID ROTATION START DAY                   
DMGNVNPW EQU   957                 NUMPER PER WEEK IS INVALID OR 0              
DMGCCHNG EQU   958                 CAN'T CHANGE STATUS OF THIS MKGD             
***********************************************************************         
* DELIVERY FAX NOTICE LINE                                                      
***********************************************************************         
RDLNFAXD DSECT                                                                  
RDFXTID  DS    CL6                 TRANSMISSION ID 'DLNFAX'                     
RDFXORDR DS    CL8                 ORDER NUMBER                                 
RDFXFRID DS    CL10                ID OF SENDER                                 
RDFXTOID DS    CL10                ID OF RECEIVER                               
RDFXDATE DS    CL6                 DATE                                         
RDFXTIME DS    CL4                 TIME                                         
RDFXTDTE DS    CL6                 DATE OF RECEIVED TRANSMISSION                
RDFXTTIM DS    CL4                 TIME OF RECEIVED TRANSMISSION                
RDFXRTRN DS    CL16                FLD SENDER ASKED TO HAVE RETURNED            
RDFXERR  DS    CL3                 ERROR CODE IF TRANS ID = ERRFAX              
RDFXNOTL EQU   *-RDLNFAXD                                                       
***********************************************************************         
* ORDER RECALL ACKNOWLEDGEMENT LINE                                             
***********************************************************************         
RORDRCLD DSECT                                                                  
RORCTID  DS    CL6                 TRANSMISSION ID  'ORDRCL'                    
RORCORDR DS    CL8                 ORDER NUMBER                                 
RORCFRID DS    CL10                ID OF SENDER                                 
RORCTOID DS    CL10                ID OF RECEIVER                               
RORCDATE DS    CL6                 DATE                                         
RORCTIME DS    CL4                 TIME                                         
RORCQSTA DS    CL6                 STATION                                      
RORCRPCN DS    CL8                 REP CONTRACT                                 
RORCRTRN DS    CL16                FLD SENDER ASKED TO HAVE RETURNED            
RORCACCP DS    CL1                 ACCEPTED Y/N                                 
RORCOLDS DS    CL6                 OLD STATION IF CALL LETTER CHANGE            
RORCAPPL EQU   *-RORDRCLD                                                       
***********************************************************************         
* ORDER SALESPERSON REASSIGNMENT BACK FROM REP                                  
***********************************************************************         
RORDSALD DSECT                                                                  
ROSPTID  DS    CL6                 TRANSMISSION ID  'ORDSAL'                    
ROSPORDR DS    CL8                 ORDER NUMBER                                 
ROSPSALP DS    CL3                 SALESPERSON CODE                             
ROSPSALN DS    CL20                SALESPERSON NAME                             
ROSPOKCF DS    CL1                 Y = OK TO CONFIRM W/O ORDAPP (RADIO)         
RORDSALL EQU   *-RORDSALD                                                       
***********************************************************************         
* ORDER APPROVAL LINE                                                           
***********************************************************************         
RORDAPPD DSECT                                                                  
ROAPTID  DS    CL6                 TRANSMISSION ID  'ORDAPP'                    
ROAPORDR DS    CL8                 ORDER NUMBER                                 
ROAPFRID DS    CL10                ID OF SENDER                                 
ROAPTOID DS    CL10                ID OF RECEIVER                               
ROAPDATE DS    CL6                 DATE                                         
ROAPTIME DS    CL4                 TIME                                         
ROAPQSTA DS    CL6                 STATION                                      
ROAPRPCN DS    CL8                 REP CONTRACT                                 
ROAPRTRN DS    CL16                FLD SENDER ASKED TO HAVE RETURNED            
ROAPOLDS DS    CL6                 OLD STATION IF CALL LETTER CHANGE            
RORDAPPL EQU   *-RORDAPPD                                                       
***********************************************************************         
* ORDER MEDIAOCEAN LINE                                                         
***********************************************************************         
RORDMO1D DSECT                                                                  
RMO1TID  DS    CL6                 TRANSMISSION ID  'ORDMO1'                    
RMO1ORDR DS    CL8                 ORDER NUMBER                                 
RMO1ISMO DS    C                   Y/N - MEDIAOCEAN                             
RMO1TRAF DS    C                   Y/N - INTEGRATED TO TRAFFIC IF MO            
         DS    CL66                SPARE                                        
RORDMO1L EQU   *-RORDMO1D                                                       
***********************************************************************         
* ORDER REJECTION LINE                                                          
***********************************************************************         
RORDREJD DSECT                                                                  
RORJTID  DS    CL6                 TRANSMISSION ID  'ORDREJ'                    
RORJORDR DS    CL8                 ORDER NUMBER                                 
RORJFRID DS    CL10                ID OF SENDER                                 
RORJTOID DS    CL10                ID OF RECEIVER                               
RORJDATE DS    CL6                 DATE                                         
RORJTIME DS    CL4                 TIME                                         
RORJQSTA DS    CL6                 STATION                                      
RORJRPCN DS    CL8                 REP CONTRACT  (OR 'UNDARE')                  
RORJRTRN DS    CL16                FLD SENDER ASKED TO HAVE RETURNED            
RORJOLDS DS    CL6                 OLD STATION IF CALL LETTER CHANGE            
RORDREJL EQU   *-RORDREJD                                                       
***********************************************************************         
* ORDER REJECTION COMMENT LINE                                                  
***********************************************************************         
RORDCOMD DSECT                                                                  
ROCMTID  DS    CL6                 TRANSMISSION ID  'ORDCOM'                    
ROCMORDR DS    CL8                 ORDER NUMBER                                 
ROCMCONT DS    CL1                 * MEANS MORE FOLLOW                          
ROCMBLIN DS    CL4                 BUYLINE NUMBER                               
ROCMTEXT DS    CL70                COMMENT TEXT                                 
RORDCOML EQU   *-RORDCOMD                                                       
***********************************************************************         
* ORDER CONFIRMATION LINE                                                       
***********************************************************************         
RORDCFMD DSECT                                                                  
ROCFTID  DS    CL6                 TRANSMISSION ID  'ORDCFM'                    
ROCFORDR DS    CL8                 ORDER NUMBER                                 
ROCFFRID DS    CL10                ID OF SENDER                                 
ROCFTOID DS    CL10                ID OF RECEIVER                               
ROCFDATE DS    CL6                 DATE                                         
ROCFTIME DS    CL4                 TIME                                         
ROCFQSTA DS    CL6                 STATION                                      
ROCFRPCN DS    CL8                 REP CONTRACT                                 
ROCFRTRN DS    CL16                FLD SENDER ASKED TO HAVE RETURNED            
ROCFOLDS DS    CL6                 OLD STATION IF CALL LETTER CHANGE            
RORDCFML EQU   *-RORDCFMD                                                       
***********************************************************************         
* ORDER CONFIRMATION URL                                                        
***********************************************************************         
RORDURLD DSECT                                                                  
ROURTID  DS    CL6                 TRANSMISSION ID  'ORDURL'                    
ROURORDR DS    CL8                 ORDER NUMBER                                 
ROURCONT DS    CL1                 * MEANS MORE FOLLOW                          
ROURTEXT DS    CL79                URL TEXT                                     
RORDURLL EQU   *-RORDURLD                                                       
***********************************************************************         
* ORDER CONFIRMATION LINE NUMBER EQUIVALENTS LINE                               
***********************************************************************         
RORDLIND DSECT                                                                  
ROLNTID  DS    CL6                 TRANSMISSION ID  'ORDLIN'                    
ROLNORDR DS    CL8                 ORDER NUMBER                                 
ROLNCONT DS    CL1                 * MEANS MORE FOLLOW                          
ROLNBLIN DS    CL4                 AGENCY BUYLINE NUMBER                        
ROLNRLIN DS    CL40                REP BUYLINE NUMBER(S)                        
*                                  (ONE 4 DIGIT LINE # FOR EACH REP             
*                                       BUYLINE CREATED)                        
RORDLINL EQU   *-RORDLIND                                                       
***********************************************************************         
* ORDER TRAILER LINE                                                            
***********************************************************************         
RORDTLRD DSECT                                                                  
ROTRTID  DS    CL6                 TRANSMISSION ID  'ORDTLR'                    
ROTRORDR DS    CL8                 ORDER NUMBER                                 
ROTRRCCT DS    CL6                 RECORD COUNT                                 
RORDTLRL EQU   *-RORDTLRD                                                       
***********************************************************************         
* MAKEGOOD OFFER INDICATION                                                     
***********************************************************************         
PMKGHDRD DSECT                                                                  
PMKGTID  DS    CL6                 TRANSMISSION ID  'MKGHDR'                    
PMKGORDR DS    CL8                 ORDER NUMBER                                 
PMKGVERS DS    CL1                 DATA VERSION NUMBER (C'0' FOR NOW)           
PMKGFRID DS    CL10                ID OF SENDER                                 
PMKGTOID DS    CL10                ID OF RECEIVER                               
PMKGUSER DS    CL4                 HEX ID # OF USER FOR PQ ENTRY                
PMKGSUBI DS    CL3                 SUB ID           FOR PQ ENTRY                
PMKGREPN DS    CL4                 HEX REPORT #     FOR PQ ENTRY                
PMKGRTNS DS    CL16                AGENCY 'RETURN TO SENDER' DATA               
PMKGOFRI DS    CL3                 MAKEGOOD OFFER GROUP ID                      
PMKGSEQN DS    CL2                 ID VERSION NUMBER (SEQUENCE)                 
PMKGHDRL EQU   *-PMKGHDRD                                                       
***********************************************************************         
* RETURN TO SENDER DATA                                                         
***********************************************************************         
RTN2SNDR DSECT                                                                  
RTNSYSID DS    CL2    EDCDIC HEX   SYSTEM ID                                    
         DS    CL2    SPARE                                                     
RTNPWRCD DS    CL2    CHARACTER    AGENCY POWER CODE                            
RTNAGYMD DS    CL2    EBCDIC HEX   AGENCY/MEDIA                                 
RTNBUYER DS    CL3    CHARACTER    AGENCY BUYER CODE                            
RTNDDS   DS    CL3                 D=Y                                          
         DS    CL2                 SPARE                                        
RTN2SNDL EQU   *-RTN2SNDR                                                       
