*          DATA SET SPDARNSI   AT LEVEL 002 AS OF 01/09/06                      
MKTTAB   DS    0CL25                                                            
         DC    AL3(0125),C'AB',CL20'ALBANY,GA           '                       
         DC    AL3(0169),C'AD',CL20'HARRISONBURG, VA    '                       
         DC    AL3(0262),C'AI',CL20'ABILENE-SWEETWATER,TX'                      
         DC    AL3(0132),C'AL',CL20'ALBANY-SCHNCTADY-TROY,NY'                   
         DC    AL3(0234),C'AM',CL20'AMARILLO,TX         '                       
         DC    AL3(0343),C'AN',CL20'ANCHORAGE,TX        '                       
         DC    AL3(0183),C'AP',CL20'ALPENA, MI          '                       
         DC    AL3(0390),C'AQ',CL20'ALBUQUERQUE,NY      '                       
         DC    AL3(0257),C'AR',CL20'ADA-ARDMORE,OK      '                       
         DC    AL3(0235),C'AS',CL20'AUSTIN,TX           '                       
         DC    AL3(0168),C'AT',CL20'ATLANTA,GA          '                       
         DC    AL3(0120),C'AU',CL20'AUGUSTA,GA          '                       
         DC    AL3(0244),C'AX',CL20'ALEXANDRIA,LA       '                       
         DC    AL3(0112),C'BA',CL20'BALTIMORE,MD        '                       
         DC    AL3(0159),C'BC',CL20'BKLY-BLUEFIELD-OAK HILL,WV'                 
         DC    AL3(0292),C'BE',CL20'BEAUMONT-PORT ARTHUR,TX'                    
         DC    AL3(0114),C'BF',CL20'BUFFALO,NY          '                       
         DC    AL3(0230),C'BI',CL20'BIRMINGHAM,AL       '                       
         DC    AL3(0400),C'BK',CL20'BAKERSFIELD,CA      '                       
         DC    AL3(0356),C'BL',CL20'BILLINGS,MT         '                       
         DC    AL3(0137),C'BM',CL20'BANGOR,ME           '                       
         DC    AL3(0102),C'BN',CL20'BINGHAMTON,NY       '                       
         DC    AL3(0106),C'BO',CL20'BOSTON, MA          '                       
         DC    AL3(0123),C'BR',CL20'BURLINGTON-PLATTSBURGH, VT'                 
         DC    AL3(0357),C'BS',CL20'BOISE,ID            '                       
         DC    AL3(0316),C'BT',CL20'BATON ROUGE, LA     '                       
         DC    AL3(0354),C'BU',CL20'BUTTE, MT           '                       
         DC    AL3(0336),C'BW',CL20'BOWLING GREEN, KY   '                       
         DC    AL3(0346),C'BX',CL20'BILOXI,MS           '                       
         DC    AL3(0117),C'CA',CL20'CHARLOTTE, NC       '                       
         DC    AL3(0146),C'CB',CL20'COLUMBIA,SC         '                       
         DC    AL3(0200),C'CC',CL20'CORPUS CHRISTI, TX  '                       
         DC    AL3(0468),C'CD',CL20'CHICO-REDDING, CA   '                       
         DC    AL3(0237),C'CE',CL20'CEDAR RAPIDS-WATERLOO, IA'                  
         DC    AL3(0248),C'CG',CL20'CHMPAGN-SPRNGFLD-DECATUR, IL'               
         DC    AL3(0202),C'CH',CL20'CHICAGO, IL         '                       
         DC    AL3(0115),C'CI',CL20'CINCINNATI, OH      '                       
         DC    AL3(0204),C'CJ',CL20'COLUMBIA-JEFFERSON CITY, MO'                
         DC    AL3(0175),C'CK',CL20'CHATTANOOGA, TN     '                       
         DC    AL3(0110),C'CL',CL20'CLEVELAND, OH       '                       
         DC    AL3(0122),C'CM',CL20'COLUMBUS,GA         '                       
         DC    AL3(0198),C'CN',CL20'CLARKSBURG-WESTON, WV'                      
         DC    AL3(0135),C'CO',CL20'COLUMBUS,OH         '                       
         DC    AL3(0367),C'CP',CL20'CASPER-RIVERTON, WY '                       
         DC    AL3(0119),C'CR',CL20'CHARLESTON,SC       '                       
         DC    AL3(0352),C'CS',CL20'COLORADO SPRINGS-PUEBLO, CO'                
         DC    AL3(0273),C'CT',CL20'COLUMBUS-TUPELO, MS '                       
         DC    AL3(0184),C'CV',CL20'CHARLOTTESVILLE, VA '                       
         DC    AL3(0164),C'CW',CL20'CHARLESTON-HUNTINGTON, WV'                  
         DC    AL3(0359),C'CY',CL20'CHYENN-SCOTTSBLUF-STERLNG, WY'              
         DC    AL3(0223),C'DA',CL20'DALLAS-FT. WORTH, TX'                       
         DC    AL3(0111),C'DC',CL20'WASHINGTON,DC       '                       
         DC    AL3(0105),C'DE',CL20'DETROIT, MI         '                       
         DC    AL3(0279),C'DM',CL20'DES MOINES AMES, IA '                       
         DC    AL3(0351),C'DN',CL20'DENVER, CO          '                       
         DC    AL3(0206),C'DO',CL20'DOTHAN, AL          '                       
         DC    AL3(0282),C'DP',CL20'DAVENPORT-R.ISLAND-MOLINE, IA'              
         DC    AL3(0142),C'DT',CL20'DAYTON, OH          '                       
         DC    AL3(0276),C'DU',CL20'DULUTH-SUPERIOR, MN '                       
         DC    AL3(0402),C'EK',CL20'EUREKA, CA          '                       
         DC    AL3(0165),C'EL',CL20'ELMIRA, NY          '                       
         DC    AL3(0421),C'EN',CL20'BEND,OR             '                       
         DC    AL3(0365),C'EP',CL20'EL PASO, TX         '                       
         DC    AL3(0116),C'ER',CL20'ERIE, PA            '                       
         DC    AL3(0342),C'ES',CL20'ENSIGN-GARDEN CITY, KS'                     
         DC    AL3(0401),C'EU',CL20'EUGENE, OR          '                       
         DC    AL3(0249),C'EV',CL20'EVANSVILLE, IN      '                       
         DC    AL3(0324),C'FA',CL20'FARGO-VALLEY CITY, ND'                      
         DC    AL3(0345),C'FI',CL20'FAIRBANKS, AK       '                       
         DC    AL3(0113),C'FL',CL20'FLINT-SAGINAW-BAY CITY'                     
         DC    AL3(0171),C'FM',CL20'FT. MYERS, FL       '                       
         DC    AL3(0466),C'FN',CL20'FRESNO(VISALIA), CA '                       
         DC    AL3(0170),C'FO',CL20'FLORENCE,SC         '                       
         DC    AL3(0270),C'FS',CL20'FT. SMITH, AR       '                       
         DC    AL3(0109),C'FW',CL20'FT. WAYNE, IN       '                       
         DC    AL3(0192),C'GA',CL20'GAINESVILLE, FL     '                       
         DC    AL3(0258),C'GB',CL20'GREEN BAY, WI       '                       
         DC    AL3(0290),C'GE',CL20'GREAT BEND, KS      '                       
         DC    AL3(0355),C'GF',CL20'GREAT FALLS, MT     '                       
         DC    AL3(0118),C'GH',CL20'GRNSBORO-H.POINT-W.SALEM, NC'               
         DC    AL3(0373),C'GJ',CL20'GRAND JUNCTION-MONTROSE, CO'                
         DC    AL3(0398),C'GL',CL20'GLENDIVE, MT        '                       
         DC    AL3(0145),C'GN',CL20'GRNVLLE-N.BERN-WASHNGTN, NC'                
         DC    AL3(0163),C'GR',CL20'GRAND RAPIDS-KALAMAZOO, MI'                 
         DC    AL3(0167),C'GV',CL20'GRNVLL-SPART-ASHEVILLE, SC'                 
         DC    AL3(0247),C'GW',CL20'GREENWOOD, MS       '                       
         DC    AL3(0133),C'HA',CL20'HARTFORD-NEW HAVEN, CT'                     
         DC    AL3(0366),C'HE',CL20'HELENA, MT          '                       
         DC    AL3(0344),C'HL',CL20'HONOLULU, HI        '                       
         DC    AL3(0291),C'HN',CL20'HUNTSVILLE-DECATUR, AL'                     
         DC    AL3(0218),C'HO',CL20'HOUSTON, TX         '                       
         DC    AL3(0166),C'HR',CL20'HRRSBRG-LANCSTR-LEB-YRK, PA'                
         DC    AL3(0341),C'HY',CL20'HAYS-GOODLAND, KS   '                       
         DC    AL3(0358),C'ID',CL20'IDAHO FALLS-POCATELLO, ID'                  
         DC    AL3(0127),C'IN',CL20'INDIANAPOLIS, IN    '                       
         DC    AL3(0239),C'JA',CL20'JACKSON,TN          '                       
         DC    AL3(0161),C'JK',CL20'JACKSONVILLE, FL    '                       
         DC    AL3(0318),C'JM',CL20'JACKSON, MS         '                       
         DC    AL3(0334),C'JN',CL20'JONESBORO, AR       '                       
         DC    AL3(0203),C'JO',CL20'JOPLIN-PITTSBURG, NE'                       
         DC    AL3(0174),C'JS',CL20'JOHNSTOWN-ALTOONA, PA'                      
         DC    AL3(0347),C'JU',CL20'JUNEAU, AK          '                       
         DC    AL3(0216),C'KC',CL20'KANSAS CITY, MO     '                       
         DC    AL3(0157),C'KN',CL20'KNOXVILLE,TN        '                       
         DC    AL3(0403),C'LA',CL20'LOS ANGELES, CA     '                       
         DC    AL3(0251),C'LB',CL20'LUBBOCK, TX         '                       
         DC    AL3(0243),C'LC',CL20'LAKE CHARLES, IA    '                       
         DC    AL3(0141),C'LE',CL20'LEXINGTON, KY       '                       
         DC    AL3(0242),C'LF',CL20'LAFAYETTE,LA        '                       
         DC    AL3(0322),C'LI',CL20'LINCOLN-HSTINGS-KEARNEY, NE'                
         DC    AL3(0293),C'LK',CL20'LITTLE ROCK-PINE BLUFF, NE'                 
         DC    AL3(0158),C'LM',CL20'LIMA, OH            '                       
         DC    AL3(0151),C'LN',CL20'LANSING, MI         '                       
         DC    AL3(0129),C'LO',CL20'LOUISVILLE, KY      '                       
         DC    AL3(0349),C'LR',CL20'LAREDO, TX          '                       
         DC    AL3(0310),C'LU',CL20'HATTIESBURG-LAUREL, MS'                     
         DC    AL3(0439),C'LV',CL20'LAS VEGAS, NV       '                       
         DC    AL3(0302),C'LW',CL20'LA CROSSE-EAU CLAIR, WI'                    
         DC    AL3(0182),C'LY',CL20'LAFAYETTE,IN        '                       
         DC    AL3(0103),C'MA',CL20'MACON, GA           '                       
         DC    AL3(0236),C'MB',CL20'HARLINGEN-WESLACO, TX'                      
         DC    AL3(0269),C'MD',CL20'MADISON, WI         '                       
         DC    AL3(0240),C'ME',CL20'MEMPHIS, TN         '                       
         DC    AL3(0413),C'MF',CL20'MEDFORD-KLAMATH-FALLS, OR'                  
         DC    AL3(0298),C'MG',CL20'MONTGOMERY, AL      '                       
         DC    AL3(0128),C'MI',CL20'MIAMI-FT. LAUDERDALE, FL'                   
         DC    AL3(0337),C'MK',CL20'MANKATO, MN         '                       
         DC    AL3(0228),C'ML',CL20'MONROE-EL DORADO, LA'                       
         DC    AL3(0213),C'MN',CL20'MINNEAPOLIS-ST. PAUL, MN'                   
         DC    AL3(0428),C'MO',CL20'MONTEREY-SALINAS, CA'                       
         DC    AL3(0286),C'MP',CL20'MOBILE-PENSACOLA, AL-FL'                    
         DC    AL3(0153),C'MQ',CL20'MARQUETTE, MI       '                       
         DC    AL3(0311),C'MR',CL20'MERIDIAN, MS        '                       
         DC    AL3(0211),C'MS',CL20'MASON CITY-AUSTIN-ROCHESTER, MN'            
         DC    AL3(0287),C'MT',CL20'MINOT-BSMRK-DICKINSON, ND'                  
         DC    AL3(0362),C'MU',CL20'MISSOULA, MT        '                       
         DC    AL3(0217),C'MW',CL20'MILWAUKEE, WI       '                       
         DC    AL3(0259),C'NA',CL20'NASHVILLE, TN       '                       
         DC    AL3(0144),C'NF',CL20'NORFOLK-PORTSMTH-NEWPT NWS, VA'             
         DC    AL3(0222),C'NO',CL20'NEW ORLEANS, LA     '                       
         DC    AL3(0340),C'NP',CL20'N.PLATTE-HAYES-MC COOK, NE'                 
         DC    AL3(0101),C'NY',CL20'NEW YORK, NY        '                       
         DC    AL3(0233),C'OD',CL20'ODESSA-MIDLAND-MONAHANS, TX'                
         DC    AL3(0250),C'OK',CL20'OKLAHOMA CITY, OK   '                       
         DC    AL3(0252),C'OM',CL20'OMAHA, NE           '                       
         DC    AL3(0134),C'OR',CL20'ORLANDO-DAYTON BEACH, FL'                   
         DC    AL3(0231),C'OT',CL20'OTTUMWA-KIRKSVILLE, IA'                     
         DC    AL3(0100),C'PL',CL20'PORTLAND-AUBURN, ME.'                       
         DC    AL3(0232),C'PA',CL20'PADUCAH-C.GIRARDEAU-HRRBRG, KY'             
         DC    AL3(0275),C'PE',CL20'PEORIA, IL          '                       
         DC    AL3(0104),C'PH',CL20'PHILADELPHIA, PA    '                       
         DC    AL3(0197),C'PK',CL20'PARKERSBURG, WV     '                       
         DC    AL3(0256),C'PN',CL20'PANAMA CITY, FL     '                       
         DC    AL3(0420),C'PO',CL20'PORTLAND,OR         '                       
         DC    AL3(0152),C'PR',CL20'PRESQUE ISLE, ME    '                       
         DC    AL3(0404),C'PS',CL20'PALM SPRINGS, CA    '                       
         DC    AL3(0108),C'PT',CL20'PITTSBURGH, PA      '                       
         DC    AL3(0121),C'PV',CL20'PROVIDENCE, RI      '                       
         DC    AL3(0353),C'PX',CL20'PHOENIX, AZ         '                       
         DC    AL3(0317),C'QU',CL20'QUINCY-HANNIBAL-KEOKUK, IL'                 
         DC    AL3(0160),C'RA',CL20'RALEIGH-DURHAM, NC  '                       
         DC    AL3(0156),C'RC',CL20'RICHMOND-PETERSBURG, VA'                    
         DC    AL3(0411),C'RE',CL20'RENO, NV            '                       
         DC    AL3(0138),C'RH',CL20'ROCHESTER, NY       '                       
         DC    AL3(0131),C'RK',CL20'TRI-CITIES, TN-VA   '                       
         DC    AL3(0173),C'RN',CL20'ROANOKE-LYNCHBURG   '                       
         DC    AL3(0210),C'RO',CL20'ROCKFORD, IL        '                       
         DC    AL3(0364),C'RP',CL20'RAPID CITY, SD      '                       
         DC    AL3(0107),C'SG',CL20'SAVANNAH, GA        '                       
         DC    AL3(0241),C'SA',CL20'SAN ANTONIO. TX     '                       
         DC    AL3(0455),C'SB',CL20'SANTA BARBARA-SANTA MARIA, CA'              
         DC    AL3(0370),C'SC',CL20'SALT LAKE CITY, UT  '                       
         DC    AL3(0425),C'SD',CL20'SAN DIEGO, CA       '                       
         DC    AL3(0419),C'SE',CL20'SEATTLE-TACOMA, WA  '                       
         DC    AL3(0407),C'SF',CL20'SAN FRANCISCO-OAKLAND, CA'                  
         DC    AL3(0188),C'SH',CL20'SOUTH BEND-ELKHART, IN'                     
         DC    AL3(0325),C'SI',CL20'SIOUX FALLS, SD     '                       
         DC    AL3(0238),C'SJ',CL20'ST. JOSEPH, MO      '                       
         DC    AL3(0481),C'SK',CL20'SPOKANE, WA         '                       
         DC    AL3(0209),C'SL',CL20'ST. LOUIS, MO       '                       
         DC    AL3(0219),C'SM',CL20'SPRINGFIELD,MO      '                       
         DC    AL3(0176),C'SO',CL20'SALISBURY, MD       '                       
         DC    AL3(0143),C'SP',CL20'SPRINFIELD-HOLYOKE, MA'                     
         DC    AL3(0177),C'SR',CL20'WILKES BARRE-SCRANTON, PA'                  
         DC    AL3(0462),C'SS',CL20'SACRAMENTO-STOCKTON, CA'                    
         DC    AL3(0261),C'ST',CL20'SAN ANGELO, TX      '                       
         DC    AL3(0212),C'SV',CL20'SHREVEPORT, LA      '                       
         DC    AL3(0224),C'SX',CL20'SIOUX CITY, IA      '                       
         DC    AL3(0155),C'SY',CL20'SYRACUSE, NY        '                       
         DC    AL3(0139),C'TA',CL20'TAMPA-ST PETERSBURG, FL'                    
         DC    AL3(0389),C'TC',CL20'TUCSON, AZ          '                       
         DC    AL3(0181),C'TH',CL20'TERRE HAUTE, IN     '                       
         DC    AL3(0205),C'TK',CL20'TOPEKA, KS          '                       
         DC    AL3(0130),C'TL',CL20'TALLAHASSEE-THOMASVILLE, FL'                
         DC    AL3(0147),C'TO',CL20'TOLEDO, OH          '                       
         DC    AL3(0140),C'TR',CL20'TRAVERSE CITY-CADILLAC, MI'                 
         DC    AL3(0271),C'TU',CL20'TULSA, OK           '                       
         DC    AL3(0360),C'TW',CL20'TWIN FALLS, ID      '                       
         DC    AL3(0309),C'TY',CL20'TYLER, TX           '                       
         DC    AL3(0126),C'UT',CL20'UTICA, NY           '                       
         DC    AL3(0226),C'VI',CL20'VICTORIA, TX        '                       
         DC    AL3(0225),C'WC',CL20'WACO-TEMPLE, TX     '                       
         DC    AL3(0227),C'WF',CL20'WICHITA FALLS-LAWTON, TX'                   
         DC    AL3(0154),C'WH',CL20'WHEELING-STEUBENVILLE, OH'                  
         DC    AL3(0278),C'WI',CL20'WICHITA-HUTCHINSON, KS'                     
         DC    AL3(0150),C'WL',CL20'WILMINGTON, NC      '                       
         DC    AL3(0148),C'WP',CL20'WEST PALM BEACH, FL '                       
         DC    AL3(0149),C'WT',CL20'WATERTOWN, NY       '                       
         DC    AL3(0305),C'WU',CL20'WAUSAU, WI          '                       
         DC    AL3(0410),C'YA',CL20'YAKIMA, WA          '                       
         DC    AL3(0136),C'YG',CL20'YOUNGSTOWN, OH      '                       
         DC    AL3(0371),C'YU',CL20'YUMA-EL CENTRO, AZ  '                       
         DC    AL3(0196),C'ZA',CL20'ZANESVILLE, OH      '                       
         DC    X'FF'                                                            
*******                                                                         
*&&DO                                                                           
*   I WAS USING DARE CITY CODE                                                  
         DC    AL3(0168),C'AT',CL20'ATLANTA'                                    
         DC    AL3(0106),C'BO',CL20'BOSTON'                                     
         DC    AL3(0117),C'CA',CL20'CHARLOTTE'                                  
         DC    AL3(0202),C'CH',CL20'CHICAGO'                                    
         DC    AL3(0110),C'CV',CL20'CLEVELAND'                                  
         DC    AL3(0223),C'DA',CL20'DALLAS'                                     
         DC    AL3(0351),C'DN',CL20'DENVER'                                     
         DC    AL3(0105),C'DE',CL20'DETROIT'                                    
         DC    AL3(0218),C'HO',CL20'HOUSTON'                                    
         DC    AL3(0127),C'IN',CL20'INDIANAPOLIS'                               
         DC    AL3(0216),C'KC',CL20'KANSAS CITY'                                
         DC    AL3(0403),C'LA',CL20'LOS ANGELES'                                
         DC    AL3(0128),C'MI',CL20'MIAMI'                                      
         DC    AL3(0213),C'MN',CL20'MINNEAPOLIS'                                
         DC    AL3(0222),C'NO',CL20'NEW ORLEANS'                                
         DC    AL3(0101),C'NY',CL20'NEW YORK'                                   
         DC    AL3(0104),C'PH',CL20'PHILADELPHIA'                               
         DC    AL3(0353),C'PX',CL20'PHOENIX'                                    
         DC    AL3(0108),C'PT',CL20'PITTSBURGH'                                 
         DC    AL3(0420),C'PO',CL20'PORTLAND, OR'                               
         DC    AL3(0241),C'SA',CL20'SAN ANTONIO'                                
         DC    AL3(0425),C'SD',CL20'SAN DIEGO'                                  
         DC    AL3(0407),C'SF',CL20'SAN FRANCISCO'                              
         DC    AL3(0419),C'SE',CL20'SEATTLE'                                    
         DC    AL3(0209),C'SL',CL20'ST LOUIS'                                   
         DC    AL3(0111),C'DC',CL20'WASHINGTON, DC'                             
         DC    AL3(0000),C'TO',CL20'TORONTO'                                    
*&&                                                                             
