*          DATA SET SPDEMFFD   AT LEVEL 003 AS OF 10/07/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20EFFD      DATE 10/07/83                 
         SPACE 1                                                                
T20EFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
DEMMSGH  DS    CL8                                                              
DEMMSG   DS    CL60     1    2   60   A    P    N         T         Y           
DEMIDH   DS    CL8                                                              
DEMID    DS    CL17     1   63   17   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL6      2    2    6   A    P    N         T         Y           
DEMACTH  DS    CL8                                                              
DEMACT   DS    CL5      2   10    5   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL6      2   19    6   A    P    N         T         Y           
DEMSRCH  DS    CL8                                                              
DEMSRC   DS    CL6      2   27    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      2   37    6   A    P    N         T         Y           
DEMMARH  DS    CL8                                                              
DEMMAR   DS    CL4      2   46    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      3    2    7   A    P    N         T         Y           
DEMSTAH  DS    CL8                                                              
DEMSTA   DS    CL5      3   10    5   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      3   19    4   A    P    N         T         Y           
DEMBOOKH DS    CL8                                                              
DEMBOOK  DS    CL6      3   27    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      3   37    3   A    P    N         T         Y           
DEMHUTH  DS    CL8                                                              
DEMHUT   DS    CL3      3   41    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      3   46    4   A    P    N         T         Y           
DEMPAGH  DS    CL8                                                              
DEMPAG   DS    CL2      3   51    2   A    U    N         T         Y           
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 275  BYTES                            
