*          DATA SET SPDEMFDD   AT LEVEL 003 AS OF 10/07/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20EFDD      DATE 10/07/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      5   10    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      5   16    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      5   22    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      5   27    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      5   32    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      5   37    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      5   42    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3      5   47    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      5   77    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL80     6    1   80   A    P    N         T         Y           
DMDHDD0H DS    CL8                                                              
DMDHDD0  DS    CL80     7    1   80   A    P    N         T         Y           
DMDHDD1H DS    CL8                                                              
DMDHDD1  DS    CL80     8    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80     9    1   80   A    P    N         T         Y           
DMDDTD0H DS    CL8                                                              
DMDDTD0  DS    CL80    10    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    11    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    12    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    13    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    14    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    15    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    16    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    17    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    18    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    19    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    20    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    21    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    22    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL80    23    1   80   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    24    1   79   A    P    N         T         Y           
DMDLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
DMDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1784 BYTES                            
