*          DATA SET SPDEMFED   AT LEVEL 003 AS OF 10/07/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20EFED      DATE 10/07/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5   A    P    N         T         Y           
DMEDEM1H DS    CL8                                                              
DMEDEM1  DS    CL7      5   10    7   A    U    N         T         Y           
DMEDEM2H DS    CL8                                                              
DMEDEM2  DS    CL7      5   20    7   A    U    N         T         Y           
DMEDEM3H DS    CL8                                                              
DMEDEM3  DS    CL7      5   30    7   A    U    N         T         Y           
DMEDEM4H DS    CL8                                                              
DMEDEM4  DS    CL7      5   40    7   A    U    N         T         Y           
DMEDEM5H DS    CL8                                                              
DMEDEM5  DS    CL7      5   50    7   A    U    N         T         Y           
DMEDEM6H DS    CL8                                                              
DMEDEM6  DS    CL7      5   60    7   A    U    N         T         Y           
DMEDEM7H DS    CL8                                                              
DMEDEM7  DS    CL7      5   70    7   A    U    N         T         Y           
DMENAMH  DS    CL8                                                              
DMENAM   DS    CL56     6   24   56   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      7    2    3   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL4      7   12    4   A    P    N         T         Y           
DMEDASHH DS    CL8                                                              
DMEDASH  DS    CL55     7   24   55   A    P    N         T         Y           
DMEDA1H  DS    CL8                                                              
DMEDA1   DS    CL8      8    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11     8   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55     8   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11     9   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55     9   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    10   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    10   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    11   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    11   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    12   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    12   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    13   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    13   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    14   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    14   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    15   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    15   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    16   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    16   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     17    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    17   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    17   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     18    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    18   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    18   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     19    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    19   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    19   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     20    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    20   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    20   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     21    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    21   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    21   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     22    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    22   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    22   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     23    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    23   12   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL55    23   24   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     24    2    1   A    U    N         T         Y           
DMELAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
DMEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1848 BYTES                            
