*          DATA SET SPDRVWRKD  AT LEVEL 009 AS OF 12/03/85                      
*                                                                               
SPDRVWKD DSECT                                                                  
         DS    D                                                                
SDNMGRPS EQU   GLOPTS              NUMBER OF MARKET GROUPS                      
SDNPGRPS EQU   GLOPTS+1            NUMBER OF PRODUCT GROUPS                     
SDTAX    EQU   GLOPTS+2            TAX OPTION                                   
SDNMNTHS EQU   GLOPTS+3            NUMBER OF MONTHS IN REQUEST                  
*                                                                               
MGR1MASK DS    H                                                                
MGR2MASK DS    H                                                                
PGR1MASK DS    H                                                                
