*          DATA SET SPEIXSTA   AT LEVEL 001 AS OF 05/19/94                      
***********************************************************************         
* LIST OF EIX STATIONS                                                *         
***********************************************************************         
         SPACE 1                                                                
         DC    CL5'KASAT'                                                       
         DC    CL5'KBHKT'                                                       
         DC    CL5'KCBST'                                                       
         DC    CL5'KCCIT'                                                       
         DC    CL5'KDFWT'                                                       
         DC    CL5'KDKAT'                                                       
         DC    CL5'KFMBT'                                                       
         DC    CL5'KFVET'                                                       
         DC    CL5'KGW T'                                                       
         DC    CL5'KHNLT'                                                       
         DC    CL5'KINGT'                                                       
         DC    CL5'KJRHT'                                                       
         DC    CL5'KMBCT'                                                       
         DC    CL5'KMOLT'                                                       
         DC    CL5'KMOVT'                                                       
         DC    CL5'KMSBT'                                                       
         DC    CL5'KMSPT'                                                       
         DC    CL5'KNXVT'                                                       
         DC    CL5'KOLOT'                                                       
         DC    CL5'KPHOT'                                                       
         DC    CL5'KPIXT'                                                       
         DC    CL5'KPLRT'                                                       
         DC    CL5'KPRCT'                                                       
         DC    CL5'KRBKT'                                                       
         DC    CL5'KREMT'                                                       
         DC    CL5'KSEET'                                                       
         DC    CL5'KSHBT'                                                       
         DC    CL5'KTTUT'                                                       
         DC    CL5'KTVBT'                                                       
         DC    CL5'KTVXT'                                                       
         DC    CL5'KUTVT'                                                       
         DC    CL5'KVUET'                                                       
         DC    CL5'KVVUT'                                                       
         DC    CL5'KWTVT'                                                       
         DC    CL5'KWWLT'                                                       
         DC    CL5'KXANT'                                                       
         DC    CL5'KXAST'                                                       
         DC    CL5'KXLYT'                                                       
         DC    CL5'KYW T'                                                       
         DC    CL5'WABCT'                                                       
         DC    CL5'WAFBT'                                                       
         DC    CL5'WANDT'                                                       
         DC    CL5'WANET'                                                       
         DC    CL5'WATLT'                                                       
         DC    CL5'WAVYT'                                                       
         DC    CL5'WBALT'                                                       
         DC    CL5'WBBMT'                                                       
         DC    CL5'WBRCT'                                                       
         DC    CL5'WBZ T'                                                       
         DC    CL5'WCAUT'                                                       
         DC    CL5'WCBST'                                                       
         DC    CL5'WCIXT'                                                       
         DC    CL5'WCNCT'                                                       
         DC    CL5'WCPOT'                                                       
         DC    CL5'WCVBT'                                                       
         DC    CL5'WDAFT'                                                       
         DC    CL5'WDRBT'                                                       
         DC    CL5'WDTNT'                                                       
         DC    CL5'WDZLT'                                                       
         DC    CL5'WESHT'                                                       
         DC    CL5'WEWST'                                                       
         DC    CL5'WFLAT'                                                       
         DC    CL5'WFTST'                                                       
         DC    CL5'WFTVT'                                                       
         DC    CL5'WGN T'                                                       
         DC    CL5'WGNOT'                                                       
         DC    CL5'WGNXT'                                                       
         DC    CL5'WHAST'                                                       
         DC    CL5'WISHT'                                                       
         DC    CL5'WISNT'                                                       
         DC    CL5'WJZ T'                                                       
         DC    CL5'WLS T'                                                       
         DC    CL5'WLYHT'                                                       
         DC    CL5'WMAQT'                                                       
         DC    CL5'WMART'                                                       
         DC    CL5'WMC T'                                                       
         DC    CL5'WNOLT'                                                       
         DC    CL5'WOODT'                                                       
         DC    CL5'WOWKT'                                                       
         DC    CL5'WPIXT'                                                       
         DC    CL5'WPTVT'                                                       
         DC    CL5'WPTYT'                                                       
         DC    CL5'WQADT'                                                       
         DC    CL5'WREGT'                                                       
         DC    CL5'WSB T'                                                       
         DC    CL5'WSOCT'                                                       
         DC    CL5'WSVNT'                                                       
         DC    CL5'WSYXT'                                                       
         DC    CL5'WTAET'                                                       
         DC    CL5'WTAJT'                                                       
         DC    CL5'WTBST'                                                       
         DC    CL5'WTVJT'                                                       
         DC    CL5'WTXXT'                                                       
         DC    CL5'WXYZT'                                                       
         DC    X'00'                                                            
