*          DATA SET SPEZFFED   AT LEVEL 010 AS OF 03/17/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230FED      DATE 03/17/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
DANANMH  DS    XL8                                                              
DANANM   DS    CL25     5   10   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
DANSRTH  DS    XL8                                                              
DANSRT   DS    CL8      6   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
DANOPTH  DS    XL8                                                              
DANOPT   DS    CL40     6   29   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
DANREDH  DS    XL8                                                              
DANRED   DS    CL10     8   11   10  A  U N             T        Y              
DANLT1H  DS    XL8                                                              
DANLT1   DS    CL57    10    2   57  A  P N             T        Y              
DANUSRH  DS    XL8                                                              
DANUSR   DS    CL8     11    2    8  A  U N             T        Y              
DANSTAH  DS    XL8                                                              
DANSTA   DS    CL7     11   12    7  A  U N             T        Y              
DANUS2H  DS    XL8                                                              
DANUS2   DS    CL8     11   22    8  A  U N             T        Y              
DANST2H  DS    XL8                                                              
DANST2   DS    CL7     11   32    7  A  U N             T        Y              
DANUS3H  DS    XL8                                                              
DANUS3   DS    CL8     11   42    8  A  U N             T        Y              
DANST3H  DS    XL8                                                              
DANST3   DS    CL7     11   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   52    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    2    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   12    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   42    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   52    7  A  U N             T        Y              
DANFLGH  DS    XL8                                                              
DANFLG   DS    CL1     21   79    1  A  U N             T        Y              
DANLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DANWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1280 BYTES                            
