*          DATA SET SPEZFEED   AT LEVEL 009 AS OF 04/04/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230EED      DATE 04/04/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
LANNAMH  DS    CL8                                                              
LANNAM   DS    CL25     5   10   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y              
LANSRTH  DS    CL8                                                              
LANSRT   DS    CL8      6   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
LANOPTH  DS    CL8                                                              
LANOPT   DS    CL40     6   29   40  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL33     8    7   33  A   P    N         T        Y              
LANSELH  DS    CL8                                                              
LANSEL   DS    CL3      9    2    3  A   U    N         T        Y              
LANNM1H  DS    CL8                                                              
LANNM1   DS    CL73     9    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    10    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    11    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    12    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    13    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    14    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    15    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    16    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    17    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    18    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    19    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    20    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    21    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    22    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL73    23    7   73  A   P    N         T        Y              
LANFLGH  DS    CL8                                                              
LANFLG   DS    CL1     24    2    1  A   U    N         T        Y              
LANLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LANWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1592 BYTES                            
