*          DATA SET SPEZFE1D   AT LEVEL 014 AS OF 09/10/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230E1D      DATE 09/10/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
LUPSTAH  DS    XL8                                                              
LUPSTA   DS    CL8      5   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     5   20   10  A  P N             T        Y              
LUPBDTH  DS    XL8                                                              
LUPBDT   DS    CL9      5   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      5   42    9  A  P N             T        Y              
LUPBSQH  DS    XL8                                                              
LUPBSQ   DS    CL6      5   54    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
LUPFTRH  DS    XL8                                                              
LUPFTR   DS    CL40     6   10   40  A  U N             T        Y              
LUPTLH   DS    XL8                                                              
LUPTL    DS    CL48     7   30   48  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
LUPTTL1H DS    XL8                                                              
LUPTTL1  DS    CL31     8    2   31  A  P H             T        Y              
LUPTTL2H DS    XL8                                                              
LUPTTL2  DS    CL25     8   34   25  A  P H             T        Y              
LUPTTL3H DS    XL8                                                              
LUPTTL3  DS    CL20     8   60   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      9    2    1  A  P N             T        Y              
LUPFRSTH DS    XL8                                                              
LUPFRST  DS    CL31    10    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    10   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    10   60   20  A  U N             T        Y              
LUPSCNDH DS    XL8                                                              
LUPSCND  DS    CL31    11    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    11   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    11   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    12    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    12   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    13    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    13   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    14    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    14   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    15    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    15   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    16    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    16   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    17    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    17   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    18    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    18   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    19    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    19   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    20    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    20   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    21    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    21   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    21   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    22    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    22   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    22   60   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL31    23    2   31  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    23   34   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    23   60   20  A  U N             T        Y              
LUPPFKYH DS    XL8                                                              
LUPPFKY  DS    CL79    24    2   79  A  P H             T        Y              
LUPLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
