*          DATA SET SPEZFF9D   AT LEVEL 023 AS OF 10/17/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230F9D      DATE 10/17/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
DIVSTAH  DS    CL8                                                              
DIVSTA   DS    CL7      5   10    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     5   20   10  A   P    N         T        Y              
DIVBDTH  DS    CL8                                                              
DIVBDT   DS    CL9      5   32    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      5   42    9  A   P    N         T        Y              
DIVBSQH  DS    CL8                                                              
DIVBSQ   DS    CL6      5   54    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
DIVOPTH  DS    CL8                                                              
DIVOPT   DS    CL40     6   10   40  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   P    H         T        Y              
DIVCNMH  DS    CL8                                                              
DIVCNM   DS    CL25     8   22   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13     8   50   13  A   P    H         T        Y              
DIVCDEH  DS    CL8                                                              
DIVCDE   DS    CL5      8   65    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      9   10    4  A   P    N         T        Y              
DIVCCDH  DS    CL8                                                              
DIVCCD   DS    CL4      9   15    4  A   U    N         T        Y              
DIVCNMDH DS    CL8                                                              
DIVCNMD  DS    CL20     9   30   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    11    2   12  A   P    H         T        Y              
DIVPNMH  DS    CL8                                                              
DIVPNM   DS    CL25    11   22   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11   50   14  A   P    H         T        Y              
DIVPPEH  DS    CL8                                                              
DIVPPE   DS    CL15    11   65   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12   10    4  A   P    N         T        Y              
DIVPCDH  DS    CL8                                                              
DIVPCD   DS    CL12    12   15   12  A   U    N         T        Y              
DIVPNMDH DS    CL8                                                              
DIVPNMD  DS    CL20    12   30   20  A   P    N         T        Y              
DIVPN2DH DS    CL8                                                              
DIVPN2D  DS    CL20    12   60   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    14    2   14  A   P    H         T        Y              
DIVINOH  DS    CL8                                                              
DIVINO   DS    CL20    14   19   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    15    2   16  A   P    H         T        Y              
DIVMOSH  DS    CL8                                                              
DIVMOS   DS    CL12    15   19   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  A   P    H         T        Y              
DIVCSTH  DS    CL8                                                              
DIVCST   DS    CL10    16   19   10  A   U    N         T        Y              
DIVCSTSH DS    CL8                                                              
DIVCSTS  DS    CL9     16   30    9  A   P    N         T        Y              
DIVFLGH  DS    CL8                                                              
DIVFLG   DS    CL1     16   79    1  A   P    N         T        Y              
DIVLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DIVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 664  BYTES                            
