*          DATA SET SPEZFFBD   AT LEVEL 007 AS OF 03/24/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230FBD      DATE 03/24/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
DONNAMH  DS    XL8                                                              
DONNAM   DS    CL25     5   10   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
DONSRTH  DS    XL8                                                              
DONSRT   DS    CL8      6   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
DONOPTH  DS    XL8                                                              
DONOPT   DS    CL40     6   29   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76     8    2   76  A  P N             T        Y              
DONOFNH  DS    XL8                                                              
DONOFN   DS    CL18     9    2   18  A  U N             T        Y              
DONUSRH  DS    XL8                                                              
DONUSR   DS    CL8      9   22    8  A  U N             T        Y              
DONSTAH  DS    XL8                                                              
DONSTA   DS    CL7      9   32    7  A  U N             T        Y              
DONON2H  DS    XL8                                                              
DONON2   DS    CL18     9   41   18  A  U N             T        Y              
DONUS2H  DS    XL8                                                              
DONUS2   DS    CL8      9   61    8  A  U N             T        Y              
DONST2H  DS    XL8                                                              
DONST2   DS    CL7      9   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    10    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    10   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    11    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    11   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    12    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    12   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    13    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    13   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    14    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    14   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    15    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    15   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    16    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    16   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    17    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    17   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    18    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    18   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    19    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    19   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    20    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    20   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    21    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    21   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    22    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    22   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   71    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    23    2   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   22    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    23   41   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   61    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   71    7  A  U N             T        Y              
DONFLGH  DS    XL8                                                              
DONFLG   DS    CL1     23   79    1  A  P N             T        Y              
DONPFKYH DS    XL8                                                              
DONPFKY  DS    CL79    24    2   79  A  P H             T        Y              
DONLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2040 BYTES                            
