*          DATA SET SPEZFDFD   AT LEVEL 002 AS OF 12/15/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230DFD      DATE 12/15/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL70     8    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70     9    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    10    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    11    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    12    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    13    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    14    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    15    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    16    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    17    2   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL70    18    2   70  A   P    N         T        Y              
ACTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ACTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 864  BYTES                            
