*          DATA SET SPEZFEFD   AT LEVEL 004 AS OF 11/07/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230EFD      DATE 11/07/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
LADNAMH  DS    CL8                                                              
LADNAM   DS    CL25     5   10   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
LADSRTH  DS    CL8                                                              
LADSRT   DS    CL8      6   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
LADOPTH  DS    CL8                                                              
LADOPT   DS    CL45     6   29   45  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
LADSL1H  DS    CL8                                                              
LADSL1   DS    CL3      8    2    3  A  P N             T        Y              
LADLIT1H DS    CL8                                                              
LADLIT1  DS    CL4      8    7    4  A  P N             T        Y              
LADLIT2H DS    CL8                                                              
LADLIT2  DS    CL15     8   34   15  A  P N             T        Y              
LADSELH  DS    CL8                                                              
LADSEL   DS    CL3      9    2    3  A  U N             T        Y              
LADNM2H  DS    CL8                                                              
LADNM2   DS    CL70     9    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    10    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    11    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    12    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    13    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    14    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    15    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    16    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    17    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    18    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    19    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    20    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    21    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    22    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    23    7   70  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL70    24    7   70  A  P N             T        Y              
LADFLGH  DS    CL8                                                              
LADFLG   DS    CL1     24   79    1  A  U N             T        Y              
LADLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LADWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1640 BYTES                            
