*          DATA SET SPEZFDED   AT LEVEL 005 AS OF 10/02/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230DED      DATE 10/02/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
LUPSTAH  DS    XL8                                                              
LUPSTA   DS    CL8      5   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     5   20   10  A  P N             T        Y              
LUPBDTH  DS    XL8                                                              
LUPBDT   DS    CL9      5   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      5   42    9  A  P N             T        Y              
LUPBSQH  DS    XL8                                                              
LUPBSQ   DS    CL6      5   54    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
LUPFTRH  DS    XL8                                                              
LUPFTR   DS    CL40     6   10   40  A  U N             T        Y              
LUPTLH   DS    XL8                                                              
LUPTL    DS    CL48     7   30   48  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
LUPTTL1H DS    XL8                                                              
LUPTTL1  DS    CL19     8    2   19  A  P H             T        Y              
LUPTTL2H DS    XL8                                                              
LUPTTL2  DS    CL25     8   22   25  A  P H             T        Y              
LUPTTL3H DS    XL8                                                              
LUPTTL3  DS    CL32     8   48   32  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      9    2    1  A  P N             T        Y              
LUPFRSTH DS    XL8                                                              
LUPFRST  DS    CL19    10    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    10   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    10   48   32  A  U N             T        Y              
LUPSCNDH DS    XL8                                                              
LUPSCND  DS    CL19    11    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    11   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    11   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    12    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    12   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    12   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    13    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    13   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    13   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    14    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    14   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    14   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    15    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    15   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    15   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    16    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    16   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    16   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    17    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    17   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    17   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    18    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    18   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    18   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    19    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    19   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    19   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    20    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    20   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    20   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    21    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    21   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    21   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    22    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    22   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    22   48   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    23    2   19  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    23   22   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL32    23   48   32  A  U N             T        Y              
LUPPFKYH DS    XL8                                                              
LUPPFKY  DS    CL79    24    2   79  A  P H             T        Y              
LUPLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
