*          DATA SET SPEZFF5OD  AT LEVEL 001 AS OF 06/26/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230F5D      DATE 06/26/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
EZFSTAH  DS    CL8                                                              
EZFSTA   DS    CL9      5   10    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
EZFFTRH  DS    CL8                                                              
EZFFTR   DS    CL40     7   10   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     9    2   20  A  P N             T        Y              
EZFESTAH DS    CL8                                                              
EZFESTA  DS    CL9      9   23    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    11    2   17  A  P N             T        Y              
EZFEADVH DS    CL8                                                              
EZFEADV  DS    CL25    11   20   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   46    9  A  P N             T        Y              
EZFEUIDH DS    CL8                                                              
EZFEUID  DS    CL8     11   56    8  A  U N             T        Y              
EZFFLGH  DS    CL8                                                              
EZFFLG   DS    CL1     12    2    1  A  P N             T        Y              
EZFLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
EZFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 256  BYTES                            
