*          DATA SET SPEZFE7D   AT LEVEL 007 AS OF 07/03/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230E7D      DATE 07/03/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
LINOAGYH DS    XL8                                                              
LINOAGY  DS    CL9      6   15    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     6   30   11  A  P N             T        Y              
LINNAGYH DS    XL8                                                              
LINNAGY  DS    CL9      6   45    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     7   30   13  A  P N             T        Y              
LINNSQ1H DS    XL8                                                              
LINNSQ1  DS    CL9      7   45    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
LINSTAH  DS    XL8                                                              
LINSTA   DS    CL8      9   13    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   30   11  A  P N             T        Y              
LINNSTAH DS    XL8                                                              
LINNSTA  DS    CL8      9   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
LINBDTEH DS    XL8                                                              
LINBDTE  DS    CL9     10   13    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11    2    9  A  P N             T        Y              
LINBSEQH DS    XL8                                                              
LINBSEQ  DS    CL6     11   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
LININVH  DS    XL8                                                              
LININV   DS    CL12    14    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   17   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   32   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   47   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   62   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   17   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   32   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   47   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   62   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   17   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   32   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   47   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   62   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   17   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   32   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   47   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   62   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   17   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   32   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   47   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   62   12  A  U N             T        Y              
LINNSQTH DS    XL8                                                              
LINNSQT  DS    CL19    20    2   19  A  P N             T        Y              
LINNSQ2H DS    XL8                                                              
LINNSQ2  DS    CL9     20   25    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   79    1  A  P N             T        Y              
LINLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 816  BYTES                            
