*          DATA SET SPEZFE6D   AT LEVEL 002 AS OF 04/29/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230E6D      DATE 04/29/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
IRPSTAH  DS    XL8                                                              
IRPSTA   DS    CL9      5   10    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   20    4  A  P H             T        Y              
IRPDTEH  DS    XL8                                                              
IRPDTE   DS    CL17     5   28   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
IRPSEQH  DS    XL8                                                              
IRPSEQ   DS    CL6      6   10    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
IRPINVH  DS    XL8                                                              
IRPINV   DS    CL10     6   28   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
IRPOPTH  DS    XL8                                                              
IRPOPT   DS    CL40     7   10   40  A  U N             T        Y              
IRPSYSH  DS    XL8                                                              
IRPSYS   DS    CL1      7   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
IRPFLGH  DS    XL8                                                              
IRPFLG   DS    CL1      8   79    1  A  P N             T        Y              
IRPLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
IRPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
