*          DATA SET SPEZFECD   AT LEVEL 013 AS OF 02/06/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230ECD      DATE 02/06/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
LPRCLTH  DS    CL8                                                              
LPRCLT   DS    CL3      5   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  A   P    N         T        Y              
LPRNAMH  DS    CL8                                                              
LPRNAM   DS    CL25     5   26   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y              
LPRSRTH  DS    CL8                                                              
LPRSRT   DS    CL8      6   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
LPROPTH  DS    CL8                                                              
LPROPT   DS    CL45     6   29   45  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46     8    7   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70     9    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    10    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    11    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    12    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    13    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    14    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    15    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    16    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    17    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    18    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    19    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    20    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    21    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    22    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    23    7   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    24    7   70  A   P    N         T        Y              
LPRFLGH  DS    CL8                                                              
LPRFLG   DS    CL1     24   79    1  A   U    N         T        Y              
LPRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1680 BYTES                            
