*          DATA SET SPEZFF5DO  AT LEVEL 009 AS OF 02/03/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230F5D      DATE 02/03/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
EZFSTAH  DS    CL8                                                              
EZFSTA   DS    CL9      5   10    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
EZFFTRH  DS    CL8                                                              
EZFFTR   DS    CL40     7   10   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     9    2   20  A  P N             T        Y              
EZFESTAH DS    CL8                                                              
EZFESTA  DS    CL9      9   25    9  A  U N             T        Y              
EZFFLGH  DS    CL8                                                              
EZFFLG   DS    CL1     10    2    1  A  P N             T        Y              
EZFLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
EZFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 168  BYTES                            
