*          DATA SET SPEZFEBD   AT LEVEL 007 AS OF 02/01/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230EBD      DATE 02/01/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
LONNAMH  DS    CL8                                                              
LONNAM   DS    CL25     5   10   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y              
LONSRTH  DS    CL8                                                              
LONSRT   DS    CL8      6   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
LONOPTH  DS    CL8                                                              
LONOPT   DS    CL40     6   29   40  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
LONSE1H  DS    CL8                                                              
LONSE1   DS    CL3      8    2    3  A   P    N         T        Y              
LONLITH  DS    CL8                                                              
LONLIT   DS    CL11     8    7   11  A   P    N         T        Y              
LONSELH  DS    CL8                                                              
LONSEL   DS    CL3      9    2    3  A   U    N         T        Y              
LONNM1H  DS    CL8                                                              
LONNM1   DS    CL25     9    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    10    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    11    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    12    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    13    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    14    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    15    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    16    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    17    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    18    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    19    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    20    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    21    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    22    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    23    7   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL25    24    7   25  A   P    N         T        Y              
LONFLGH  DS    CL8                                                              
LONFLG   DS    CL1     24   79    1  A   U    N         T        Y              
LONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 896  BYTES                            
