*          DATA SET SPEZFF5D   AT LEVEL 004 AS OF 09/10/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230F5D      DATE 09/10/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
EZFSTAH  DS    XL8                                                              
EZFSTA   DS    CL9      5   10    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
EZFFTRH  DS    XL8                                                              
EZFFTR   DS    CL40     7   10   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19     9    2   19  A  P N             T        Y              
EZFESTAH DS    XL8                                                              
EZFESTA  DS    CL9      9   23    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    11    2   16  A  P N             T        Y              
EZFEADVH DS    XL8                                                              
EZFEADV  DS    CL25    11   19   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   46    8  A  P N             T        Y              
EZFEUIDH DS    XL8                                                              
EZFEUID  DS    CL8     11   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    13    2   19  A  P N             T        Y              
EZFRUEQH DS    XL8                                                              
EZFRUEQ  DS    CL8     13   46    8  A  P N             T        Y              
EZFRUIDH DS    XL8                                                              
EZFRUID  DS    CL8     13   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   64    4  A  P N             T        Y              
EZFRSTAH DS    XL8                                                              
EZFRSTA  DS    CL9     13   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   53    1  A  P N             T        Y              
EZFRUI2H DS    XL8                                                              
EZFRUI2  DS    CL8     14   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   67    1  A  P N             T        Y              
EZFRST2H DS    XL8                                                              
EZFRST2  DS    CL9     14   69    9  A  U N             T        Y              
EZFSAEQH DS    XL8                                                              
EZFSAEQ  DS    CL16    16    2   16  A  P N             T        Y              
EZFSADVH DS    XL8                                                              
EZFSADV  DS    CL25    16   19   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   46    8  A  P N             T        Y              
EZFSUIDH DS    XL8                                                              
EZFSUID  DS    CL8     16   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   64    4  A  P N             T        Y              
EZFSSTAH DS    XL8                                                              
EZFSSTA  DS    CL9     16   69    9  A  U N             T        Y              
EZFSEQUH DS    XL8                                                              
EZFSEQU  DS    CL1     17   17    1  A  P N             T        Y              
EZFSAD2H DS    XL8                                                              
EZFSAD2  DS    CL25    17   19   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   53    1  A  P N             T        Y              
EZFSID2H DS    XL8                                                              
EZFSID2  DS    CL8     17   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   67    1  A  P N             T        Y              
EZFSST2H DS    XL8                                                              
EZFSST2  DS    CL9     17   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   17    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    18   19   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   53    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   67    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   17    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    19   19   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   53    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   67    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   17    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    20   19   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   53    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   67    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   17    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    21   19   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   53    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   67    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   17    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    22   19   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   53    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   67    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   69    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   17    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    23   19   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   53    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   55    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   67    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   69    9  A  U N             T        Y              
EZFFLGH  DS    XL8                                                              
EZFFLG   DS    CL1     24    2    1  A  P N             T        Y              
EZFLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
EZFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1160 BYTES                            
