*          DATA SET SPEZFB3D   AT LEVEL 034 AS OF 05/12/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230B3D      DATE 05/12/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
LINTYPEH DS    CL8                                                              
LINTYPE  DS    CL2      5   10    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL2      5   20    2  A  P H             T        Y              
LINUIDH  DS    CL8                                                              
LINUID   DS    CL8      5   28    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
LINOPTH  DS    CL8                                                              
LINOPT   DS    CL69     6   10   69  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P H             T        Y              
LINBILLH DS    CL8                                                              
LINBILL  DS    CL2      8    8    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      8   15    6  A  P H             T        Y              
LINFRMTH DS    CL8                                                              
LINFRMT  DS    CL3      8   25    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      8   30    4  A  P N             T        Y              
LINLINKH DS    CL8                                                              
LINLINK  DS    CL8      8   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   52    8  A  P N             T        Y              
LINCSTCH DS    CL8                                                              
LINCSTC  DS    CL6      8   62    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   52    8  A  P N             T        Y              
LINARCDH DS    CL8                                                              
LINARCD  DS    CL7      9   62    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A  P H             T        Y              
LINBNAMH DS    CL8                                                              
LINBNAM  DS    CL30    10   15   30  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     10   52    8  A  P N             T        Y              
LININACH DS    CL8                                                              
LININAC  DS    CL4     10   62    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11    2    9  A  P N             T        Y              
LINBATTH DS    CL8                                                              
LINBATT  DS    CL30    11   15   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P H             T        Y              
LINBAD1H DS    CL8                                                              
LINBAD1  DS    CL30    12   15   30  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
LINBAD2H DS    CL8                                                              
LINBAD2  DS    CL30    13   15   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14    2    9  A  P H             T        Y              
LINBCTYH DS    CL8                                                              
LINBCTY  DS    CL20    14   15   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10    14   38   10  A  P H             T        Y              
LINBSTH  DS    CL8                                                              
LINBST   DS    CL2     14   50    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     14   54    8  A  P H             T        Y              
LINBZIPH DS    CL8                                                              
LINBZIP  DS    CL10    14   64   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   11    1  N  P N             T        Y              
LINTELAH DS    CL8                                                              
LINTELA  DS    CL3     16   13    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   17    1  N  P N             T        Y              
LINTELEH DS    CL8                                                              
LINTELE  DS    CL3     16   19    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   23    1  N  P N             T        Y              
LINTELNH DS    CL8                                                              
LINTELN  DS    CL4     16   25    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   30    1  N  P N             T        Y              
LINTELXH DS    CL8                                                              
LINTELX  DS    CL5     16   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   11    1  N  P N             T        Y              
LINFAXAH DS    CL8                                                              
LINFAXA  DS    CL3     17   13    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   17    1  N  P N             T        Y              
LINFAXEH DS    CL8                                                              
LINFAXE  DS    CL3     17   19    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   23    1  N  P N             T        Y              
LINFAXNH DS    CL8                                                              
LINFAXN  DS    CL4     17   25    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   30    1  N  P N             T        Y              
LINFAXXH DS    CL8                                                              
LINFAXX  DS    CL5     17   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   38    5  A  P N             T        Y              
LINMED1H DS    CL8                                                              
LINMED1  DS    CL1     18   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   54    4  A  P N             T        Y              
LINRTE1H DS    CL8                                                              
LINRTE1  DS    CL2     18   64    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   38    5  A  P N             T        Y              
LINMED2H DS    CL8                                                              
LINMED2  DS    CL1     19   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   54    4  A  P N             T        Y              
LINRTE2H DS    CL8                                                              
LINRTE2  DS    CL2     19   64    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   38    5  A  P N             T        Y              
LINMED3H DS    CL8                                                              
LINMED3  DS    CL1     20   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   54    4  A  P N             T        Y              
LINRTE3H DS    CL8                                                              
LINRTE3  DS    CL2     20   64    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   38    5  A  P N             T        Y              
LINMED4H DS    CL8                                                              
LINMED4  DS    CL1     21   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   54    4  A  P N             T        Y              
LINRTE4H DS    CL8                                                              
LINRTE4  DS    CL2     21   64    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
LINBSRCH DS    CL8                                                              
LINBSRC  DS    CL60    22   13   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   79    1  A  P N             T        Y              
LINLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1104 BYTES                            
