*          DATA SET SPEZFB1D   AT LEVEL 012 AS OF 02/27/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230B1D      DATE 02/27/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
REQMEDH  DS    CL8                                                              
REQMED   DS    CL1      6   20    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
REQCLTH  DS    CL8                                                              
REQCLT   DS    CL3      7   20    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
REQPRDH  DS    CL8                                                              
REQPRD   DS    CL3      8   20    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
REQESTH  DS    CL8                                                              
REQEST   DS    CL3      9   20    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    10    2   15  A  P H             T        Y              
REQMTHH  DS    CL8                                                              
REQMTH   DS    CL16    10   20   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
REQAGYH  DS    CL8                                                              
REQAGY   DS    CL3     11   20    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
REQSTAH  DS    CL8                                                              
REQSTA   DS    CL8     12   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P Z             T        Y              
REQRRUNH DS    CL8                                                              
REQRRUN  DS    CL8     13   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    2   10  A  P Z             T        Y              
REQTRCEH DS    CL8                                                              
REQTRCE  DS    CL1     14   20    1  A  U N             T        Y              
REQLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
REQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 272  BYTES                            
