*          DATA SET SPEZFA5D   AT LEVEL 003 AS OF 11/08/17                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230A5D      DATE 11/08/17                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
CPEUIDH  DS    XL8                                                              
CPEUID   DS    CL10     6   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
CPEMEDH  DS    XL8                                                              
CPEMED   DS    CL1      7   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
CPESTAH  DS    XL8                                                              
CPESTA   DS    CL7      8   20    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
CPESRCH  DS    XL8                                                              
CPESRC   DS    CL4      9   20    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
CPEMOSH  DS    XL8                                                              
CPEMOS   DS    CL6     10   20    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
CPEDATH  DS    XL8                                                              
CPEDAT   DS    CL17    11   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
CPESTTH  DS    XL8                                                              
CPESTT   DS    CL1     12   20    1  A  U N             T        Y              
CPEFLGH  DS    XL8                                                              
CPEFLG   DS    CL1     12   79    1  A  P N             T        Y              
CPELAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
CPEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
