*          DATA SET SPEZFE2D   AT LEVEL 005 AS OF 07/23/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230E2D      DATE 07/23/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
LINAGYH  DS    XL8                                                              
LINAGY   DS    CL10     6   15   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
LINSTAH  DS    XL8                                                              
LINSTA   DS    CL8      8   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
LINBDTEH DS    XL8                                                              
LINBDTE  DS    CL18     9   15   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
LINBSEQH DS    XL8                                                              
LINBSEQ  DS    CL6     10   15    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
LINFTRH  DS    XL8                                                              
LINFTR   DS    CL60    11   15   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   79    1  A  P N             T        Y              
LINLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 240  BYTES                            
