*          DATA SET SPEZFF7D   AT LEVEL 004 AS OF 11/07/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230F7D      DATE 11/07/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
DADNAMH  DS    CL8                                                              
DADNAM   DS    CL25     5   10   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
DADSRTH  DS    CL8                                                              
DADSRT   DS    CL8      6   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
DADOPTH  DS    CL8                                                              
DADOPT   DS    CL45     6   29   45  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
DADLIT1H DS    CL8                                                              
DADLIT1  DS    CL41     8    3   41  A  P N             T        Y              
DADIDH   DS    CL8                                                              
DADID    DS    CL8      9    3    8  A  U N             T        Y              
DADSTAH  DS    CL8                                                              
DADSTA   DS    CL7      9   14    7  A  U N             T        Y              
DADID2H  DS    CL8                                                              
DADID2   DS    CL8      9   26    8  A  U N             T        Y              
DADST2H  DS    CL8                                                              
DADST2   DS    CL7      9   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   37    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     24    3    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     24   14    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     24   26    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     24   37    7  A  U N             T        Y              
DADFLGH  DS    CL8                                                              
DADFLG   DS    CL1     24   79    1  A  U N             T        Y              
DADLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DADWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1208 BYTES                            
