*          DATA SET SPEZFFAD   AT LEVEL 001 AS OF 03/10/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230FAD      DATE 03/10/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
DBASTAH  DS    XL8                                                              
DBASTA   DS    CL7      5   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   20    4  A  P N             T        Y              
DBADTEH  DS    XL8                                                              
DBADTE   DS    CL17     5   28   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   56    3  A  P N             T        Y              
DBASEQH  DS    XL8                                                              
DBASEQ   DS    CL6      5   64    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DBAOPTH  DS    XL8                                                              
DBAOPT   DS    CL40     6   10   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
DBAST2H  DS    XL8                                                              
DBAST2   DS    CL8      8   19    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    2    4  A  P H             T        Y              
DBADT2H  DS    XL8                                                              
DBADT2   DS    CL8      9   19    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P H             T        Y              
DBASQ2H  DS    XL8                                                              
DBASQ2   DS    CL6     10   19    6  A  P N             T        Y              
DBAIRIH  DS    XL8                                                              
DBAIRI   DS    CL15    10   52   15  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL11    11    2   11  A  P H             T        Y              
DBAANMH  DS    XL8                                                              
DBAANM   DS    CL30    11   19   30  A  P N             T        Y              
DBAIANH  DS    XL8                                                              
DBAIAN   DS    CL25    11   52   25  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P H             T        Y              
DBAAD1H  DS    XL8                                                              
DBAAD1   DS    CL30    12   19   30  A  P N             T        Y              
DBAIADH  DS    XL8                                                              
DBAIAD   DS    CL25    12   52   25  A  P Z             T        Y              
DBAAD2H  DS    XL8                                                              
DBAAD2   DS    CL30    13   19   30  A  P N             T        Y              
DBAAD3H  DS    XL8                                                              
DBAAD3   DS    CL30    14   19   30  A  P N             T        Y              
DBAAD4H  DS    XL8                                                              
DBAAD4   DS    CL30    15   19   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    2   11  A  P H             T        Y              
DBADUSH  DS    XL8                                                              
DBADUS   DS    CL8     17   19    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    18    2   16  A  P H             T        Y              
DBACAOH  DS    XL8                                                              
DBACAO   DS    CL13    18   19   13  A  P N             T        Y              
DBAFLGH  DS    XL8                                                              
DBAFLG   DS    CL1     18   79    1  A  P N             T        Y              
DBALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DBAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 656  BYTES                            
