*          DATA SET SPEZFFDD   AT LEVEL 009 AS OF 02/01/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230FDD      DATE 02/01/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    H         T        Y              
DCLNAMH  DS    CL8                                                              
DCLNAM   DS    CL25     5   10   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y              
DCLSRTH  DS    CL8                                                              
DCLSRT   DS    CL8      6   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
DCLOPTH  DS    CL8                                                              
DCLOPT   DS    CL45     6   29   45  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
DCLLIT1H DS    CL8                                                              
DCLLIT1  DS    CL71     8    2   71  A   P    N         T        Y              
DCLCDEH  DS    CL8                                                              
DCLCDE   DS    CL3      9    2    3  A   U    N         T        Y              
DCLCNMH  DS    CL8                                                              
DCLCNM   DS    CL20     9    7   20  A   P    N         T        Y              
DCLSTAH  DS    CL8                                                              
DCLSTA   DS    CL7      9   29    7  A   U    N         T        Y              
DCLCD2H  DS    CL8                                                              
DCLCD2   DS    CL3      9   40    3  A   U    N         T        Y              
DCLCN2H  DS    CL8                                                              
DCLCN2   DS    CL20     9   45   20  A   P    N         T        Y              
DCLST2H  DS    CL8                                                              
DCLST2   DS    CL7      9   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    10    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    10   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    11    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    11   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    12    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    12   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    13    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    13   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    17    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    17   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    18    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    18   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    19    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    19   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    20    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    20   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    21    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    21   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    22    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    22   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    23    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    23   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23   67    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    24    7   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     24   29    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24   40    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    24   45   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     24   67    7  A   U    N         T        Y              
DCLFLGH  DS    CL8                                                              
DCLFLG   DS    CL1     24   79    1  A   U    N         T        Y              
DCLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1976 BYTES                            
