*          DATA SET SPEZFF6D   AT LEVEL 012 AS OF 09/17/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T230F6D      DATE 09/17/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    N         T        Y              
EZFSTAH  DS    CL8                                                              
EZFSTA   DS    CL7      5   10    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  A   P    N         T        Y              
EZFDTEH  DS    CL8                                                              
EZFDTE   DS    CL9      5   28    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y              
EZFDRFH  DS    CL8                                                              
EZFDRF   DS    CL2      6   10    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
EZFRESH  DS    CL8                                                              
EZFRES   DS    CL2      6   28    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6   38    6  A   P    N         T        Y              
EZFSRCEH DS    CL8                                                              
EZFSRCE  DS    CL5      6   45    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6   56    6  A   P    N         T        Y              
EZFSTATH DS    CL8                                                              
EZFSTAT  DS    CL5      6   64    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
EZFOPTH  DS    CL8                                                              
EZFOPT   DS    CL40     7   10   40  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    N         T        Y              
EZFLT2H  DS    CL8                                                              
EZFLT2   DS    CL73     9    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    10    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    11    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    12    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    13    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    14    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    15    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    16    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    17    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    18    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    19    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    20    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    21    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    22    7   73  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL73    23    7   73  A   P    N         T        Y              
EZFFLGH  DS    CL8                                                              
EZFFLG   DS    CL1     24    2    1  A   P    N         T        Y              
EZFLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
EZFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1472 BYTES                            
