*          DATA SET SPFINTWA   AT LEVEL 027 AS OF 10/03/91                      
TWAD     DSECT                                                                  
         ORG   TWAOVER                                                          
TSAVE    DS    CL5                                                              
TIND     DS    CL1                                                              
TINIT    EQU   X'40'            TSAR HAS BEEN INITIALIZED                       
TRES     EQU   X'20'            TSAR HAS BEEN RESTORED                          
TIND2    DS    CL1                                                              
TRES2    EQU   X'80'            SPOTBLOCK HAS BEEN SAVED                        
TSTART   DS    CL1              Y=START LIST FROM BEGINNING                     
         ORG                                                                    
*                                                                               
         ORG   SAVOVER                                                          
ESTST    DS    CL6                ESTIMATE START DATE                           
ESTND    DS    CL6                ESTIMATE END DATE                             
MEDNM    DS    CL10               MEDIA NAME                                    
SVPROF   DS    CL16               SAVED PROFILE 00                              
CLTNM    DS    CL20               CLIENT NAME                                   
PRDNM    DS    CL20               PRODUCT NAME                                  
ESTNM    DS    CL20               ESTIMATE NAME                                 
MKTNM    DS    CL24               MARKET NAME                                   
SKEY     DS    XL44               SAVED DISPLAY KEY                             
SVOPTS   DS    XL64               SAVED OPTIONS                                 
DTLIST   DS    XL107              BINARY DTS OF REQ- ENDS WITH X'00'            
SVPROFB3 DS    XL16               SAVED PROFILE B3                              
YMLIST   DS    CL27               Y/M FOR B3 PROFILE                            
         ORG                                                                    
         SPACE 2                                                                
