*          DATA SET SPGENINFO  AT LEVEL 008 AS OF 01/13/94                      
INFORECD DSECT           *******   SPOTPAK INFOMERCIAL DATA RECORD              
*                                                                               
INFKEY   DS    0XL13                                                            
INFKTYP  DS    XL2'0D79'           RECORD TYPE                                  
INFKAGMD DS    XL1                 AGENCY/MEDIA                                 
INFKCLT  DS    XL2                 CLIENT                                       
INFKPRD  DS    XL1                 PRODUCT                                      
INFKEST  DS    XL1                 ESTIMATE                                     
INFKMKT  DS    XL2                 MARKET                                       
INFKSTA  DS    XL3                 STATION                                      
         DS    XL1                 THANKS MEL                                   
*                                                                               
INFLEN   DS    XL2                 RECORD LENGTH                                
INFCNTL  DS    XL1                                                              
INFLINKS DS    XL4                                                              
INFAGYA  DS    CL2                 ALPHA AGY                                    
         DS    CL2                                                              
*                                                                               
INFEL    DS    0C                                                               
*                                                                               
INFNAMEL DSECT                     UPSELL CATEGORY NAMES ELEMENT                
INFNAMCD DS    X'01'               ELEMENT CODE (X'01')                         
INFNAMLN DS    AL1(62)             ELEMENT LENGTH                               
INFNAMES DS    5XL12               UPSELL CATEGORY NAMES                        
*                                                                               
INFCPOEL DSECT                     CPO ELEMENT                                  
INFCPOCD DS    X'05'               ELEMENT CODE (X'05')                         
INFCPOLN DS    AL1(26)             ELEMENT LENGTH                               
INFCPO   DS    6XL4                ORDERS/UPS1/UPS2/.../UPS5                    
*                                                                               
INFRATEL DSECT                     TARGET RATIO  ELEMENT                        
INFRATCD DS    X'06'               ELEMENT CODE (X'06')                         
INFRATLN DS    AL1(26)             ELEMENT LENGTH                               
INFRAT   DS    6XL4                ORDERS/UPS1/UPS2/.../UPS5 (2 DEC)            
*                                                                               
INFCOSEL DSECT                     TARGET BRK EVEN COST ELEMENT                 
INFCOSCD DS    X'07'               ELEMENT CODE (X'07')                         
INFCOSLN DS    AL1(26)             ELEMENT LENGTH                               
INFCOS   DS    6XL4                ORDERS/UPS1/UPS2/.../UPS5 (2 DEC)            
*                                                                               
INFMSCEL DSECT                                                                  
INFMSCCD DS    X'08'               INFO MISCELLANEOUS DATA ELEMENT              
INFMSCLN DS    AL1(10)                                                          
INFMSCOR DS    XL4                 TARGET ORDERS                                
INFMSCBU DS    XL4                 BUDGET (IN DOLLARS)                          
*                                                                               
INFPRICE DSECT                                                                  
INFPRCD  DS    X'09'               UPSELL PRICES ELEMENT                        
INFPRLN  DS    AL1(26)                                                          
INFPR    DS    6XL4                UPSELL PRICES. LAST 4 BYTES ARE              
*                                  RETAIL PRICE                                 
*                                                                               
