*          DATA SET SPGENNVL   AT LEVEL 004 AS OF 04/03/87                      
NVLRECD  DSECT           SPOTPAK NV REPORT LETTER DEFINITION RECORD             
*                                                                               
NVLKEY   DS    0XL13                                                            
NVLKTYP  DS    XL2'0D43'           RECORD TYPE                                  
NVLKAGY  DS    CL2                 AGENCY ALPHA                                 
NVLKID   DS    XL2                 SIGNON ID                                    
NVLKMED  DS    CL1                 MEDIA                                        
NVLKCLT  DS    XL2                 CLIENT                                       
         DS    XL4                 NOT USED                                     
*                                                                               
NVLLEN   DS    XL2                                                              
NVLCNTL  DS    XL1                                                              
         DS    XL8                                                              
         SPACE 2                                                                
NVLEL01  DSECT                     ADDRESS DEFINITION                           
         DS    XL1'01'                                                          
         DS    AL1                                                              
NVLADDR  DS    X                   ADDRESS                                      
*                                                                               
NVLEL02  DSECT                     SIGNATURE DEFINITION                         
         DS    XL1'02'                                                          
         DS    AL1                                                              
NVLSIGT  DS    X                   SIGNATURE                                    
*                                                                               
NVLEL03  DSECT                     DEPARTMENT DEFINITION                        
         DS    XL1'03'                                                          
         DS    AL1                                                              
NVLDEPT  DS    X                   DEPARTMENT                                   
