*          DATA SET SPGENDREV  AT LEVEL 014 AS OF 06/11/20                      
DRVRECD  DSECT         ***** SPOTPAK DESKTOP BUY CONTRCUTION RECS *****         
*                      *****        REVISION/REVLINE RECS         *****         
*                      *****         WORKSHEET/AVAIL RECS         *****         
*                      *****           PROPOASAL RECS             *****         
*                      *****           DEVIATED WEEKS             *****         
*                                                                               
DRVKEY   DS    0CL32                                                            
DRVKTYP  DS    XL1                 RECORD TYPE X'0E'                            
DRVKTYPQ EQU   X'0E'                                                            
*                                                                               
DRVKSUB  DS    XL1                 RECORD SUBTYPE X'10'                         
DRVKSUBQ EQU   X'10'               X'10' REVISION SUB KEY                       
DWKKSUBQ EQU   X'11'               X'11' WORK SUB KEY                           
DPRKSUBQ EQU   X'12'               X'11' PROPOSAL SUB KEY                       
*                                                                               
DRVKSPR1 DS    XL11                SPARE FOR COMPRESSION                        
*                                                                               
DRVKAM   DS    XL1                 AGENCY/MEDIA                                 
DRVKCLT  DS    XL2                 CLIENT CODE                                  
DRVKPRD  DS    CL3                 PRODUCT CODE OR POL                          
DRVKEST  DS    XL1                 ESTIMATE                                     
DRVKMKT  DS    XL2                 MARKET                                       
*                                                                               
DRVKREVS DS    XL3                 REVISION/WRKSHEET SEQ # (F'S COMP)           
*                                                                               
DRVKREVL DS    XL3                 REVLINE/AVAIL SEQ # (F'S COMP)               
*                                                                               
DRVKFLG  DS    XL1                -FLAG                                         
DRVKCOM  EQU   X'80'              -COMMENT RECORD                               
*                                                                               
DRVKSPR3 DS    CL3                 SPARE                                        
***********************************************************************         
* NOTE: DRVKREVL IS NULLS IN SHEET HEADER RECORDS                               
***********************************************************************         
*                                                                               
         ORG   DRVKEY+L'DRVKEY                                                  
DRVKSTAT DS    0XL4                DIRECTORY STATUS BYTES                       
*                                                                               
DRVKST0  DS    X                   STATUS+0                                     
DRVKSDEL EQU   X'80'               RECORD DELETED                               
*                                                                               
DRVKST1  DS    X                   STATUS+1                                     
DRVKSRPL EQU   X'80'               LINE REPLACED                                
DRVKSXFR EQU   X'40'               LINE TRASNFERRED                             
*                                                                               
DRVKST2  DS    X                   STATUS+2                                     
DRVKST3  DS    X                   STATUS+3                                     
DRVKDA   DS    XL4                 DISK ADDRESS                                 
*                                                                               
         ORG   DRVKEY                                                           
DRPKEY   DS    0XL32               PASSIVE KEY ????                             
*                                                                               
         ORG   DRVKEY+L'DRVKEY                                                  
DRVRLEN  DS    XL2                                                              
DRVRSTAT DS    0XL2                                                             
*                                                                               
DRVRST0  DS    X                   STATUS+0                                     
DRVRSDEL EQU   X'80'               RECORD DELETED                               
*                                                                               
DRVRST1  DS    X                   STATUS+1                                     
DRVRSRPL EQU   X'80'               LINE REPLACED                                
DRVRSXFR EQU   X'40'               LINE TRASNFERRED                             
*                                                                               
DRVRAGYA DS    CL2                                                              
DRVRLINK DS    XL4                                                              
DRVEL    DS    0C                  FIRST ELEMENT                                
*                                                                               
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
* REVISION/WORKSHEET HEADER RECORD ELEMENTS:                          *         
*  10 - R/W SHEET NAME ELEMENT                                        *         
*  20 - R/W SHEET DESCRIPTION DATA ELEM                               *         
*  22 - R/W SHEET NOTES ELEM                                          *         
*  30 - R/W SHEET DEMO CATEGORIES ELEM                                *         
*  32 - R/W SHEET DEMO BOOKS ELEM                                     *         
*  34 - R/W SHEET DEMO UPGRADE/AVERAGE ELEM                                     
*  40 - R/W SHEET COPIED FROM REVISION/WORKSHEET ELEM                 *         
*  90 - R/W SHEET ACTIVITY ELEM                                       *         
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
* FOUND IN R/W SHEET RECORD                                                     
RSNELD   DSECT                                                                  
RSNEL    DS    XL1                 R/W SHEET NAME ELEMENT                       
RSNELQ   EQU   X'10'                                                            
RSNLEN   DS    XL1                                                              
RSNLENQ  EQU   *-RSNEL                                                          
RSNAME   DS    0C                  NAME                                         
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSDELD   DSECT                                                                  
RSDEL    DS    XL1                 R/W SHEET DATA ELEMENT                       
RSDELQ   EQU   X'20'                                                            
RSDLEN   DS    XL1                                                              
RSDFLTST DS    XP(DT02)L2          FLIGHT START DATE                            
RSDFLTEN DS    XP(DT02)L2          FLIGHT END DATE                              
RSDADJ   DS    CL1                 FADJACENCY CODE                              
RSDREP   DS    CL3                 REP CODE                                     
RSDPURP  DS    CL6                 PURPOSE CODE                                 
RSDBYR   DS    CL12                BUYER                                        
RSDPRD   DS    CL3                 PRODUCT CODE                                 
RSDAUDEM DS    XL4   ???????????   AUDIENCE COMP BASE DEMO                      
*                                  FLAGS:                                       
RSDFDALY DS    C                   - DAILY R/W SHEET                            
RSDFCMBD DS    C                   - COMBINE DAILY BUYS                         
RSDFAADJ DS    C                   - AUTO ADJUST                                
RSDFAAD2 DS    C                   - AUTO ADJ IMPS OR ALL RHOMES DEMOS          
RSDFAAD3 DS    C                   - AUTO ADJ IMPS OR ALL TARGET DEMOS          
*                                                                               
RSDHILN# DS    XL2                 HIGH LINE #                                  
RSCSBKTY DS    XL1                 COMSCORE BOOKTYPE                            
RSCSSRDT DS    XL1                 COMSCORE SURVEY DATES                        
RSDLENQ  EQU   *-RSDELD                                                         
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSNTELD  DSECT                     R/W SHEET NOTES ELEMENT                      
RSNTEL   DS    XL1                                                              
RSNTELQ  EQU   X'22'                                                            
RSNTLEN  DS    XL1                                                              
RSNTSEQ  DS    XL1                 SEQUENCE NUMBER FOR SORTING                  
RSNTLENQ EQU   *-RSNTELD                                                        
RSNTTXT  DS    0C                  NOTES TEXT (VARIABLE LENGTH)                 
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSCELD   DSECT                     R/W SHEET DEMO CATEGORIES                    
RSCEL    DS    XL1                                                              
RSCELQ   EQU   X'30'                                                            
RSCLEN   DS    XL1                 VARIABLE LENGTH                              
RSCLENQ  EQU   *-RSCELD            = ELEM OVERHEAD                              
RSCDEMO  DS    XL3                 X'00'/DEMO TYPE/DEMO NUMBER                  
*                                                                               
RSCDFBCS DS    C                   USE FOR B'CAST STATIONS                      
RSCDFCBL DS    C                   USE FOR CABLE STATIONS                       
RSCDFDIS DS    C                   DISPLAY CATEGORY ON R/W SHEET                
*                                                                               
RSCLEN2  EQU   *-RSCDEMO           = LENGTH OF EACH ENTRY                       
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSBELD   DSECT                     R/W SHEET HISTORICAL DEMO BOOKS              
RSBEL    DS    XL1                                                              
RSBELQ   EQU   X'32'                                                            
RSBLEN   DS    XL1                 VARIABLE LENGTH                              
RSBLENQ  EQU   *-RSBELD            = ELEM OVERHEAD                              
RSBBOOK  DS    CL12                BOOK                                         
RSBLEN2  EQU   *-RSBBOOK           = LENGTH OF EACH ENTRY                       
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSUELD   DSECT                     R/W SHEET BOOK/PROJ/AVG ELEM                 
RSUEL    DS    XL1                                                              
RSUELQ   EQU   X'34'                                                            
RSULEN   DS    XL1                                                              
RSUSTTDT DS    XP(DT02)L2          FFECTIVE START DATE FOR FORMULA              
RSUENDDT DS    XP(DT02)L2          EFFECTIVE END DATE FOR FORMULA               
RSUTBRD  DS    C                   B'CAST STATIONS                              
RSUTCBL  DS    C                   CABLE STATIONS                               
RSULENQ  EQU   *-RSUELD            =OVERHEAD LEN                                
RSUFORM  DS    0C                  BOOK/PROJ/AVG                                
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSCUELD  DSECT                     R/W SHEET CUME ELEM FOR RADIO                
RSCUEL   DS    XL1                                                              
RSCUELQ  EQU   X'36'                                                            
RSCULEN  DS    XL1                                                              
RSCUTZ   DS    XL1                 TIME ZONE                                    
         DS    XL5                 SPARE                                        
RSCULNQ  EQU   *-RSCUELD           =OVERHEAD LENGTH                             
RSCUME   DS    0C                  CUME BOOK                                    
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSNDELD  DSECT                     R/W SHEET NON-TRAD DEMO SHORT NAMES          
RSNDEL   DS    XL1                                                              
RSNDELQ  EQU   X'38'                                                            
RSNDLEN  DS    XL1                 VARIABLE LENGTH                              
RSNDLENQ EQU   *-RSNDELD           = ELEM OVERHEAD                              
RSNDDEMO DS    CL8                                                              
RSNDLEN2 EQU   *-RSNDDEMO          = LENGTH OF EACH ENTRY                       
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSRELD   DSECT                     COPIED FROM THIS R/W SHEET ELEMENT           
RSREL    DS    XL1                                                              
RSRELQ   EQU   X'40'                                                            
RSRLEN   DS    XL1                                                              
RSRDATE  DS    XP(DT02)L2          DATE OF COPY                                 
RSRPID   DS    XL2                 PID OF COPIER                                
RSRMED   DS    CL1                 MEDIA                                        
RSRCLT   DS    XL2                 CLIENT                                       
RSREST   DS    XL1                 ESTIMATE                                     
RSRMKT   DS    XL2                 MARKET                                       
RSRSEQ   DS    XL3                 R/W SHEET SEQ NUMBER (COMP'D)                
RSRPRD   DS    CL3                 PRODUCT                                      
RSRLENQ  EQU   *-RSRELD                                                         
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSPNELD  DSECT                 R/A NEW DAY/TIME PERIOD OVERRIDE ELEMENT         
RSPNEL   DS    XL1                                                              
RSPNELQ  EQU   X'44'                                                            
RSPNLEN  DS    XL1                                                              
RSPNSTA  DS    CL10                STATION                                      
RSPNDAYS DS    XL1                 DAYS                                         
RSPNSTIM DS    XL2                 START TIME                                   
RSPNETIM DS    XL2                 END TIME                                     
RSPNTYPE DS    C                                                                
RSPNDEM  EQU   C'D'                DEMO                                         
RSPNUPG  EQU   C'U'                UPGRADE                                      
RSPNAVG  EQU   C'A'                AVERAGE                                      
         DS    XL3                 SPARE                                        
RSPNLENQ EQU   *-RSPNELD           LENGTH OF ELEMENT                            
RSPNUFRM DS    0C                  UPGRADE/AVERAGE                              
RSPNDEMO DS    0XL16                                                            
RSPNCAT  DS    XL3       B         X'00'/DEMO TYPE/DEMO NUMBER                  
RSPNSVI  DS    XL1       B         HUT ADJUSTMENT                               
RSPNFP   DS    X                   DEMO FLAGS AND PRECISION                     
RSPNDOV  EQU   X'80'               -DEMO OVERRIDE FLAG                          
RSPNRAW  DS    PL5       B         DEMO VALUE                                   
RSPNSFP  DS    X                   DEMO SHR FLAGS AND PRECISION                 
RSPNSHR  DS    PL5                 DEMO SHARE VALUE                             
RSPNPFP  DS    X                   DEMO PUT FLAGS AND PRECISION                 
RSPNPUT  DS    PL5                 DEMO PUT VALUE                               
RSPNLNQ2 EQU   *-RSPNDEMO          = ENTRY LENGTH                               
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSPHELD  DSECT                     R/A DAY/TIME PERIOD OVERRIDE ELEMENT         
RSPHEL   DS    XL1                                                              
RSPHELQ  EQU   X'45'                                                            
RSPHLEN  DS    XL1                                                              
RSPHSTA  DS    CL10                STATION                                      
RSPHDAYS DS    XL1                 DAYS                                         
RSPHSTIM DS    XL2                 START TIME                                   
RSPHETIM DS    XL2                 END TIME                                     
RSPHTYPE DS    C                                                                
RSPHDEM  EQU   C'D'                DEMO                                         
RSPHUPG  EQU   C'U'                UPGRADE                                      
RSPHAVG  EQU   C'A'                AVERAGE                                      
         DS    XL3                 SPARE                                        
RSPHLENQ EQU   *-RSPHELD           LENGTH OF ELEMENT                            
RSPHUFRM DS    0C                  UPGRADE/AVERAGE                              
RSPHDEMO DS    0XL16                                                            
RSPHCAT  DS    XL3       B         X'00'/DEMO TYPE/DEMO NUMBER                  
RSPHSVI  DS    XL1       B         HUT ADJUSTMENT                               
RSPHDOVR DS    C                   DEMO OVERRIDE                                
RSPHRAW  DS    PL3       B         DEMO VALUE                                   
RSPHSOVR DS    C                   SHARE OVERRIDE                               
RSPHSHR  DS    PL3                 SHARE                                        
RSPHPOVR DS    C                   PUT OVERRIDE                                 
RSPHPUT  DS    PL3                 PUT                                          
RSPHLNQ2 EQU   *-RSPHDEMO          = ENTRY LENGTH                               
*                                                                               
* FOUND IN R/W SHEET RECORD                                                     
RSAELD   DSECT                     R/W SHEET ACTIVITY ELEMENT                   
RSAEL    DS    XL1                                                              
RSAELQ   EQU   X'90'                                                            
RSALEN   DS    XL1                                                              
RSAADD   DS    XP(DT02)L2          DATE ADDED                                   
RSAATIME DS    XL3                 TIME ADDED                                   
RSAAPID  DS    XL2                 PID ADDED                                    
RSACHG   DS    XP(DT02)L2          DATE LAST CHANGED                            
RSACTIME DS    XL3                 TIME CHANGED                                 
RSACPID  DS    XL2                 PID LAST CHANGED                             
RSAXFR   DS    XP(DT02)L2          DATE LAST TRANSFER                           
RSAXTIME DS    XL3                 TIME LAST TRANSFER                           
RSAXPID  DS    XL2                 PID LAST TRANSFER                            
         DS    XL10                SPARE                                        
RSALENQ  EQU   *-RSAELD                                                         
*                                                                               
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
* REVLINE/AVAIL RECORD ELEMENTS :                                     *         
*  11 - R/A LINE BUY DECRIPTION ELEMENT                               *         
*  15 - R/A LINE RATES WITH EFFECTIVE DATES                           *         
*  21 - R/A LINE ESTIMATE DEMOS ELEMENT                               *         
*  25 - R/A LINE UPGRADE/AVERAGE ELEMENT                              *         
*  27 - R/A LINE SPILL DEMOS ELEMENT                                  *         
*  31 - R/A LINE SPOTS ELEMENT                                        *         
*  33 - R/A LINE COMMENTS ELEMENT                                     *         
*  35 - R/A LINE NOTES ELEMENT                                        *         
*  41 - R/A LINE GENERIC ELEMENT                                      *         
*  43 - R/A LINE HIATUS WEEKS ELEMENT                                 *         
*  51 - R/A LINE REASON CODE ELEMENT                                  *         
*  53 - R/A LINE ORBIT ELEMENT                                        *         
*  61 - R/A LINE PACKAGE ELEMENT                                      *         
*  71 - R/A LINE AVAIL DETAIL ELEMENT                                 *         
*  91 - R/A LINE ACTIVITY ELEMENT                                     *         
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLDELD   DSECT                     R/A LINE DESCRIPTION ELEMENT                 
RLDEL    DS    XL1                                                              
RLDELQ   EQU   X'11'               REGULAR R/A LINE                             
RLDLEN   DS    XL1                                                              
         DS    XL3                 SPARE                                        
RLDSTA   DS    CL10                STATION                                      
RLDBYR   DS    CL12                BUYER                                        
RLDBLINE DS    XL2                 BUYLINE NUMBER (BLANK FOR NEW)               
RLDSTDT  DS    XP(DT02)L2          BUYLINE START DATE                           
RLDENDT  DS    XP(DT02)L2          BUYLINE END DATE                             
RLDDAYS  DS    XL1                 DAYS                                         
RLDSTDAY DS    XL1                 START DAY/END DAY                            
RLDSTIME DS    PL3                 START TIME                                   
RLDETIME DS    PL3                 END TIME                                     
RLDSLN   DS    XL1                 SPOT LENGTH                                  
RLDNPW   DS    PL2                 SPOTS PER WEEK                               
RLDDAYPT DS    CL1                 DAYPART                                      
RLDSDYPT DS    CL1                 SUB DAYPART                                  
RLDPROG  DS    CL18                PROGRAM                                      
RLDADJ   DS    CL1                 ADJACENCY CODE                               
RLDCOST  DS    PL6                 COST                                         
RLDREP   DS    CL3                 REP CODE                                     
RLDPRD   DS    CL3                 PRODUCT - MASTER                             
RLDPRD2  DS    CL3                 PIGGY   - MASTER                             
RLDPRDLN DS    PL2   ???????       ACTIVE PRD SPLIT LEN (WHEN PIGGY)            
RLDMGCD  DS    CL2                 MAKEGOOD GROUP CODE                          
RLDBYID  DS    CL12                BUY ID                                       
RLDREASN DS    CL6                 REASON CODE                                  
RLDTAX   DS    PL4                 TAX                                          
RLDPURP  DS    XL6                 PURPOSE CODE                                 
RLDHISQ# DS    XL2                 HIGH SEQUENCE #                              
RLCOST2  DS    PL6                 COST2 VAL., FACTOR                           
*                                   OR RLCOST2+5 = X'FF' FOR NOCOST2            
*                                                                               
RLDCIND  DS    C                   COST INDICATOR - SAME AS BUY                 
RLDFEEQ  EQU   C'F'                - FEE                                        
RLDQRATQ EQU   C'Q'                - Q-RATE                                     
RLDGROSQ EQU   C'G'                - GROSS                                      
RLD1765Q EQU   C'V'                - 17.65 NET                                  
RLD1500Q EQU   C'N'                - 15.00 NET                                  
RLDSPCLQ EQU   C'S'                - SPECIAL - NO COMMISSION                    
RLDXRATQ EQU   C'X'                - X RATE - 10% COMMISSION                    
RLDCOMOQ EQU   C'C'                - C RATE (COMMISSION ONLY)                   
RLDNTPQ  EQU   C'P'                - NTP                                        
RLDNORTP EQU   X'FF'               - NO RATE TYPE                               
*                                                                               
RLDFDALY DS    C                   - LINE IS DAILY LINE                         
RLDFPSCD DS    C                   - PREVENT SCHED OUTSIDE AVL'BLE DATE         
RLDFDELX DS    C                   - DELETE BUYLINE ON TRANSFER                 
RLCOS2TP DS    C                   - WE HAVE A COST2 FACTOR                     
RLLINEID DS    XL2                 LINE ID                                      
RLDDLSPT DS    C                   - DELETE SPOTS ON TRSANSFER                  
RLC2RTYP DS    C                   COS2 HONORS RATE TYPE                        
         DS    XL8                 SPARE                                        
RLDLENQ  EQU   *-RLDELD            LENGTH OF ELEMENT                            
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLMELD   DSECT                     R/A LINE EFFECTIVE RATES ELEMENT             
RLMEL    DS    XL1                                                              
RLMELQ   EQU   X'15'                                                            
RLMLEN   DS    XL1                                                              
         DS    XL2                 SPARE                                        
RLMLENQ  EQU   *-RLMELD            = OVERHEAD LENGTH                            
RLMEFFRT DS    0XL10               ONLY 1 RATE FOR REVLINES                     
*                                  UPTO 14 RATES FOR AVAILS                     
RLMSTTDT DS    XP(DT02)L2          START DATE                                   
RLMENDDT DS    XP(DT02)L2          END DATE                                     
RLMRATE  DS    PL6                 RATE                                         
RLMLENQ2 EQU   *-RLMEFFRT                                                       
*                                                                               
RLAUTAVD DSECT                     AUTOMATED-AVAILS UUID                        
RLAAEL   DS    XL1                                                              
RLAAELQ  EQU   X'19'                                                            
RLAALEN  DS    XL1                                                              
RLAALENQ EQU   *-RLAUTAVD                                                       
RLAAUUID DS    0C                  UUID (VARIABLE LENGTH)                       
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLNEDELD DSECT                     R/A LINE NEW ESTIMATE DEMO ELEMENT           
RLNEDEL  DS    XL1                                                              
RLNEDELQ EQU   X'22'                                                            
RLNEDLEN DS    XL1                                                              
RLNEDBK  DS    XL2                 BOOK FOR BUY DEMOS                           
RLNEDBT  DS    CL1                 BOOK TYPE                                    
RLNEDLNQ EQU   *-RLNEDELD          = OVERHEAD LENGTH                            
RLNEDDEM DS    0XL22               UP TO ?? DEMOS (8 BYTES PER DEMO)            
RLNEDCAT DS    XL3       B         X'00'/DEMO TYPE/DEMO NUMBER                  
RLNEDSVI DS    CL1       B         HUT ADJUSTMENT                               
RLNEDFP  DS    X                   DEMO FLAGS AND PRECISION                     
RLNEDOV  EQU   X'80'               - DEMO OVERRIDE FLAG                         
RLNEDRAW DS    PL5       B         DEMO VALUE                                   
RLNEDSFP DS    X                   DEMO SHR FLAGS AND PRECISION                 
RLNEDSHR DS    PL5       B         DEMO SHR VALUE                               
RLNEDPFP DS    X                   DEMO PUT FLAGS AND PRECISION                 
RLNEDPUT DS    PL5       B         DEMO PUT VALUE                               
RLNEDLN2Q EQU  *-RLNEDDEM          = ENTRY LENGTH                               
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLEDELD  DSECT                     R/A LINE ESTIMATE DEMO ELEMENT               
RLEDEL   DS    XL1                                                              
RLEDELQ  EQU   X'23'                                                            
RLEDLEN  DS    XL1                                                              
RLEDBOOK DS    XL2                 BOOK FOR BUY DEMOS                           
RLEDBTYP DS    CL1                 BOOK TYPE                                    
RLEDLENQ EQU   *-RLEDELD           = OVERHEAD LENGTH                            
RLEDDEMO DS    0XL16               UP TO 20 DEMOS (16 BYTES PER DEMO)           
RLEDCAT  DS    XL3       B         X'00'/DEMO TYPE/DEMO NUMBER                  
RLEDSVI  DS    CL1       B         HUT ADJUSTMENT                               
RLEDOVR  DS    C                   DEMO OVERRIDE                                
RLEDRAW  DS    PL3       B         DEMO VALUE                                   
RLEDSOVR DS    C                   DEMO SHR OVERRIDE                            
RLEDSHR  DS    PL3       B         DEMO SHR VALUE                               
RLEDPOVR DS    C                   DEMO PUT OVERRIDE                            
RLEDPUT  DS    PL3       B         DEMO PUT VALUE                               
RLEDLN2Q EQU   *-RLEDDEMO          = ENTRY LENGTH                               
*                                                                               
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLNDELD  DSECT                     R/A LINE NON-TRAD DEMO SHORT NAMES           
RLNDEL   DS    XL1                                                              
RLNDELQ  EQU   X'24'                                                            
RLNDLEN  DS    XL1                 VARIABLE LENGTH                              
RLNDLENQ EQU   *-RLNDELD           = ELEM OVERHEAD                              
RLNDDEMO DS    CL8                                                              
RLNDDFLG DS    X                                                                
RLNDFDLK EQU   X'80'                - CATEGORY DOES NOT NEED DEMO LKUP          
RLNDFSDL EQU   X'40'                - CATEGORY DOES NOT NEED SPILL LKUP         
RLNDLEN2 EQU   *-RLNDDEMO          = LENGTH OF EACH ENTRY                       
*                                                                               
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLUELD   DSECT                     R/A LINE UPGRADE/AVERAGE ELEM                
RLUEL    DS    XL1                                                              
RLUELQ   EQU   X'25'                                                            
RLULEN   DS    XL1                                                              
RLUSTTDT DS    XP(DT02)L2          FFECTIVE START DATE                          
RLUENDDT DS    XP(DT02)L2          FFECTIVE END DATE                            
         DS    XL2                 SPARE                                        
RLULENQ  EQU   *-RLUELD            =OVERHEAD LEN                                
RLUFORM  DS    0C                  UPGRADE/AVERAGE TEXT                         
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLNLDELD DSECT                     R/A LINE NEW SPILL DEMO ELEMENT              
RLNLDEL  DS    XL1                                                              
RLNLDELQ EQU   X'26'                                                            
RLNLDLEN DS    XL1                                                              
RLNLDMKT DS    XL2                 SPILL MARKET                                 
         DS    XL4                                                              
RLNLDLNQ EQU   *-RLNLDELD           = OVERHEAD LENGTH                           
RLNLDDEM DS    0XL8                UP TO ?? DEMOS (8 BYTES PER DEMO)            
RLNLDCAT DS    XL3       B         X'00'/DEMO TYPE/DEMO NUMBER                  
RLNLDSVI DS    CL1       B         HUT ADJUSTMENT                               
RLNLDFP  DS    X                   DEMO FLAGS AND PRECISION                     
RLNLDOV  EQU   X'80'               - DEMO OVERRIDE FLAG                         
RLNLDRAW DS    PL5       P         DEMO VALUE                                   
RLNLDLN2Q EQU  *-RLNLDDEM           = ENTRY LENGTH                              
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLLDELD  DSECT                     R/A LINE SPILL DEMO ELEMENT                  
RLLDEL   DS    XL1                                                              
RLLDELQ  EQU   X'27'                                                            
RLLDLEN  DS    XL1                                                              
RLLDMKT  DS    XL2                 SPILL MARKET                                 
         DS    XL4                                                              
RLLDLENQ EQU   *-RLLDELD           = OVERHEAD LENGTH                            
RLLDDEMO DS    0XL8                UP TO ?? DEMOS (8 BYTES PER DEMO)            
RLLDCAT  DS    XL3       B         X'00'/DEMO TYPE/DEMO NUMBER                  
RLLDSVI  DS    CL1       B         HUT ADJUSTMENT                               
RLLDOVR  DS    C                   DEMO OVERRIDE                                
RLLDRAW  DS    PL3       P         DEMO VALUE                                   
RLLDLN2Q EQU   *-RLLDDEMO          = ENTRY LENGTH                               
*                                                                               
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLSELD   DSECT                     R/A LINE SPOTS ELEM                          
RLSEL    DS    XL1                                                              
RLSELQ   EQU   X'31'                                                            
RLSLEN   DS    XL1                                                              
RLSDATE  DS    XP(DT02)L2          DATE                                         
RLSREF#  DS    XL2                 UNIQUE SEQ #                                 
RLSNOWK  DS    PL2                 NUMBER OF SPOTS                              
RLSPRD   DS    CL3                 PRODUCT                                      
RLSPRD2  DS    CL3                 PIGGYBACK                                    
RLSPRDLN DS    PL2                 ACTIVE PRD SPLIT LEN (WHEN PIGGY)            
RLSCOST  DS    PL6                 COST OVERRIDE                                
RLSXSCHD DS    CL1                 "X" - DO NOT SCHEDULE FLAG                   
         DS    XL3                                                              
RLSLENQ  EQU   *-RLSELD                                                         
*                                                                               
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLCMELD  DSECT                     R/A LINE COMMENT ELEMENT                     
RLCMEL   DS    XL1                                                              
RLCMELQ  EQU   X'33'                                                            
RLCMLEN  DS    XL1                                                              
RLCMNUM  DS    XL1                 COMMENT LINE NUMBER                          
RLCMLENQ EQU   *-RLCMELD                                                        
RLCMTXT  DS    0C                  COMMENT TEXT (VARIABLE LENGTH)               
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLNTELD  DSECT                     R/A LINE NOTES ELEMENT                       
RLNTEL   DS    XL1                                                              
RLNTELQ  EQU   X'35'                                                            
RLNTLEN  DS    XL1                                                              
         DS    XL4                 SPARE                                        
RLNTLENQ EQU   *-RLNTELD                                                        
RLNTTXT  DS    0C                  NOTES TEXT (VARIABLE LENGTH)                 
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLGELD   DSECT                     R/A LINE GENERIC DATA ELEM                   
RLGEL    DS    XL1                                                              
RLGELQ   EQU   X'41'                                                            
RLGLEN   DS    XL1                                                              
RLGMAP   DS    XL2                 MAP CODE                                     
RLGLENQ  EQU   *-RLGELD            =OVERHEAD LEN                                
RLGDATA  DS    0C                  DATA                                         
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLHELD   DSECT                     R/A LINE HIATUS WEEKS ELEMENT                
RLHEL    DS    XL1                 ONE FOR EACH STATION                         
RLHELQ   EQU   X'43'                                                            
RLHLEN   DS    XL1                 VARIABLE                                     
RLHLEN1  EQU   *-RLHELD            = OVERHEAD LEN                               
RLHIAST  DS    XP(DT02)L2          HIATUS START                                 
RLHIAEND DS    XP(DT02)L2          HIATUS END                                   
RLHLEN2  EQU   *-RLHIAST           = ENTRY LENGTH                               
*                                                                               
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLRELD   DSECT       ??????????    REASON CODE ELEMENT                          
RLREL    DS    XL1                                                              
RLRELQ   EQU   X'51'                                                            
RLRLEN   DS    XL1                                                              
RLREASN  DS    CL6                 REASON CODE                                  
RLROFF   DS    CL1                 OFFICE                                       
RLRLENQ  EQU   *-RLRELD                                                         
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLNOELD  DSECT                     R/A NEW ORBIT ELEMENT                        
RLNOEL   DS    XL1                                                              
RLNOELQ  EQU   X'52'                                                            
RLNOLEN  DS    XL1                                                              
RLNODEL  DS    CL1                 Y/N - DELETE ORBITS ON TRANSFER              
RLNOLENQ EQU   *-RLNOELD           = OVERHEAD LENGTH                            
RLNODAY  DS    CL1                 DAY                                          
RLNOSTIM DS    PL3                 START TIME                                   
RLNOETIM DS    PL3                 END TIME                                     
RLNODESC DS    CL7                 DESCRIPTION/PROGRAM                          
RLNOFP   DS    X                   DEMO FLAGS AND PRECISION                     
RLNOOVR  EQU   X'80'               - DEMO OVERRIDE FLAG                         
RLNODEM  DS    PL5                 DEMO - ALWAYS ESTIMATED                      
RLNOLN2Q EQU   *-RLNODAY           = ENTRY LENGTH                               
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLOELD   DSECT                     R/A ORBIT ELEMENT                            
RLOEL    DS    XL1                                                              
RLOELQ   EQU   X'53'                                                            
RLOLEN   DS    XL1                                                              
RLODEL   DS    CL1                 Y/N - DELETE ORBITS ON TRANSFER              
RLOLENQ  EQU   *-RLOELD            = OVERHEAD LENGTH                            
RLODAY   DS    CL1                 DAY                                          
RLOSTIM  DS    PL3                 START TIME                                   
RLOETIM  DS    PL3                 END TIME                                     
RLODESC  DS    CL7                 DESCRIPTION/PROGRAM                          
RLODEM   DS    PL3                 DEMO - ALWAYS ESTIMATED                      
RLOLN2Q  EQU   *-RLODAY            = ENTRY LENGTH                               
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLPELD   DSECT                     PACKAGE ELEMENT                              
RLPEL    DS    XL1                                                              
RLPELQ   EQU   X'61'                                                            
RLPLEN   DS    XL1                                                              
RLPIND   DS    CL1                 INDICATOR                                    
RLPMASTQ EQU   1                   PACKAGE PARENT                               
RLPSLAVQ EQU   2                   PACKAGE CHILD                                
RLPREVMQ EQU   5                   REVISION PARENT                              
RLPREVSQ EQU   6                   REVISION CHILD                               
RLPMMSTQ EQU   7                   MAKEGOOD PARENT                              
RLPMSLVQ EQU   8                   MAKEGOOD CHILD                               
RLPREMOV EQU   255                 PACKAGE REMOVAL                              
RLPLENQ  EQU   *-RLPELD            = OVERHEAD LENGTH                            
RLPLINES DS    CL1                 LINE NUMBERS                                 
RLPLN2Q  EQU   *-RLPLINES          = OVERHEAD LENGTH                            
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLAELD   DSECT                     ACTIVITY ELEMENT                             
RLAEL    DS    XL1                                                              
RLAELQ   EQU   X'91'                                                            
RLALEN   DS    XL1                                                              
RLAADD   DS    XP(DT02)L2          DATE ADDED                                   
RLAATIME DS    XL3                 TIME ADD                                     
RLAAPID  DS    XL2                 PID ADDED                                    
RLACHG   DS    XP(DT02)L2          DATE LAST CHANGED                            
RLACTIME DS    XL3                 TIME LAST CHANGE                             
RLACPID  DS    XL2                 PID LAST CHANGED                             
RLAXFR   DS    XP(DT02)L2          DATE LAST TRANSFER                           
RLAXTIM  DS    XL3                 TIME LAST TRANSFER                           
RLAXPID  DS    XL2                 PID LAST TRANSFER                            
RLALENQ  EQU   *-RLAELD                                                         
*                                                                               
* FOUND IN R/A LINE RECORD                                                      
RLXELD   DSECT                     TRASNFER ELEMENT                             
RLXEL    DS    XL1                                                              
RLXELQ   EQU   X'92'                                                            
RLXLEN   DS    XL1                                                              
RLXBUYLN DS    XL2                 BUYLINE # TRANSFERRED                        
RLXFLTST DS    XL3                 BUYLINE START DATE                           
RLXFLTEN DS    XL3                 BUYLINE END DATE                             
RLXDAYS  DS    XL1                 DAYS/ROTATION                                
RLXRATE  DS    XL4                 RATE                                         
RLXACT   DS    C                   BUYLINE ACTION (A,C,D)                       
RLXENQ   EQU   *-RLXELD                                                         
