*          DATA SET SPGENBUY   AT LEVEL 173 AS OF 06/18/20                      
*              BUY RECORD                                                       
         SPACE 2                                                                
BUYREC   DS    0C                                                               
BUYKEY   DS    0CL13     V         KEY                                          
BUYKAM   DS    CL1       A/M       AGENCY/MEDIA                                 
BUYKCLT  DS    CL2       CLT       CLIENT                                       
BUYKPRD  DS    CL1       B         PRODUCT CODE                                 
BUYKMSTA DS    CL5       M/S       MARKET/STATION                               
         ORG   BUYKMSTA                                                         
BUYMSTA  DS    0CL5                <THIS IS THE OLD NON-K NAME>                 
BUYKMKTN DS    XL2                 MARKET NUMBER                                
BUYKMKT  EQU   BUYKMKTN,2                                                       
BUYKSTAC DS    XL3                 STATION CODE                                 
BUYKSTA  EQU   BUYKSTAC,3                                                       
BUYKEST  DS    CL1       B         ESTIMATE NUMBER                              
BUYKBUY  DS    CL3       BUY       BUY DETAILS                                  
         ORG   BUYKBUY+1                                                        
BUYKLIN  DS    XL2                 BUYLINE NUMBER (DIRECTORY POINTER)           
         ORG   BUYKBUY                                                          
BUYRLIN  DS    XL2                 BUYLINE NUMBER (RECORD)                      
         DS    X                                                                
*                                                                               
BUYKCNTL DS    XL1                 CONTROL BYTE                                 
BUYKDA   DS    XL4                 RECORD DISK ADDRESS                          
         ORG   BUYKCNTL                                                         
         SPACE 2                                                                
BUYRLEN  DS    CL2       B         RECORD LENGTH (MAX 2000 BYTES)               
BUYRCNTL DS    CL1       B         CONTROL BYTE                                 
BUYRDEL  EQU   X'80'               BUY IS DELETED                               
BUYRCLS  EQU   X'40'               BUY IS CLOSED OUT                            
BUYRNPRG EQU   X'20'               DO NOT PURGE RECORD IF DELETED               
BUYRLN2  EQU   X'10'               2-BYTE LINE NUMBER!                          
BUYRLINK DS    CL4       B         LINK FIELD                                   
BUYALPHA DS    CL2       A         ALPHA AGENCY CODE                            
         DS    CL2       B         SPARE                                        
*                                                                               
*              BUY RECORD ELEMENT CODES                                         
         SPACE 1                                                                
*        X'01' BUY DESCRIPTION ELEMENT                                          
*        X'02' DEMOGRAPHIC ORIGINAL ELEMENT                                     
*        X'03' DEMOGRAPHIC SPILL ELEMENT                                        
*        X'04' PIGGY BACK ELEMENT                                               
*        X'05' PACKAGE ELEMENT                                                  
*        X'06' ORIGINAL BUY ELEMENT                                             
*        X'07' OTO ELEMENT                                                      
*        X'08' FLIP ELEMENT                                                     
*        X'0B' POOL ORIGINAL ELEMENT                                            
*        X'0C' POOL OTO ELEMENT                                                 
*        X'0D' POOL FLIP ELEMENT                                                
*        X'10' AFFIDAVIT ELEMENT                                                
*        X'12' FILM ELEMENT                                                     
*        X'13' SPOT EXTENSION ELEMENT                                           
*        X'18' DEALER TAG CML AND TAG ASSIGN ELEMENT                            
*        X'19' MISSED EXCEPTION ELEMENT                                         
*        X'22' POST BUY DEMOGRAPHIC ORIGINAL ELEMENT                            
*        X'23' POST BUY DEMOGRAPHIC SPILL ELEMENT                               
*        X'24' DEMO LOOK-UP OVERRIDE DATA (BOOKTYPE)                            
*        X'50' NON-TRADIONAL DEMO NAMES SHORT FORM                              
*        X'60' NET RATE ELEMENT                                                 
*        X'61' MASTER CLIENT ELEMENT                                            
*        X'62' UPGRADE DESCRIPTION ELEMENT                                      
*        X'63' RADIO DEMO DESCRIPTION ELEMENT                                   
*        X'65' MAKEGOOD REASON CODE ELEMENT                                     
*        X'66' COMMENT ELEMENT                                                  
*        X'67' ORBIT DESC ELEMENT                                               
*        X'68' CANAD NTWK STATION ELEMENT                                       
*        X'69' CANAD NTWK TAX ELEMENT                                           
*        X'6A' CANAD VAT ELEMENT                                                
*        X'6B' CANAD PST ELEMENT                                                
*        X'70' ID ELEMENT                                                       
*        X'71' COST ELEMENT (PENNIES)                                           
*        X'72' INFOMERCIAL ELEMENT                                              
*        X'73' COST ELEMENT (FACTOR)                                            
*        X'76' SPECIAL REP COMMENT ELEMENT (SEE X'66')                          
*        X'7A' AUTOMATED-AVAIL UUID                                             
*        X'7F' *** DO NOT USE ***  SEE SPREPK102                                
*        X'90' REASON CODE ELEMENT                                              
*        X'91' DATE/TIME OF BUY COPY (SBY)                                      
*        X'92' COPY FROM CLT/PRD/EST/LIN/DATE(2)/PID                            
*        X'93' COPY 'TO' CLT/PRD/EST/LIN/DATE(2)/PID                            
*        X'94' MC/GM MOVE ELEM (BUYS MOVED TO NEW CLT/PRD/EST)                  
*        X'95' UPLOAD ELEMENT                                                   
*        X'96' CANADIAN EXCHANGE RATE ELEMENT                                   
*        X'97' BWS TRANSFER ELEMENT                                             
*        X'98' AMFM TRACE ELEMENT                                               
*        X'99' ACTIVITY ELEMENT                                                 
*        X'9A' CLONED RECORD ELEMENT                                            
*        X'9B' DESKTOP TRANSFER ELEMENT (WAS PW MKT ELEM)                       
*        X'9C' MKTFIX ELEMENT                                                   
*        X'9D' STATION CALL LETTER CHANGE ELEMENT                               
*        X'9E' DARE MAKEGOOD TRACE ELEMENT                                      
*        X'9F' SAME AS 9D FOR ONE-TIME CANADIAN CABLE CONVERSION                
*        X'A0' UPLOAD ACTIVITY ELEMENT                                          
*        X'D4' MAKEGOOD CONVERSION ELEMENT                                      
         SPACE 2                                                                
*              BUY DESCRIPTION ELEMENT                                          
         SPACE 2                                                                
BDELEM   DS    0C        V         BUY DESCRIPTION ELEMENT                      
BDCODE   DS    CL1       B         ELEMENT CODE (X'01')                         
BDCODEQ  EQU   X'01'                                                            
BDLEN    DS    CL1       B         ELEMENT LENGTH                               
BDSTART  DS    CL3       B         BUY START DATE (YMD)                         
BDEND    DS    CL3       B         BUY END DATE (YMD)                           
BDWKS    DS    CL1       B         NUMBER OF WEEKS                              
BDINPUT  DS    CL1       B         METHOD 1=WEEKS 2=END DATE 3=E                
BDWKIND  DS    CL1       B         O=1/WK A=1/2WK T=1/3WK F=1/4WK               
BDDAY    DS    CL1       B         BIT 0=SPARE 1=MON 2=TUE ... 7=SUN            
BDNOWK   DS    CL1       B         NUMBER OF SPOTS PER WEEK                     
BDSEC    DS    CL1       B         SPOT LENGTH IN SECONDS                       
BDTIME   DS    CL1       B         TIME PORTION FOR ACTIVE P/B PARTNER          
BDCOSTP  DS    CL1       B         COST PORTION FOR ACTIVE P/B PARTNER          
BDDAYPT  DS    CL1       A         DAYPART CODE (VARIES BY AGENCY)              
BDPROG   DS    0CL22     V         PROGRAM AREA                                 
BDTIMST  DS    CL2       B         MILITARY START TIME (0-2400)                 
BDTIMEND DS    CL2       B         MILITARY END TIME (0-2400)                   
BDPROGRM DS    CL18      A         DESC (LAST=X'00' FOR SPECIALS -S)            
BDPROGT  DS    CL1       B         PROGRAM ADJACENCY CODE                       
BDCOST   DS    CL3       B         SPOT COST                                    
BDCIND   DS    CL1       B         COST INDICATORS                              
BDCFEEQ  EQU   X'80'               FEE                                          
BDCQRATQ EQU   X'40'               Q-RATE                                       
BDCGROSQ EQU   X'20'               GROSS                                        
BDC1765Q EQU   X'10'               17.65 NET                                    
BDC1500Q EQU   X'08'               15.00 NET                                    
BDCSPCLQ EQU   X'04'               SPECIAL - NO COMMISSION                      
BDCXRATQ EQU   X'02'               X RATE - 10% COMMISSION                      
BDCMINSQ EQU   X'01'               X'01'=MINUS SPOT                             
BDCNTPQ  EQU   X'00'               X'00'=NTP                                    
*                                                                               
BDCF     EQU   C'F'                                                             
BDCQ     EQU   C'Q'                                                             
BDCGRS   EQU   C' '                                                             
BDCV     EQU   C'V'                                                             
BDCN     EQU   C'N'                                                             
BDCS     EQU   C'S'                                                             
BDCX     EQU   C'X'                                                             
BDCC     EQU   C'C'                                                             
BDCNTP   EQU   C'P'                                                             
*                                                                               
BDXFRAGY DS    CL1                 NON-ZERO = INTERFILE AGY NUM (COKE)          
BDNTAX   DS    CL2                 TAX RATE (TO 3 DECIMALS)                     
BDWHY3   DS    CL1                                                              
BDWSKEDQ EQU   X'80'               SKED CHANGE                                  
BDWMOVEQ EQU   X'40'               MOVE                                         
BDWOTOMQ EQU   X'20'               OTO'S MINUSED BY $MAT                        
BDWCCWMQ EQU   X'10'               CREATED BY CSO WEEK MOVE                     
*                                                                               
BDREP    DS    CL2       B         SPECIAL REP CODE                             
BDCHG    DS    CL3       B         LAST CHANGE DATE (YMD)                       
BDWHY    DS    CL1       B         REASON FOR LAST CHANGE                       
BDWNEWBQ EQU   X'80'               NEW BUY                                      
BDWDESCQ EQU   X'40'               BUY DESCRIPTION CHANGE                       
BDWPBALQ EQU   X'20'               POOL BRAND ALLOCATION                        
BDWOTOQ  EQU   X'10'               OTO                                          
BDWCMNTQ EQU   X'08'               COMMENT CHANGE                               
BDWREPBQ EQU   X'04'               REPEAT NEW BUY                               
BDWDEMOQ EQU   X'02'               DEMO LOOK-UP/CHANGE                          
BDWPACKQ EQU   X'01'               PACKAGE CHANGE                               
         EJECT                                                                  
BDPURP   DS    CL1       A         PURPOSE CODE                                 
BDELLEN  DS    0CL1      B         *** WILL BE DELETED ***                      
BDSEDAY  DS    XL1       B         START/END DAY NUMBERS                        
BDCANAD  DS    XL1                                                              
BDCANAD_GENPTRS EQU  X'80'         GENERATE COMBINED POINTERS                   
BDCIND2  DS    XL1       B         INDICATOR BYTE 2                             
BDCCOMOQ EQU   X'80'               C RATE (COMMISSION ONLY)                     
BDCEXCHQ EQU   X'40'               EXCHANGE RATE USED                           
BDCCANAQ EQU   X'20'               CANADIAN AGENCY BUY                          
BDCNBRDQ EQU   X'10'               BUY IN DOLLARS                               
BDCRNEGQ EQU   X'08'               BUY RATE IS MINUS                            
BDC2NEG  EQU   X'08'                                                            
BDCCONVQ EQU   X'04'               CONVERTED BDCIND FLAG                        
BDCTRADQ EQU   X'02'               TRADE BUY (TBS)                              
BDCRATPQ EQU   X'01'               RATE IN PENNIES (NETWORK)                    
*                                                                               
BDWHY2   DS    CL1                 REASON FOR LAST CHANGE CONT'D                
BDWAFIDQ EQU   X'80'               AFFIDAVIT INPUT                              
BDWDAYPQ EQU   X'40'               DAYPART CHANGE                               
BDWDEMCQ EQU   X'08'               DEMO CHANGE                                  
BDWHUTCQ EQU   X'04'               HUT CHANGE                                   
BDWOBITQ EQU   X'02'               ORBIT CHANGE                                 
BDWFILMQ EQU   X'01'               FILM NUMBER                                  
*                                                                               
BDSTAT   DS    CL1                 STATUS                                       
BDSPRECQ EQU   X'80'               POL NPW DATA IN REC                          
BDSVNPWQ EQU   X'40'               VARIABLE NPW DATA IN REC                     
BDSNETLQ EQU   X'20'               NETWORK LEVEL BUY                            
BDSBBUTQ EQU   X'10'               CREATED BY BUY TRANSFER                      
BDSCSOTQ EQU   X'08'               CREATED BY CSO TRANSFER                      
BDSBWSTQ EQU   X'04'               CREATED BY BWS TRANSFER                      
BDSKEEPQ EQU   X'02'               IF ON, DO NOT PURGE RECORD                   
*                                     EVEN IF BDXFRAGY NOT 0                    
BDSNETBQ EQU   X'01'               NETPAK BUY FLAG - WATCH OUT                  
*                                                                               
BDMGDATE DS    CL2       B         MAKEGOOD GROUP CODE (WAS DATE)               
BDSTAT3  DS    XL1                 *** WAS BDSPILL ***                          
BDST3_SPODS  EQU  X'80'            SPODS IN THIS RECORD                         
BDST3_CNNEW  EQU  X'40'            NEW CAN NET BUY ($ OVRDS ALLOWED)            
BDST3_DSKADD EQU  X'08'            ADDED BY NEW DESKTOP                         
BDST3_DSKCHG EQU  X'04'            CHANGED BY NEW DESKTOP                       
BDST3_COS2RT EQU  X'02'            COS2 TO HONOR RATE TYPE                      
*                                                                               
BDNRGN   DS    CL1                 NETWORK REGION CODE (CANAD)                  
BDMGSPOT DS    CL1       B         =====>> NOT USED                             
BDADVAGY DS    CL1       B         ADVERTISER AGENCY CODE                       
BDMASPRD DS    CL2       B         POOL MASTER PRODUCT CODES                    
*                                                                               
BDSTAT2  DS    CL1       B         STATUS BYTE 2                                
BDSDSKDQ EQU   X'80'               DAILY SKED IN RECORD                         
BDSCNEXQ EQU   X'40'               CAN NTWK EXCEPTIONS OFF                      
BDSTRADQ EQU   X'20'               TRADE AGENCY BUY (NOT CTA)                   
BDSDIYTQ EQU   X'10'               DIY TRADE (NET NOT ZERO)                     
BDSNTDMS EQU   X'08'               WE HAVE NON-TRADITIONAL DEMO CATEGS          
BDSSARBQ EQU   X'04'               SPECIAL ARB BUY/POST FLAG                    
BDSCSTRQ EQU   X'02'               CONFIRMED START DATE                         
BDSCENDQ EQU   X'01'               CONFIRMED END DATE                           
BDCFD    EQU   BDSTAT2                                                          
*                                                                               
BDSTAT4  DS    XL1                                                              
*                                                                               
BDELEMX  EQU   *                                                                
                                                                                
*              DEMOGRAPHIC ELEMENT                                              
                                                                                
NDELEM   DS    0C        V         ELEMENT CODE                                 
NDCODE   DS    CL1       B         X'02'=ORIGINAL X'03'=SPILL                   
NDCORGQ  EQU   X'02'               ORIGINAL                                     
NDCSPLQ  EQU   X'03'               SPILL                                        
NDLEN    DS    CL1       B         ELEMENT LENGTH (24 + 8*N'DEMOS)              
NDBOOK   DS    CL2       B         RATING BOOK YEAR/MONTH                       
NDPROG   DS    CL16      A         PROGRAMMING                                  
*                                                                               
         ORG   NDPROG              REDEFINITION FOR SPILL                       
NDAGYMKT DS    XL2       B         AGENCY MARKET NUMBER                         
NDRSMKT  DS    XL2       B   ***** FOR BACKWARD COMPATIBILITY                   
NDBKTYPE DS    CL1       C         BOOKTYPE OVERRIDE                            
NDRTGSVC DS    CL1       C         RATING SERVICE (NSI=C'0'/BBM=C'1')           
NDSTA    DS    CL4       C         CALL LETTERS FOR LOOKUP                      
NDFLGS   DS    XL1                 X'80'=SUPPRESS IMPRESSIONS                   
         DS    CL2                 SPARE                                        
NDMKTALF DS    CL3                 ALPHA MARKET                                 
*                                                                               
NDACTL   DS    CL2       B         ACTUAL 1ST DEMO (1 DECIMAL)                  
NDHUT    DS    CL1       B         HUT MONTH(S) IN EACH NIBBLE                  
NDERR    DS    CL1       B         ERROR CODES DURING LOOK UP                   
         SPACE 1                                                                
NDEMNO   DS    XL3       B         X'00'/DEMO TYPE/DEMO NUMBER                  
NDSVI    DS    CL1       B         HUT ADJUSTMENT                               
NDEMRAW  DS    CL4       B         DEMO VALUE                                   
NDEMMANQ EQU   X'80'               IN HOB, MANUAL OVERRIDE                      
NDEM2DEC EQU   X'40'               RATING IS IN 2-DECIMAL PRECISION             
NDEMLNQ  EQU   *-NDEMNO                                                         
         EJECT                                                                  
*              PIGGYBACK ELEMENT                                                
                                                                                
PBELEM   DS    0C        V         PIGGYBACK -                                  
PBCODE   DS    CL1       B         ELEMENT CODE (X'04')                         
PBCODEQ  EQU   X'04'                                                            
PBLEN    DS    CL1       B         ELEMENT LENGTH (2 + 7*N'PARTNERS)            
PBPROD   DS    CL1       B         PASSIVE PRODUCT CODE                         
PBEST    DS    CL1       B         PASSIVE ESTIMATE NUMBER                      
PBTIME   DS    CL1       B         TIME SHARE (SECONDS)                         
PBCOST   DS    CL1       B         COST SHARE (SECONDS)                         
PBPRD    DS    CL3       A         PRODUCT MNEMONIC                             
         SPACE 2                                                                
*              PACKAGE ELEMENT                                                  
                                                                                
PKGELEM  DS    0C        V         PACKAGE -                                    
PKGCODE  DS    CL1       B         ELEMENT CODE (X'05')                         
PKGCODEQ EQU   X'05'                                                            
PKGLEN   DS    CL1       B         ELEMENT LENGTH                               
*                                                                               
PKGIND   DS    CL1       B         PACKAGE TYPE                                 
* X'10' MEANS 2 BYTE LINE NUMBERS IN ELEMENT                                    
PKGMASTQ EQU   1  OR X'11'         PACKAGE MASTER                               
PKGSLAVQ EQU   2  OR X'12'         PACKAGE SLAVE                                
PKGREVMQ EQU   5  OR X'15'         REVISION MASTER                              
PKGREVSQ EQU   6  OR X'16'         REVISION SLAVE                               
*                                                                               
PKGLINES DS    CL1 OR CL2          SLAVES HAVE MASTER LINE NUMBER HERE          
*                                  MASTERS HAVE VARIABLE NO. OF SLAVES          
                                                                                
*              ORIGINAL AND OTO ELEMENTS                                        
                                                                                
REGELEM  DS    0C        V         REGULAR BUY ELEMENT                          
RCODE    DS    CL1       B         ELEMENT CODE                                 
RCORGQ   EQU   X'06'               ORIGINAL                                     
RCOTOQ   EQU   X'07'               OTO                                          
RCPOLOQ  EQU   X'0B'               POOL ORIGINAL                                
RCPOTOQ  EQU   X'0C'               POOL OTO                                     
RLEN     DS    CL1         B       ELEMENT LENGTH                               
RDATE    DS    XP(DT02)L2  B       COMPRESSED BUY DATE                          
RPAY     DS    XP(DT02)L2  B       COMPRESSED PAY DATE                          
RSTATUS  DS    CL1         B       STATUS                                       
RSMINUSQ EQU   X'80'               MINUS SPOT                                   
RSMINSDQ EQU   X'40'               SPOT HAS BEEN MINUSED                        
RSRATOVQ EQU   X'20'               RATE OVERRIDE FOR POOL                       
RSMKGDPQ EQU   X'10'               MAKEGOOD PENDING                             
RSB1PALQ EQU   X'08'               BRAND 1 PAYS ALL (PIGGYBACKS)                
RSHIATSQ EQU   X'04'               HIATUS                                       
RSMGONLQ EQU   X'02'               MAKEGOOD ON NEW LINE                         
RSNOALLQ EQU   X'01'               K4 NOT TO CHANGE ALLOCATION                  
         SPACE 1                                                                
*              THESE FIELDS APPLY TO NON-POOL SPOTS                             
         SPACE 1                                                                
RNUM     DS    CL1       B         NUMBER OF SPOTS                              
RBILL    DS    0CL2      B         *** NOT USED ***                             
RPAYSEQ  DS    XL1       B         CLEARANCE SEQUENCE NUMBER                    
         DS    XL1                 SPARE                                        
RLREGLNQ EQU   *-REGELEM                                                        
         SPACE 1                                                                
*              THESE FIELDS APPLY TO POOL SPOTS                                 
         SPACE 1                                                                
         ORG   RNUM                                                             
RPCOST   DS    CL3       B         COST OVERRIDE IF RSTATUS=X'20'               
RPALLOC  DS    0CL4      B         FOR EACH ALLOCATED PRODUCT -                 
RPPRD    DS    CL1       B         PRODUCT CODE                                 
RPTIME   DS    CL1       B         TIME SHARE IN SECONDS                        
RPPAYSEQ DS    CL1                 CLEARANCE SEQUENCE NUMBER                    
RPSTAT2  DS    XL1                 X'80'= TRADE SPOT (TBS)                      
*                                  X'00-7F'= MAKEGOOD SEQ NUM                   
*                                  X'00-7F'= MAKEGOOD SEQ NUM                   
RLPOL1LQ EQU   *-REGELEM                                                        
*                                                                               
RPALLOC2 DS    XL(L'RPALLOC)       PIGGYBACK VALUES                             
RLPOL2LQ EQU   *-REGELEM                                                        
         SPACE 2                                                                
*              AFFIDAVIT ELEMENT                                                
         SPACE 1                                                                
AFFELEM  DS    0C          B       AFFIDAVIT DETAILS -                          
ACODE    DS    CL1         B       ELEMENT CODE (X'10')                         
ACCODEQ  EQU   X'10'                                                            
ALEN     DS    CL1         B       ELEMENT LENGTH (X'06')                       
ADATE    DS    XP(DT02)L2  B       AFFIDAVIT DATE                               
ATIME    DS    CL2         B       BITS 0-3=STATUS 4-15=MILITARY TIME           
*                                  STATUS = FILM TYPE OR X'40'=RSP DTA          
         SPACE 2                                                                
*              FILM NUMBER ELEM   (SEEDED BY I2 OR BUY)                         
         SPACE 1                                                                
FLMELEM  DS    0C                                                               
FLMCODE  DS    CL1       B         ELEMENT CODE (X'12')                         
FLMCODEQ EQU   X'12'                                                            
FLMLEN   DS    CL1       V         ELEMENT LEN (3 + 2 PER BRAND)                
FLMDAY   DS    CL1       B         X'40'=MON, X'01'=SUNDAY                      
FLMNUM   DS    CL2       B         VARIABLE NUMBER OF 2 BYTE FILMS              
         SPACE 1                                                                
*              SPOT EXTENSION ELEMENT                                           
         SPACE 1                                                                
SXTELEM  DS    0C                                                               
SXTCODE  DS    XL1       B         ELEMENT CODE (X'13')                         
SXTCODEQ EQU   X'13'                                                            
SXTLEN   DS    XL1       V         ELEMENT LEN (3)                              
SXTFLAG  DS    XL1       B                                                      
SXTFLAG_C1ONLY EQU X'80'           COST OVERRIDE FOR COST1 ONLY                 
SXTFLAG_C2ONLY EQU X'40'           COST OVERRIDE FOR COST2 ONLY                 
         SPACE 1                                                                
*              RESPONSE COUNT ELEMENT                                           
         SPACE 1                                                                
RSVPELEM DS    0C                                                               
         DS    CL1                 ELEMENT CODE (X'17')                         
         DS    CL1                 ELEMENT LEN (6)                              
RSVPDPT  DS    CL1       A         ACTUAL DAYPART                               
         DS    CL1                 SPARE                                        
RSVPNUM  DS    CL2       B         NUMBER OF RESPONSES                          
         EJECT                                                                  
*              DEALER CML/TAG ASSIGN ELEMENT                                    
         SPACE 1                                                                
DLTGID   DS    X                  ELEMENT CODE                                  
DLTGIDQ  EQU   X'18'                                                            
DLTGLN   DS    AL1(9) ELEMENT LENGTH                                            
DLTGCSQ  DS    XL3                COMMERCIAL SEQ                                
DLTGTAG  DS    XL2                DEALER TAG NUMBER                             
DLTGDTE  DS    XP(DT02)L2         INSTRUCTION DATE                              
DLTLENQ  EQU   *-DLTGID                                                         
         SPACE 1                                                                
*              TRAFFIC CML ASSIGN ELEMENT                                       
         SPACE 1                                                                
TRACID   DS    X                  ELEMENT CODE                                  
TRACIDQ  EQU   X'18'                                                            
TRACLN   DS    AL1(8)             ELEMENT LENGTH                                
TRACCSQ  DS    XL2                COMMERCIAL SEQ                                
TRACCSQ2 DS    XL2                P/B COMMERCIAL SEQ                            
TRACREF  DS    XL2                PATTERN REF IF SOURCE=PATTERN                 
TRACLEN  EQU   *-TRACID                                                         
         SPACE 1                                                                
*              MISSED EXCEPTION ELEMENT (FOLLOWS MINUS SPOT)                    
         SPACE 1                                                                
MSEXELEM DS    X'19'              CODE                                          
MSEXLEN  DS    XL1                LENGTH (4)                                    
MSEXMGCD DS    XL2                ALPHA MGCODE IF X'FF' IN REGEL SLOT           
         SPACE 1                                                                
*              POST BUY DEMOGRAPHIC ORIGINATING ELEMENT                         
*              IF PRESENT, MUST FOLLOW X'02' ELEMENT                            
         SPACE 1                                                                
PDELEM   DS    0C        V         ELEMENT CODE                                 
PDCODE   DS    CL1       B         X'22'                                        
PDLEN    DS    CL1       B         ELEMENT LENGTH (2+3*N'DEMOS)                 
PDEMO    DS    XL3       B         X'80'=POST BUY OVERRIDE                      
*                                  FOLLOWED BY DEMO VALUE                       
         SPACE 1                                                                
*              POST BUY DEMOGRAPHIC SPILL ELEMENT                               
*              IF PRESENT, MUST FOLLOW X'03' ELEMENT                            
         SPACE 1                                                                
SDELEM   DS    0C        V         ELEMENT CODE                                 
SDCODE   DS    XL1       B         X'23'                                        
SDLEN    DS    XL1       B         ELEMENT LENGTH (6+3*N'DEMOS)                 
SDAGYMKT DS    XL2       B         AGENCY MARKET NUMBER                         
SDRSVMKT DS    XL2       B         RATING SERVICE MARKET NUMBER                 
SDEMO    DS    XL3       B         X'80'=POST BUY OVERRIDE                      
*                                  FOLLOWED BY DEMO VALUE                       
                                                                                
*              DEMO LOOK-UP OVERRIDE ELEMENT                                    
                                                                                
DLUELEM  DS    0C                  ELEMENT CODE                                 
DLUCODE  DS    XL1       B         X'24'                                        
DLUCODEQ EQU   X'24'                                                            
DLULEN   DS    XL1       B         ELEMENT LEN  TV=11,RAD=6                     
DLUBKTYP DS    CL1       C         BOOK TYPE CODE                               
DLUBAMKT DS    XL3                 ALPHA MARKET                                 
DLUBSTOV DS    CL4                 STATION OVERRIDE                             
DLUBFLGS DS    XL1                 LOOKUP FLAGS (TV)                            
*                                  X'01'=BBM FOR CANADA                         
*                                  X'02'=NSI                                    
*                                  X'80'=SUPPRESS IMPRESSIONS                   
DLULENQ  EQU   *-DLUELEM                                                        
         SPACE 1                                                                
*              MASTER CLIENT DESCRIPTION ELEMENT                                
         SPACE 1                                                                
MCLTELEM DS    0C                                                               
         DS    CL1                 ELEMENT CODE (X'61')                         
         DS    XL1'6'              ELEMENT LENGTH                               
MCLTCODE DS    XL2                 2-BYTE MASTER CLIENT CODE                    
MCLTUNIQ DS    XL1                 1-BYTE SOURCE ID (TO KEY+10)                 
MCLTPRD  DS    XL1                 1-BYTE PRODUCT CODE                          
         SPACE 1                                                                
*              UPGRADE DESCRIPTION ELEMENT                                      
         SPACE 1                                                                
UPELEM   DS    0C        V                                                      
         DS    CL1       B         ELEMENT CODE (X'62')                         
         DS    AL1(UPELEMLN)       ELEMENT LEN (49)                             
UPFILE   DS    CL1       A         TP/PAV                                       
UPSRC    DS    CL1       A         ARB/NSI                                      
UPPUR    DS    XL2       B         PAV PURE NUMBER                              
UPFBK    DS    XL2       B         SHARE SOURCE BOOK                            
UPSTA    DS    CL5       C         OVERRIDE STATION                             
UPDAYTIM DS    XL5       B         OVERRIDE DAY/TIME                            
UPTYPE   DS    XL8       B         UPGRADE OPTIONS (SEE REP/RAVLNEL)            
UPINPUT  DS    XL15      A         UPGRADE DATA AS INPUT                        
UP2YRP   DS    CL1       C         Y= 2 YEAR PUT AVERAGING                      
UP2YRS   DS    CL1       C         Y= 2 YEAR SHR AVERAGING                      
UPFBKLST DS    XL6       B         SHARE SOURCE BOOK LIST (MAX 3)               
UPELEMLN EQU   *-UPELEM                                                         
         SPACE 1                                                                
*              DEMO BOOK AVERAGE DESCRIPTON ELEMENT                             
         SPACE 1                                                                
AVGBKLEM DS    0C                                                               
AVGBKEL  DS    CL1       B         ELEMENT CODE (X'64')                         
AVGBKELQ EQU   X'64'                                                            
AVGBKLN  DS    XL1                                                              
         DS    CL5                 SPARE                                        
AVGBKLNQ EQU   *-AVGBKLEM                                                       
AVGBOOK  DS    0C                  AVERAGE BOOKS TEXT                           
         SPACE 1                                                                
*              MAKEGOOD REASON CODE ELEMENT                                     
         SPACE 1                                                                
MGRCEL   DS    0C        V         MAKEGOOD REASON CODE ELEMENT                 
MGRCELCD DS    XL1'65'   B         ELEMENT CODE (X'65')                         
MGRCELLN DS    AL1(9)    B         ELEMENT LENGTH (9)                           
MGRCREAS DS    CL6       A/N       REASON CODE                                  
MGRCOFF  DS    CL1       A/N       OFFICE                                       
MGRCELX  EQU   *                                                                
*              COMMENT ELEMENT                                                  
         SPACE 1                                                                
COMELEM  DS    0C        V         COMMENTS -                                   
CMCODE   DS    CL1       B         ELEMENT CODE (X'66' OR X'76')                
CMCODEQ  EQU   X'66'                                                            
CMLEN    DS    CL1       B         ELEMENT LENGTH (3 + L'COMMENT)               
CMNUM    DS    CL1       B         COMMENT NUMBER                               
CMDATA   DS    0C        A/N       VARIABLE LENGTH COMMENT                      
         SPACE 2                                                                
*              RADIO DEMO DESCRIPTION ELEMENT                                   
         SPACE 1                                                                
RDELEM   DS    0C        V                                                      
RDCODE   DS    XL1       B         ELEMENT CODE (X'63')                         
RDLEN    DS    AL1(10)   B         ELEMENT LENGTH (10)                          
RDBOOKS  DS    XL8       B         MAX 4 BOOKS                                  
         SPACE 2                                                                
*              ORBIT DESCRIPTION ELEMENT                                        
         SPACE 1                                                                
ORBELEM  DS    0C        V         ORBIT DESCRIPTION ELEMENT                    
ORBCODE  DS    CL1       B         ELEMENT CODE (X'67')                         
ORBLEN   DS    CL1       B         ELEMENT LENGTH (4 + 16*N'SHOWS)              
         DS    CL1                                                              
         DS    CL1                 SPARE                                        
*                                                                               
ORBDAY   DS    CL1       B         DAY                                          
ORBTIME  DS    CL4       B         TIME                                         
ORBDESC  DS    CL7       C         DESC                                         
ORBDEM   DS    CL2       B         ESTIMATED DEMO                               
         DS    CL2                 SPARE                                        
         SPACE 2                                                                
*              CANAD NTWK STATION ELEMENT                                       
         SPACE 1                                                                
NTWKELEM DS    0C                  NTWK STATION LIST ELEMENT                    
NTWKCODE DS    CL1       B         ELEMENT CODE (X'68')                         
NTWKCODQ EQU   X'68'                                                            
NTWKLEN  DS    CL1       B         ELEMENT LENGTH (11)                          
NTWKMKST DS    CL5       B         MKT-STATION                                  
NTWKSHR  DS    CL4       B         PCTG OF NTWK BUY                             
NTWKFLG  DS    XL1       B         FLAGS                                        
NTWKFLG_CUTIN  EQU  X'80'          CUTIN FOR THIS STATION                       
                                                                                
*              CANAD NTWK TAX ELEMENT                                           
                                                                                
NTWKCTAX DS    0C                                                               
         DS    CL1                 ELEMENT CODE (X'69')                         
         DS    CL1                 ELEMENT LEN (6)                              
         DS    CL4                 TAX AMOUNT                                   
         SPACE 2                                                                
*              CANADIAN VAT ELEMENT (FOR VAT EXCEPTIONS ONLY)                   
         SPACE 1                                                                
VATELEM  DS    0C                                                               
         DS    CL1                 ELEMENT CODE (X'6A)                          
         DS    CL1                 ELEMENT LENGTH (03)                          
VATSTA   DS    CL1                 STATION VAT CODE                             
         SPACE 2                                                                
*              CANADIAN PST ELEMENT                                             
         SPACE 1                                                                
PSTELEM  DS    0C                                                               
         DS    XL1'6B'             ELEMENT CODE (X'6B')                         
         DS    AL1(12)                                                          
PSTVALS  DS    CL10                PST CODES BY PROVINCE                        
         SPACE 2                                                                
*              ID ELEMENT                                                       
         SPACE 1                                                                
IDELEM   DS    0C                                                               
IDELCOD  DS    CL1                 ELEMENT CODE (X'70')                         
IDELCODQ EQU   X'70'                                                            
IDELLEN  DS    CL1                 ELEMENT LEN (15)                             
         DS    CL1                 ID TYPE                                      
IDCONNO  DS    CL12                DATA                                         
IDELLENQ EQU   *-IDELEM                                                         
         SPACE 1                                                                
*              COST ELEMENT                                                     
         SPACE 1                                                                
COS2ELEM DS    0C                                                               
         DS    CL1                 ELEMENT CODE (X'71' OR X'73')                
         DS    CL1                 ELEMENT LEN (6)                              
         DS    CL4                 2ND COST AMOUNT (71) OR FACTOR (73)          
COS2LENQ EQU   *-COS2ELEM                                                       
         SPACE 1                                                                
*              AUTOMATED-AVAIL UUID ELEMENT                                     
         SPACE 1                                                                
AAVELEM  DS    0C                                                               
AAVCODE  DS    CL1                 ELEMENT CODE (X'7A')                         
AAVCODQ  EQU   X'7A'                                                            
AAVLEN   DS    XL1                 ELEMENT LENGTH                               
AAVLENQ  EQU   *-AAVELEM                                                        
AAVUUID  DS    0C                  UUID (VARIABLE LENGTH)                       
         SPACE 1                                                                
*              REASON CODE ELEMENT                                              
         SPACE 1                                                                
RCELEM   DS    0C                                                               
RCELCOD  DS    XL1                 ELEMENT CODE                                 
RCELCODQ EQU   X'90'               ELEMENT CODE                                 
RCELLEN  DS    XL1     V           ELEMENT LENGTH                               
RCELLENQ EQU   9                   BASIC EL LEN W/O TEXT                        
RCELRC   DS    CL6                 REASON CODE                                  
RCFLDID  DS    XL1                 FIELD ID OF CHANGE                           
RCID_NONE EQU  X'00'               LAST CHG DID NOT REQ RSNCODE                 
RCID_VAR EQU   X'01'               LAST CHG WAS MULTI FIELDS                    
RCID_PER EQU   X'10'                                                            
RCID_TIM EQU   X'11'                                                            
RCID_SLN EQU   X'12'                                                            
RCID_COS EQU   X'13'                                                            
RCID_NPW EQU   X'14'                                                            
RCID_SKD EQU   X'15'                                                            
RCID_MG  EQU   X'16'                                                            
RCID_NEW EQU   X'20'               NEW BUY                                      
RCELTXT  DS    0C                  REASON CODE TEXT                             
         SPACE 1                                                                
*              BUY COPY DATE/TIME ELEM (SBY)                                    
         SPACE 1                                                                
BCELEM   DS    0C                                                               
BCELCOD  DS    XL1                 ELEMENT CODE                                 
BCELCODQ EQU   X'91'               ELEMENT CODE                                 
BCELLEN  DS    XL1     V           ELEMENT LENGTH                               
BCDATE   DS    XP(DT02)L2          DATE SBY RUN                                 
BCTIME   DS    XL2                 TIME SBY RUN (BINARY OF HHMM)                
         DS    XL2                 SPARE                                        
BCLENQ   EQU   *-BCELEM                                                         
         SPACE 1                                                                
*              BUY MOVE ELEM (X'92'=SPOTS MOVED FROM THIS LINE)                 
*                            (X'93'=SPOTS MOVED TO THIS LINE)                   
         SPACE 1                                                                
MOVELEM  DS    0C                                                               
MOVELCOD DS    XL1                ELEMENT CODE                                  
MOVELFRQ EQU   X'92'                                                            
MOVELTOQ EQU   X'93'                                                            
MOVELLEN DS    AL1(16)            ELEMENT LENGTH                                
MOVQCLT  DS    CL3                                                              
MOVQPRD  DS    CL3                                                              
MOVBEST  DS    XL1                                                              
MOVLIN   DS    XL1                                                              
MOVDATE  DS    XP(DT02)L2          DATE                                         
MOVTIME  DS    XL2                 TIME                                         
MOVWHO   DS    XL2                                                              
MOVLENQ  EQU   *-MOVELEM                                                        
         SPACE 1                                                                
*              MC/GM BUY MOVE ELEMENT                                           
         SPACE 1                                                                
BMVELEM  DS    0C                                                               
BMVELCOD DS    XL1                ELEMENT CODE                                  
BMVELCDQ EQU   X'94'                                                            
BMVELLEN DS    AL1(12)            ELEMENT LENGTH                                
BMVBUYCL DS    XL2                CLT                                           
BMVBUYPR DS    CL3                PRD                                           
BMVBUYES DS    XL1                EST                                           
BMVBUYLN DS    XL1                LINE                                          
*                                                                               
BMVDATE  DS    XP(DT02)L2         MOVE DATE                                     
*                                                                               
BMVSTAT1 DS    XL1                STATUS BYTE 1                                 
BMVSTAT1_TOLN EQU X'80'           MOVE 'TO' LINE                                
BMVSTAT1_FRLN EQU X'40'           MOVE FROM LINE                                
*                                                                               
BMVLENQ  EQU   *-BMVELEM                                                        
         SPACE 2                                                                
*              BUY UPLOAD ELEMENT                                               
         SPACE 1                                                                
BUPELEM  DS    0C                                                               
BUPCODE  DS    XL1                 ELEMENT CODE                                 
BUPCODEQ EQU   X'95'                                                            
BUPLEN   DS    XL1                 ELEMENT LENGTH                               
BUPDAT   DS    XL3                 DATE OF UPLOAD                               
BUPIND   DS    XL1                 INDICATOR                                    
BUPIUPD  EQU   X'80'               UPDATES ONLY UPLOAD                          
BUPIMAN  EQU   X'40'               MANUALLY ADDED                               
BUPIDDS  EQU   X'20'               UID ASSIGNED BY DDS                          
BUPUID   DS    CL8                 UNIQUE BUY ID                                
BUPTIME  DS    XL3                 TIME OF UPLOAD (HMS BINARY)                  
BUPLENQ  EQU   *-BUPELEM                                                        
         SPACE 2                                                                
*              CANADIAN EXCHANGE RATE ELEMENT                                   
         SPACE 1                                                                
XCHELEM  DS    0C                                                               
XCHCODE  DS    CL1       B         ELEMENT CODE (X'96')                         
XCHCODEQ EQU   X'96'                                                            
XCHLEN   DS    CL1       B         ELEMENT LENGTH (8+ 4 BYTES/PAYDATE)          
XCHCTYP  DS    CL1                 CLIENT TYPE U/C                              
XCHSTYP  DS    CL1                 STATION TYPE U/C                             
XCHDTYP  DS    CL1                 DOLLAR INPUT TYPE U/C                        
XCHRATE  DS    XL2                 EXCHANGE RATE                                
XCHC58   DS    XL2                 C58 TAX                                      
XCHLENQ  EQU   *-XCHELEM           THIS DEFINES BASE ELEMENT LENGTH             
*                                                                               
* FOLLOWING 4 BYTES OCCUR ONCE FOR EACH PAYMENT DATE                            
*                                                                               
XCHPDT   DS    XL2                 COMPRESSED???  PAYMENT DATE                  
XCHPDRT  DS    XL2                 CURRENT EXCHANGE RATE                        
         SPACE 2                                                                
*              BWS TRANSFER ELEMENT                                             
         SPACE 1                                                                
BWSELEM  DS    0C                                                               
BWSCODE  DS    CL1       B         ELEMENT CODE (X'97')                         
BWSCODEQ EQU   X'97'                                                            
BWSLEN   DS    CL1       B         ELEMENT LENGTH                               
BWSBYR   DS    CL3       C         BUYER                                        
BWSCAM   DS    XL2       B         CAMPAIGN                                     
BWSDATE  DS    XL3                 TRANSFER DATE                                
BWSLENQ  EQU   *-BWSELEM                                                        
         SPACE 2                                                                
*                                                                               
BTRCELEM DS    0C                  AMFM/DARE TRACE ELEMENT (X'98')              
BTRCCODE DS    XL1                 ELEMENT CODE                                 
BTRCCODQ EQU   X'98'                                                            
BTRCLEN  DS    XL1                 ELEMENT LENGTH                               
BTRCSEQN DS    XL4                 SCHEDULE SEQUENCE NUMBER                     
BTRCDATE DS    XL3                 DATE CREATED                                 
BTRCTIME DS    XL3                 TIME CREATED (HMS BINARY)                    
BTRCLUID DS    0CL8                WHO CREATED THE BUY                          
BTRCLINE DS    CL4                 LINE ID ('DARE' FOR DARE)                    
BTRCADDR DS    CL4                 TERMINAL ADDRESS                             
BTRCLENQ EQU   *-BTRCELEM                                                       
*                                                                               
*              ACTIVITY ELEMENT                                                 
         SPACE 1                                                                
ACTVELEM DS    0C                                                               
         DS    CL1                 ELEMENT CODE (X'99')                         
         DS    CL1                 ELEMENT LEN (12)                             
ACTVADD  DS    CL2                 CREATION AUTH CODE                           
         DS    CL3                 CREATION DATE                                
ACTVCHG  DS    CL2                 LAST CHG AUTH CODE                           
         DS    CL3                 LAST CHG DATE                                
         SPACE 2                                                                
*              CLONED RECORD ELEMENT                                            
         SPACE 1                                                                
CRELEM   DS    0C                                                               
CRCODE   DS    CL1       B         ELEMENT CODE (X'9A')                         
CRCODEQ  EQU   X'9A'                                                            
CRLEN    DS    CL1       B         ELEMENT LENGTH (20)                          
CRCLKEY  DS    CL13                CLONED FROM KEY                              
CRALPHA  DS    CL2                 CLONED FROM ALPHA AGENCY                     
CRLENQ   EQU   *-CRELEM            THIS DEFINES BASE ELEMENT LENGTH             
         SPACE 2                                                                
*              DESKTOP TRANSFER ELEMENT                                         
* NOTE: THIS ELEM ONLY VALID IF LAST CHANGED BY DTOP                            
         SPACE 1                                                                
DTXELEM  DS    0C                                                               
DTXCODE  DS    XL1       B         ELEMENT CODE (X'9B')                         
DTXCODEQ EQU   X'9B'                                                            
DTXLEN   DS    XL1       B         ELEMENT LENGTH                               
*                                                                               
DTXSTAT  DS    XL1                 STATUS                                       
DTXS_MNT EQU   X'00'               BUY CAME FROM US BUY MAINT                   
DTXS_OLD EQU   X'80'               BUY FROM OLD SAVE (SPBUY39)                  
DTXS_AVA EQU   X'40'               BUY CAME FROM AVAIL                          
DTXS_REV EQU   X'20'               BUY CAME FROM REVISION                       
DTCX_CMT EQU   X'10'               BUY CAME FROM CANADIAN MAINT                 
DTCX_CBC EQU   X'08'               BUY CAME FROM CANADIAN BUY CONST             
DTCX_PNG EQU   X'04'               BUY CAME FROM CANADIAN PINERGY               
*                                                                               
DTXVER   DS    XL4                 PC VERSION NUMBER                            
DTXTIME  DS    XL3                 TIME (SEE 99 FOR DATE & PID)                 
DTXSLNQ  EQU   *-DTXELEM           SHORT ELEM LENGTH                            
*                                                                               
DTXSHT   DS    XL3                 REV/AVA SHEET # (XFF COMP)                   
DTXLIN   DS    XL3                 REV/AVA LINE # (XFF COMP)                    
DTXLLNQ  EQU   *-DTXELEM           LONG ELEM LENGTH                             
*                                                                               
         SPACE 2                                                                
*              MKTFIX ELEMENT                                                   
         SPACE 1                                                                
MFXELEM  DS    0C                                                               
MFXCODE  DS    CL1       B         ELEMENT CODE (X'9C')                         
MFXCODEQ EQU   X'9C'                                                            
MFXLEN   DS    CL1       B         ELEMENT LENGTH                               
MFXMKT   DS    XL2                 OLD MARKET NUMBER                            
MFXDATE  DS    XP(DT02)L2          DATE WHEN MARKET CHANGED                     
MFXLENQ  EQU   *-MFXELEM                                                        
         SPACE 2                                                                
*              STATION CALL LETTER CHANGE ELEMENT                               
         SPACE 1                                                                
SFXELEM  DS    0C                                                               
SFXCODE  DS    CL1       B         ELEMENT CODE (X'9D')                         
SFXCODEQ EQU   X'9D'               OR X'9F' FOR CANAD CABLE CONV                
SFXLEN   DS    CL1       B         ELEMENT LENGTH                               
SFXSTA   DS    XL3                 OLD STATION CALL LETTERS                     
SFXDATE  DS    XP(DT02)L2          DATE WHEN SSC RAN                            
SFXLENQ  EQU   *-SFXELEM                                                        
         SPACE 2                                                                
*              DARE MAKEGOOD TRACE ELEMENT                                      
         SPACE 1                                                                
BDARELEM DS    0C                  DARE TRACE ELEMENT (X'9E')                   
BDARCODE DS    XL1                 ELEMENT CODE                                 
BDARCODQ EQU   X'9E'                                                            
BDARLEN  DS    XL1                 ELEMENT LENGTH                               
BDARDATE DS    XL3                 DATE CREATED                                 
BDARTIME DS    XL3                 TIME CREATED (HMS BINARY)                    
BDARORD  DS    CL8                 DARE ORDER NUMBER                            
BDARBYR  DS    CL3                 BUYER CODE                                   
BDARMKGP DS    CL3                 MAKEGOOD GROUP CODE (DARE)                   
BDARFLT  DS    XL1                 FLIGHT NUMBER                                
BDARSEQN DS    XL3                 OFFER/REC/SEQNUM                             
BDARLENQ EQU   *-BDARELEM                                                       
         SPACE 2                                                                
*              ACTIVITY CHANGE ELEMENT                                          
         SPACE 1                                                                
BACELEM  DS    0X                                                               
BACCODE  DS    X                   ELEMENT CODE                                 
BACCODEQ EQU   X'A0'                                                            
BACLEN   DS    X                   ELEMENT LENGTH (VARIABLE)                    
                                                                                
BACPROG  DS    X                   ** ORIGINATING PROGRAM **                    
BACPSBUY EQU   1                   SPOT BUY                                     
BACPSPK4 EQU   2                   SPOT K4/KL                                   
BACPSTEW EQU   3                   SPOT STEWARD                                 
                                                                                
BACACTN  DS    X                   ** CHANGE ACTION **                          
BACAALOC EQU   1                   CHANGE PRODUCT ALLOCATION                    
         DS    X                   SPARE                                        
                                                                                
BACDATE  DS    XP(DT02)L2          CHANGE DATE (COMPRESSED)                     
BACTIME  DS    XL3                 CHANGE TIME (BINARY HHMMSS)                  
BACLEN1Q EQU   *-BACELEM                                                        
                                                                                
BACUSER  DS    XL2                 OPTIONAL USER-ID NUMBER                      
BACLEN2Q EQU   *-BACELEM                                                        
                                                                                
BACPASS  DS    XL2                 OPTIONAL PERSON PASSWORD NUMBER              
BACLEN3Q EQU   *-BACELEM                                                        
*                                                                               
MGCVNEL  DS    XL1                 ELEMENT CODE                                 
MGCNVELQ EQU   C'M'                                                             
MGCNVELN DS    AL1(4)                                                           
MGCNVADJ DS    XL2                 ADJUSTMENT ADDED TO OLD MGCODE               
         SPACE 2                                                                
*              NON-TRADITIONAL DEMO NAME SHORT FORM ELEMENT                     
         SPACE 1                                                                
NTDELEM  DS    0C                                                               
NTDELCD  DS    CL1       B         ELEMENT CODE (X'50')                         
NTDELCDQ EQU   X'50'                                                            
NTDELLN  DS    CL1       B         ELEMENT LENGTH (VARIABLE)                    
NTDOVHDQ EQU   *-NTDELEM           OVRHD BEFORE DATA (UPTO 20 DEMOS)            
NTDDMONM DS    CL8                 NAME WITH X AND MODIFIER PREFIXED            
NTDDMOFL DS    XL1                 FLAGS                                        
NTDDFDLK EQU   X'80'                -CATEGORY DOES NOT NEED DEMO LKUP           
NTDDFSDL EQU   X'40'                -CATEGORY DOES NOT NEED SPILL LKUP          
NTDDLKNA EQU   X'20'                -CATEGORY LOOKUP IS N/A                     
NTDDLEN  EQU   *-NTDDMONM                                                       
         SPACE 2                                                                
