*          DATA SET SPGENPCD   AT LEVEL 002 AS OF 11/13/85                      
PCDRECD  DSECT           SPOTPAK PRODUCT CENTRE DEFINITION RECORD               
*                                                                               
PCDKEY   DS    0XL13                                                            
PCDKTYP  DS    XL2'0D41'           RECORD TYPE                                  
PCDKAGMD DS    XL1                 AGENCY-MEDIA                                 
PCDKCLT  DS    XL2                 CLIENT                                       
PCDKMID  DS    CL1                 MKTGRP ID                                    
PCDKMGRP DS    CL2       PWOS      MKTGRP NUMBER (LEFT ALIGNED)                 
         DS    XL5                 NOT USED                                     
*                                                                               
PCDLEN   DS    XL2                                                              
PCDCNTL  DS    XL1                                                              
         DS    XL4                                                              
PCDAGYA  DS    CL2                                                              
         DS    CL2                                                              
*                                                                               
         SPACE 2                                                                
PCDEL01  DSECT                     COST CENTRE NAME DEFINITION                  
         DS    XL1'01'                                                          
         DS    AL1(23)                                                          
PCDCCSEQ DS    XL1                 SEQUENCE NUMBER                              
PCDCCEN  DS    CL20      A/N       COST CENTRE NAME                             
