*          DATA SET SPGENMTR   AT LEVEL 009 AS OF 12/04/86                      
*                        *** MARKET TRANSLATION RECORD ***                      
         SPACE 1                                                                
MTRREC   DS    0C                                                               
MTRKEY   DS    0CL13               KEY                                          
MTRKTYPE DS    X'0D46'   A         RECORD TYPE                                  
MTRKAM   DS    XL1       N         AGENCY/MEDIA                                 
MTRKRTG  DS    CL1       A         RATING SERVICE (A/N)                         
MTRKRSMK DS    XL2       B         RATING SERVICE MARKET NUMBER                 
         DS    XL7                                                              
         SPACE 1                                                                
MTRLEN   DS    CL2                 RECORD LENGTH                                
MTRCTL   DS    CL1       B         CONTROL BYTE                                 
         DS    CL4                 RESERVED                                     
MTRAGYA  DS    CL2                 AGENCY ALPHA                                 
         DS    CL2                                                              
         SPACE 1                                                                
MTREL05  DS    X'05'               TRANSLATION ELEMENT                          
         DS    AL1(6)                                                           
MTRCLT   DS    XL2                 CLIENT CODE (X'00' = ALL)                    
MTRAGMK  DS    XL2                 AGENCY MARKET NUMBER                         
