*          DATA SET SPGENOLD   AT LEVEL 010 AS OF 03/01/04                      
GENOLD   DSECT                                                                  
*                                                                               
BASERB   DS    A                                                                
BASERD   DS    A                                                                
*                                                                               
DMCB     DS    CL24                                                             
*                                                                               
KEY      DS    CL20                                                             
KEYSAVE  DS    CL20                                                             
COMMAND  DS    CL8                                                              
AREC     DS    A                                                                
DMWORK   DS    12D                                                              
DMINBTS  DS    C                                                                
DMOUTBTS DS    C                                                                
BYTE     DS    C                                                                
BYTE2    DS    C                                                                
WORK     DS    CL48                                                             
SPACES   DS    CL80                INITIALIZED TO SPACES                        
WORK2    DS    CL48                                                             
FULL     DS    F                                                                
DUB      DS    D                                                                
HALF     DS    H                                                                
HALF2    DS    H                                                                
NUMFLD   DS    H                                                                
AGYALPHA DS    H                                                                
ERRCD    DS    C                                                                
ELCODE   DS    C                                                                
FRSTFLD  DS    A                                                                
LASTFLD  DS    A                                                                
ERRAREA  DS    A                                                                
*                                                                               
VTWA     DS    A                                                                
VDATAMGR DS    A                                                                
VCALLOV  DS    A                                                                
VCASHVAL DS    A                                                                
VDATVAL  DS    A                                                                
VADDAY   DS    A                                                                
VDTCNV   DS    A                                                                
VGETDAY  DS    A                                                                
VRECUP   DS    A                                                                
VGETMSG  DS    A                                                                
VDATCON  DS    A                                                                
VSCANNER DS    A                                                                
VTIA     DS    A                                                                
         DS    7A                                                               
VCOMFACS DS    A                                                                
*                                                                               
ERROR    DS    A                                                                
ANY      DS    A                                                                
MOVE     DS    A                                                                
PACK     DS    A                                                                
*                                                                               
READ     DS    A                                                                
SEQ      DS    A                                                                
HIGH     DS    A                                                                
ADD      DS    A                                                                
DIR      DS    A                                                                
RDSTA    DS    A                                                                
STA      DS    A                                                                
GETREC   DS    A                                                                
PUTREC   DS    A                                                                
ADDREC   DS    A                                                                
FIL      DS    A                                                                
         DS    5A                  SPARE                                        
*                                                                               
USER1    DS    A                                                                
USER2    DS    A                                                                
USER3    DS    A                                                                
USER4    DS    A                                                                
USER5    DS    A                                                                
USER6    DS    A                                                                
USER7    DS    A                                                                
USER8    DS    A                                                                
USER9    DS    A                                                                
