*          DATA SET SPGETBUBLD AT LEVEL 010 AS OF 02/01/89                      
         DS    0F                                                               
GETBUBLD DS    0XL40         ***** GETBUBL INTERFACE BLOCK *****                
GBCOMFAC DS    A                   A(COMFACS)                                   
GBIOA    DS    A                   A(2K I/O AREA)                               
GBNAMFLD DS    A                   A(FLDHDR)                                    
*                                                                               
GBERR    DS    XL1                 ERROR CODE (ON EXIT)                         
*                                  X'81' = NAME NOT FOUND                       
*                                  ELSE DATAMGR ERROR RETURN                    
*                                                                               
GBTYPE   DS    CL1                 I=BILLER/B=BUYER                             
GBAGY    DS    CL2                 ALPHA AGENCY CODE                            
GBOFFICE DS    CL1                 OFFICE CODE                                  
GBMEDEBC DS    CL1                 EBCDIC MEDIA CODE                            
GBCLTEBC DS    CL3                 EBCDIC CLIENT CODE                           
*                                                                               
GBAGYMD  DS    XL1                                                              
GBCLT    DS    XL2                                                              
GBPRD    DS    XL1                                                              
GBEST    DS    XL1                                                              
GBMKT    DS    XL2                                                              
GBSTA    DS    XL3                                                              
         DS    XL9                 SPARE                                        
