*          DATA SET SPGENSNV   AT LEVEL 030 AS OF 06/22/20                      
***********************************************************************         
*                                                                               
*    SPGENSNV - SPOTPAK STATION INVOICE RECORDS                                 
*                                                                               
*    NOTE- ALL THE DATA FOR A GIVEN CLIENT/STATION/MONTH/INVOICE IS             
*          STORED IN ONE MINIO RECORD SET.                                      
*                                                                               
***********************************************************************         
*                                                                               
SNVKEYD  DSECT                                                                  
SNVKEY   DS    0XL32                                                            
*                                                                               
SNVKMAST DS    0XL24               *** MASTER KEY FOR MINIO                     
SNVKTYPE DS    XL1                 RECORD CODE - X'0E03'                        
SNVKTYPQ EQU   X'0E'                                                            
SNVKSUB  DS    XL1                                                              
SNVKSUBQ EQU   X'03'                                                            
SNVKAM   DS    XL1                 AGENCY/MEDIA                                 
SNVKCLT  DS    XL2                 CLIENT                                       
SNVKSTA  DS    XL3                 STATION                                      
SNVKMOS  DS    XP(DT02X)L2         2-BYTE COMPRESSED X'FF' COMPLEMENT           
*                                   OF YYMM01 MOS                               
         DS    XL2                 SPARE (COULD BE USED FOR END DATE)           
SNVKINV  DS    CL10                INVOICE NUMBER                               
         DS    XL2                 SPARE                                        
*                                                                               
SNVKMINK DS    XL6                 MINIO ELEMENT KEY                            
         DS    XL2                 SPARE                                        
*                                                                               
SNVDSTAT DS    XL4                 DIRECTORY STATUS BYTES                       
* SNVDSTAT+0, X'20'= FILM ANALYSIS ERRORS                                       
* SNVDSTAT+0, X'10'= HORIZONTAL/VERTICAL ERRORS                                 
* SNVDSTAT+0, X'08'= SECONDARY SEPARATION ERRORS                                
* SNVDSTAT+1, X'80'= SUCCESSFUL MATCH                                           
* SNVDSTAT+1, X'40'= MATCHMAKER WIP                                             
* SNVDSTAT+1, X'20'= UNWIRED NETWORK                                            
* SNVDSTAT+1, X'10'= CALENDAR MONTH                                             
* SNVDSTAT+1, X'08'= INTEGRATION+TIME INVOICE (I)                               
* SNVDSTAT+1, X'04'= INTEGRATION ONLY INVOICE (O)                               
* SNVDSTAT+1, X'02'= APPROVED                                                   
SNVDDA   DS    XL4                 DISK ADDRESS                                 
*                                                                               
         ORG   SNVDSTAT                                                         
SNVRLEN  DS    XL2                 RECORD LENGTH                                
SNVRSTAT DS    XL4                 RECORD STATUS BYTES                          
* SNVRSTAT+0, X'20'= FILM ANALYSIS ERRORS                                       
* SNVRSTAT+0, X'10'= HORIZONTAL/VERTICAL ERRORS                                 
* SNVRSTAT+0, X'08'= SECONDARY SEPARATION ERRORS                                
* SNVRSTAT+1, X'80'= SUCCESSFUL MATCH                                           
* SNVRSTAT+1, X'40'= MATCHMAKER WIP                                             
* SNVRSTAT+1, X'20'= UNWIRED NETWORK                                            
* SNVRSTAT+1, X'10'= CALENDAR MONTH                                             
* SNVRSTAT+1, X'08'= INTEGRATION+TIME INVOICE (I)                               
* SNVRSTAT+1, X'04'= INTEGRATION ONLY INVOICE (O)                               
* SNVRSTAT+1, X'02'= APPROVED                                                   
SNVRLNK  DS    XL4                 LINK FIELD                                   
*                                                                               
SNVELS   DS    0X                  START OF FIRST ELEMENT                       
*                                                                               
*        PASSIVE KEY (FOR MATCHMAKER)                                           
*                                                                               
         ORG   SNVKEY                                                           
*                                                                               
SNVPKEY  DS    0XL32                                                            
SNVPTYP  DS    XL1                                                              
SNVPTYPQ EQU   X'0E'                                                            
SNVPSUB  DS    XL1                                                              
SNVPSUBQ EQU   X'83'                                                            
SNVPAM   DS    XL1                 AGENCY/MEDIA                                 
SNVPMKT  DS    XL2                 MARKET - OR BUYER SEQ NUMBER                 
         ORG   SNVPMKT                                                          
SNVPBYR  DS    XL2                 MARKET - OR BUYER SEQ NUMBER                 
SNVPSTA  DS    XL3                 STATION                                      
SNVPMOS  DS    XP(DT02X)L2         2-BYTE COMPRESSED X'FF' COMPLEMENT           
*                                   OF YYMM01 MOS                               
SNVPCLT  DS    XL2                 CLIENT                                       
SNVPPRD  DS    CL3                 PRODUCT                                      
SNVPEST  DS    XL1                 ESTIMATE (FIRST OR ONLY)                     
SNVPEST2 DS    XL1                 ESTIMATE2                                    
SNVPINV  DS    CL10                INVOICE NUMBER                               
SNVPPRD2 DS    CL3                 PIGGY PRODUCT                                
SNVPMKT2 DS    CL2                 EMPTY IF SNVPMKT IS A MARKET -OR-            
*                                    CONTAINS THE MARKET IF SNVPMKT IS          
*                                    A BUYER SEQ NUMBER                         
*                                                                               
SNVPSTAT DS    XL4                 DIRECTORY STATUS BYTES                       
* SNVPSTAT+0, X'20'= FILM ANALYSIS ERRORS                                       
* SNVPSTAT+0, X'10'= HORIZONTAL/VERTICAL ERRORS                                 
* SNVPSTAT+0, X'08'= SECONDARY SEPARATION ERRORS                                
* SNVPSTAT+1, X'80'= SUCCESSFUL MATCH                                           
* SNVPSTAT+1, X'40'= MATCHMAKER WIP                                             
* SNVPSTAT+1, X'20'= UNWIRED NETWORK                                            
* SNVPSTAT+1, X'10'= CALENDAR MONTH                                             
* SNVPSTAT+1, X'02'= APPROVED                                                   
SNVPDA   DS    XL4                 DISK ADDRESS                                 
*                                                                               
*        PASSIVE KEY (FOR NETPAK CABLE MATCHMAKER)                              
*                                                                               
         ORG   SNVKEY                                                           
*                                                                               
SNVNKEY  DS    0XL32                                                            
SNVNTYP  DS    XL1                                                              
SNVNTYPQ EQU   X'0E'                                                            
SNVNSUB  DS    XL1                                                              
SNVNSUBQ EQU   X'93'                                                            
SNVNAM   DS    XL1                 AGENCY/MEDIA                                 
SNVNCLT  DS    XL2                 CLIENT                                       
SNVNNETW DS    CL4                 NETWORK                                      
SNVNMOS  DS    XP(DT02X)L2         2-BYTE COMPLEMENT OF YYMM01 MOS              
SNVNPRD  DS    CL3                 PRODUCT                                      
SNVNEST  DS    XL1                 ESTIMATE (FIRST OR ONLY)                     
SNVNEST2 DS    XL1                 ESTIMATE2                                    
SNVNINV  DS    CL10                INVOICE NUMBER                               
SNVNPRD2 DS    CL3                 PIGGY PRODUCT                                
SNVNPGR  DS    CL1                 PRODUCT GROUP                                
         DS    CL2                 SPARE                                        
*                                                                               
SNVNSTAT DS    XL4                 DIRECTORY STATUS BYTES                       
* SNVNSTAT+0, X'20'= FILM ANALYSIS ERRORS                                       
* SNVNSTAT+0, X'10'= HORIZONTAL/VERTICAL ERRORS                                 
* SNVNSTAT+0, X'08'= SECONDARY SEPARATION ERRORS                                
* SNVNSTAT+1, X'80'= SUCCESSFUL MATCH                                           
* SNVNSTAT+1, X'40'= MATCHMAKER WIP                                             
* SNVNSTAT+1, X'20'= UNWIRED NETWORK                                            
* SNVNSTAT+1, X'10'= CALENDAR MONTH                                             
* SNVNSTAT+1, X'08'= INTEGRATION+TIME INVOICE (I)                               
* SNVNSTAT+1, X'04'= INTEGRATION ONLY INVOICE (O)                               
SNVNDA   DS    XL4                 DISK ADDRESS                                 
*                                                                               
*                                                                               
*        ACTIVE KEY FOR REPPAK INVOICES - NATIONAL USERS                        
*                                                                               
         ORG   SNVKEY                                                           
*                                                                               
SNVRKEY  DS    0XL32                                                            
SNVRTYP  DS    XL1                                                              
SNVRTYPQ EQU   X'0E'                                                            
SNVRSUB  DS    XL1                                                              
SNVRSUBQ EQU   X'A3'                                                            
SNVREP   DS    CL2                 REP CODE                                     
SNVRSTA  DS    CL5                 STATION  WABCA                               
SNVRMOS  DS    XP(DT02X)L2         2-BYTE COMPLEMENT OF YYMM01 MOS              
SNVRCON  DS    XL4                 CONTRACT NUMBER                              
SNVRINV  DS    CL10                INVOICE NUMBER                               
         DS    CL1                 SPARE                                        
SNVRMIN  DS    CL6                 MINIO ELEMENT KEY                            
SNVRST   DS    XL4                 DIRECTORY STATUS BYTES                       
SNVRDA   DS    XL4                 DISK ADDRESS                                 
*                                                                               
*        ACTIVE KEY FOR REPPAK INVOICES - LOCAL USERS                           
*                                                                               
         ORG   SNVKEY                                                           
*                                                                               
SNVLKEY  DS    0XL32                                                            
SNVLTYP  DS    XL1                                                              
SNVLTYPQ EQU   X'0E'                                                            
SNVLSUB  DS    XL1                                                              
SNVLSUBQ EQU   X'B3'                                                            
SNVLID   DS    XL2                 USER ID NUMBER                               
SNVLSTA  DS    CL5                 STATION  WABCA                               
SNVLMOS  DS    XP(DT02X)L2         2-BYTE COMPLEMENT OF YYMM01 MOS              
SNVLSORD DS    CL10                LOCAL STATION ORDER NUMBER                   
SNVLPOW  DS    CL2                 POWER CODE                                   
         DS    CL3                 SPARE                                        
SNVLMIN  DS    CL6                 MINIO ELEMENT KEY                            
SNVLST   DS    XL4                 DIRECTORY STATUS BYTES                       
SNVLDA   DS    XL4                 DISK ADDRESS                                 
         EJECT                                                                  
***********************************************************************         
*        INVOICE HEADER ELEMENT                                                 
***********************************************************************         
*                                                                               
SNVHDELD DSECT                                                                  
SNVHDEL  DS    XL1                 ELEMENT CODE                                 
SNVHDELQ EQU   X'10'                                                            
SNVHDLEN DS    XL1                 ELEMENT LENGTH                               
*                                                                               
         DS    XL5                 SPARE (MINIO ELEMENT KEY)                    
*                                                                               
SNVHDPRD DS    XL1                 PRODUCT - 0=VARIOUS                          
SNVHDPR2 DS    XL1                 2ND PRODUCT (IF PIGGY)                       
SNVHDEST DS    XL1                 ESTIMATE - 0=VARIOUS                         
SNVHDCON DS    CL12                CONTRACT NUMBER                              
SNVHDSDT DS    XP(DT02)L2          PERIOD START DATE                            
SNVHDEDT DS    XP(DT02)L2          PERIOD END DATE                              
SNVHDIDT DS    XP(DT02)L2          INVOICE DATE                                 
SNVHDDDT DS    XP(DT02)L2          DUE DATE                                     
*                                                                               
SNVHDCTL DS    XL1                 CONTROL BYTE                                 
SNVHDNTQ EQU   X'80'                 AMOUNTS ARE NET, NOT GROSS                 
SNVHDCLQ EQU   X'40'                 CALENDAR MONTHS, NOT BROADCAST             
SNVHDRSQ EQU   X'20'                 RESPONSE COUNT 'INVOICE'                   
SNVHDMCQ EQU   X'10'                 MCT 'INVOICE'                              
* SNVHDMCQ IS ALSO USED FOR MID FLIGHT CLEARANCES -                             
* WHICH ARE USED TO VERIFY COMMERCIALS, THEY ARE NOT                            
* REALLY FINAL INVOICES, AND SO THEY CAN BE OVERWRITTEN                         
* WHEN OTHER INVOICES SHOW UP                                                   
         SPACE                                                                  
SNVHDDNQ EQU   X'08'                 INVOICE WAS NETTED DOWN                    
SNVHDAUQ EQU   X'04'                 INVOICE TO BE AUDITED                      
SNVHDMTQ EQU   X'02'                 INVOICE USE MILITARY TIMES                 
SNVHDPDQ EQU   X'01'                 INVOICE IS PAID                            
*                                                                               
SNVHDTCS DS    PL8                 TOTAL COST                                   
SNVHDTSP DS    XL2                 TOTAL SPOTS                                  
SNVHDEZS DS    CL4                 EASI SOURCE                                  
SNVHDEZD DS    0XL3                DATE INVOICE GEN RUN TO EASI                 
SNVHDDEM DS    XL3                 DEMO CATEGORY                                
SNVHDLNQ EQU   *-SNVHDELD                                                       
*                                                                               
SNVHDEZB DS    XL3                 EASI BATCH DATE                              
SNVHDTAX DS    XL4                 TAX AMOUNT IN PENNIES (FOR CK, COKE)         
SNVHDCDT DS    XP(DT02)L2          CREATION DATE                                
SNVHDREP DS    XL3                                                              
SNVHDPKG DS    XL1                                                              
         ORG   SNVHDPKG                                                         
SNVHDCT2 DS    XL1                 CONTROL BYTE2 *SPOT SYSTEM ONLY*             
SNVHDTXQ EQU   X'01'               TAX FIELD IS NET+TAX (CANADA ONLY)           
*                                                                               
SNVHDLN2 EQU   *-SNVHDELD          (AS OF 8/28/96)                              
SNVHDAP1 DS    CL3                 ALPHA PRODUCT 1                              
SNVHDAP2 DS    CL3                 ALPHA PRODUCT 2                              
SNVHDSTA DS    XL1                 STATUS                                       
SNVHDSER DS    XL2                 SERIAL NUMBER                                
         DS    XL2                 SPARE                                        
SNVHDLN3 EQU   *-SNVHDELD          (AS OF 2005-10-12)                           
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
*        EASI INVOICE ORIGIN ELEMENT                                            
***********************************************************************         
*                                                                               
SNVEOD   DSECT                                                                  
SNVEOEL  DS    X                   ELEMENT CODE                                 
SNVEOELQ EQU   X'13'                                                            
SNVEOLEN DS    X                   ELEMENT LENGTH                               
SNVEOUID DS    XL2                 USER ID                                      
SNVEOSTA DS    0XL5                STATION (IN EASI INDEX)                      
SNVEOCLL DS    XL4                 CALL LETTERS                                 
SNVEOMED DS    X                   MEDIA/BAND                                   
SNVEODAT DS    XP(DT14)L2          EASI BATCH DATE                              
SNVEOAID DS    XL8                 AGENCY ID ("21" REC, FIELD 2)                
         DS    XL2                 SPARE                                        
SNVEOLQ  EQU   *-SNVEOD                                                         
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
*        INVOICE IDENTIFICATION ELEMENT (FOR INVOICE MANAGER)                   
***********************************************************************         
*                                                                               
SNVIMIDD DSECT                                                                  
SNVIMEL  DS    XL1                 ELEMENT CODE                                 
SNVIMELQ EQU   X'15'                                                            
SNVIMLEN DS    XL1                 ELEMENT LENGTH                               
SNVIMSTA DS    CL4                 STATION                                      
SNVIMMED DS    CL2                 MEDIA                                        
SNVIMBND DS    CL2                 BAND                                         
SNVIMMOS DS    CL4                 MONTH OF SERVICE                             
SNVIMINV DS    CL10                INVOICE NUMBER                               
SNVIMVER DS    CL3                 INVOICE VERSION NUMBER                       
SNVIMLQ  EQU   *-SNVIMIDD                                                       
*                                                                               
*                                                                               
***********************************************************************         
*        INVOICE HEADER'S DETAIL ORDER ELEMMENT                                 
***********************************************************************         
*                                                                               
SNVDTELD DSECT                                                                  
SNVDTEL  DS    XL1                 ELEMENT CODE                                 
SNVDTELQ EQU   X'20'                                                            
SNVDTLEN DS    XL1                 ELEMENT LENGTH                               
*                                                                               
         DS    XL5                 SPARE (MINIO ELEMENT KEY)                    
*                                                                               
SNVDTOVQ EQU   *-SNVDTELD                                                       
SNVDTFLD DS    0C                  FIELD EQUATE LIST                            
MAXFLDEQ EQU   20                  MAXIMUM FIELD COUNT                          
*                                                                               
***********************************************************************         
*        INVOICE ORIGIN & REP INFO  ELEMMENT                                    
***********************************************************************         
*                                                                               
SNVRTELD DSECT                                                                  
SNVRTEL  DS    XL1                 ELEMENT CODE                                 
SNVRTELQ EQU   X'24'                                                            
SNVRTLEN DS    XL1                 ELEMENT LENGTH                               
*                                                                               
         DS    XL5                 SPARE (MINIO ELEMENT KEY)                    
*                                                                               
SNVRORG  DS    XL2                 ORIGIN SIGNON ID FROM INVOICE                
SNVRADV  DS    CL4                 ADVERTISER FROM CONTRACT                     
SNVRCT   DS    XL2                 COUNT OF TIMES OVERWRITTEN                   
SNVROLDS DS    CL5                 CALL LETTERS AS RECEIVED                     
SNVRDTE  DS    XL3                 DATE CONVERTED                               
         DS    CL9                 SPARE                                        
SNVRTOVQ EQU   *-SNVRTELD                                                       
*                                                                               
***********************************************************************         
*        INVOICE NUMBER ELEMENT - ONLY IN LOCAL REP INVOICES                    
***********************************************************************         
*                                                                               
SNVRINVD DSECT                                                                  
SNVRIEL  DS    XL1                 ELEMENT CODE                                 
SNVRIELQ EQU   X'25'                                                            
SNVRILEN DS    XL1                 ELEMENT LENGTH                               
*                                                                               
         DS    XL5                 SPARE (MINIO ELEMENT KEY)                    
*                                                                               
SNVRIAGN DS    CL25                AGENCY NAME                                  
SNVRISNM DS    CL25                SALESPERSON NAME                             
SNVRIANM DS    CL25                ADVERTISER NAME                              
SNVRIPNM DS    CL25                PRODUCT NAME                                 
SNVRINV# DS    CL10                INVOICE NUMBER                               
SNVRISSD DS    CL6                 SCHEDULE START DATE  YYMMDD                  
SNVRISED DS    CL6                 SCHEDULE END   DATE  YYMMDD                  
         DS    XL10                SPARE                                        
SNVRINVQ EQU   *-SNVRINVD                                                       
*                                                                               
***********************************************************************         
*        COMMERCIAL CODE TRANSLATION TABLE ELEMENT                              
***********************************************************************         
*                                                                               
SNVCMELD DSECT                                                                  
SNVCMEL  DS    XL1                 ELEMENT CODE                                 
SNVCMELQ EQU   X'30'                                                            
SNVCMLEN DS    XL1                 ELEMENT LENGTH                               
*                                                                               
SNVCMICD DS    XL1                 INTERNAL CODE FOR COMMERICAL                 
SNVCMSEQ DS    XL2                 TRAFFIC SYSTEM SEQ NUMBER                    
SNVCMFLG DS    XL1                 FLAG BYTE (MINIO ELEMENT KEY)                
* RESERVED!    X'80'               USED INTERNALLY BY MM, DO NOT USE!           
SNVCMHDQ EQU   X'01'               THIS AD-ID IS HI-DEF                         
         DS    XL1                 SPARE (MINIO ELEMENT KEY)                    
*                                                                               
SNVCMAID DS    0CL12               AD-ID                                        
SNVCMCD  DS    CL8                 COMMERCIAL CODE                              
SNVCMSUF DS    XL4                 LAST 4 OF AD-ID OR BINARY ZEROES             
SNVCMLNQ EQU   *-SNVCMELD                                                       
*                                                                               
*                                                                               
***********************************************************************         
*        INVOICE DETAIL ELEMENT                                                 
***********************************************************************         
*                                                                               
SNVIDELD DSECT                                                                  
SNVIDEL  DS    XL1                 ELEMENT CODE                                 
SNVIDELQ EQU   X'40'                                                            
SNVIDLEN DS    XL1                 ELEMENT LENGTH                               
*                                                                               
SNVIDDAY DS    XL1                 DAY-RELATIVE TO 1ST DAY OF PERIOD            
SNVIDTIM DS    XL2                 TIME OF DAY IN MINUTES (0 = 6:00A)           
SNVIDSEQ DS    XL1                 SEQ NO. TO ALLOW MULTIPLE SPOTS WITH         
*                                    SAME DAY AND TIME                          
         DS    XL1                 SPARE (MINIO ELEMENT KEY)                    
*                                    COULD BE USED FOR A FOLLOW-UP ELEM         
*                                    FOR DATA NOT NORMALLY STORED               
*                                                                               
SNVIDSLN DS    XL1                 SECONDS LENGTH                               
SNVIDPRD DS    XL1                 PRODUCT                                      
SNVIDPR2 DS    XL1                 2ND PRODUCT (IF PIGGY)                       
SNVIDEST DS    XL1                 ESTIMATE                                     
SNVIDCST DS    XL4                 COST                                         
SNVIDRSP DS    XL3                 RESPONSE COUNT                               
SNVIDCML DS    XL1                 COMMERCIAL CODE                              
SNVIDCM2 DS    XL1                 2ND CMML (IF PIGGY)                          
SNVIDCTL DS    XL1                 STATUS BYTE                                  
SNVIDICQ EQU   X'80'                 IGNORE COST                                
SNVIDSIQ EQU   X'40'                 SKIP INTERVAL CHECK                        
SNVIDEZQ EQU   X'20'                 INVOICE CONVERTED TO EASI                  
SNVIDMGQ EQU   X'10'                 MAKE GOOD                                  
SNVIDITQ EQU   X'08'                 IGNORE TIME FOR MATCH                      
SNVIDIFQ EQU   X'04'                 IGNORE FILM FOR MATCH                      
SNVIDBLQ EQU   X'02'                 BILLBOARD                                  
SNVIDNGQ EQU   X'01'                 NEGATIVE ITEM                              
SNVIDNWK DS    XL1                 NETWORK BYTE                                 
SNVIDCT2 DS    XL1                 2ND STATUS BYTE                              
SNVIDCTQ EQU   X'80'                 CONTRACT TRADE ITEM                        
SNVIDIIQ EQU   X'40'                 IGNORE INTEGRATION                         
SNVIDNIQ EQU   X'20'                 NEGATIVE INTEGRATION                       
SNVIDBON EQU   X'10'                 BONUS                                      
SNVIDMMC EQU   X'08'                 COST CHANGED BY MM                         
SNVIDEMS EQU   X'04'                 E-MAIL SENT BY MM                          
SNVIDISQ EQU   X'01'                 IGNORE SPOT LENGTH                         
*                                                                               
* MATCHMAKER INFORMATION BLOCK                                                  
*                                                                               
SNVIDMM  DS    0XL(SNVIDMLQ)                                                    
SNVIDMM1 DS    0X                  BLOCK START (TO DEFINE SNVIDMLQ EQU)         
*                                                                               
*                                  BUY DATA FOR SPOT MATCHMAKER                 
*                                                                               
SNVIDBES DS    XL1                 ESTIMATE                                     
SNVIDBLN DS    XL1                 LINE                                         
SNVIDBDT DS    XP(DT02)L2          SPOT DATE                                    
SNVIDBNO DS    XL1                 SPOT NUMBER WITHIN DATE                      
SNVIDBOR DS    XL1                 ORBIT LINE NUMBER                            
SNVIDDEM DS    XL2                 FIRST DEMO VALUE FOR MM - SPOT ONLY          
SNVIDTBL DS    XL2                 TWO BYTE LINE NUMBER                         
SNVIDLNQ EQU   *-SNVIDELD                                                       
*                                                                               
SNVIDDM4 DS    XL4                 FIRST DEMO VALUE FOR MM - 4 BYTES            
         DS    XL5                 SPARE                                        
SNVIDMLQ EQU   *-SNVIDMM1          MATCHMAKER BLOCK LENGTH                      
*                                                                               
         ORG   SNVIDBES                                                         
*                                                                               
*                                  BUY DATA FOR NET MATCHMAKER                  
*                                                                               
SNVIDUDT DS    XP(DT02)L2          UNIT DATE           (NUKDATE)                
SNVIDUTM DS    XL1                 UNIT TIME (1/4 HR)  (NUKTIME)                
SNVIDUES DS    XL1                 ESTIMATE            (NUKEST)                 
SNVIDUSB DS    XL1                 SUB LINE NO         (NUKSUB)                 
SNVIDUDP DS    XL1                 DAYPART             (NUKDP)                  
*                                                                               
SNVIDINT DS    XL4                 INTEGRATION - NET ONLY - NOT MM              
*                                                                               
SNVIDUPG DS    CL6                 PROGRAM             (NUKPROG)                
SNVIDNDM DS    XL2                 FIRST DEMO VALUE FOR MM                      
SNVIDPKG DS    XL1                 PACKAGE - NET ONLY - NOT MM                  
*                                                                               
         ORG                                                                    
*                                                                               
SNVIDFLG DS    XL1                 FLAGS                                        
SNVIDMIR EQU   X'80'               DETAIL MATCHES TO MIRROR GHOST UNIT          
*                                                                               
SNVIDL2Q EQU   *-SNVIDELD                                                       
SNVIDAP1 DS    CL3                 PRODUCT ALPHA 1                              
SNVIDAP2 DS    CL3                 PRODUCT ALPHA 2                              
SNVIDATT DS    XL2                 ATTRIBUTES                                   
SNVIDOR$ DS    XL4                 ORIGINAL COST IF CHANGED -                   
*                                     - ALL X'FF'S FOR ORIGINALLY $0            
SNVIDL3Q EQU   *-SNVIDELD          (AS OF 2005-10-12)                           
*                                                                               
* 16 BYTES BELOW ARE USED FOR DIGITAL STATIONS ONLY                             
*                                                                               
SNVIDIMP DS    XL4                 IMPRESSIONS (X'FF'S IF NO VALUE)             
SNVIDRAT DS    XL4                 RATINGS (X'FF'S IF NO VALUE)                 
SNVIDCLK DS    XL4                 CLICKS (X'FF'S IF NO VALUE)                  
         DS    XL4                 SPARE                                        
*                                                                               
SNVIDL4Q EQU   *-SNVIDELD          (AS OF 1012-10-23)                           
*                                                                               
***********************************************************************         
*        MATCHMAKER STATUS ELEMENT                                              
***********************************************************************         
*                                                                               
SNVMMELD DSECT                                                                  
SNVMMEL  DS    XL1                 ELEMENT CODE                                 
SNVMMELQ EQU   X'E8'               (SHOULD FORCE TO FF RECORD)                  
SNVMMLEN DS    XL1                 ELEMENT LENGTH                               
         DS    XL3                 SPARE (MINIO ELEMENT KEY)                    
SNVMMSEQ DS    XL2                 SEQUENCE FOR TIE-BREAKING                    
*                                                                               
SNVMMRP1 DS    CL3                 REQUESTED PRD1                               
SNVMMRP2 DS    CL3                 REQUESTED PRD2                               
SNVMMRE1 DS    XL1                 REQUESTED ESTIMATE                           
SNVMMRE2 DS    XL1                 REQUESTED ESTIMATE END                       
SNVMMRPG DS    CL1                 REQUESTED PGROUP ID (NUM IN PRD1)            
SNVMMBYR DS    XL2                 BUYER SEQUENCE NUMBE                         
SNVMMMKT DS    XL2                 MARKET                                       
SNVMMDAT DS    XP(DT02)L2          DATE OF I2                                   
SNVMMMST DS    XL1                 MATCH STATUS                                 
SNVMMSCQ EQU   X'80'                 SUCCESSFUL                                 
SNVMMIPQ EQU   X'40'                 IN PROGRESS                                
SNVMMUWQ EQU   X'20'                 UNWIRED NETWORK                            
SNVMMCMQ EQU   X'10'                 CALENDAR MONTH                             
SNVMMITQ EQU   X'08'                 INTEGRATION + TIME                         
SNVMMIOQ EQU   X'04'                 INTEGRATION ONLY                           
*                                                                               
SNVMMGN  DS    CL1                 G=GROSS,N=NET                                
SNVMMTOT DS    XL4                 TOTAL $                                      
SNVMMSPS DS    XL4                 SPOT COUNT                                   
SNVMMBK  DS    CL4                 REQUESTED QBOOK1                             
SNVMMNWK DS    CL4                 NETWORK*NEVER USE FOR SPOT                   
*                                     WITHOUT CHANGING SPLDCPTR                 
SNVMMTIM DS    XL2                 TIME OF I2 (PWOS OF HHMM)                    
SNVMMLNQ EQU   *-SNVMMEL                                                        
*                                                                               
SNVMMERR DS    XL1                 ERROR STATUS                                 
*        EQU   X'80'                 ** DON'T EVER USE **                       
*        EQU   X'40'                 ** DON'T EVER USE **                       
SNVMMFLM EQU   X'20'                 FILM ANALYSIS ERRORS                       
SNVMMHVE EQU   X'10'                 HORIZONTAL/VERTICAL ERRORS                 
SNVMMSSE EQU   X'08'                 SECONDARY SEPARATION ERRORS                
*                                                                               
         DS    XL2                 SPARE                                        
SNVMML2Q EQU   *-SNVMMEL                                                        
*                                                                               
***********************************************************************         
*        I2 REQUEST DETAILS                                                     
***********************************************************************         
*                                                                               
SNVMTELD DSECT                     MATCHMAKER TRACE ELEM                        
SNVMTEL  DS    XL1                 ELEMENT CODE                                 
SNVMTELQ EQU   X'E9'               (SHOULD FORCE TO FF RECORD)                  
SNVMTLEN DS    XL1                 ELEMENT LENGTH                               
         DS    XL3                 SPARE (MINIO ELEMENT KEY)                    
SNVMTCLT DS    CL3                 SAVED QCLT                                   
SNVMTPRD DS    CL3                 SAVED QPRD                                   
SNVMTEST DS    CL3                 SAVED QEST                                   
SNVMTMKT DS    CL4                 SAVED QMKT                                   
SNVMTSTA DS    CL5                 SAVED QSTA                                   
SNVMTPR2 DS    CL3                 SAVED PIGGY PRD                              
SNVMTINT DS    CL1                 SAVED Q2USER+2 (INTEGRATION OPT)             
*                                    I=MATCH INT, O=MATCH INT ONLY              
SNVMTCAL DS    CL1                 SAVED Q2USER+1 (CALENDAR OPT)                
*                                    B=BROADCAST, C=CALENDAR                    
SNVMTHUT DS    CL2                 SAVED QHUT                                   
SNVMTACM DS    CL1                 SAVED ASSIGNED CMML MATCH (Y/B)              
         DS    XL2                 SPARE                                        
SNVMTLNQ EQU   *-SNVMTEL                                                        
*                                                                               
***********************************************************************         
*        I2 MATCHING RECON INFO -                                               
***********************************************************************         
*                                                                               
SNVMRELD DSECT                     MATCHING RECON ELEM                          
SNVMREL  DS    XL1                 ELEMENT CODE                                 
SNVMRELQ EQU   X'EA'               (SHOULD FORCE TO FF RECORD)                  
SNVMRLEN DS    XL1                 ELEMENT LENGTH                               
         DS    XL3                 SPARE (MINIO ELEMENT KEY)                    
*                                                                               
SNVMRFDT DS    XL3                 DATE OF FIRST MATCH ATTEMPT                  
SNVMRFPC DS    XL1                 FIRST MATCH - % MATCHED (1-100)              
SNVMRLDT DS    XL3                 DATE OF LAST MATCH ATTEMPT                   
SNVMRLPC DS    XL1                 LAST MATCH - % MATCHED- 100%=DONE            
*                                                                               
SNVMRI2S DS    XL2                 NUMBER TIMES I2 WAS RUN UPDATIVE             
*                                  THESE FIELDS PERTAIN TO LAST I2              
SNVMRMAT DS    XL2                 NUMBER DETAILS MATCHED                       
SNVMRRNO DS    XL2                 NUMBER RNOS                                  
SNVMRONR DS    XL2                 NUMBER ONRS                                  
         DS    XL6                 SPARE                                        
SNVMRLNQ EQU   *-SNVMREL                                                        
*                                                                               
***********************************************************************         
*  E8/E9/EA PLACE HOLDER FOR UPDATIVE SOONS  (ELEM IS BINARY 0'S)               
***********************************************************************         
*                                                                               
*        DSECT                     E8/E9 PLACE HOLDER                           
*        DS    XL1                 ELEMENT CODE                                 
*        EQU   X'FE'               (SHOULD FORCE TO FF RECORD)                  
*                                                                               
