*          DATA SET SPGENSPCT  AT LEVEL 004 AS OF 12/02/85                      
SPCRECD  DSECT           SPOTPAK STATION PERCENT RECORD                         
*                                                                               
SPCKEY   DS    0XL13                                                            
SPCKTYP  DS    XL2'0D42'           RECORD TYPE                                  
SPCKAGMD DS    XL1                 AGENCY-MEDIA                                 
SPCKCLT  DS    XL2                 CLIENT                                       
SPCKSTA  DS    CL5                 STATION                                      
SPCKYEAR DS    XL1                 YEAR                                         
         DS    XL2                 NOT USED                                     
*                                                                               
SPCLEN   DS    XL2                                                              
SPCCNTL  DS    XL1                                                              
         DS    XL4                                                              
SPCAGYA  DS    CL2                                                              
         DS    CL2                                                              
*                                                                               
         SPACE 2                                                                
SPCEL01  DSECT                     STATION PERCENTAGES                          
         DS    XL1'01'                                                          
         DS    AL1(05)                                                          
SPCPCSEQ DS    XL1                 SEQENCE NUMBER                               
SPCPCNT  DS    XL2                 PERCENT                                      
