*          DATA SET SPGENBUYA  AT LEVEL 001 AS OF 03/03/04                      
BAKEY    DS    0CL13     V         BUY ACTIVITY KEY                             
BAKEYTYP DS    CL1       B         RECORD TYPE                                  
BAKEYTYQ EQU   X'0D'                                                            
BAKEYSUB DS    CL1       B         SUB-RECORD TYPE                              
BAKEYSBQ EQU   X'F3'                                                            
         DS    XL1                                                              
BAKEYAM  DS    XL1       B         AGENCY/MEDIA                                 
BAKEYEDT DS    XL2       B         BUYLINE END DATE                             
BAKEYSDT DS    XL2       B         BUYLINE START DATE                           
BAKEYSTA DS    XL3       B         STATION                                      
BAKEYCLT DS    XL2       B         CLIENT                                       
*                                                                               
BAKCNTRL DS    XL1       B         CONTROL BYTE                                 
BAKDA    DS    0XL4      B         DISK ADDRESS                                 
BAKEYMKT DS    XL2       B         MARKET                                       
         DS    XL2                                                              
         SPACE 2                                                                
