*          DATA SET SPGENHHUT  AT LEVEL 008 AS OF 07/01/83                      
NHHRECD  DSECT                                                                  
*                                                                               
NHHREC   DS    0C                                                               
NHHKEY   DS    0CL13                                                            
NHHKTYPE DS    XL2'0D52'           RECORD TYPE                                  
NHHKAM   DS    XL1                 AGENCY/MEDIA                                 
NHHKDATE DS    CL2                 DATE                                         
NHHKSCHM DS    CL1                 SCHEME                                       
         DS    CL7                 SPARE                                        
*                                                                               
NHHLEN   DS    XL2                 RECORD LENGTH                                
NHHSTAT  DS    XL1                 CONTROL BYTE                                 
NHHLINK  DS    XL4                                                              
NHHAGYA  DS    CL2                 ALPHA AGENCY                                 
         DS    XL2                                                              
*                                                                               
*        01 ELEMENT                                                             
*                                                                               
NHHEL01  DS    XL1'01'                                                          
         DS    XL1'08'             ELEMENT LENGTH                               
NHHACTD  DS    CL3                 LAST ACTIVITY DATE                           
NHHACT   DS    CL1                 A=ADD C=CHANGE                               
         DS    CL2                 SPARE                                        
*                                                                               
*        52 ELEMENT - % ADJUSTMENTS                                             
*                                                                               
NHHEL    DS    XL1'52'                                                          
NHHELEN  DS    XL1'18'             ELEMENT LENGTH                               
NHHADJ   DS    0CL22               ADJUSTMENT FACTORS FOR DAYPARTS              
*                                  (2 DEC PLUS OR MINUS)                        
NHHALL   DS    CL2                 ALL                                          
NHHDAY   DS    CL2                 DAYTIME                                      
NHHFRI   DS    CL2                 FRINGE                                       
NHHPRIME DS    CL2                 PRIME                                        
NHHLATE  DS    CL2                 LATE                                         
NHHKIDS  DS    CL2                 KIDS                                         
NHHSPORT DS    CL2                 SPORTS                                       
NHHYOUTH DS    CL2                 YOUTH                                        
         DS    CL6                 SPARE                                        
