*          DATA SET SPGENXRT   AT LEVEL 002 AS OF 07/07/88                      
XRTRECD  DSECT           SPOTPAK EXCHANGE RATES RECORD                          
*                                                                               
XRTKEY   DS    0XL13                                                            
XRTKTYP  DS    XL1                                                              
XRTKTYPQ EQU   X'0D'                                                            
XRTKSUB  DS    XL1                                                              
XRTKSUBQ EQU   X'4B'                                                            
XRTKAGY  DS    CL2                 AGENCY                                       
XRTKYR   DS    XL1                 YEAR                                         
         DS    XL8                                                              
*                                                                               
XRTLEN   DS    XL2                                                              
XRTCNTL  DS    XL1                                                              
XRTLINK  DS    XL8                                                              
XRTFSTEL EQU   *                                                                
*                                                                               
*                                                                               
MXREL    DSECT                     MONTHLY EXCHANGE RATES                       
MXRELCD  DS    XL1                                                              
MXRELCDQ EQU   X'01'                                                            
MXRELLN  DS    XL1                                                              
MXRMNTHS DS    XL24                12 X 2-BYTE EXCHANGE RATES N.NNNN            
MXRELLNQ EQU   *-MXREL                                                          
