*          DATA SET SPGENADD   AT LEVEL 016 AS OF 05/05/14                      
*              STATION ADDRESS RECORD                                           
         SPACE 2                                                                
ADDRREC  DS    0CL208    V         ADDRESS RECORD                               
ADDRKEY  DS    0CL15     V         KEY                                          
ADDKTYPE DS    CL1       A         RECORD TYPE (C'A')                           
ADDKTYPQ EQU   C'A'                                                             
ADDKMED  DS    CL1       A         MEDIA                                        
ADDKCALL DS    CL5       A         CALL LETTERS                                 
ADDKAGY  DS    CL2       N         AGENCY CODE                                  
ADDKFILL DS    CL6       N         6 C'0' FILL CHARACTERS                       
ADDKEYLQ EQU   *-ADDRREC                                                        
         SPACE 1                                                                
ARECL    DS    CL2       B         RECORD LENGTH                                
ACNTL    DS    CL1       B         CONTROL                                      
ANAME    DS    CL20      A         STATION NAME                                 
A1LINE   DS    CL24      A         STATION STREET ADDRESS                       
A2LINE   DS    CL24      A         CITY                                         
A3LINE   DS    CL3       A         STATE CODE                                   
AZIP     DS    CL5       N         ZIP                                          
ABIGZIP  DS    CL10      A/N       POSTAL CODE                                  
APHONE   DS    CL20                                                             
         ORG   APHONE                                                           
ADDRCOM  DS    CL35                STATION TELEPHONE                            
ADDRCHDT DS    XL3                 LAST CHANGE DATE                             
ADDRCHBY DS    XL2                 LAST CHANGED BY                              
ADRRECLQ EQU   *-ADDRREC                                                        
ADREMAIL DS    CL40                E-MAIL ADDRESS                               
A1LINE2  DS    CL24                2ND LINE FOR STREET ADDRESS                  
ADRREC2Q EQU   *-ADDRREC           NEW LEN                                      
ADRSAP   DS    CL10                SAP INTERFACE CODE                           
         DS    CL24                SPARE                                        
ADRREC3Q EQU   *-ADDRREC                                                        
