*          DATA SET SPGOLF4D   AT LEVEL 002 AS OF 03/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T202F4D      DATE 03/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7    8    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17     7   15   17  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7   32    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14     7   39   14  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14     7   53   14  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      7   67    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
XFRPERH  DS    CL8                                                              
XFRPER   DS    CL17     8   11   17  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     10   12    6  A  P H             T        Y              
XFROMKTH DS    CL8                                                              
XFROMKT  DS    CL4     10   20    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   26    7  A  P H             T        Y              
XFRODPTH DS    CL8                                                              
XFRODPT  DS    CL7     10   35    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     11   12    6  A  P H             T        Y              
XFRNMKTH DS    CL8                                                              
XFRNMKT  DS    CL4     11   20    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   26    7  A  P H             T        Y              
XFRNDPTH DS    CL8                                                              
XFRNDPT  DS    CL7     11   35    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   43    8  A  P H             T        Y              
XFRNPRDH DS    CL8                                                              
XFRNPRD  DS    CL27    11   52   27  A  U N             T        Y              
XFRDSPH  DS    CL8                                                              
XFRDSP   DS    CL76    13    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    14    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    15    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    16    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    17    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    18    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    19    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    20    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    21    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    22    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    23    2   76  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    24    2   76  A  P H             T        Y              
XFRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
XFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1376 BYTES                            
