*          DATA SET SPGOLFFD   AT LEVEL 002 AS OF 03/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T202FFD      DATE 03/28/96                 
         SPACE 1                                                                
T202FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
GOLMSGH  DS    CL8                                                              
GOLMSG   DS    CL60     1    2   60  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      3    2    8  A  P H             T        Y              
GOLMDH   DS    CL8                                                              
GOLMD    DS    CL4      3   11    4  A  U N             T    I   Y              
GOLMDNMH DS    CL8                                                              
GOLMDNM  DS    CL20     3   17   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      3   39    7  A  P H             T        Y              
GOLPLNRH DS    CL8                                                              
GOLPLNR  DS    CL12     3   47   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      4    2    8  A  P H             T        Y              
GOLCLH   DS    CL8                                                              
GOLCL    DS    CL4      4   11    4  A  U N             T        Y              
GOLCLNMH DS    CL8                                                              
GOLCLNM  DS    CL20     4   17   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      4   39    7  A  P H             T        Y              
GOLPRH   DS    CL8                                                              
GOLPR    DS    CL7      4   47    7  A  U N             T        Y              
GOLPRNMH DS    CL8                                                              
GOLPRNM  DS    CL20     4   56   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      5    2    8  A  P H             T        Y              
GOLESH   DS    CL8                                                              
GOLES    DS    CL4      5   11    4  A  U N             T        Y              
GOLESNMH DS    CL8                                                              
GOLESNM  DS    CL20     5   17   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   39    7  A  P N             T        Y              
GOLTGH   DS    CL8                                                              
GOLTG    DS    CL7      5   47    7  A  U N             T        Y              
GOLTGNMH DS    CL8                                                              
GOLTGNM  DS    CL15     5   56   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
GOLOPTSH DS    CL8                                                              
GOLOPTS  DS    CL50     6   11   50  A  U N             T        Y              
GOLACTNH DS    CL8                                                              
GOLACTN  DS    CL6      7    2    6  A  P H             T        Y              
GOLMRKTH DS    CL8                                                              
GOLMRKT  DS    CL7      7    8    7  A  P H             T        Y              
GOLMKNMH DS    CL8                                                              
GOLMKNM  DS    CL17     7   15   17  A  P H             T        Y              
GOLDPTH  DS    CL8                                                              
GOLDPT   DS    CL7      7   32    7  A  P H             T        Y              
GOLDOLLH DS    CL8                                                              
GOLDOLL  DS    CL14     7   39   14  A  P H             T        Y              
GOLPTSH  DS    CL8                                                              
GOLPTS   DS    CL14     7   53   14  A  P H             T        Y              
GOLPERDH DS    CL8                                                              
GOLPERD  DS    CL6      7   67    6  A  P H             T        Y              
GOLACT0H DS    CL8                                                              
GOLACT0  DS    CL3      8    2    3  A  P N             T        Y              
GOLMKT0H DS    CL8                                                              
GOLMKT0  DS    CL4      8    9    4  A  P N             T        Y              
GOLDPT0H DS    CL8                                                              
GOLDPT0  DS    CL6      8   32    6  A  P N             T        Y              
GOLPER0H DS    CL8                                                              
GOLPER0  DS    CL13     8   67   13  A  P N             T        Y              
GOLACT1H DS    CL8                                                              
GOLACT1  DS    CL3      9    2    3  A  U N             T        Y              
GOLMKT1H DS    CL8                                                              
GOLMKT1  DS    CL4      9    9    4  A  U N             T        Y              
GOLNAM1H DS    CL8                                                              
GOLNAM1  DS    CL16     9   15   16  A  P N             T        Y              
GOLDPT1H DS    CL8                                                              
GOLDPT1  DS    CL6      9   32    6  A  U N             T        Y              
GOLDOL1H DS    CL8                                                              
GOLDOL1  DS    CL11     9   40   11  A  U N             T        Y              
GOLPTS1H DS    CL8                                                              
GOLPTS1  DS    CL11     9   54   11  A  U N             T        Y              
GOLPER1H DS    CL8                                                              
GOLPER1  DS    CL13     9   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    10   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    10   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     11    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    11   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    12   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    12   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    13   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    13   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    14   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    14   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    15   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    15   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    16   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    16   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    17   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    17   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    18   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    18   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    19   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    19   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    20   67   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21    9    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    21   15   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   32    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   40   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   54   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   67   13  A  U N             T        Y              
GOLLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
GOLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2296 BYTES                            
