*          DATA SET SPINVFFD   AT LEVEL 015 AS OF 05/19/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T206FFD      DATE 05/19/94                 
         SPACE 1                                                                
T206FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ICSMSGH  DS    CL8                                                              
ICSMSG   DS    CL60     1    2   60  A  P N             T        Y              
ICSSRVH  DS    CL8                                                              
ICSSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      2    1    5  A  P N             T        Y              
ICSMEDH  DS    CL8                                                              
ICSMED   DS    CL1      2    9    1  A  U N             T    I   Y              
ICSMEDNH DS    CL8                                                              
ICSMEDN  DS    CL10     2   13   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      2   36    7  A  P N             T        Y              
ICSSTAH  DS    CL8                                                              
ICSSTA   DS    CL8      2   45    8  A  U N             T        Y              
ICSMKTNH DS    CL8                                                              
ICSMKTN  DS    CL24     2   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      3    1    6  A  P N             T        Y              
ICSCLTH  DS    CL8                                                              
ICSCLT   DS    CL3      3    9    3  A  U N             T        Y              
ICSCLTNH DS    CL8                                                              
ICSCLTN  DS    CL20     3   13   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      3   36    6  A  P N             T        Y              
ICSACTH  DS    CL8                                                              
ICSACT   DS    CL8      3   45    8  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL7      3   54    7  A  P N             T        Y              
ICSOPTNH DS    CL8                                                              
ICSOPTN  DS    CL18     3   62   18  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      4    1    7  A  P N             T        Y              
ICSREQH  DS    CL8                                                              
ICSREQ   DS    CL44     4    9   44  A  U N             T        Y              
ICSINVWH DS    CL8                                                              
ICSINVW  DS    CL7      4   54    7  A  P N             T        Y              
ICSINVH  DS    CL8                                                              
ICSINV   DS    CL18     4   62   18  A  P N             T        Y              
ICSBLRWH DS    CL8                                                              
ICSBLRW  DS    CL7      5    1    7  A  P N             T        Y              
ICSBLRH  DS    CL8                                                              
ICSBLR   DS    CL20     5    9   20  A  P N             T        Y              
ICSHD1H  DS    CL8                                                              
ICSHD1   DS    CL36     6    2   36  A  P N             T        Y              
ICSHD2H  DS    CL8                                                              
ICSHD2   DS    CL7      6   40    7  A  P N             T        Y              
ICSFCHDH DS    CL8                                                              
ICSFCHD  DS    CL10     6   53   10  A  P N             T        Y              
ICSDATH  DS    CL8                                                              
ICSDAT   DS    CL8      7    2    8  A  U N             T        Y              
ICSTIMH  DS    CL8                                                              
ICSTIM   DS    CL6      7   13    6  A  U N             T        Y              
ICSLENH  DS    CL8                                                              
ICSLEN   DS    CL3      7   23    3  A  U N             T        Y              
ICSPRDH  DS    CL8                                                              
ICSPRD   DS    CL7      7   30    7  A  U N             T        Y              
ICSCOSTH DS    CL8                                                              
ICSCOST  DS    CL12     7   40   12  A  U N             T        Y              
ICSFILMH DS    CL8                                                              
ICSFILM  DS    CL21     7   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     8   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     9   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    10   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    12   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    13   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    14   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    15   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    16   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    17   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    18   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    19   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    20   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    21   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    22   54   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   13    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   30    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   40   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    23   54   21  A  U N             T        Y              
ICSDMYH  DS    CL8                                                              
ICSDMY   DS    CL1     23   79    1  A  U N             T        Y              
ICSFOOTH DS    CL8                                                              
ICSFOOT  DS    CL60    24    2   60  A  P N             T        Y              
ICSRCODH DS    CL8                                                              
ICSRCOD  DS    CL1     24   79    1  A  U N             T        Y              
ICSLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
ICSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2488 BYTES                            
