*          DATA SET SPLFMB4D   AT LEVEL 007 AS OF 07/11/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219B4D      DATE 07/11/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     7    2   17  A  P N             T        Y              
CGRLISTH DS    CL8                                                              
CGRLIST  DS    CL5      9    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9    8    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   14    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   26    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   32    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   44    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   50    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   56    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   62    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   68    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   74    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    8    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   14    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   26    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   32    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   44    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   50    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   56    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   62    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   68    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   74    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    8    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   14    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   26    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   32    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   44    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   50    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   56    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   62    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   68    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   74    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    8    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   14    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   26    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   32    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   44    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   50    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   56    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   62    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   68    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   74    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    8    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   14    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   26    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   32    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   44    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   50    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   56    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   62    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   68    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   74    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    8    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   14    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   26    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   32    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   44    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   50    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   56    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   62    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   68    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   74    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    8    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   14    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   26    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   32    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   44    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   50    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   56    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   62    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   68    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   74    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23    8    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   14    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   26    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   32    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   44    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   50    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   56    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   62    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   68    5  A  P N             T        Y              
CGRCLTLH DS    CL8                                                              
CGRCLTL  DS    CL5     23   74    5  A  P N             T        Y              
CGRLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
CGRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1384 BYTES                            
