*          DATA SET SPLFME6D   AT LEVEL 005 AS OF 07/31/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219E6D      DATE 07/31/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DEM1H    DS    CL8                                                              
DEM1     DS    CL7      7    2    7  A   P    N         T        Y              
DEMF1H   DS    CL8                                                              
DEMF1    DS    CL10     7   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     7   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     7   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     7   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   70   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19   10   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   22    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19   30   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   42    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19   50   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   62    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19   70   10  A   U    N         T        Y              
DEMTABH  DS    CL8                                                              
DEMTAB   DS    CL1     21   10    1  A   U    N         T        Y              
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1728 BYTES                            
