*          DATA SET SPLFMD6D   AT LEVEL 004 AS OF 06/09/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219D6D      DATE 06/09/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      7    2    8  A   P    N         T        Y              
TALDATH  DS    CL8                                                              
TALDAT   DS    CL8      7   12    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A   P    N         T        Y              
TALFCTH  DS    CL8                                                              
TALFCT   DS    CL6      8   12    6  A   U    N         T        Y              
TALTABH  DS    CL8                                                              
TALTAB   DS    CL1      9   12    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL36    11    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    11   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    12    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    12   41   36  A   P    N         T        Y              
TALPER1H DS    CL8                                                              
TALPER1  DS    CL36    13    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    13   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    14    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    14   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    15    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    15   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    16    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    16   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    17    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    17   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    18    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    18   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    19    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    19   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    20    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    20   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    21    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    21   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    22    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    22   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    23    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    23   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    24    2   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    24   41   36  A   P    N         T        Y              
TALLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
TALWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
