*          DATA SET SPLFMD1D   AT LEVEL 025 AS OF 11/02/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219D1D      DATE 11/02/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
CL2NAMEH DS    CL8                                                              
CL2NAME  DS    CL20     7   17   20  A  P N             T        Y              
CL2FRSTH DS    CL8                                                              
CL2FRST  DS    CL21     9    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     9   48   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    10    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    10   48   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11   48   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    12    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    12   48   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    13    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    13   48   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    14    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    14   48   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    15    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    15   48   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    16    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   24    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    16   48   21  A  P N             T        Y              
CL2LSTH  DS    CL8                                                              
CL2LST   DS    CL8     16   70    8  A  U N             T        Y              
CL2LAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
CL2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
