*          DATA SET SPLFME1D   AT LEVEL 004 AS OF 04/26/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219E1D      DATE 04/26/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
STAMKTH  DS    CL8                                                              
STAMKT   DS    CL4      7   19    4  N  U N             T        Y              
STAMKNMH DS    CL8                                                              
STAMKNM  DS    CL24     7   30   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
STAPAYRH DS    CL8                                                              
STAPAYR  DS    CL3      9   19    3  A  U N             T        Y              
STAPRNMH DS    CL8                                                              
STAPRNM  DS    CL22     9   30   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
STATSHRH DS    CL8                                                              
STATSHR  DS    CL3     10   19    3  A  U N             T        Y              
STATSNMH DS    CL8                                                              
STATSNM  DS    CL22    10   30   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
STATRARH DS    CL8                                                              
STATRAR  DS    CL3     11   19    3  A  U N             T        Y              
STATANMH DS    CL8                                                              
STATANM  DS    CL22    11   30   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
STATYPEH DS    CL8                                                              
STATYPE  DS    CL3     12   19    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   41   11  A  P N             T        Y              
STANTISH DS    CL8                                                              
STANTIS  DS    CL4     12   58    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
STACHANH DS    CL8                                                              
STACHAN  DS    CL4     13   19    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   41   11  A  P N             T        Y              
STANETAH DS    CL8                                                              
STANETA  DS    CL4     13   58    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
STATWIXH DS    CL8                                                              
STATWIX  DS    CL20    14   19   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   41   10  A  P N             T        Y              
STAFAXH  DS    CL8                                                              
STAFAX   DS    CL12    14   58   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15    2    9  A  P N             T        Y              
STATBNKH DS    CL8                                                              
STATBNK  DS    CL10    15   19   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   41    8  A  P N             T        Y              
STATAXH  DS    CL8                                                              
STATAX   DS    CL6     15   58    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16    2    4  A  P N             T        Y              
STASIZEH DS    CL8                                                              
STASIZE  DS    CL1     16   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   41    7  A  P N             T        Y              
STACOUNH DS    CL8                                                              
STACOUN  DS    CL3     16   58    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    17    2   15  A  P N             T        Y              
STACTXH  DS    CL8                                                              
STACTX   DS    CL5     17   19    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   41   11  A  P N             T        Y              
STAFEEH  DS    CL8                                                              
STAFEE   DS    CL5     17   58    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
STAGSTH  DS    CL8                                                              
STAGST   DS    CL1     18   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   41    8  A  P N             T        Y              
STABKTYH DS    CL8                                                              
STABKTY  DS    CL1     18   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
STAPSTH  DS    CL8                                                              
STAPST   DS    CL60    19   19   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   79    1  A  U N             T        Y              
STALAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
STAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
