*          DATA SET SPLFMCAD   AT LEVEL 004 AS OF 01/24/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219CAD      DATE 01/24/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL19     7    2   19  A  P N             T        Y              
GFEDBCH  DS    XL8                                                              
GFEDBC   DS    CL2      7   22    2  A  U N             T        Y   10         
GFEDBCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
GFEPRCH  DS    XL8                                                              
GFEPRC   DS    CL4      8   22    4  A  U N             T        Y   20         
GFEPRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
GFEGFNH  DS    XL8                                                              
GFEGFN   DS    CL3      9   22    3  A  U N             T        Y   30         
GFEGFNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
GFEGFSH  DS    XL8                                                              
GFEGFS   DS    CL3     10   22    3  A  U N             T        Y   40         
GFEGFSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    11    2   18  A  P N             T        Y              
GFEBAGYH DS    XL8                                                              
GFEBAGY  DS    CL8     11   22    8  A  U N             T        Y   50         
GFEBAGYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    12    2   18  A  P N             T        Y              
GFEEXPTH DS    XL8                                                              
GFEEXPT  DS    CL6     12   22    6  A  U N             T        Y   60         
GFEEXPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    13    2   19  A  P N             T        Y              
GFEPRIDH DS    XL8                                                              
GFEPRID  DS    CL10    13   22   10  A  U N             T        Y   70         
GFEPRIDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    14    2   18  A  P N             T        Y              
GFECAGYH DS    XL8                                                              
GFECAGY  DS    CL8     14   22    8  A  U N             T        Y   80         
GFECAGYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    15    2   18  A  P N             T        Y              
GFESAGYH DS    XL8                                                              
GFESAGY  DS    CL8     15   22    8  A  U N             T        Y   90         
GFESAGYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    16    2   19  A  P N             T        Y              
GFEREQNH DS    XL8                                                              
GFEREQN  DS    CL20    16   22   20  A  U N             T        Y  100         
GFEREQNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    17    2   18  A  P N             T        Y              
GFETMKTH DS    XL8                                                              
GFETMKT  DS    CL1     17   22    1  A  U N             T        Y  110         
GFETMKTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    18    2   19  A  P N             T        Y              
GFEDEALH DS    XL8                                                              
GFEDEAL  DS    CL10    18   22   10  A  U N             T        Y  120         
GFEDEALX DS    XL8                                                              
GFETAGH  DS    XL8                                                              
GFETAG   DS    CL1     20   22    1  A  U N             T        Y              
GFELAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
GFEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 592  BYTES                            
