*          DATA SET SPLFMC3D   AT LEVEL 006 AS OF 07/28/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219C3D      DATE 07/28/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      7   65    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL36     8   15   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   55    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   65    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   10    3  A  P N             T        Y              
HUTJAN1H DS    CL8                                                              
HUTJAN1  DS    CL6      9   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   45    6  A  U N             T        Y              
HUTMTH1H DS    CL8                                                              
HUTMTH1  DS    CL8      9   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   45    6  A  U N             T        Y              
HUTMTH2H DS    CL8                                                              
HUTMTH2  DS    CL8     10   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   55    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   55    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   55    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   25    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   35    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   45    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   55    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   65    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
HUTSPECH DS    CL8                                                              
HUTSPEC  DS    CL22    22   10   22  A  U N             T        Y              
HUTACTH  DS    CL8                                                              
HUTACT   DS    CL30    22   35   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   10    1  A  U N             T        Y              
HUTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
HUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1240 BYTES                            
