*          DATA SET SPLFMF4D   AT LEVEL 005 AS OF 12/02/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219F4D      DATE 12/02/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     7    2   13  A  P N             T        Y              
PGDBK1H  DS    CL8                                                              
PGDBK1   DS    CL12     7   17   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   35    6  A  P N             T        Y              
PGDLN1H  DS    CL8                                                              
PGDLN1   DS    CL1      7   43    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
PGDBK2H  DS    CL8                                                              
PGDBK2   DS    CL12     8   17   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   35    6  A  P N             T        Y              
PGDLN2H  DS    CL8                                                              
PGDLN2   DS    CL1      8   43    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   46    1  A  U N             T        Y              
PGDLISTH DS    CL8                                                              
PGDLIST  DS    CL72    10    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    11    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    12    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    13    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    14    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    15    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    16    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    17    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    18    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    19    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    20    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    21    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    22    2   72  A  P N             T        Y              
PGDLLSTH DS    CL8                                                              
PGDLLST  DS    CL72    23    2   72  A  P N             T        Y              
PGDLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
PGDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1264 BYTES                            
