*          DATA SET SPLFMC8D   AT LEVEL 006 AS OF 04/04/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219C8D      DATE 04/04/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL21     7    2   21  A  P N             T        Y              
PGECHRH  DS    XL8                                                              
PGECHR   DS    CL3      7   25    3  A  U N             T        Y   10         
PGECHRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21     8    2   21  A  P N             T        Y              
PGEACCH  DS    XL8                                                              
PGEACC   DS    CL6      8   25    6  A  U N             T        Y   20         
PGEACCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21     9    2   21  A  P N             T        Y              
PGEBRNH  DS    XL8                                                              
PGEBRN   DS    CL4      9   25    4  A  U N             T        Y   30         
PGEBRNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    10    2   21  A  P N             T        Y              
PGEESTH  DS    XL8                                                              
PGEEST   DS    CL4     10   25    4  A  U N             T        Y   40         
PGEESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    11    2   21  A  P N             T        Y              
PGEEVTH  DS    XL8                                                              
PGEEVT   DS    CL6     11   25    6  A  U N             T        Y   50         
PGEEVTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    12    2   21  A  P N             T        Y              
PGEMBFH  DS    XL8                                                              
PGEMBF   DS    CL1     12   25    1  A  U N             T        Y   60         
PGEMBFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    13    2   21  A  P N             T        Y              
PGENOBH  DS    XL8                                                              
PGENOB   DS    CL1     13   25    1  A  U N             T        Y   70         
PGENOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    14    2   21  A  P N             T        Y              
PGEENDH  DS    XL8                                                              
PGEEND   DS    CL8     14   25    8  A  U N             T        Y   80         
PGEENDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    15    2   21  A  P N             T        Y              
PGEXFRH  DS    XL8                                                              
PGEXFR   DS    CL3     15   25    3  A  U N             T        Y   90         
PGEXFRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    16    2   21  A  P N             T        Y              
PGESUFH  DS    XL8                                                              
PGESUF   DS    CL2     16   25    2  A  U N             T        Y  100         
PGESUFX  DS    XL8                                                              
PGETAGH  DS    XL8                                                              
PGETAG   DS    CL1     18   25    1  A  U N             T        Y              
PGELAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PGEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 504  BYTES                            
