*          DATA SET SPLFMFED   AT LEVEL 002 AS OF 09/29/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219FED      DATE 09/29/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
DEM1H    DS    CL8                                                              
DEM1     DS    CL4      7    6    4   A    P    N         T         Y           
DEMF1H   DS    CL8                                                              
DEMF1    DS    CL7      7   11    7   A    U    N         T         Y           
DEM2H    DS    CL8                                                              
DEM2     DS    CL21     7   24   21   A    P    N         T         Y           
DEMF2H   DS    CL8                                                              
DEMF2    DS    CL3      7   46    3   A    U    N         T         Y           
DEM3H    DS    CL8                                                              
DEM3     DS    CL13     7   55   13   A    P    N         T         Y           
DEMF3H   DS    CL8                                                              
DEMF3    DS    CL7      7   69    7   A    U    N         T         Y           
DEM4H    DS    CL8                                                              
DEM4     DS    CL78     9    2   78   A    P    N         T         Y           
DEM5H    DS    CL8                                                              
DEM5     DS    CL78    10    2   78   A    P    N         T         Y           
DEM6H    DS    CL8                                                              
DEM6     DS    CL78    11    2   78   A    P    N         T         Y           
DEM7H    DS    CL8                                                              
DEM7     DS    CL78    12    2   78   A    P    N         T         Y           
DEM8H    DS    CL8                                                              
DEM8     DS    CL78    13    2   78   A    P    N         T         Y           
DEM9H    DS    CL8                                                              
DEM9     DS    CL78    14    2   78   A    P    N         T         Y           
DEM10H   DS    CL8                                                              
DEM10    DS    CL78    15    2   78   A    P    N         T         Y           
DEM11H   DS    CL8                                                              
DEM11    DS    CL78    16    2   78   A    P    N         T         Y           
DEM12H   DS    CL8                                                              
DEM12    DS    CL78    17    2   78   A    P    N         T         Y           
DEM13H   DS    CL8                                                              
DEM13    DS    CL78    18    2   78   A    P    N         T         Y           
DEM14H   DS    CL8                                                              
DEM14    DS    CL78    19    2   78   A    P    N         T         Y           
DEM15H   DS    CL8                                                              
DEM15    DS    CL78    20    2   78   A    P    N         T         Y           
DEM16H   DS    CL8                                                              
DEM16    DS    CL78    21    2   78   A    P    N         T         Y           
DEM17H   DS    CL8                                                              
DEM17    DS    CL78    22    2   78   A    P    N         T         Y           
DEMTABH  DS    CL8                                                              
DEMTAB   DS    CL1     23    2    1   A    U    N         T         Y           
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1319 BYTES                            
