*          DATA SET SPLFMFCD   AT LEVEL 007 AS OF 03/29/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219FCD      DATE 03/29/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ESTKEX2H DS    CL8                                                              
ESTKEX2  DS    CL52     7   30   52  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
ESTPRD1H DS    CL8                                                              
ESTPRD1  DS    CL3      9   17    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   23    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   29    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   41    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   53    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   59    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   65    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   71    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   17    1  A  U N             T        Y              
ESTDSPH  DS    CL8                                                              
ESTDSP   DS    CL80    11    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    12    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    13    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    14    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    15    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    16    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    17    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    18    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    19    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    20    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    21    1   80  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80    22    1   80  A  P N             T        Y              
ESTLSTH  DS    CL8                                                              
ESTLST   DS    CL80    23    1   80  A  P N             T        Y              
ESTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1352 BYTES                            
