*          DATA SET SPLFMB3D   AT LEVEL 022 AS OF 05/03/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219B3D      DATE 05/03/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
ESTDESCH DS    CL8                                                              
ESTDESC  DS    CL20     7   17   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
ESTSTRDH DS    CL8                                                              
ESTSTRD  DS    CL9      8   17    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   31    8  A  P N             T        Y              
ESTENDDH DS    CL8                                                              
ESTENDD  DS    CL9      8   44    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL33    10    8   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   56    4  A  P N             T        Y              
ESTAUTHH DS    CL8                                                              
ESTAUTH  DS    CL3     11    2    3  A  P N             T        Y              
ESTAJANH DS    CL8                                                              
ESTAJAN  DS    CL10    11   12   10  A  U N             T        Y              
ESTOJANH DS    CL8                                                              
ESTOJAN  DS    CL10    11   31   10  A  P N             T        Y              
ESTPJANH DS    CL8                                                              
ESTPJAN  DS    CL10    11   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
ESTAFEBH DS    CL8                                                              
ESTAFEB  DS    CL10    12   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
ESTAMARH DS    CL8                                                              
ESTAMAR  DS    CL10    13   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
ESTAAPRH DS    CL8                                                              
ESTAAPR  DS    CL10    14   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
ESTAMAYH DS    CL8                                                              
ESTAMAY  DS    CL10    15   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
ESTAJUNH DS    CL8                                                              
ESTAJUN  DS    CL10    16   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
ESTAJULH DS    CL8                                                              
ESTAJUL  DS    CL10    17   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
ESTAAUGH DS    CL8                                                              
ESTAAUG  DS    CL10    18   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
ESTASEPH DS    CL8                                                              
ESTASEP  DS    CL10    19   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
ESTAOCTH DS    CL8                                                              
ESTAOCT  DS    CL10    20   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
ESTANOVH DS    CL8                                                              
ESTANOV  DS    CL10    21   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
ESTADECH DS    CL8                                                              
ESTADEC  DS    CL10    22   12   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     24    2    5  A  P N             T        Y              
ESTATOTH DS    CL8                                                              
ESTATOT  DS    CL10    24   12   10  A  P N             T        Y              
ESTOTOTH DS    CL8                                                              
ESTOTOT  DS    CL10    24   31   10  A  P N             T        Y              
ESTPTOTH DS    CL8                                                              
ESTPTOT  DS    CL10    24   50   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   79    1  A  U N             T        Y              
ESTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1032 BYTES                            
