*          DATA SET SPLFMF7D   AT LEVEL 002 AS OF 09/29/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219F7D      DATE 09/29/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    N         T         Y           
LFMBK1H  DS    CL8                                                              
LFMBK1   DS    CL12     7   11   12   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL4      7   33    4   A    P    N         T         Y           
LFMNM1H  DS    CL8                                                              
LFMNM1   DS    CL24     7   39   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      8    2    7   A    P    N         T         Y           
LFMBK2H  DS    CL8                                                              
LFMBK2   DS    CL12     8   11   12   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL4      8   33    4   A    P    N         T         Y           
LFMNM2H  DS    CL8                                                              
LFMNM2   DS    CL24     8   39   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9    2    7   A    P    N         T         Y           
LFMBK3H  DS    CL8                                                              
LFMBK3   DS    CL12     9   11   12   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL4      9   33    4   A    P    N         T         Y           
LFMNM3H  DS    CL8                                                              
LFMNM3   DS    CL24     9   39   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    10    2   18   A    P    N         T         Y           
LFMLACCH DS    CL8                                                              
LFMLACC  DS    CL4     10   25    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14    12    2   14   A    P    N         T         Y           
LFMMKT1H DS    CL8                                                              
LFMMKT1  DS    CL4     12   18    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     12   25    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     12   32    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     12   39    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     12   46    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     12   53    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     12   60    4   A    U    N         T         Y           
LFMMKTXH DS    CL8                                                              
LFMMKTX  DS    CL4     12   67    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     12   74    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    14    2   16   A    P    N         T         Y           
LFMLST1H DS    CL8                                                              
LFMLST1  DS    CL75    16    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    17    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    18    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    19    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    20    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    21    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    22    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    23    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    24    2   75   A    P    N         T         Y           
LFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
LFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1176 BYTES                            
