*          DATA SET SPLFME9D   AT LEVEL 002 AS OF 09/29/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219E9D      DATE 09/29/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL15     7    2   15   A    P    N         T         Y           
UNINAM1H DS    CL8                                                              
UNINAM1  DS    CL8      9    2    8   A    P    N         T         Y           
UNIFLD1H DS    CL8                                                              
UNIFLD1  DS    CL7      9   11    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9   31    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9   51    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10   11    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10   31    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10   51    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   11    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   31    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   51    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   11    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   31    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   51    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   11    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   31    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   51    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14   11    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14   31    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14   51    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15   11    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15   31    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     15   51    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     16   11    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     18    2    7   A    P    N         T         Y           
UNISPECH DS    CL8                                                              
UNISPEC  DS    CL7     18   10    7   A    U    N         T         Y           
UNIACTVH DS    CL8                                                              
UNIACTV  DS    CL50    18   22   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     20    2    7   A    P    N         T         Y           
UNIDESCH DS    CL8                                                              
UNIDESC  DS    CL60    20   10   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     20   78    1   A    U    N         T         Y           
UNILAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
UNIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 888  BYTES                            
