*          DATA SET SPLFMEFD   AT LEVEL 001 AS OF 08/04/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219EFD      DATE 08/04/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7   35    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL22     7   44   22  A   P    N         T        Y              
SPLAM1H  DS    CL8                                                              
SPLAM1   DS    CL7      8    2    7  A   U    N         T        Y              
SPLAMN1H DS    CL8                                                              
SPLAMN1  DS    CL20     8   10   20  A   P    N         T        Y              
SPLOS1H  DS    CL8                                                              
SPLOS1   DS    CL4      8   35    4  A   U    N         T        Y              
SPLRM1H  DS    CL8                                                              
SPLRM1   DS    CL35     8   44   35  A   P    N         T        Y              
SPLAM2H  DS    CL8                                                              
SPLAM2   DS    CL7      9    2    7  A   U    N         T        Y              
SPLAMN2H DS    CL8                                                              
SPLAMN2  DS    CL20     9   10   20  A   P    N         T        Y              
SPLOS2H  DS    CL8                                                              
SPLOS2   DS    CL4      9   35    4  A   U    N         T        Y              
SPLRM2H  DS    CL8                                                              
SPLRM2   DS    CL35     9   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    10   10   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     10   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    10   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    11   10   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     11   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    11   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    12   10   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    12   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    13   10   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    13   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14   10   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    14   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15   10   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    15   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16   10   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    16   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    17   10   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    17   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    18   10   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL35    18   44   35  A   P    N         T        Y              
SPLAMLH  DS    CL8                                                              
SPLAML   DS    CL7     19    2    7  A   U    N         T        Y              
SPLAMNLH DS    CL8                                                              
SPLAMNL  DS    CL20    19   10   20  A   P    N         T        Y              
SPLOSLH  DS    CL8                                                              
SPLOSL   DS    CL4     19   35    4  A   U    N         T        Y              
SPLRMLH  DS    CL8                                                              
SPLRML   DS    CL35    19   44   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20    9    1  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1248 BYTES                            
