*          DATA SET SPLFME4D   AT LEVEL 001 AS OF 08/04/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219E4D      DATE 08/04/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     7    2   11  A   P    N         T        Y              
MARNAMEH DS    CL8                                                              
MARNAME  DS    CL24     7   19   24  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A   P    N         T        Y              
MARTZONH DS    CL8                                                              
MARTZON  DS    CL1      8   19    1  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16     9    2   16  A   P    N         T        Y              
MARRANKH DS    CL8                                                              
MARRANK  DS    CL3      9   19    3  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    10    2   16  A   P    N         T        Y              
MARHOMSH DS    CL8                                                              
MARHOMS  DS    CL8     10   19    8  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   P    N         T        Y              
MARNTAH  DS    CL8                                                              
MARNTA   DS    CL2     11   19    2  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    12    2   16  A   P    N         T        Y              
MARWTH   DS    CL8                                                              
MARWT    DS    CL5     12   19    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    13    2   16  A   P    N         T        Y              
MARSHRH  DS    CL8                                                              
MARSHR   DS    CL5     13   19    5  A   U    N         T        Y              
MARRST1H DS    CL8                                                              
MARRST1  DS    CL16    14    2   16  A   P    N         T        Y              
MARRSM1H DS    CL8                                                              
MARRSM1  DS    CL4     14   19    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   26   12  A   P    N         T        Y              
MARSCL1H DS    CL8                                                              
MARSCL1  DS    CL1     14   39    1  N   U    N         T        Y              
MARRST2H DS    CL8                                                              
MARRST2  DS    CL16    15    2   16  A   P    N         T        Y              
MARRSM2H DS    CL8                                                              
MARRSM2  DS    CL4     15   19    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   26   12  A   P    N         T        Y              
MARSCL2H DS    CL8                                                              
MARSCL2  DS    CL1     15   39    1  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  A   P    N         T        Y              
MARLOCKH DS    CL8                                                              
MARLOCK  DS    CL3     16   19    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    17    2   16  A   P    N         T        Y              
MARDSTH  DS    CL8                                                              
MARDST   DS    CL1     17   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    18    2   16  A   P    N         T        Y              
MARMKTSH DS    CL8                                                              
MARMKTS  DS    CL35    18   19   35  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   19    1  A   U    N         T        Y              
MARLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
MARWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 528  BYTES                            
