*          DATA SET SPLFMFAD   AT LEVEL 003 AS OF 11/17/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219FAD      DATE 11/17/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SUBMDTSH DS    CL8                                                              
SUBMDTS  DS    CL50     7   28   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  A   P    N         T        Y              
SUBEST1H DS    CL8                                                              
SUBEST1  DS    CL4     11    3    4  A   U    N         T        Y              
SUBDSC1H DS    CL8                                                              
SUBDSC1  DS    CL20    11   11   20  A   U    N         T        Y              
SUBSDT1H DS    CL8                                                              
SUBSDT1  DS    CL9     11   35    9  A   U    N         T        Y              
SUBEDT1H DS    CL8                                                              
SUBEDT1  DS    CL9     11   48    9  A   U    N         T        Y              
SUBRTG1H DS    CL8                                                              
SUBRTG1  DS    CL7     11   61    7  A   U    N         T        Y              
SUBHUT1H DS    CL8                                                              
SUBHUT1  DS    CL8     11   72    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12    3    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    12   11   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     12   35    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     12   48    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   72    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13    3    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    13   11   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     13   35    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     13   48    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   72    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14    3    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14   11   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     14   35    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     14   48    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   72    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15    3    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15   11   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     15   35    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     15   48    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   72    8  A   U    N         T        Y              
SUBENDH  DS    CL8                                                              
SUBEND   DS    CL1     16    3    1  A   U    N         T        Y              
SUBLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
SUBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 681  BYTES                            
