*          DATA SET SPLFMF3D   AT LEVEL 013 AS OF 01/07/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219F3D      DATE 01/07/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
ESTDESCH DS    CL8                                                              
ESTDESC  DS    CL20     7   17   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   41    6  A  P N             T        Y              
ESTSTATH DS    CL8                                                              
ESTSTAT  DS    CL8      7   53    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
ESTSTRDH DS    CL8                                                              
ESTSTRD  DS    CL9      8   17    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   41    8  A  P N             T        Y              
ESTENDDH DS    CL8                                                              
ESTENDD  DS    CL9      8   53    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    10    2   29  A  P N             T        Y              
ESTBBASH DS    CL8                                                              
ESTBBAS  DS    CL5     10   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   39    8  A  P N             T        Y              
ESTCPCTH DS    CL8                                                              
ESTCPCT  DS    CL8     10   48    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   58   10  A  P N             T        Y              
ESTCBASH DS    CL8                                                              
ESTCBAS  DS    CL5     10   69    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
ESTDEMSH DS    CL8                                                              
ESTDEMS  DS    CL69    12   10   69  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
ESTDEM2H DS    CL8                                                              
ESTDEM2  DS    CL69    13   10   69  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
ESTWTSH  DS    CL8                                                              
ESTWTS   DS    CL69    14   10   69  A  U N             T        Y              
ESTRBKDH DS    CL8                                                              
ESTRBKD  DS    CL11    16    2   11  A  P N             T        Y              
ESTRBKH  DS    CL8                                                              
ESTRBK   DS    CL6     16   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   24    7  A  P N             T        Y              
ESTHUTH  DS    CL8                                                              
ESTHUT   DS    CL7     16   33    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   43    8  A  P N             T        Y              
ESTMENUH DS    CL8                                                              
ESTMENU  DS    CL2     16   53    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   58    7  A  P N             T        Y              
ESTFLTRH DS    CL8                                                              
ESTFLTR  DS    CL3     16   67    3  A  U N             T        N              
         DS    CL8                                                              
         DS    CL9     18    2    9  A  P N             T        Y              
ESTCOPYH DS    CL8                                                              
ESTCOPY  DS    CL1     18   12    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   17   11  A  P N             T        Y              
ESTREPH  DS    CL8                                                              
ESTREP   DS    CL3     18   29    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   35    7  A  P N             T        Y              
ESTCPPEH DS    CL8                                                              
ESTCPPE  DS    CL7     18   43    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   53    4  A  P N             T        Y              
ESTTYPEH DS    CL8                                                              
ESTTYPE  DS    CL3     18   58    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19    2    9  A  P N             T        Y              
ESTRNGEH DS    CL8                                                              
ESTRNGE  DS    CL7     19   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   22    9  A  P N             T        Y              
ESTRTYPH DS    CL8                                                              
ESTRTYP  DS    CL2     19   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20    2   20  A  P N             T        Y              
ESTOWDH  DS    CL8                                                              
ESTOWD   DS    CL4     20   23    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   28    7  A  P N             T        Y              
ESTECONH DS    CL8                                                              
ESTECON  DS    CL15    20   36   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    20   58   16  A  P N             T        Y              
ESTERTLH DS    CL8                                                              
ESTERTL  DS    CL2     20   76    2  A  U N             T        Y              
ESTDSC1H DS    CL8                                                              
ESTDSC1  DS    CL20    21    2   20  A  P N             T        Y              
ESTUSR1H DS    CL8                                                              
ESTUSR1  DS    CL32    21   23   32  A  P N             T        Y              
ESTDSC2H DS    CL8                                                              
ESTDSC2  DS    CL20    22    2   20  A  P N             T        Y              
ESTUSR2H DS    CL8                                                              
ESTUSR2  DS    CL32    22   23   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
ESTOPTH  DS    CL8                                                              
ESTOPT   DS    CL65    23   12   65  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   79    1  A  U N             T        Y              
ESTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1168 BYTES                            
