*          DATA SET SPLFME7D   AT LEVEL 002 AS OF 09/29/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219E7D      DATE 09/29/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
FLT1H    DS    CL8                                                              
FLT1     DS    CL6      7    2    6   A    P    N         T         Y           
FLTF1H   DS    CL8                                                              
FLTF1    DS    CL13     7   10   13   A    U    N         T         Y           
FLT2H    DS    CL8                                                              
FLT2     DS    CL6      7   29    6   A    P    N         T         Y           
FLTF2H   DS    CL8                                                              
FLTF2    DS    CL13     7   36   13   A    U    N         T         Y           
FLT3H    DS    CL8                                                              
FLT3     DS    CL6      7   55    6   A    P    N         T         Y           
FLTF3H   DS    CL8                                                              
FLTF3    DS    CL13     7   62   13   A    U    N         T         Y           
FLT4H    DS    CL8                                                              
FLT4     DS    CL6      9    2    6   A    P    N         T         Y           
FLTF4H   DS    CL8                                                              
FLTF4    DS    CL13     9   10   13   A    U    N         T         Y           
FLT5H    DS    CL8                                                              
FLT5     DS    CL6      9   29    6   A    P    N         T         Y           
FLTF5H   DS    CL8                                                              
FLTF5    DS    CL13     9   36   13   A    U    N         T         Y           
FLT6H    DS    CL8                                                              
FLT6     DS    CL6      9   55    6   A    P    N         T         Y           
FLTF6H   DS    CL8                                                              
FLTF6    DS    CL13     9   62   13   A    U    N         T         Y           
FLT7H    DS    CL8                                                              
FLT7     DS    CL6     11    2    6   A    P    N         T         Y           
FLTF7H   DS    CL8                                                              
FLTF7    DS    CL13    11   10   13   A    U    N         T         Y           
FLT8H    DS    CL8                                                              
FLT8     DS    CL6     11   29    6   A    P    N         T         Y           
FLTF8H   DS    CL8                                                              
FLTF8    DS    CL13    11   36   13   A    U    N         T         Y           
FLT9H    DS    CL8                                                              
FLT9     DS    CL6     11   55    6   A    P    N         T         Y           
FLTF9H   DS    CL8                                                              
FLTF9    DS    CL13    11   62   13   A    U    N         T         Y           
FLT10H   DS    CL8                                                              
FLT10    DS    CL6     13    2    6   A    P    N         T         Y           
FLTF10H  DS    CL8                                                              
FLTF10   DS    CL13    13   10   13   A    U    N         T         Y           
FLT11H   DS    CL8                                                              
FLT11    DS    CL6     13   29    6   A    P    N         T         Y           
FLTF11H  DS    CL8                                                              
FLTF11   DS    CL13    13   36   13   A    U    N         T         Y           
FLT12H   DS    CL8                                                              
FLT12    DS    CL6     13   55    6   A    P    N         T         Y           
FLTF12H  DS    CL8                                                              
FLTF12   DS    CL13    13   62   13   A    U    N         T         Y           
FLT13H   DS    CL8                                                              
FLT13    DS    CL6     15    2    6   A    P    N         T         Y           
FLTF13H  DS    CL8                                                              
FLTF13   DS    CL13    15   10   13   A    U    N         T         Y           
FLT14H   DS    CL8                                                              
FLT14    DS    CL6     15   29    6   A    P    N         T         Y           
FLTF14H  DS    CL8                                                              
FLTF14   DS    CL13    15   36   13   A    U    N         T         Y           
FLT15H   DS    CL8                                                              
FLT15    DS    CL6     15   55    6   A    P    N         T         Y           
FLTF15H  DS    CL8                                                              
FLTF15   DS    CL13    15   62   13   A    U    N         T         Y           
FLT16H   DS    CL8                                                              
FLT16    DS    CL6     17    2    6   A    P    N         T         Y           
FLTF16H  DS    CL8                                                              
FLTF16   DS    CL13    17   10   13   A    U    N         T         Y           
FLT17H   DS    CL8                                                              
FLT17    DS    CL6     17   29    6   A    P    N         T         Y           
FLTF17H  DS    CL8                                                              
FLTF17   DS    CL13    17   36   13   A    U    N         T         Y           
FLT18H   DS    CL8                                                              
FLT18    DS    CL6     17   55    6   A    P    N         T         Y           
FLTF18H  DS    CL8                                                              
FLTF18   DS    CL13    17   62   13   A    U    N         T         Y           
FLT19H   DS    CL8                                                              
FLT19    DS    CL6     19    2    6   A    P    N         T         Y           
FLTF19H  DS    CL8                                                              
FLTF19   DS    CL13    19   10   13   A    U    N         T         Y           
FLT20H   DS    CL8                                                              
FLT20    DS    CL6     19   29    6   A    P    N         T         Y           
FLTF20H  DS    CL8                                                              
FLTF20   DS    CL13    19   36   13   A    U    N         T         Y           
FLT21H   DS    CL8                                                              
FLT21    DS    CL6     19   55    6   A    P    N         T         Y           
FLTF21H  DS    CL8                                                              
FLTF21   DS    CL13    19   62   13   A    U    N         T         Y           
FLT22H   DS    CL8                                                              
FLT22    DS    CL6     21    2    6   A    P    N         T         Y           
FLTF22H  DS    CL8                                                              
FLTF22   DS    CL13    21   10   13   A    U    N         T         Y           
FLT23H   DS    CL8                                                              
FLT23    DS    CL6     21   29    6   A    P    N         T         Y           
FLTF23H  DS    CL8                                                              
FLTF23   DS    CL13    21   36   13   A    U    N         T         Y           
FLT24H   DS    CL8                                                              
FLT24    DS    CL6     21   55    6   A    P    N         T         Y           
FLTF24H  DS    CL8                                                              
FLTF24   DS    CL13    21   62   13   A    U    N         T         Y           
FLT25H   DS    CL8                                                              
FLT25    DS    CL6     23    2    6   A    P    N         T         Y           
FLTF25H  DS    CL8                                                              
FLTF25   DS    CL13    23   10   13   A    U    N         T         Y           
FLT26H   DS    CL8                                                              
FLT26    DS    CL6     23   29    6   A    P    N         T         Y           
FLTF26H  DS    CL8                                                              
FLTF26   DS    CL13    23   36   13   A    U    N         T         Y           
FLT27H   DS    CL8                                                              
FLT27    DS    CL6     23   55    6   A    P    N         T         Y           
FLTF27H  DS    CL8                                                              
FLTF27   DS    CL13    23   62   13   A    U    N         T         Y           
FLTTABH  DS    CL8                                                              
FLTTAB   DS    CL1     23   77    1   A    U    N         T         Y           
FLTLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
FLTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 957  BYTES                            
