*          DATA SET SPLFMC4D   AT LEVEL 005 AS OF 08/16/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219C4D      DATE 08/16/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      7   15    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8   15    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   10    3  A   P    N         T        Y              
HUTJAN1H DS    CL8                                                              
HUTJAN1  DS    CL6      9   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   10    3  A   P    N         T        Y              
HUTAPR1H DS    CL8                                                              
HUTAPR1  DS    CL6     12   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     13   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   10    3  A   P    N         T        Y              
HUTJUN1H DS    CL8                                                              
HUTJUN1  DS    CL6     14   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     15   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   10    3  A   P    N         T        Y              
HUTAUG1H DS    CL8                                                              
HUTAUG1  DS    CL6     16   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     17   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     18   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     19   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   10    3  A   P    N         T        Y              
HUTDEC1H DS    CL8                                                              
HUTDEC1  DS    CL6     20   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22    2    7  A   P    N         T        Y              
HUTSPECH DS    CL8                                                              
HUTSPEC  DS    CL22    22   10   22  A   U    N         T        Y              
HUTACTH  DS    CL8                                                              
HUTACT   DS    CL30    22   35   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   10    1  A   U    N         T        Y              
HUTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
HUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 432  BYTES                            
