*          DATA SET SPLFME5D   AT LEVEL 002 AS OF 09/29/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219E5D      DATE 09/29/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      7    2    4   A    P    N         T         Y           
REPNAMEH DS    CL8                                                              
REPNAME  DS    CL22     7   22   22   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18     8    2   18   A    P    N         T         Y           
REPSTADH DS    CL8                                                              
REPSTAD  DS    CL24     8   22   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14     9    2   14   A    P    N         T         Y           
REPGOALH DS    CL8                                                              
REPGOAL  DS    CL7      9   22    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12    10    2   12   A    P    N         T         Y           
REPOCLTH DS    CL8                                                              
REPOCLT  DS    CL3     10   22    3   A    U    N         T         Y           
REPONAMH DS    CL8                                                              
REPONAM  DS    CL20    10   30   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL15    11    2   15   A    P    N         T         Y           
REPPCTH  DS    CL8                                                              
REPPCT   DS    CL6     11   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13    12    2   13   A    P    N         T         Y           
REPPTYPH DS    CL8                                                              
REPPTYP  DS    CL1     12   22    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14    12   25   14   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     14   22    1   A    U    N         T         Y           
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 297  BYTES                            
