*          DATA SET SPLFMD4D   AT LEVEL 005 AS OF 02/19/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219D4D      DATE 02/19/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DPTSTRTH DS    CL8                                                              
DPTSTRT  DS    CL11     7    2   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7   15   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7   28   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7   41   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7   54   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7   67   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     8   15   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     8   28   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     8   41   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     8   54   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     8   67   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9    2   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9   15   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9   28   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9   41   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9   54   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9   67   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10    2   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10   15   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10   28   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10   41   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10   54   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10   67   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11    2   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11   15   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11   28   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11   41   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11   54   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11   67   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12    2   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12   15   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12   28   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12   41   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12   54   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12   67   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    13    2   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    13   15   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    13   28   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    13   41   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    13   54   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    13   67   11  A   U    N         T        Y              
DPTTABH  DS    CL8                                                              
DPTTAB   DS    CL1     14    8    1  A   U    N         T        Y              
DPTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
DPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 810  BYTES                            
