*          DATA SET SPLFMC5D   AT LEVEL 002 AS OF 09/29/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219C5D      DATE 09/29/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      7   10    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10     7   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10     8   20   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     10   10    3   A    P    N         T         Y           
HUTHOL1H DS    CL8                                                              
HUTHOL1  DS    CL8     10   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     11   10    3   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   10    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     13   10    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     14   10    4   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     15   10    4   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     16   10    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     17   10    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     17   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     18   20    1   A    U    N         T         Y           
HUTACTH  DS    CL8                                                              
HUTACT   DS    CL30    20   10   30   A    P    N         T         Y           
HUTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
HUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 329  BYTES                            
