*          DATA SET SPLFMF5D   AT LEVEL 018 AS OF 11/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219F5D      DATE 11/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
LFMBK1H  DS    CL8                                                              
LFMBK1   DS    CL12     7   11   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   33    4  A  P N             T        Y              
LFMNM1H  DS    CL8                                                              
LFMNM1   DS    CL24     7   39   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
LFMBK2H  DS    CL8                                                              
LFMBK2   DS    CL12     8   11   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   33    4  A  P N             T        Y              
LFMNM2H  DS    CL8                                                              
LFMNM2   DS    CL24     8   39   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    10    2   25  A  P N             T        Y              
LFMUSERH DS    CL8                                                              
LFMUSER  DS    CL3     10   30    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
LFMPRD1H DS    CL8                                                              
LFMPRD1  DS    CL3     11   18    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   24    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   30    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   36    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   42    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   48    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   54    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   60    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   66    3  A  U N             T        Y              
LFMPRDXH DS    CL8                                                              
LFMPRDX  DS    CL3     11   72    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
LFMLST1H DS    CL8                                                              
LFMLST1  DS    CL72    15    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    16    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    17    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    18    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    19    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    20    2   72  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL72    21    2   72  A  P N             T        Y              
LFMSEPAH DS    CL8                                                              
LFMSEPA  DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
LFMADD1H DS    CL8                                                              
LFMADD1  DS    CL30    23   10   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   42    6  A  P N             T        Y              
LFMADD2H DS    CL8                                                              
LFMADD2  DS    CL30    23   50   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     24    2    6  A  P N             T        Y              
LFMADD3H DS    CL8                                                              
LFMADD3  DS    CL30    24   10   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   42    6  A  P N             T        Y              
LFMADD4H DS    CL8                                                              
LFMADD4  DS    CL30    24   50   30  A  U N             T        Y              
LFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
LFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1232 BYTES                            
