*          DATA SET SPLFMF6D   AT LEVEL 002 AS OF 09/29/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219F6D      DATE 09/29/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     7    2   13   A    P    N         T         Y           
LFMBK1H  DS    CL8                                                              
LFMBK1   DS    CL12     7   17   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      7   35    6   A    P    N         T         Y           
LFMLN1H  DS    CL8                                                              
LFMLN1   DS    CL1      7   43    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13     8    2   13   A    P    N         T         Y           
LFMBK2H  DS    CL8                                                              
LFMBK2   DS    CL12     8   17   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      8   35    6   A    P    N         T         Y           
LFMLN2H  DS    CL8                                                              
LFMLN2   DS    CL1      8   43    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13     9    2   13   A    P    N         T         Y           
LFMBK3H  DS    CL8                                                              
LFMBK3   DS    CL12     9   17   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      9   35    6   A    P    N         T         Y           
LFMLN3H  DS    CL8                                                              
LFMLN3   DS    CL1      9   43    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13    10    2   13   A    P    N         T         Y           
LFMPGAH  DS    CL8                                                              
LFMPGA   DS    CL3     10   17    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13    11    2   13   A    P    N         T         Y           
LFMALLMH DS    CL8                                                              
LFMALLM  DS    CL3     11   17    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13    12    2   13   A    P    N         T         Y           
LFMADEXH DS    CL8                                                              
LFMADEX  DS    CL5     12   17    5   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13   17    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14    15    2   14   A    P    N         T         Y           
LFMEXLH  DS    CL8                                                              
LFMEXL   DS    CL72    16    2   72   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL72    17    2   72   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL72    18    2   72   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL72    19    2   72   A    P    N         T         Y           
LFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
LFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 644  BYTES                            
