*          DATA SET SPLFMC9D   AT LEVEL 004 AS OF 12/18/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219C9D      DATE 12/18/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     7    2   13  A   P    N         T        Y              
ATTETYH  DS    CL8                                                              
ATTETY   DS    CL8      7   17    8  A   U    N         T        Y   10         
ATTETYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   30    4  A   P    N         T        Y              
ATTDATH  DS    CL8                                                              
ATTDAT   DS    CL9      7   35    9  A   U    N         T        Y   20         
ATTDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     8    2   13  A   P    N         T        Y              
ATTBUSH  DS    CL8                                                              
ATTBUS   DS    CL2      8   17    2  A   U    N         T        Y   30         
ATTBUSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    N         T        Y              
ATTDIVH  DS    CL8                                                              
ATTDIV   DS    CL2      9   17    2  A   U    N         T        Y   40         
ATTDIVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    N         T        Y              
ATTRESH  DS    CL8                                                              
ATTRES   DS    CL9     10   17    9  A   U    N         T        Y   50         
ATTRESX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11    2    4  A   P    N         T        Y              
ATTEXTH  DS    CL8                                                              
ATTEXT   DS    CL5     11   17    5  A   U    N         T        Y   60         
ATTEXTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    12    2   11  A   P    N         T        Y              
ATTESTH  DS    CL8                                                              
ATTEST   DS    CL5     12   17    5  A   U    N         T        Y   70         
ATTESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     13    2    9  A   P    N         T        Y              
ATTBUDH  DS    CL8                                                              
ATTBUD   DS    CL3     13   17    3  A   U    N         T        Y   80         
ATTBUDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    14    2   11  A   P    N         T        Y              
ATTDESH  DS    CL8                                                              
ATTDES   DS    CL50    14   17   50  A   U    N         T        Y   90         
ATTDESX  DS    CL8                                                              
ATTTAGH  DS    CL8                                                              
ATTTAG   DS    CL1     16   17    1  A   U    N         T        Y              
ATTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ATTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 408  BYTES                            
