*          DATA SET SPLFMF9D   AT LEVEL 002 AS OF 09/29/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219F9D      DATE 09/29/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     7    2   12   A    P    N         T         Y           
PRDSTDTH DS    CL8                                                              
PRDSTDT  DS    CL9      7   23    9   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12     8    2   12   A    P    N         T         Y           
PRDNDDTH DS    CL8                                                              
PRDNDDT  DS    CL9      8   23    9   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      8   36    1   A    U    N         T         Y           
PRDLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
PRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 86   BYTES                            
