*          DATA SET SPLFMD5D   AT LEVEL 004 AS OF 10/02/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219D5D      DATE 10/02/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL3      7    2    3  A   P    N         T        Y              
EQUS10H  DS    CL8                                                              
EQUS10   DS    CL4      7    7    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7   14    3  A   P    N         T        Y              
EQUS15H  DS    CL8                                                              
EQUS15   DS    CL4      7   18    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7   26    3  A   P    N         T        Y              
EQUS20H  DS    CL8                                                              
EQUS20   DS    CL4      7   30    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7   38    3  A   P    N         T        Y              
EQUS30H  DS    CL8                                                              
EQUS30   DS    CL4      7   42    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7   50    3  A   P    N         T        Y              
EQUS40H  DS    CL8                                                              
EQUS40   DS    CL4      7   54    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   P    N         T        Y              
EQUS45H  DS    CL8                                                              
EQUS45   DS    CL4      9    7    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   14    3  A   P    N         T        Y              
EQUS50H  DS    CL8                                                              
EQUS50   DS    CL4      9   18    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   26    3  A   P    N         T        Y              
EQUS60H  DS    CL8                                                              
EQUS60   DS    CL4      9   30    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   38    3  A   P    N         T        Y              
EQUS90H  DS    CL8                                                              
EQUS90   DS    CL4      9   42    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   50    3  A   P    N         T        Y              
EQUS120H DS    CL8                                                              
EQUS120  DS    CL4      9   54    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   P    N         T        Y              
EQUS27H  DS    CL8                                                              
EQUS27   DS    CL4     11    7    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   14    3  A   P    N         T        Y              
EQUS3H   DS    CL8                                                              
EQUS3    DS    CL4     11   18    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   26    3  A   P    N         T        Y              
EQUS75H  DS    CL8                                                              
EQUS75   DS    CL4     11   30    4  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   38    3  A   P    N         T        Y              
EQUS5H   DS    CL8                                                              
EQUS5    DS    CL4     11   42    4  N   U    N         T        Y              
EQUTABH  DS    CL8                                                              
EQUTAB   DS    CL1     15    2    1  A   U    N         T        Y              
EQULAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
EQUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 336  BYTES                            
