*          DATA SET SPLFMECD   AT LEVEL 009 AS OF 08/02/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T219ECD      DATE 08/02/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DMVHD1H  DS    CL8                                                              
DMVHD1   DS    CL79     7    3   79  A  P N             T        Y              
DMVIMP1H DS    CL8                                                              
DMVIMP1  DS    CL4      8    3    4  A  U N             T        Y              
DMVIMP2H DS    CL8                                                              
DMVIMP2  DS    CL4      8   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   17    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   31    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   59    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   66    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   73    4  A  U N             T        Y              
DMVHD2H  DS    CL8                                                              
DMVHD2   DS    CL79     9    3   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   17    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   31    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   59    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   66    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   73    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    11    3   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   17    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   31    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   59    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   66    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   73    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    13    3   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   17    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   31    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   59    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   66    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   73    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    15    3   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     16    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   17    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   31    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   59    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   66    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   73    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    17    3   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   17    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   31    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   59    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   66    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   73    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    19    3   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     20    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   17    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   31    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   59    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   66    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   73    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    21    3   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     22    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   17    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   24    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   31    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   45    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   59    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   66    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   73    4  A  U N             T        Y              
DMVLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
DMVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1760 BYTES                            
