*          DATA SET SPMAKWRK   AT LEVEL 033 AS OF 07/15/19                      
WORKD    DSECT                                                                  
*                                                                               
INVALID  EQU   2                                                                
BADMED   EQU   13                  INVALID MEDIUM                               
BADCLT   EQU   14                                                               
BADPRD   EQU   15                  INVALID PRODUCT                              
BADEST   EQU   16                                                               
BADMKT   EQU   17                                                               
BADSTA   EQU   18                                                               
PERERR   EQU   20                  PERIOD ENTRY NOT VALID                       
BADBOOK  EQU   60                  BAD BOOK                                     
MKTAUTH  EQU   69                  MARKET NOT AUTHORIZED                        
BUFFOVER EQU   91                  BUFFER OVERFLOW                              
SECLOCK  EQU   158                 ACCESS TO THIS CLT NOT AUTHORIZED            
NOTAUTH  EQU   207                 ACCESS TO DATA NOT AUTHORIZED                
INVCOST  EQU   265                 INVALID COST                                 
BADUSRID EQU   784                 DESTINATION ID NOT VALID                     
BUYCHGD  EQU   787                 BUY CHGD SINCE MATCH - RUN I2                
BADSKDT  EQU   799                 CANNOT SKED OUTSIDE BUY PERIOD               
DATALOCK EQU   808                 DATA LOCKED FOR OFFLINE PROCESSING           
MISSSPV  EQU   811                 MISSING SUPERVISOR RECORD                    
MAXRNO   EQU   818                 7 RNO'S MAX FOR NEW BUY/MAKEGOOD             
MAXDATA  EQU   822                 DATA BUFFER OVERFLOW                         
I2RERUN  EQU   826                 I2 HAS BEEN RE-RUN - REFRESH DATA            
I2CHG    EQU   831                 I2 HAS BEEN CHANGED - UPD MATCH DET          
POLONLY  EQU   833                 MM ONLY AVAIL FOR TRUE/BRAND POL             
ONENTWK  EQU   836                 SELECTIONS MUST BE FOR SAME NETWORK          
INVCHGD  EQU   837                 INVOICE CHANGED SINCE D/L - REFRESH          
MANYMKT  EQU   839                 TOO MANY MARKETS/CLIENTS TO DOWNLOAD         
MANYRNO  EQU   845                 TOO MANY RNOS TO ALLOC FOR BUY/MG            
BUYFUL1  EQU   961                 BUY REC FULL, AFFIDS NOT SEEDED              
BUYFUL2  EQU   962                 BUY REC FULL, FILMS NOT POSTED               
BADCMML  EQU   979                 INVALID CMML CODE ON INVOICE                 
INTERR   EQU   998                 INTERNAL ERROR, PLEASE RECONNECT             
BADBYR   EQU   1021                INVALID BUYER NAME                           
NOMKTS   EQU   1124                NO MARKETS ASSIGNED                          
NOINVS   EQU   1125                NO INVOICES FOR THIS OFC/BYR                 
BADRNOS  EQU   1127                RNOS/SPOTS NOT COMPATIBLE                    
BADOFC   EQU   1129                INVALID BUYING GROUP                         
DUPINV   EQU   1130                DUPLICATE INVOICE ITEM                       
MISSSPOT EQU   1137                SPOT NOT FOUND - RE-OPEN DETAILS             
INVOCOST EQU   1197                INVALID COST OVERRIDE                        
BADNVDET EQU   1212                INVOICE DETAIL NOT FOUND                     
ESTLOCK  EQU   1221                ESTIMATE LOCKED, NO ADDS/DELETES/CHA         
INVPAID  EQU   1223                INVOICE PAID, NO ADDS/DELETES/CHA            
NOUPDATE EQU   1249                UPDATES/I2 NOT ALLOWED                       
MKGDCNF  EQU   1406                MAKEGOOD CODE NOT FOUND                      
*                                                                               
BASERD   DS    F                                                                
BASERELO DS    F                                                                
OVRELO   DS    F                                                                
ATWA     DS    A                                                                
ATIA     DS    A                                                                
ATIOB    DS    A                                                                
ASYSPARM DS    A                                                                
ACOMFACS DS    A                                                                
ASYSFACS DS    A                                                                
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
*                                                                               
VTWABLD  DS    A                   LINKED WITH BASE                             
         DS    A                                                                
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
*                                                                               
VDATAMGR DS    A                                                                
VCALLOV  DS    A                                                                
VGETMSG  DS    A                                                                
VGETTXT  DS    A                                                                
VHELLO   DS    A                                                                
VSCANNER DS    A                                                                
VHEXIN   DS    A                                                                
VHEXOUT  DS    A                                                                
VCASHVAL DS    A                                                                
VDATVAL  DS    A                                                                
VDATCON  DS    A                                                                
VADDAY   DS    A                                                                
VPERVERT DS    A                                                                
VGETDAY  DS    A                                                                
VPERVAL  DS    A                                                                
VGLOBBER DS    A                                                                
VRECUP   DS    A                                                                
VGETFACT DS    A                                                                
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
         DS    A                   SPARE                                        
*                                                                               
VCOMBASE DS    0A                  VCOMMON ROUTINES IN BASE                     
*                                                                               
READ     DS    A                                                                
SEQ      DS    A                                                                
HIGH     DS    A                                                                
ADD      DS    A                                                                
WRITE    DS    A                                                                
GETREC   DS    A                                                                
PUTREC   DS    A                                                                
ADDREC   DS    A                                                                
READSTA  DS    A                                                                
HIGHSTA  DS    A                                                                
*                                                                               
VALIBYR  DS    A                                                                
VALIMED  DS    A                                                                
VALICLT  DS    A                                                                
VALIPRD  DS    A                                                                
VALIEST  DS    A                                                                
VALISTA  DS    A                                                                
VALIPR2  DS    A                                                                
GETHDR   DS    A                                                                
GETDATA  DS    A                                                                
SENDMSG  DS    A                   ERROR MESSAGES GO HERE                       
         DS    17A                 SPARE                                        
VCOMBASX EQU   *                                                                
VCOMBASN EQU   (VCOMBASX-VCOMBASE)/4                                            
*                                                                               
AIO      DS    A                   SHOULD BE ONE OF THE FOLLOWING !             
AIO1     DS    A                                                                
AIO2     DS    A                                                                
AIO3     DS    A                                                                
AIO4     DS    A                                                                
*                                                                               
APHASES  DS    0A                                                               
*                                                                               
VFALINK  DS    V                                                                
VOFFICER DS    V                                                                
VSTAPACK DS    V                                                                
VDEMOCON DS    V                                                                
VDAYUNPK DS    V                                                                
VUNTIME  DS    V                                                                
VGETBROD DS    V                                                                
VCLPACK  DS    A                                                                
VSTAVAL  DS    A                                                                
VTSAR    DS    A                                                                
VSPOTIO  DS    A                                                                
VTIMVAL  DS    A                                                                
VGETRATE DS    A                                                                
VCLUNPK  DS    A                                                                
VGETBUBL DS    A                                                                
VGETBUY  DS    A                                                                
VBLDMGN  DS    A                                                                
         DS    A                                                                
         DS    A                                                                
         DS    A                                                                
         DS    A                                                                
         DS    A                                                                
         DS    A                                                                
*                                                                               
COMMAND  DS    CL8                 DATAMGR COMMAND                              
DIRECTRY DS    CL8                                                              
FILE     DS    CL8                 DATAMGR FILE                                 
*                                                                               
RDUPDATE DS    C                                                                
DMOUTBTS DS    X                                                                
DMINBTS  DS    X                                                                
DMBYTE   DS    X                                                                
XSP      DS    C                   =C'Y' FOR XSPDIR/XSPFILE                     
*                                                                               
DDS      DS    C                   Y=DDS TERMINAL                               
*                                                                               
BUY1OR2  DS    XL1                 1 OR 2 BYTE BUYLINE                          
         DS    XL1                 SPARE                                        
*                                                                               
HDRADDR  DS    A                                                                
DATADDR  DS    A                                                                
SEMICOL   EQU  X'5E'                                                            
SEMICOLON EQU  SEMICOL                                                          
         DS    32D                 SPARE                                        
*                                                                               
AGETDATA DS    A                   FALINK ROUTINE ADDRESSES                     
ASETELEM DS    A                                                                
AADDDATA DS    A                                                                
AFABLK   DS    A                                                                
AMAPTAB  DS    A                                                                
DPOINTER DS    A                   FOR INPUT DATA IN BDATA                      
HDRCODE  DS    CL2                                                              
ANYDATA  DS    CL1                                                              
MYFLAG   DS    CL1                                                              
CMTCOUNT DS    X                                                                
*                                                                               
DMCB     DS    6F                                                               
DMWORK   DS    12D                                                              
SPACES   DS    CL80                                                             
*                                                                               
DUB      DS    D                                                                
FULL     DS    F                                                                
HALF     DS    H                                                                
HALF2    DS    H                                                                
*                                                                               
ERROR    DS    H                                                                
*                                                                               
BYTE     DS    X                                                                
BYTE2    DS    X                                                                
*                                                                               
ELCODE   DS    X                                                                
ELCDLO   DS    X                                                                
ELCDHI   DS    X                                                                
BUYELS   DS    XL2                 SAVE ELCDLO/ELCDHI                           
         DS    XL2                                                              
         DS    XL1                                                              
*                                                                               
SPOTS    DS    F                                                                
GROSS    DS    F                                                                
NET      DS    F                                                                
TAX      DS    F                                                                
*                                                                               
         DS    0D                                                               
KEY      DS    XL48                                                             
KEYSAVE  DS    XL48                                                             
*                                                                               
WORK     DS    CL64                                                             
WORK2    DS    CL64                                                             
*                                                                               
         DS    0D                                                               
BLOCK    DS    CL256                                                            
*                                                                               
         DS    0D                                                               
TSARBLK  DS    6D                                                               
TSARREC  DS    XL64                                                             
*                                                                               
         DS    0D                                                               
PROF00   DS    CL16                00 PROFILE                                   
PROFA0   DS    CL16                A0 PROFILE                                   
PROFMK   DS    CL16                MK PROFILE                                   
PROFI2   DS    CL16                I2 PROFILE                                   
PROFI2A  DS    CL16                I2A PROFILE                                  
PROFI2B  DS    CL16                I2B PROFILE                                  
PROFI2C  DS    CL16                I2C PROFILE                                  
PROFI2N  DS    CL16                I2N PROFILE                                  
PROFI2S  DS    CL16                I2S PROFILE                                  
PROFI2X  DS    CL16                I2X PROFILE                                  
PROFI2Y  DS    CL16                I2Y PROFILE                                  
PROFI2Z  DS    CL16                I2Z PROFILE                                  
PROFDAR  DS    CL16                DAR PROFILE                                  
PROFB0   DS    CL16                B0 PROFILE                                   
PROFTI   DS    CL16                TI PROFILE                                   
*                                                                               
FPRD     DS    CL3                 ACTION FIND PRD & EST                        
FPRD2    DS    CL3                                                              
FBPRD    DS    XL1                                                              
FBPRD2   DS    XL1                                                              
FBEST    DS    XL1                                                              
*                                                                               
         DS    0D                                                               
OVWORK   DS    XL512                                                            
*                                                                               
         DS    0D                                                               
SPTBLK   DS    XL4096                                                           
*                                                                               
         ORG   SPTBLK                                                           
RH6      DS    0D                                                               
RH6DAYS  DS    XL8                 DAYS (IN UNDAY FORMAT)                       
RH6TIME  DS    XL11                START TIME                                   
RH6DATE  DS    CL11                START-END DATE (MMMDD-MMMDD)                 
RH6SLN   DS    CL3                 SPOT LENGTH                                  
RH6DPT   DS    CL1                                                              
RH6MG    DS    CL2                 MAKEGOOD CODE                                
RH6PROG  DS    CL17                PROGRAM                                      
RH6PROGL DS    X                   PROGRAM LENGTH (-1)                          
RH6ADJ   DS    CL2                 ADJACENCY/PURPOSE CODE                       
RH6NPW   DS    CL2                                                              
RH6PRD   DS    CL3                 PRODUCT (ONLY FOR MOVE SPOT)                 
RH6PR2   DS    CL3                 PIGGY   (ONLY FOR MOVE SPOT)                 
RH6DEM   DS    CL100               OVERRIDE DEMOS                               
RH6COM1  DS    CL72                COMMENT 1                                    
RH6COM2  DS    CL72                COMMENT 2                                    
RH6COM3  DS    CL72                COMMENT 3                                    
RH6COM4  DS    CL72                COMMENT 4                                    
RH6COM5  DS    CL72                COMMENT 5                                    
RH6COML  EQU   *-RH6COM1                                                        
RH6RSNCD DS    CL6                 REASON CODE                                  
RH6RSNTX DS    CL40                REASON TEXT                                  
RH6L     EQU   *-RH6                                                            
*                                                                               
         ORG                                                                    
*                                                                               
LENIO    EQU   6*1024                                                           
IOAREA1  DS    (LENIO)X                                                         
IOAREA2  DS    (LENIO)X                                                         
IOAREA3  DS    (LENIO)X                                                         
IOAREA4  DS    (LENIO)X                                                         
*                                                                               
LENWORK  EQU   *-WORKD                                                          
*                                                                               
WORKX    EQU   *                                                                
         EJECT                                                                  
*===================================================================*           
* SCREEN DSECT                                                                  
*===================================================================*           
         SPACE 1                                                                
       ++INCLUDE FATWA                                                          
*                                                                               
         ORG   TWAD+64                                                          
       ++INCLUDE SPMAKFFD                                                       
*                                                                               
         ORG   TWAD+2304                                                        
FABLK    DS    CL(FALINKDL)        BLOCK FOR FALINK                             
FPARMS   DS    6F                  RETURN PARMETER BLK FROM GETDATA             
FAMSGBLK DS    CL(FAMSGDL)         BLOCK FOR FALINK ERROR MESSAGES              
FACON    DS    CL(L'FALCON)        BLOCK FOR FALINK CONTROL FIELD               
*                                                                               
         DS    0D                                                               
SVTSRKEY DC    XL13'00'            TSAR KEY (A-M/CLT/PRD/MKT/STA/EST)           
         DS    X                                                                
SVBUYCNT DS    H                                                                
*                                                                               
QAGY     EQU   TWAAGY                                                           
SVAGYNAM DS    CL33                                                             
SVAGYADR DS    CL33                                                             
SVAPROF  DS    CL16                AGENCY PROFILE                               
SVOFCNAM DS    CL24                                                             
SVBYRNAM DS    CL24                                                             
SVRCVEL  DS    CL2                                                              
QGRP     DS    CL4                                                              
QBYR     DS    CL4                                                              
SVOFFC   DS    CL1                 SAVED OFFICE CODE FROM CLTHDR                
QMED     DS    CL1                                                              
SVMEDNM  DS    CL12                                                             
QCLT     DS    CL3                                                              
SVCNAME  DS    CL20                                                             
SVCPROF  DS    CL16                                                             
SVCXTRA  DS    CL16                                                             
QPRD     DS    CL3                                                              
QPRD2    DS    CL3                                                              
SVPNAME  DS    CL20                                                             
SVPNAME2 DS    CL20                                                             
QEST     DS    CL3                                                              
QEST2    DS    CL3                                                              
SVENAME  DS    CL20                                                             
SVEDEMOS DS    XL60                                                             
QSTA     DS    CL8                                                              
SVSTAPRT DS    CL8                                                              
QMKT     DS    CL4                                                              
SVMKTNM  DS    CL24                                                             
QMGR     DS    0CL5                                                             
QMGRPID  DS    CL1                                                              
QMGRP    DS    CL4                                                              
QPER     DS    CL12                REQUESTED PERIOD                             
*                                                                               
BAGYMD   DS    XL1                                                              
BCLT     DS    XL2                                                              
BPRD     DS    XL1                                                              
BPRD2    DS    XL1                                                              
BPOLPRD  DS    XL1                                                              
BEST     DS    XL1                 BEST/BEST2 USED FOR HEADER EST               
BEST2    DS    XL1                                                              
BMKTSTA  DS    0XL5                                                             
BMKT     DS    XL2                                                              
BSTA     DS    XL3                                                              
BMOS     DS    XL2                 Y/M                                          
BPER     DS    XL4                 2 BYTE MOS START/END                         
*                                                                               
BUYEST   DS    XL1                 BUYEST USED FOR BUYS (FROM H06)              
BYCBLNET DS    XL3                                                              
BDAYS    DS    XL1                                                              
BSDATE   DS    XL3                                                              
BEDATE   DS    XL3                                                              
BNOGOL   DS    C                                                                
BBUYER   DS    CL12                                                             
BBCBLNET DS    X                   CABLE NETWORK CODE                           
BSKED    DS    C                   O=OTO, S=SKED                                
*                                                                               
FLAGS    DS    X                   VARIOUS FLAGS                                
FLSNDCMT EQU   X'80'               SEND COMMENTS WITH BUYS                      
FLNOMAT  EQU   X'40'               UPDATE BUY W/OUT MATCH                       
FLSNDMAT EQU   X'20'               SEND MATCHED DATA                            
FLSKVRSN EQU   X'10'               SKIP VERSION CHECKING                        
FLCMTRCV EQU   X'08'               COMMENTS RECEIVED FLAG                       
FLWEEKLY EQU   X'04'               SEND PROGRAM NAME FROM WKLY METERED          
FLOVNITE EQU   X'02'               SEND PROGRAM NAME FROM OVERNIGHTS            
FLNOOVR  EQU   X'01'               DON'T OVERRIDE SPOT COST                     
*                                                                               
FLAG2    DS    X                   VARIOUS FLAGS                                
*        EQU   X'80'                                                            
*        EQU   X'40'                                                            
*        EQU   X'20'                                                            
*        EQU   X'10'                                                            
*        EQU   X'08'                                                            
*        EQU   X'04'                                                            
*        EQU   X'02'                                                            
*        EQU   X'01'                                                            
*                                                                               
* BDATA CODES:                                                                  
*        B     EST(1)/BUYLINE(2)                                                
*        D     SPOT DATE(2)                                                     
*        A     AFFID DATE(2)                                                    
*        T     AFFID TIME(2)/PRD(1)/PRD2(1)/COST(4)                             
*        N/O   SPOT OR OTO NUMBER(1)                                            
*        I     INVOICE NUMBER(10)                                               
*                                                                               
BDATA    DS    XL512               EST/LINE/SPOT DATA                           
BDATAX   EQU   *                                                                
*                                                                               
         DS    0D                                                               
BBUYLIN  DS    XL2                 CURRENT BUYLINE NUMBER                       
*                                                                               
SVXFROV  DS    X                   OVERLAY FOR XFRCTL RETURN                    
SVRESUME DS    X                   GLOBBER RETURN IF NON-ZERO                   
SVREASON DS    X                   REASON FOR GLOBBER EXIT                      
*                                                                               
SVRIDEL  EQU   C'I'                I,DEL (DELETE AFFID)                         
SVRMOTO  EQU   C'M'                MINUS OTO                                    
SVRTMOTO EQU   C'T'                TEST MINUS OTO OK                            
SVRPOTO  EQU   C'P'                PLUS OTO                                     
SVRPASS1 EQU   C'1'                VALIDATE BUY                                 
SVRPASS2 EQU   C'2'                MAKE NEW BUY                                 
SVRBUYX  EQU   C'X'                LAST NEW BUY PASS                            
SVRMG    EQU   C'G'                MAKEGOOD                                     
SVRSKED  EQU   C'S'                SKED                                         
SVRCHG   EQU   C'C'                CHANGE BUY (TIME/COST)                       
*                                                                               
SVDPNTRD DS    H                   SAVE DPOINTER DISPLACEMENT                   
*                                                                               
APRD     DS    CL3                 AFFID ELEM PRODUCT                           
SVOLDRCV DS    X                                                                
SVSNVKEY DS    XL32                                                             
SVBUYDT1 DS    XL78                                                             
SVBUYDT2 DS    XL78                                                             
SVBUYDT3 DS    XL78                                                             
*                                                                               
BMGCODE  DS    CL2                 BUY MAKEGOOD CODE                            
BSTDATE  DS    XL2                 BUY START DATE                               
BEDDATE  DS    XL2                 BUY END DATE                                 
BCOST    DS    XL4                 BUY COST                                     
BNPW     DS    X                   NUMBER PER WEEK                              
BRTTYP   DS    X                   RATE TYPE                                    
*                                                                               
QCOST    DS    CL10                                                             
*                                                                               
SVBYRFLT DS    CL1                                                              
QMGCD    DS    CL2                 MAKEGOOD CODE                                
QUESTOR  DS    CL12                                                             
QWHEN    DS    CL1                                                              
QDEST    DS    CL8                                                              
QBOOK    DS    CL4                                                              
QHUT     DS    CL2                                                              
*                                                                               
SVSKDATE DS    XL2                                                              
SVSKNUM  DS    XL1                                                              
*                                                                               
QBUYID   DS    CL12                                                             
*                                                                               
VERSION  DS    XL4                 MM VERSION NUMBER                            
*                                                                               
OTODATA  DS    CL3                 +OTO DATE/SPOTNUM                            
*                                                                               
QSTARTB  DS    XL3                 MOS START IN 3 BYTE BINARY                   
QENDB    DS    XL3                 MOS END IN 3 BYTE BINARY                     
*                                                                               
MOLINE   DS    XL2                 LAST MINUS OTO/I,DEL LINE NUMBER             
SVBYROP1 DS    X                                                                
QREP     DS    CL3                 REP                                          
APRD2    DS    CL3                 PIGGY AFFID PRD                              
LASTEST  DS    X                   LAST I,DEL EST NUMBER                        
I2DATE   DS    XL2                 DATE I2 LAST RUN (COMPRESSED)                
I2TIME   DS    XL2                 TIME I2 LAST RUN (BINARY OF HHMM)            
BUYCALL  DS    X                   COUNTER OF CALLS TO BUY PGM (DEBUG)          
BUBBLCD  DS    XL2                 BUYER/BILLER CODE                            
XOTOCODE DS    C                   SPECIAL -OTO CODE                            
QCOST2   DS    CL10                                                             
SVCOST2  DS    C                   COST2 FLAG (FROM CLT REC)                    
AFCOST   DS    XL4                 NEW AFFID COST                               
*                                                                               
OVFLAGS  DS    0CL8                                                             
OVFLM    DS    C                   IGNORE FILM FLAG                             
OVCST    DS    C                   IGNORE COST FLAG                             
OVTIM    DS    C                   IGNORE TIME FLAG                             
OVSLN    DS    C                   IGNORE SPOT LENGTH FLAG                      
OVINT    DS    C                   IGNORE INTERVAL CHECKING                     
         DS    CL3                 SPARE OVERRIDES                              
*                                                                               
BNODEM   DS    C                   BUY - NO DEMO FLAG                           
STAT1    DS    X                   KEY STATUS BYTE 1 TO BE SET                  
*                                                                               
SVBUYDT4 DS    XL78                                                             
IVCBLNET DS    XL3                 INVOICE CABLE NETWORK                        
INVBCNET DS    X                   INVOICE CABLE NETWORK CODE                   
*                                                                               
DEC2IMPS DS    C                   2 DECIMAL IMPRESSIONS FROM 00A PROF          
*                                                                               
         DS    96C                 SPARE                                        
*                                                                               
         ORG                                                                    
         DS    0D                                                               
SVCLTREC DS    1280C                                                            
*                                                                               
SVOVDATA DS    CL1024                                                           
SVCHKSUM DS    200CL(CHKSUML)      SEE CHKSUMD                                  
SVCHKL   EQU   *-SVCHKSUM                                                       
*                                                                               
         ORG   TWAD+((TWANOGO)-(4*1024))                                        
SVFALINK DS    XL(4*1024)          FALINK'S SAVED STORAGE                       
         EJECT                                                                  
* FAMAP EQUATES *                                                               
H01Q     EQU   X'01'                                                            
H02Q     EQU   X'02'                                                            
H03Q     EQU   X'03'                                                            
H04Q     EQU   X'04'                                                            
H05Q     EQU   X'05'                                                            
H06Q     EQU   X'06'                                                            
H07Q     EQU   X'07'                                                            
H08Q     EQU   X'08'                                                            
H09Q     EQU   X'09'                                                            
H0AQ     EQU   X'0A'                                                            
H0BQ     EQU   X'0B'                                                            
H0CQ     EQU   X'0C'                                                            
H0DQ     EQU   X'0D'                                                            
H0EQ     EQU   X'0E'                                                            
*H0FQ     EQU   X'0F'              DO NOT USE                                   
*H10Q     EQU   X'10'              DO NOT USE                                   
H11Q     EQU   X'11'                                                            
H30Q     EQU   X'30'                                                            
H31Q     EQU   X'31'                                                            
H32Q     EQU   X'32'                                                            
H33Q     EQU   X'33'                                                            
H34Q     EQU   X'34'                                                            
H35Q     EQU   X'35'                                                            
H36Q     EQU   X'36'                                                            
H37Q     EQU   X'37'                                                            
H38Q     EQU   X'38'                                                            
H39Q     EQU   X'39'                                                            
H3AQ     EQU   X'3A'                                                            
H3BQ     EQU   X'3B'                                                            
H3CQ     EQU   X'3C'                                                            
H3DQ     EQU   X'3D'                                                            
H3EQ     EQU   X'3E'                                                            
H3FQ     EQU   X'3F'                                                            
H40Q     EQU   X'40'                                                            
H41Q     EQU   X'41'                                                            
H42Q     EQU   X'42'                                                            
H43Q     EQU   X'43'                                                            
H44Q     EQU   X'44'                                                            
H45Q     EQU   X'45'                                                            
H46Q     EQU   X'46'                                                            
H47Q     EQU   X'47'                                                            
H48Q     EQU   X'48'                                                            
HFDQ     EQU   X'FD'                                                            
HFEQ     EQU   X'FE'                                                            
H99Q     EQU   X'99'               USED FOR TEST PHASE                          
*                                                                               
H01A001  EQU   1                   GROSS/NET                                    
H01AG06  EQU   2                   BUY PERIOD OTO'S                             
H01MK01  EQU   3                   CONVERT OTO TO SKED                          
H01CL10  EQU   4                   ADJACENCY CODE                               
H01I2X7  EQU   5                   MG INV TO MG SPOT ONLY                       
H01I2X13 EQU   6                   SHOW SPOT SEQ NUMBERS                        
H01I2Y5  EQU   7                   SHOW SPECIAL REP NAME                        
H01AG08  EQU   9                   CANADIAN?                                    
H01B004  EQU   10                  DON'T MATCH BY CONTRACT #                    
H01I200  EQU   11                  TIME LEEWAY                                  
H01I2X14 EQU   12                  TIME LEEWAY AFTER                            
H01I205  EQU   13                  H/V CHECKING %                               
H01I2X10 EQU   14                  H/V CHECKING % WEEK                          
H01I2S1  EQU   15                  SEPARATION CHECKING NO,CLT,BRAND             
H01I2S2  EQU   16                  SEPARATION CHECKING PRIMARY INTRVL           
H01I2S3  EQU   17                  SEPARATION CHECKING SECONDARY INTRVL         
H01TI11  EQU   18                  INVALID FILMS DISCREPANT                     
H01B007  EQU   19                  REASON CODE SCHEME (0=NONE)                  
H01B009  EQU   20                  REQUIRE PURPOSE CODES                        
H01MK09  EQU   21                  APPROVE INVOICES                             
H01PE    EQU   22                  PROGRAM EXCHANGE                             
H01DAR7  EQU   23                  TRADE SPECIAL REP DIGITS 1-3                 
H01I2A6  EQU   24                  MATCH ON REP CODE                            
H010010  EQU   25                  2 DECIMAL RATINGS                            
H01CLC2  EQU   26                  CLT COST 2 (Y/N/T/O)                         
H01MK10  EQU   27                  CHANGE RNO COST (Y/N/L/Z)                    
H01I2A15 EQU   28                  SEPARATE ADDED VALUE - $0                    
H01I2A16 EQU   29                  5,7,10 SEC $0 ARE ADDED VALUE                
H01MK11  EQU   30                  AUTO I2 REQUEST ON MATCH                     
H01I2B10 EQU   31                  SPOT LENGTH LEEWAY BEFORE                    
H01I2B11 EQU   32                  SPOT LENGTH LEEWAY AFTER                     
H01I2N4  EQU   33                  EST=NO INVALID WHEN UPDATIVE                 
H01I2N6  EQU   34                  EST=NO UPDATIVE I2 ONLY                      
H01DAR16 EQU   35                  ADD COMM RATE TYPE FOR TRADE                 
H01CL15  EQU   36                  CLIENT RATE CONTROL                          
H01I2C7  EQU   37                  COMML TIMES ARE B'CAST DAY                   
H01I2C8  EQU   38                  CHECK COMML LENGTH (SECONDS)                 
H01I2C6  EQU   39                  FILM MATCH DSCRPCY = FILM ERR                
H01I2C11 EQU   40                  SPOT COST TOLERANCE                          
H01MK14  EQU   41                  ONLY USE DAR REP FOR NEW BUYS                
H012DIMP EQU   42                  2 DECIMAL IMPRESSIONS                        
H01RTYPE EQU   99                  SPOT BUY RATE TYPES                          
*                                                                               
H02OFC   EQU   1                                                                
H02BYR   EQU   2                                                                
*                                                                               
H03MKT   EQU   2                                                                
H03STA   EQU   3                                                                
H03CLT   EQU   4                                                                
H03PRD   EQU   5                                                                
H03PR2   EQU   6                                                                
H03MOS   EQU   7                                                                
H03ESRNG EQU   8                                                                
H03CNAME EQU   10                                                               
H03PNAME EQU   11                                                               
H03ENAME EQU   12                                                               
H03FLMSQ EQU   14                                                               
H03FLM   EQU   15                                                               
H03FLAGS EQU   16                                                               
H03STAT1 EQU   19                  STATUS BYTE 1                                
*SNVMMFLM EQU   X'20'                 FILM ANALYSIS ERRORS                      
*SNVMMHVE EQU   X'10'                 HORIZONTAL/VERTICAL ERRORS                
*SNVMMSSE EQU   X'08'                 SECONDARY SEPARATION ERRORS               
H03SPOTS EQU   20                                                               
H03DOLS  EQU   21                                                               
H03PAID  EQU   22                                                               
H03CONT  EQU   23                  CONTRACT NUMBER                              
*                                                                               
H03FLAGD DSECT                                                                  
H03F_POL  DS  CL1                  C'N' IF NOT POL                              
H03F_STAT DS  CL1                  C'W' WIP, C'M' MATCHED                       
H03F_APP  DS  CL1                  C'Y' APPROVED                                
*                                                                               
H04MKT   EQU   01                                                               
H04MKTNM EQU   02                                                               
*                                                                               
H05EST   EQU   01                                                               
H05ESTNM EQU   02                                                               
H05ESDAT EQU   03                                                               
H05EEDAT EQU   04                                                               
H05EDEM  EQU   05                                                               
         EJECT                                                                  
H06BDATA EQU   1                   (SEE H6D BELOW)                              
H06BDEM  EQU   2                                                                
*                                                                               
H6D      DSECT          *** BUYREC DATA (SEMICOLON DELIMITED)                   
H6SEQ    DS    CL3                 SEQUENCE NUMBER                              
H6PRD    DS    CL3                 PRD                                          
H6EST    DS    CL3                 EST                                          
H6PRD2   DS    CL3                 PRD2                                         
H6EST2   DS    CL3                 EST2                                         
H6LINE   DS    CL3                 LINE                                         
H6DAYS   DS    CL3                 DAYS (SUM OF BIT VALUES)                     
H6DAYCNT DS    CL1                 END DAY - START DAY (=0 DEFAULT)             
H6STIM   DS    CL4                 START TIME (0-2400)                          
H6ETIM   DS    CL4                 END TIME (0-2400)                            
H6SDAT   DS    CL6                 START DATE MMDDYY                            
H6EDAT   DS    CL6                 END DATE   MDDDYY                            
H6SLN    DS    CL3                 SLN                                          
H6GRS    DS    CL8                 GROSS COST                                   
H6NET    DS    CL8                 NET COST                                     
H6RTYP   DS    CL1                 RATE TYPE                                    
H6PROG   DS    CL17                PROGRAM NAME                                 
H6COM    DS    CL1                 COMMENTS ? (=N/Y)                            
H6REP    DS    CL3                 SPECIAL REP                                  
H6ADJ    DS    CL2                 ADJACENCY CODE                               
H6WKIND  DS    CL1                 WEEK INDICATOR                               
H6DPT    DS    CL1                 DAYPART CODE                                 
H6CBLNET DS    CL3                 CABLE NETWORK                                
H6MGCD   DS    CL2                 BUYLINE MAKEGOOD CODE                        
H6DAILY  DS    CL1                 BUYLINE HAS DAILY SKED                       
H6ID     DS    CL12                BUY ID (CONTRACT NUMBER)                     
H6COS2   DS    CL8                 COST 2                                       
H6NCOS2  DS    CL8                 NET COST 2                                   
H6TAX    DS    CL8                 TAX                                          
H6DX     EQU   *                                                                
*                                                                               
H07DAYS  EQU   01                                                               
H07TIMS  EQU   02                                                               
H07PROG  EQU   03                                                               
*                                                                               
H08SPDET EQU   01                                                               
*                                                                               
S8D      DSECT                     FIELD DELIMITER IS SEMICOLON                 
S8SEQ    DS    CL3                 BUYLINE SEQNUM                               
S8MTCH   DS    CL1                 MATCHED (=N/Y)                               
S8MGCD   DS    CL2                 MAKEGOOD CODE                                
S8SDAT   DS    CL6                 START DATE MMDDYY                            
S8SPOT   DS    CL2                 SPOT NUMBER                                  
S8PRD    DS    CL3                 PRODUCT                                      
S8PRD2   DS    CL3                 PRODUCT 2                                    
*                                  0=$0, NULL=NO OVRD                           
S8GRS    DS    CL8                 GROSS COST OVERRIDE                          
S8NET    DS    CL8                 NET COST OVERRIDE                            
S8OTO    DS    CL1                 THIS IS AN OTO (=N/Y/-)                      
S8PAID   DS    CL1                 THIS SPOT IS PAID                            
S8PAIDDT DS    CL6                 SPOT PAID DATE                               
S8TAX    DS    CL8                 TAX                                          
S8DX     EQU   *                                                                
*                                                                               
H09AFFID EQU   01                                                               
*                                                                               
S9D      DSECT                     DELIMITER IS SEMICOLON                       
S9MTCHD  DS    CL1                 MATCHED (=Y/N)                               
S9RUNON  DS    CL6                 RUN DATE MMDDYY                              
S9STIME  DS    CL4                 START TIME (INTEGER)                         
S9SLN    DS    CL3                 SLN                                          
S9PRD    DS    CL3                 PRODUCT                                      
S9PR2    DS    CL3                 PRODUCT 2                                    
S9GROSS  DS    CL8                 GROSS COST                                   
S9NET    DS    CL8                 NET COST                                     
S9MGCOD  DS    CL2                 ORDERED SPOT MAKEGOOD CODE                   
S9DEMO   DS    CL5                 DEMO VALUE                                   
S9FILM   DS    XL1                 FILM CODE                                    
S9FILM2  DS    XL1                 FILM CODE                                    
S9CBLNET DS    CL3                 CABLE NETWORK                                
S9MGAFF  DS    CL1                 AFFID IS A MAKEGOOD                          
S9INVNUM DS    CL2                 0 RELATIVE INV SEQ NUM                       
S9EST    DS    XL1                 ESTIMATE NUMBER                              
S9DX     EQU   *                                                                
*                                                                               
H10COM   EQU   01                                                               
*                                                                               
CHKSUMD  DSECT                                                                  
CHKSKEY  DS    CL10                INVOICE NUMBER                               
CHKSVAL  DS    XL2                 2 BYTE CHECKSUM                              
CHKSUML  EQU   *-CHKSUMD                                                        
*                                                                               
         EJECT                                                                  
*********************************************************************           
* DSECT TO COVER DEMO BLOCK                                                     
*********************************************************************           
DBLOCKD  DSECT                                                                  
       ++INCLUDE DEDBLOCK                                                       
         EJECT                                                                  
       ++INCLUDE DDCOMFACS                                                      
       ++INCLUDE FALINKBLK                                                      
