*          DATA SET SPMEDBDESD AT LEVEL 005 AS OF 08/24/79                      
BDEXTD   DSECT                                                                  
BDPDAY   DS    CL8                 DAYS                                         
BDPTIME  DS    CL11                TIME                                         
BDPSLN   DS    CL3                 SPOT LENGTH                                  
BDPPURP  DS    CL1                 PURPOSE                                      
BDPDPT   DS    CL1                 DAYPART                                      
BDPEST   DS    CL3                 EST                                          
BDPLIN   DS    CL3                 LINE                                         
BDPPTR   DS    CL3                 PARTNER                                      
BDPPEST  DS    CL3                 PARTNER ESTIMATE                             
BDPBDATE DS    0CL11               BUY DATES                                    
BDPSDTE  DS    CL5                 START DATE                                   
         DS    CL1                                                              
BDPEDTE  DS    CL5                 END DATE                                     
BDPCIND  DS    CL1                 COST INDICATOR                               
BDPWIND  DS    CL1                 WEEK INDICATOR                               
BDPINP   DS    CL1                 INPUT METHOD                                 
BDPDASHE DS    CL1                 'E' IF INPUT =-E                             
BDPPROG  DS    CL18                PROGRAM DESCRIPTION                          
BDPPTYP  DS    CL1                 PROGRAM TYPE                                 
BDPCOST  DS    CL12                $XXX,XXX.XX-                                 
BDPSREP  DS    CL3                 SPECIAL REP                                  
BDPWKS   DS    CL2                 NO OF WEEK                                   
BDPNPWK  DS    CL2                 NO PER WEEK                                  
BDPPKG   DS    CL20                PACKAGE CAPTION                              
BDPAST   DS    CL1                 * IF BDCHG = TODAY                           
BDPADJ   DS    CL2                 ADJACENCY CODE                               
BDPCFDS  DS    CL1                 ( IF START DATE CONFIRMED                    
BDPCFDE  DS    CL1                 ) IF END DATE CONFIRMED                      
BDPCOST2 DS    CL12                XXXXXXXXXXX-                                 
BDPEND   DS    0C                                                               
