*          DATA SET SPMGELINED AT LEVEL 001 AS OF 11/21/00                      
         EJECT                                                                  
* THESE DSECTS FOR LINES BUILT BY SPBLDMGE                                      
*                                                                               
LINED    DSECT                                                                  
LSELECTH DS    CL8                                                              
LSELECT  DS    CL3                                                              
LDISPLNH DS    CL8                                                              
*                                                                               
LMSGROUP DS    CL3                                                              
LMSMINUS DS    CL1                                                              
LMSBUYLN DS    CL3                                                              
         DS    CL1                                                              
LMSBDATE DS    CL5                                                              
         DS    CL4                                                              
LMSTSLN  DS    CL3                                                              
         DS    CL1                                                              
LMSTIME  DS    CL11                                                             
         DS    CL1                                                              
LMSCOST  DS    CL7                                                              
         DS    CL1                                                              
LMSRATNG DS    CL5                                                              
         DS    CL15                                                             
LMSPRGM  DS    CL14                                                             
*                                                                               
         ORG   LMSGROUP                                                         
LMGGROUP DS    CL3                                                              
LMGPLUS  DS    CL1                                                              
LMGPRIOD DS    0CL12               PERIOD (IE: FEB07-2W,02 )                    
LMGDATNY DS    CL5                                                              
LMGDASH  DS    CL1                                                              
LMGNWKS  DS    CL2                                                              
LMGWEEK  DS    CL1                                                              
LMGSTAR  DS    CL1                                                              
LMGNSPTS DS    CL2                                                              
         DS    CL1                                                              
LMGTSLN  DS    CL3                                                              
         DS    CL1                                                              
LMGTIME  DS    CL11                                                             
         DS    CL1                                                              
LMGDAYS  DS    CL7                                                              
         DS    CL7                                                              
LMGCOST  DS    CL7                                                              
         DS    CL1                                                              
LMGRATNG DS    CL5                                                              
         DS    CL1                                                              
LMGPRGM  DS    CL14                                                             
*                                                                               
LNEXTLIN DS    0C                                                               
*                                                                               
         ORG   LMSGROUP                                                         
LMTGROUP DS    CL3                                                              
LMTMINUS DS    CL1                                                              
LMTBUYLN DS    CL3                                                              
         DS    CL1                                                              
LMTBDATE DS    CL12                                                             
         DS    CL4                                                              
LMTTSLN  DS    CL3                                                              
         DS    CL1                                                              
LMTTIME  DS    CL11                                                             
         DS    CL1                                                              
LMTCOST  DS    CL8                                                              
         DS    CL1                                                              
LMTRATNG DS    CL5                                                              
         DS    CL15                                                             
LMTPRGM  DS    CL14                                                             
