*          DATA SET SPMGRTAB   AT LEVEL 008 AS OF 07/09/03                      
         TITLE 'SPMGRTAB - 1 BYTE TO 2 BYTE MKTGRPS'                            
         DS    0D                                                               
SPMGRTAB DS    0XL3                                                             
         DC    C'YA',X'01'                                                      
         DC    C'YB',X'02'                                                      
         DC    C'YC',X'03'                                                      
         DC    C'YD',X'04'                                                      
         DC    C'YE',X'05'                                                      
         DC    C'YF',X'06'                                                      
         DC    C'YG',X'07'                                                      
         DC    C'YH',X'08'                                                      
         DC    C'YI',X'09'                                                      
         DC    C'YJ',X'0A'                                                      
         DC    C'YK',X'0B'                                                      
         DC    C'YL',X'0C'                                                      
         DC    C'YM',X'0D'                                                      
         DC    C'YN',X'0E'                                                      
         DC    C'YO',X'0F'                                                      
         DC    C'YP',X'10'                                                      
         DC    C'YQ',X'11'                                                      
         DC    C'YR',X'12'                                                      
         DC    C'YS',X'13'                                                      
         DC    C'YT',X'14'                                                      
         DC    C'YU',X'15'                                                      
         DC    C'YV',X'16'                                                      
         DC    C'YW',X'17'                                                      
         DC    C'YX',X'18'                                                      
         DC    C'YY',X'19'                                                      
         DC    C'YZ',X'1A'                                                      
         DC    C'AB',X'41'                                                      
         DC    C'AC',X'42'                                                      
         DC    C'AD',X'43'                                                      
         DC    C'AF',X'44'                                                      
         DC    C'AG',X'45'                                                      
         DC    C'AH',X'46'                                                      
         DC    C'AJ',X'47'                                                      
         DC    C'AK',X'48'                                                      
         DC    C'AL',X'49'                                                      
         DC    C'AM',X'4A'                                                      
         DC    C'AN',X'4B'                                                      
         DC    C'AP',X'4C'                                                      
         DC    C'AQ',X'4D'                                                      
         DC    C'AR',X'4E'                                                      
         DC    C'AS',X'4F'                                                      
         DC    C'AT',X'50'                                                      
         DC    C'AV',X'51'                                                      
         DC    C'AW',X'52'                                                      
         DC    C'AX',X'53'                                                      
         DC    C'AY',X'54'                                                      
         DC    C'AZ',X'55'                                                      
         DC    C'BB',X'56'                                                      
         DC    C'BC',X'57'                                                      
         DC    C'BD',X'58'                                                      
         DC    C'BF',X'59'                                                      
         DC    C'BG',X'5A'                                                      
         DC    C'BH',X'5B'                                                      
         DC    C'BJ',X'5C'                                                      
         DC    C'BK',X'5D'                                                      
         DC    C'BL',X'5E'                                                      
         DC    C'BN',X'5F'                                                      
*                                                                               
         DC    C'A ',X'C1'                                                      
         DC    C'B ',X'C2'                                                      
         DC    C'C ',X'C3'                                                      
         DC    C'D ',X'C4'                                                      
         DC    C'E ',X'C5'                                                      
         DC    C'F ',X'C6'                                                      
         DC    C'G ',X'C7'                                                      
         DC    C'H ',X'C8'                                                      
         DC    C'I ',X'C9'                                                      
         DC    C'WA',X'CA'         VALUES > G FOR ALL CLIENTS                   
         DC    C'WB',X'CB'                                                      
         DC    C'WC',X'CC'                                                      
         DC    C'WD',X'CD'                                                      
         DC    C'WF',X'CE'                                                      
         DC    C'WG',X'CF'                                                      
         DC    C'WH',X'D0'                                                      
         DC    C'J ',X'D1'                                                      
         DC    C'K ',X'D2'                                                      
         DC    C'L ',X'D3'                                                      
         DC    C'M ',X'D4'                                                      
         DC    C'O ',X'D6'                                                      
         DC    C'P ',X'D7'                                                      
         DC    C'Q ',X'D8'                                                      
         DC    C'R ',X'D9'                                                      
         DC    C'WJ',X'DA'                                                      
         DC    C'WK',X'DB'                                                      
         DC    C'WL',X'DC'                                                      
         DC    C'WM',X'DD'                                                      
         DC    C'WN',X'DE'                                                      
         DC    C'WP',X'DF'                                                      
         DC    C'WQ',X'E0'                                                      
         DC    C'S ',X'E2'                                                      
         DC    C'T ',X'E3'                                                      
         DC    C'U ',X'E4'                                                      
         DC    C'V ',X'E5'                                                      
         DC    C'W ',X'E6'                                                      
         DC    C'X ',X'E7'                                                      
         DC    C'Z ',X'E9'                                                      
         DC    C'WR',X'EA'                                                      
         DC    C'WS',X'EB'                                                      
         DC    C'WT',X'EC'                                                      
         DC    C'WV',X'ED'                                                      
         DC    C'WW',X'EE'                                                      
         DC    C'WX',X'EF'                                                      
         DC    C'WZ',X'FA'                                                      
         DC    C'XB',X'FB'                                                      
         DC    C'XC',X'FC'                                                      
         DC    C'XD',X'FD'                                                      
         DC    C'XF',X'FE'                                                      
         DC    C'XG',X'FF'                                                      
SPMGRTBX EQU   *                                                                
