*          DATA SET SPMISFFD   AT LEVEL 006 AS OF 12/18/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20BFFD      DATE 12/18/03                 
         SPACE 1                                                                
T20BFFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MISMSGH  DS    XL8                                                              
MISMSG   DS    CL60     1    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      2    1    5  A  P N             T        Y              
MISMEDH  DS    XL8                                                              
MISMED   DS    CL4      2    9    4  A  U H             T    I   Y              
MISMEDNH DS    XL8                                                              
MISMEDN  DS    CL10     2   17   10  A  P N             N        Y              
         DS    XL8                                                              
         DS    CL6      2   41    6  A  P N             T        Y              
MISCLTH  DS    XL8                                                              
MISCLT   DS    CL5      2   50    5  A  U H             T        Y              
MISCLTNH DS    XL8                                                              
MISCLTN  DS    CL20     2   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      3    1    7  A  P N             T        Y              
MISPRDH  DS    XL8                                                              
MISPRD   DS    CL7      3    9    7  A  U H             T        Y              
MISPRDNH DS    XL8                                                              
MISPRDN  DS    CL20     3   17   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      3   41    8  A  P N             T        Y              
MISESTH  DS    XL8                                                              
MISEST   DS    CL8      3   50    8  A  U H             T        Y              
MISESTNH DS    XL8                                                              
MISESTN  DS    CL20     3   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      4    1    6  A  P N             T        Y              
MISMKTH  DS    XL8                                                              
MISMKT   DS    CL4      4    9    4  A  U H             T        Y              
MISMKTNH DS    XL8                                                              
MISMKTN  DS    CL23     4   17   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   41    7  A  P N             T        Y              
MISSTAH  DS    XL8                                                              
MISSTA   DS    CL8      4   50    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5    1    7  A  P N             T        Y              
MISDPTH  DS    XL8                                                              
MISDPT   DS    CL4      5    9    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   41    6  A  P N             T        Y              
MISLENH  DS    XL8                                                              
MISLEN   DS    CL5      5   50    5  A  U H             T        Y              
MISEQUH  DS    XL8                                                              
MISEQU   DS    CL13     5   60   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    1    6  A  P N             T        Y              
MISPERH  DS    XL8                                                              
MISPER   DS    CL17     6    9   17  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6   41    6  A  P N             T        Y              
MISFORH  DS    XL8                                                              
MISFOR   DS    CL5      6   50    5  A  U H             T        Y              
MISPTITH DS    XL8                                                              
MISPTIT  DS    CL4      6   60    4  A  P N             T        Y              
MISPAGEH DS    XL8                                                              
MISPAGE  DS    CL2      6   66    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      7    1    7  A  P N             T        Y              
MISOPTH  DS    XL8                                                              
MISOPT   DS    CL50     7    9   50  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
MISL8H   DS    XL8                                                              
MISL8    DS    CL80     8    1   80  A  P H             T        Y              
MISL9H   DS    XL8                                                              
MISL9    DS    CL79     9    1   79  A  P H             T        Y              
MISL10H  DS    XL8                                                              
MISL10   DS    CL79    10    1   79  A  P N             T        Y              
MISL11H  DS    XL8                                                              
MISL11   DS    CL79    11    1   79  A  P N             T        Y              
MISL12H  DS    XL8                                                              
MISL12   DS    CL79    12    1   79  A  P N             T        Y              
MISL13H  DS    XL8                                                              
MISL13   DS    CL79    13    1   79  A  P N             T        Y              
MISL14H  DS    XL8                                                              
MISL14   DS    CL79    14    1   79  A  P N             T        Y              
MISL15H  DS    XL8                                                              
MISL15   DS    CL79    15    1   79  A  P N             T        Y              
MISL16H  DS    XL8                                                              
MISL16   DS    CL79    16    1   79  A  P N             T        Y              
MISL17H  DS    XL8                                                              
MISL17   DS    CL79    17    1   79  A  P N             T        Y              
MISL18H  DS    XL8                                                              
MISL18   DS    CL79    18    1   79  A  P N             T        Y              
MISL19H  DS    XL8                                                              
MISL19   DS    CL79    19    1   79  A  P N             T        Y              
MISL20H  DS    XL8                                                              
MISL20   DS    CL79    20    1   79  A  P N             T        Y              
MISL21H  DS    XL8                                                              
MISL21   DS    CL79    21    1   79  A  P N             T        Y              
MISL22H  DS    XL8                                                              
MISL22   DS    CL79    22    1   79  A  P N             T        Y              
MISL23H  DS    XL8                                                              
MISL23   DS    CL79    23    1   79  A  P N             T        Y              
MISPFKH  DS    XL8                                                              
MISPFK   DS    CL79    24    1   79  A  P N             T        Y              
MISLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
MISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2192 BYTES                            
