*          DATA SET SPNWSDDD   AT LEVEL 003 AS OF 05/06/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207DDD      DATE 05/06/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
LSTMEDH  DS    CL8                                                              
LSTMED   DS    CL1      5   10    1  A   U    N         T        Y              
LSTMEDX  DS    CL8                                                              
LSTMDNH  DS    CL8                                                              
LSTMDN   DS    CL10     5   14   10  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL5      5   28    5  A   P    N         T        Y              
LSTBYRH  DS    CL8                                                              
LSTBYR   DS    CL3      5   34    3  A   U    N         T        Y              
LSTBYRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   39    3  A   P    N         T        Y              
LSTNUMH  DS    CL8                                                              
LSTNUM   DS    CL5      5   43    5  A   U    N         T        Y              
LSTNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   49    6  A   P    N         T        Y              
LSTCLTH  DS    CL8                                                              
LSTCLT   DS    CL3      5   57    3  A   U    N         T        Y              
LSTCLTX  DS    CL8                                                              
LSTCNMH  DS    CL8                                                              
LSTCNM   DS    CL20     5   61   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
LSTPRDH  DS    CL8                                                              
LSTPRD   DS    CL3      6   10    3  A   U    N         T        Y              
LSTPRDX  DS    CL8                                                              
LSTPNMH  DS    CL8                                                              
LSTPNM   DS    CL20     6   14   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8      6   39    8  A   P    N         T        Y              
LSTESTH  DS    CL8                                                              
LSTEST   DS    CL3      6   49    3  A   U    N         T        Y              
LSTESTX  DS    CL8                                                              
LSTENMH  DS    CL8                                                              
LSTENM   DS    CL20     6   57   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL78     8    2   78  A   P    H         T        Y              
LSTL1H   DS    CL8                                                              
LSTL1    DS    CL3      9    2    3  A   U    N         T        Y              
LSTL1X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75     9    6   75  A   P    N         T        Y              
LSTL2H   DS    CL8                                                              
LSTL2    DS    CL3     10    2    3  A   U    N         T        Y              
LSTL2X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    10    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    11    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    12    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    13    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    14    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    15    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    16    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    17    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    18    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    19    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    20    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    21    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    22    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    23    6   75  A   P    N         T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1920 BYTES                            
