*          DATA SET SPNWSF4AD  AT LEVEL 002 AS OF 09/25/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207F4D      DATE 09/25/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL79     4    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      5    2    3  A  P H             T        Y              
PKGNUMH  DS    CL8                                                              
PKGNUM   DS    CL3      5    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      5   10    4  A  P H             T        Y              
PKGDESH  DS    CL8                                                              
PKGDES   DS    CL17     5   15   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      5   34    4  A  P H             T        Y              
PKGCSTH  DS    CL8                                                              
PKGCST   DS    CL6      5   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   47    5  A  P N             T        Y              
PKGDATH  DS    CL8                                                              
PKGDAT   DS    CL17     5   53   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   72    6  A  P N             T        Y              
PKGUPDH  DS    CL8                                                              
PKGUPD   DS    CL1      5   79    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
PKGDEMH  DS    CL8                                                              
PKGDEM   DS    CL70     6   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PKGCOMH  DS    CL8                                                              
PKGCOM   DS    CL70     7   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35     8    2   35  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     8   38   15  A  P H             T        Y              
PKGDN1H  DS    CL8                                                              
PKGDN1   DS    CL6      8   54    6  A  P H             T        Y              
PKGDN2H  DS    CL8                                                              
PKGDN2   DS    CL6      8   61    6  A  P H             T        Y              
PKGDN3H  DS    CL8                                                              
PKGDN3   DS    CL6      8   68    6  A  P H             T        Y              
PKGDN4H  DS    CL8                                                              
PKGDN4   DS    CL6      8   75    6  A  P H             T        Y              
PKGL1H   DS    CL8                                                              
PKGL1    DS    CL2      9    2    2  A  U N             T        Y              
PKGLINH  DS    CL8                                                              
PKGLIN   DS    CL3      9    5    3  A  P N             T        Y              
PKGDAYH  DS    CL8                                                              
PKGDAY   DS    CL7      9    9    7  A  U N             T        Y              
PKGTIMH  DS    CL8                                                              
PKGTIM   DS    CL11     9   17   11  A  U N             T        Y              
PKGDPTH  DS    CL8                                                              
PKGDPT   DS    CL1      9   29    1  A  U N             T        Y              
PKGCOSH  DS    CL8                                                              
PKGCOS   DS    CL6      9   31    6  A  U N             T        Y              
PKGPRDH  DS    CL8                                                              
PKGPRD   DS    CL43     9   38   43  A  P N             T        Y              
PKGL2H   DS    CL8                                                              
PKGL2    DS    CL2     10    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL43    10   38   43  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL43    11   38   43  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL43    12   38   43  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL43    13   38   43  A  P N             T        Y              
PKGCA1H  DS    CL8                                                              
PKGCA1   DS    CL55    14   25   55  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL22    15    2   22  A  P H             T        Y              
PKGCA2H  DS    CL8                                                              
PKGCA2   DS    CL55    15   25   55  A  P H             T        Y              
PKGDT1H  DS    CL8                                                              
PKGDT1   DS    CL22    16    2   22  A  P N             T        Y              
PKGSKDH  DS    CL8                                                              
PKGSKD   DS    CL55    16   25   55  A  U N             T        Y              
PKGDT2H  DS    CL8                                                              
PKGDT2   DS    CL22    17    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55    17   25   55  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    18    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55    18   25   55  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    19    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55    19   25   55  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL22    20    2   22  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55    20   25   55  A  U N             T        Y              
PKGCMTH  DS    CL8                                                              
PKGCMT   DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  P H             T        Y              
PKGGOLH  DS    CL8                                                              
PKGGOL   DS    CL76    22    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A  P H             T        Y              
PKGACTH  DS    CL8                                                              
PKGACT   DS    CL76    23    4   76  A  P N             T        Y              
PKGPFKH  DS    CL8                                                              
PKGPFK   DS    CL78    24    2   78  A  P N             T        Y              
PKGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PKGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2168 BYTES                            
