*          DATA SET SPNWSDBD   AT LEVEL 005 AS OF 12/18/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207DBD      DATE 12/18/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
COMMEDH  DS    CL8                                                              
COMMED   DS    CL1      5   15    1  A  U N             T        Y   10         
COMMEDX  DS    CL8                                                              
COMMDNH  DS    CL8                                                              
COMMDN   DS    CL10     5   25   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
COMBYRH  DS    CL8                                                              
COMBYR   DS    CL3      6   15    3  A  U N             T        Y   20         
COMBYRX  DS    CL8                                                              
COMBYNH  DS    CL8                                                              
COMBYN   DS    CL20     6   25   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
COMCAMH  DS    CL8                                                              
COMCAM   DS    CL5      7   15    5  A  U N             T        Y   30         
COMCAMX  DS    CL8                                                              
COMCMNH  DS    CL8                                                              
COMCMN   DS    CL20     7   25   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
COMMKTH  DS    CL8                                                              
COMMKT   DS    CL5      8   15    5  A  U N             T        Y   40         
COMMKTX  DS    CL8                                                              
COMMTNH  DS    CL8                                                              
COMMTN   DS    CL20     8   25   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
COMSTAH  DS    CL8                                                              
COMSTA   DS    CL8      9   15    8  A  U N             T        Y   40         
COMSTAX  DS    CL8                                                              
COMSTNH  DS    CL8                                                              
COMSTN   DS    CL20     9   25   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  P H             T        Y              
COMCM1H  DS    CL8                                                              
COMCM1   DS    CL50    11   15   50  A  U N             T        Y              
COMCM2H  DS    CL8                                                              
COMCM2   DS    CL50    12   15   50  A  U N             T        Y              
COMCM3H  DS    CL8                                                              
COMCM3   DS    CL50    13   15   50  A  U N             T        Y              
COMCM4H  DS    CL8                                                              
COMCM4   DS    CL50    14   15   50  A  U N             T        Y              
COMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 560  BYTES                            
