*          DATA SET SPNWSE8D   AT LEVEL 010 AS OF 10/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207E8D      DATE 10/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
LEDMEDH  DS    CL8                                                              
LEDMED   DS    CL1      5   10    1  A  U N             T        Y    1         
LEDMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
LEDBYRH  DS    CL8                                                              
LEDBYR   DS    CL3      5   27    3  A  U N             T        Y    2         
LEDBYRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   37    8  A  P H             T        Y              
LEDNUMH  DS    CL8                                                              
LEDNUM   DS    CL5      5   47    5  A  U N             T        Y    3         
LEDNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   59    7  A  P H             T        Y              
LEDSTAH  DS    CL8                                                              
LEDSTA   DS    CL8      5   70    8  A  U N             T        Y    0         
LEDSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
LEDDAYH  DS    CL8                                                              
LEDDAY   DS    CL7      6   10    7  A  U N             T        Y    0         
LEDDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   20    5  A  P H             T        Y              
LEDTIMH  DS    CL8                                                              
LEDTIM   DS    CL11     6   27   11  A  U N             T        Y    0         
LEDTIMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   47    6  A  P H             T        Y              
LEDDLNH  DS    CL8                                                              
LEDDLN   DS    CL5      6   54    5  A  U N             T        Y    0         
LEDDLNX  DS    CL8                                                              
LEDSUBH  DS    CL8                                                              
LEDSUB   DS    CL10     6   64   10  A  P H             T        Y              
LEDSDPH  DS    CL8                                                              
LEDSDP   DS    CL1      6   75    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
LEDCSTH  DS    CL8                                                              
LEDCST   DS    CL8      8    8    8  A  U H             T        Y    0         
LEDCSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P N             T        Y              
LEDUPGH  DS    CL8                                                              
LEDUPG   DS    CL32     8   29   32  A  U H             T        Y    0         
LEDUPGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8   65    4  A  P N             T        Y              
LEDDEMH  DS    CL8                                                              
LEDDEM   DS    CL7      8   72    7  A  U H             T        Y    0         
LEDDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
LEDPRGH  DS    CL8                                                              
LEDPRG   DS    CL17     9   10   17  A  U H             T        Y    0         
LEDPRGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9   65    6  A  P H             T        Y              
LEDSRCH  DS    CL8                                                              
LEDSRC   DS    CL3      9   72    3  A  P N             T        Y    0         
LEDSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P H             T        Y              
LEDLIDH  DS    CL8                                                              
LEDLID   DS    CL7     10   10    7  A  P N             T        Y    0         
LEDLIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10   18    8  A  P N             T        Y              
LEDLITH  DS    CL8                                                              
LEDLIT   DS    CL11    10   27   11  A  U H             T        Y    0         
LEDLITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   40    7  A  P H             T        Y              
LEDLODH  DS    CL8                                                              
LEDLOD   DS    CL7     10   48    7  A  P N             T        Y    0         
LEDLODX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10   56    8  A  P N             T        Y              
LEDLOTH  DS    CL8                                                              
LEDLOT   DS    CL11    10   65   11  A  U H             T        Y    0         
LEDLOTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    11    2   10  A  P H             T        Y              
LEDLIPH  DS    CL8                                                              
LEDLIP   DS    CL16    11   14   16  A  P N             T        Y    0         
LEDLIPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    11   40   10  A  P H             T        Y              
LEDLOPH  DS    CL8                                                              
LEDLOP   DS    CL16    11   52   16  A  P N             T        Y    0         
LEDLOPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     13    2    9  A  P N             T        Y              
LEDBK1H  DS    CL8                                                              
LEDBK1   DS    CL8     13   14    8  A  U H             T        Y    0         
LEDBK1X  DS    CL8                                                              
LEDBK2H  DS    CL8                                                              
LEDBK2   DS    CL8     13   27    8  A  U H             T        Y    0         
LEDBK2X  DS    CL8                                                              
LEDBK3H  DS    CL8                                                              
LEDBK3   DS    CL8     13   40    8  A  U H             T        Y    0         
LEDBK3X  DS    CL8                                                              
LEDBK4H  DS    CL8                                                              
LEDBK4   DS    CL8     13   53    8  A  U H             T        Y    0         
LEDBK4X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    13   64   17  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     14   77    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P H             T        Y              
LEDROTH  DS    CL8                                                              
LEDROT   DS    CL47    15   14   47  A  P N             T        Y    0         
LEDROTX  DS    CL8                                                              
LEDRTGH  DS    CL8                                                              
LEDRTG   DS    CL10    15   63   10  A  U N             T        Y    0         
LEDRTGX  DS    CL8                                                              
LEDCPPH  DS    CL8                                                              
LEDCPP   DS    CL7     15   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P H             T        Y              
LEDLIQH  DS    CL8                                                              
LEDLIQ   DS    CL67    16   14   67  A  P N             T        Y    0         
LEDLIQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P H             T        Y              
LEDLOQH  DS    CL8                                                              
LEDLOQ   DS    CL67    17   14   67  A  P N             T        Y    0         
LEDLOQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18    2   10  A  P H             T        Y              
LEDROPH  DS    CL8                                                              
LEDROP   DS    CL67    18   14   67  A  P N             T        Y    0         
LEDROPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19    2   10  A  P H             T        Y              
LEDBIAH  DS    CL8                                                              
LEDBIA   DS    CL67    19   14   67  A  P N             T        Y    0         
LEDBIAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    20    2   11  A  P H             T        Y              
LEDBOAH  DS    CL8                                                              
LEDBOA   DS    CL67    20   14   67  A  P N             T        Y    0         
LEDBOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  P H             T        Y              
LEDIPRH  DS    CL8                                                              
LEDIPR   DS    CL69    21   12   69  A  P N             T        Y    0         
LEDIPRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P H             T        Y              
LEDOPRH  DS    CL8                                                              
LEDOPR   DS    CL69    22   12   69  A  P N             T        Y    0         
LEDOPRX  DS    CL8                                                              
LEDCMTH  DS    CL8                                                              
LEDCMT   DS    CL75    24    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
LEDLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LEDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
