*          DATA SET SPNWSGOAL  AT LEVEL 004 AS OF 09/03/93                      
         SPACE 1                                                                
*        NEW BUYER'S WORKSHEET GOAL RECORD                                      
         SPACE 1                                                                
BWGRECD  DSECT                                                                  
BWGKEY   DS    0XL13                                                            
BWGKTYP  DS    XL1                                                              
BWGKTYPQ EQU   X'0D'                                                            
BWGKSUB  DS    XL1                                                              
BWGKSUBQ EQU   X'6A'                                                            
BWGKAGMD DS    XL1                 AGENCY-MEDIA                                 
BWGKBYR  DS    CL1                 BUYER CODE                                   
BWGKCAM  DS    XL2                 CAMPAIGN NUMBER                              
BWGKMKT  DS    XL2                 MARKET                                       
BWGKDPT  DS    CL1                 DAYPART                                      
BWGKLEN  DS    XL1                 LENGTH                                       
         DS    CL3                 N/D                                          
BWGKCNTL DS    0X                                                               
*                                                                               
BWGLEN   DS    XL2                                                              
BWGCNTL  DS    XL1                                                              
BWGLINK  DS    XL8                                                              
BWGFSTEL EQU   *                                                                
         SPACE  1                                                               
BWGEL    DS    0X                  ** GOAL ELEMENT **                           
BWGELCD  DS    XL1                                                              
BWGELCDQ EQU   X'01'                                                            
BWGELLN  DS    XL1                                                              
BWGBUDT  DS    XL4                 TOTAL BUDGET                                 
BWGGRPT  DS    XL4                 TOTAL POINTS                                 
BWGBUD   DS    XL(14*4)            WEEKLY BUDGETS                               
BWGGRP   DS    XL(14*4)            WEEKLY POINTS                                
BWGELLNQ EQU   *-BWGEL                                                          
