*          DATA SET SPNWSFBD   AT LEVEL 002 AS OF 03/21/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207FBD      DATE 03/21/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
WRKCPEH  DS    XL8                                                              
WRKCPE   DS    CL61     4    2   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   63    6  A  P N             T        Y              
WRKSCRH  DS    XL8                                                              
WRKSCR   DS    CL10     4   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     5    2   11  A  P H             T        Y              
WRKDCPH  DS    XL8                                                              
WRKDCP   DS    CL14     5   13   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL41     5   28   41  A  P H             T        Y              
WRKCPMH  DS    XL8                                                              
WRKCPM   DS    CL12     5   69   12  A  P H             T        Y              
WRKL1H   DS    XL8                                                              
WRKL1    DS    CL2      6    2    2  A  U N             T        Y              
WRKLSTH  DS    XL8                                                              
WRKLST   DS    CL7      6    5    7  A  P H             T        Y              
WRKRATH  DS    XL8                                                              
WRKRAT   DS    CL6      6   13    6  A  U N             T        Y              
WRKCPPH  DS    XL8                                                              
WRKCPP   DS    CL7      6   20    7  A  P H             T        Y              
WRKDAYH  DS    XL8                                                              
WRKDAY   DS    CL7      6   28    7  A  U N             T        Y              
WRKTIMH  DS    XL8                                                              
WRKTIM   DS    CL11     6   36   11  A  U N             T        Y              
WRKCSTH  DS    XL8                                                              
WRKCST   DS    CL6      6   48    6  A  U N             T        Y              
WRKPRGH  DS    XL8                                                              
WRKPRG   DS    CL13     6   55   13  A  U N             T        Y              
WRKDLMH  DS    XL8                                                              
WRKDLM   DS    CL12     6   69   12  A  P H             T        Y              
WRKL2H   DS    XL8                                                              
WRKL2    DS    CL2      7    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     7   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     7   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2      8    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2      9    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      9   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      9   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     10   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     10   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     11   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     11   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     12   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   69   12  A  P H             T        Y              
WRKL8H   DS    XL8                                                              
WRKL8    DS    CL2     13    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     13   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     14   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     14   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     15   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     15   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     16   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     16   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     17   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     17   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     18   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     18   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     19   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     19   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     20   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     20   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   69   12  A  P H             T        Y              
WRKFINH  DS    XL8                                                              
WRKFIN   DS    CL2     21    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21    5    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     21   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     21   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   36   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   55   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   69   12  A  P H             T        Y              
WRKFUTH  DS    XL8                                                              
WRKFUT   DS    CL79    24    2   79  A  P N             T        Y              
WRKLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
WRKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2592 BYTES                            
