*          DATA SET SPNWSE7D   AT LEVEL 002 AS OF 12/09/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207E7D      DATE 12/09/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
RESMEDH  DS    XL8                                                              
RESMED   DS    CL1      5    8    1  A  U N             T        Y    1         
RESMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   12    5  A  P H             T        Y              
RESBYRH  DS    XL8                                                              
RESBYR   DS    CL3      5   18    3  A  U N             T        Y    2         
RESBYRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   23    5  A  P H             T        Y              
RESNUMH  DS    XL8                                                              
RESNUM   DS    CL5      5   29    5  A  U N             T        Y    4         
RESNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   40    7  A  P H             T        Y              
RESSTAH  DS    XL8                                                              
RESSTA   DS    CL8      5   48    8  A  U N             T        Y    0         
RESSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   59    4  A  P H             T        Y              
RESLINH  DS    XL8                                                              
RESLIN   DS    CL3      5   64    3  A  U N             T        Y    0         
RESLINX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   69    4  A  P H             T        Y              
RESSEQH  DS    XL8                                                              
RESSEQ   DS    CL3      5   74    3  A  U N             T        Y    0         
RESSEQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
RESDAYH  DS    XL8                                                              
RESDAY   DS    CL7      6   10    7  A  U N             T        Y    0         
RESDAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   20    5  A  P H             T        Y              
RESTIMH  DS    XL8                                                              
RESTIM   DS    CL11     6   27   11  A  U N             T        Y    0         
RESTIMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   47    6  A  P H             T        Y              
RESDLNH  DS    XL8                                                              
RESDLN   DS    CL5      6   54    5  A  U N             T        Y    0         
RESDLNX  DS    XL8                                                              
RESSUBH  DS    XL8                                                              
RESSUB   DS    CL10     6   64   10  A  P H             T        Y              
RESSDPH  DS    XL8                                                              
RESSDP   DS    CL1      6   75    1  A  P N             T        Y    0         
RESSDPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   47    6  A  P H             T        Y              
RESSRCH  DS    XL8                                                              
RESSRC   DS    CL3      7   54    3  A  P N             T        Y    0         
RESSRCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   64    6  A  P N             T        Y              
RESWKYH  DS    XL8                                                              
RESWKY   DS    CL8      7   72    8  A  U H             T        Y    0         
RESWKYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
RESCSTH  DS    XL8                                                              
RESCST   DS    CL8      8    8    8  A  U H             T        Y    0         
RESCSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   29    7  A  P N             T        Y              
RESUPGH  DS    XL8                                                              
RESUPG   DS    CL32     8   38   32  A  U H             T        Y    0         
RESUPGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
RESBK1H  DS    XL8                                                              
RESBK1   DS    CL8      9   14    8  A  U H             T        Y    0         
RESBK1X  DS    XL8                                                              
RESBK2H  DS    XL8                                                              
RESBK2   DS    CL8      9   27    8  A  U H             T        Y    0         
RESBK2X  DS    XL8                                                              
RESBK3H  DS    XL8                                                              
RESBK3   DS    CL8      9   40    8  A  U H             T        Y    0         
RESBK3X  DS    XL8                                                              
RESBK4H  DS    XL8                                                              
RESBK4   DS    CL8      9   53    8  A  U H             T        Y    0         
RESBK4X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     9   64   17  A  P N             T        Y              
RESHD1H  DS    XL8                                                              
RESHD1   DS    CL52    10   10   52  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   77    4  A  P N             T        Y              
RESHD2H  DS    XL8                                                              
RESHD2   DS    CL52    11   10   52  A  P N             T        Y              
RESPRGH  DS    XL8                                                              
RESPRG   DS    CL17    11   63   17  A  U H             T        Y    0         
RESPRGX  DS    XL8                                                              
RESDM1H  DS    XL8                                                              
RESDM1   DS    CL7     12    2    7  A  P N             T        Y              
RESSELH  DS    XL8                                                              
RESSEL   DS    CL1     12   10    1  A  U N             T        Y    0         
RESSELX  DS    XL8                                                              
RESLN1H  DS    XL8                                                              
RESLN1   DS    CL49    12   12   49  A  P N             T        Y    0         
RESLN1X  DS    XL8                                                              
RESRTGH  DS    XL8                                                              
RESRTG   DS    CL10    12   63   10  A  U N             T        Y    0         
RESRTGX  DS    XL8                                                              
RESCPPH  DS    XL8                                                              
RESCPP   DS    CL7     12   74    7  A  P N             T        Y              
RESLN2H  DS    XL8                                                              
RESLN2   DS    CL56    13    5   56  A  P N             T        Y              
RESSHPH  DS    XL8                                                              
RESSHP   DS    CL10    13   63   10  A  U N             T        Y    0         
RESSHPX  DS    XL8                                                              
RESDM2H  DS    XL8                                                              
RESDM2   DS    CL7     14    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   10    1  A  U N             T        Y    0         
         DS    XL8                                                              
RESLN3H  DS    XL8                                                              
RESLN3   DS    CL49    14   12   49  A  P N             T        Y    0         
RESLN3X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     14   74    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL56    15    5   56  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   10    1  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL49    16   12   49  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16   74    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL56    17    5   56  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   10    1  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL49    18   12   49  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18   74    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL56    19    5   56  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     20    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   10    1  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL49    20   12   49  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     20   74    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL56    21    5   56  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   10    1  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL49    22   12   49  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     22   74    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL56    23    5   56  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   63   10  A  U N             T        Y    0         
         DS    XL8                                                              
RESCMTH  DS    XL8                                                              
RESCMT   DS    CL10    24    2   10  A  P N             T        Y              
RESCMT1H DS    XL8                                                              
RESCMT1  DS    CL64    24   13   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
RESLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
RESWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2296 BYTES                            
