*          DATA SET SPNWSE5D   AT LEVEL 006 AS OF 12/18/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207E5D      DATE 12/18/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SPLMEDH  DS    CL8                                                              
SPLMED   DS    CL1      5   10    1  A  U N             T        Y    1         
SPLMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
SPLBYRH  DS    CL8                                                              
SPLBYR   DS    CL3      5   27    3  A  U N             T        Y    2         
SPLBYRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   37    8  A  P H             T        Y              
SPLCAMH  DS    CL8                                                              
SPLCAM   DS    CL5      5   46    5  A  U N             T        Y    3         
SPLCAMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   61    7  A  P H             T        Y              
SPLSTNH  DS    CL8                                                              
SPLSTN   DS    CL8      5   69    8  A  U N             T        Y    0         
SPLSTNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
SPLDAYH  DS    CL8                                                              
SPLDAY   DS    CL7      6   10    7  A  U N             T        Y    0         
SPLDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   20    5  A  P H             T        Y              
SPLTIMH  DS    CL8                                                              
SPLTIM   DS    CL11     6   27   11  A  U N             T        Y    0         
SPLTIMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   46    7  A  P H             T        Y              
SPLDLNH  DS    CL8                                                              
SPLDLN   DS    CL5      6   54    5  A  U N             T        Y    0         
SPLDLNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   61    4  A  P N             T        Y              
SPLDEMH  DS    CL8                                                              
SPLDEM   DS    CL7      6   69    7  A  U H             T        Y    0         
SPLDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SPLPRGH  DS    CL8                                                              
SPLPRG   DS    CL17     7   10   17  A  U H             T        Y    0         
SPLPRGX  DS    CL8                                                              
SPLSUBH  DS    CL8                                                              
SPLSUB   DS    CL10     7   46   10  A  P H             T        Y              
SPLSDPH  DS    CL8                                                              
SPLSDP   DS    CL1      7   57    1  A  P N             T        Y    0         
SPLSDPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   61    6  A  P H             T        Y              
SPLSRCH  DS    CL8                                                              
SPLSRC   DS    CL3      7   69    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
SPLCSTH  DS    CL8                                                              
SPLCST   DS    CL9      8   10    9  A  U H             T        Y    0         
SPLCSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8   20    6  A  P N             T        Y              
SPLWKYH  DS    CL8                                                              
SPLWKY   DS    CL8      8   27    8  A  U H             T        Y    0         
SPLWKYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   37    7  A  P N             T        Y              
SPLUPGH  DS    CL8                                                              
SPLUPG   DS    CL32     8   46   32  A  U H             T        Y    0         
SPLUPGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
SPLBK1H  DS    CL8                                                              
SPLBK1   DS    CL7      9   17    7  A  U H             T        Y    0         
SPLBK1X  DS    CL8                                                              
SPLBK2H  DS    CL8                                                              
SPLBK2   DS    CL7      9   31    7  A  U H             T        Y    0         
SPLBK2X  DS    CL8                                                              
SPLBK3H  DS    CL8                                                              
SPLBK3   DS    CL7      9   45    7  A  U H             T        Y    0         
SPLBK3X  DS    CL8                                                              
SPLBK4H  DS    CL8                                                              
SPLBK4   DS    CL7      9   59    7  A  U H             T        Y    0         
SPLBK4X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      9   71    9  A  P N             T        Y              
SPLMK1H  DS    CL8                                                              
SPLMK1   DS    CL29    10    2   29  A  P N             T        Y              
SPLRT1H  DS    CL8                                                              
SPLRT1   DS    CL12    11   12   12  A  P N             T        Y              
SPLRT2H  DS    CL8                                                              
SPLRT2   DS    CL12    11   26   12  A  P N             T        Y              
SPLRT3H  DS    CL8                                                              
SPLRT3   DS    CL12    11   40   12  A  P N             T        Y              
SPLRT4H  DS    CL8                                                              
SPLRT4   DS    CL12    11   54   12  A  P N             T        Y              
SPLPRJH  DS    CL8                                                              
SPLPRJ   DS    CL12    11   68   12  A  U H             T        Y              
SPLMK2H  DS    CL8                                                              
SPLMK2   DS    CL29    12    2   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   12   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   26   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   40   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   54   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   68   12  A  U H             T        Y              
SPLMK3H  DS    CL8                                                              
SPLMK3   DS    CL29    14    2   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   12   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   26   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   40   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   54   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   68   12  A  U H             T        Y              
SPLMK4H  DS    CL8                                                              
SPLMK4   DS    CL29    16    2   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   12   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   26   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   40   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   54   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   68   12  A  U H             T        Y              
SPLMK5H  DS    CL8                                                              
SPLMK5   DS    CL29    18    2   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   12   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   26   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   40   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   54   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   68   12  A  U H             T        Y              
SPLMK6H  DS    CL8                                                              
SPLMK6   DS    CL29    20    2   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   12   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   26   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   40   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   54   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   68   12  A  U H             T        Y              
SPLMK7H  DS    CL8                                                              
SPLMK7   DS    CL29    22    2   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   12   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   26   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   40   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   54   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   68   12  A  U H             T        Y              
SPLFUTH  DS    CL8                                                              
SPLFUT   DS    CL65    24    2   65  A  P N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
