*          DATA SET SPNWSF9D   AT LEVEL 002 AS OF 02/08/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207F9D      DATE 02/08/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RECL4H   DS    CL8                                                              
RECL4    DS    CL79     4    1   79  A   P    H         T        Y              
RECL5H   DS    CL8                                                              
RECL5    DS    CL79     5    1   79  A   P    H         T        Y              
RECL6H   DS    CL8                                                              
RECL6    DS    CL79     6    1   79  A   P    N         T        Y              
RECL7H   DS    CL8                                                              
RECL7    DS    CL79     7    1   79  A   P    N         T        Y              
RECL8H   DS    CL8                                                              
RECL8    DS    CL79     8    1   79  A   P    N         T        Y              
RECL9H   DS    CL8                                                              
RECL9    DS    CL79     9    1   79  A   P    N         T        Y              
RECL10H  DS    CL8                                                              
RECL10   DS    CL79    10    1   79  A   P    N         T        Y              
RECL11H  DS    CL8                                                              
RECL11   DS    CL79    11    1   79  A   P    N         T        Y              
RECL12H  DS    CL8                                                              
RECL12   DS    CL79    12    1   79  A   P    N         T        Y              
RECL13H  DS    CL8                                                              
RECL13   DS    CL79    13    1   79  A   P    N         T        Y              
RECL14H  DS    CL8                                                              
RECL14   DS    CL79    14    1   79  A   P    N         T        Y              
RECL15H  DS    CL8                                                              
RECL15   DS    CL79    15    1   79  A   P    N         T        Y              
RECL16H  DS    CL8                                                              
RECL16   DS    CL79    16    1   79  A   P    N         T        Y              
RECL17H  DS    CL8                                                              
RECL17   DS    CL79    17    1   79  A   P    N         T        Y              
RECL18H  DS    CL8                                                              
RECL18   DS    CL79    18    1   79  A   P    N         T        Y              
RECL19H  DS    CL8                                                              
RECL19   DS    CL79    19    1   79  A   P    N         T        Y              
RECL20H  DS    CL8                                                              
RECL20   DS    CL79    20    1   79  A   P    N         T        Y              
RECL21H  DS    CL8                                                              
RECL21   DS    CL79    21    1   79  A   P    N         T        Y              
RECL22H  DS    CL8                                                              
RECL22   DS    CL79    22    1   79  A   P    N         T        Y              
RECL23H  DS    CL8                                                              
RECL23   DS    CL79    23    1   79  A   P    N         T        Y              
RECL24H  DS    CL8                                                              
RECL24   DS    CL79    24    1   79  A   P    N         T        Y              
RECLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
RECWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1832 BYTES                            
