*          DATA SET SPNWSFED   AT LEVEL 002 AS OF 02/28/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207FED      DATE 02/28/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
BYRMEDH  DS    CL8                                                              
BYRMED   DS    CL1      5   12    1  A   U    N         T        Y    1         
BYRMEDX  DS    CL8                                                              
BYRMDNH  DS    CL8                                                              
BYRMDN   DS    CL10     5   19   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    H         T        Y              
BYRBYRH  DS    CL8                                                              
BYRBYR   DS    CL3      6   12    3  A   U    N         T        Y    2         
BYRBYRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    N         T        Y              
BYRPASH  DS    CL8                                                              
BYRPAS   DS    CL10     8   12   10  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4     10    2    4  A   P    N         T        Y              
BYRNAMH  DS    CL8                                                              
BYRNAM   DS    CL20    10   12   20  A   U    H         T        Y              
BYRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
BYRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 160  BYTES                            
