*          DATA SET SPNWSEFD   AT LEVEL 006 AS OF 05/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207EFD      DATE 05/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P N             T        Y              
UPRREQH  DS    CL8                                                              
UPRREQ   DS    CL3      5   20    3  A  U N             T        Y    0         
UPRREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     6    2   12  A  P H             T        Y              
UPRWENH  DS    CL8                                                              
UPRWEN   DS    CL9      6   20    9  A  U N             T        Y    0         
UPRWENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
UPRDIDH  DS    CL8                                                              
UPRDID   DS    CL10     7   20   10  A  U N             T        Y    0         
UPRDIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
UPROUTH  DS    CL8                                                              
UPROUT   DS    CL6      8   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P H             T        Y              
UPRMEDH  DS    CL8                                                              
UPRMED   DS    CL1     10   20    1  A  U N             T        Y    0         
UPRMEDX  DS    CL8                                                              
UPRMDNH  DS    CL8                                                              
UPRMDN   DS    CL10    10   30   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P H             T        Y              
UPRBYRH  DS    CL8                                                              
UPRBYR   DS    CL3     11   20    3  A  U N             T        Y    0         
UPRBYRX  DS    CL8                                                              
UPRBYNH  DS    CL8                                                              
UPRBYN   DS    CL20    11   30   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
UPRCMPH  DS    CL8                                                              
UPRCMP   DS    CL8     12   20    8  A  U N             T        Y    0         
UPRCMPX  DS    CL8                                                              
UPRCMNH  DS    CL8                                                              
UPRCMN   DS    CL20    12   30   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
UPRMSTH  DS    CL8                                                              
UPRMST   DS    CL9     13   20    9  A  U N             T        Y    0         
UPRMSTX  DS    CL8                                                              
UPRMSNH  DS    CL8                                                              
UPRMSN   DS    CL20    13   30   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
UPRDPLH  DS    CL8                                                              
UPRDPL   DS    CL4     14   20    4  A  U N             T        Y    0         
UPRDPLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
UPRRNKH  DS    CL8                                                              
UPRRNK   DS    CL4     16   20    4  A  U N             T        Y    0         
UPRRNKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    16   30   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
UPRDEMH  DS    CL8                                                              
UPRDEM   DS    CL15    17   20   15  A  U N             T        Y    0         
UPRDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    19    2   14  A  P N             T        Y              
UPRBRKH  DS    CL8                                                              
UPRBRK   DS    CL1     19   20    1  A  U N             T        Y    0         
UPRBRKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    20    2   14  A  P N             T        Y              
UPRSECH  DS    CL8                                                              
UPRSEC   DS    CL1     20   20    1  A  U N             T        Y    0         
UPRSECX  DS    CL8                                                              
UPRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
UPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 640  BYTES                            
