*          DATA SET SPNWSD5D   AT LEVEL 002 AS OF 03/21/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207D5D      DATE 03/21/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
WRKCPEH  DS    XL8                                                              
WRKCPE   DS    CL61     4    2   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   63    6  A  P N             T        Y              
WRKSCRH  DS    XL8                                                              
WRKSCR   DS    CL10     4   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     5    2   10  A  P H             T        Y              
WRKDCPH  DS    XL8                                                              
WRKDCP   DS    CL14     5   14   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL39     5   29   39  A  P H             T        Y              
WRKCPMH  DS    XL8                                                              
WRKCPM   DS    CL12     5   69   12  A  P H             T        Y              
WRKL1H   DS    XL8                                                              
WRKL1    DS    CL2      6    2    2  A  U N             T        Y              
WRKLSTH  DS    XL8                                                              
WRKLST   DS    CL8      6    5    8  A  P H             T        Y              
WRKRATH  DS    XL8                                                              
WRKRAT   DS    CL6      6   14    6  A  U N             T        Y              
WRKCPPH  DS    XL8                                                              
WRKCPP   DS    CL7      6   21    7  A  P H             T        Y              
WRKDAYH  DS    XL8                                                              
WRKDAY   DS    CL7      6   29    7  A  U N             T        Y              
WRKTIMH  DS    XL8                                                              
WRKTIM   DS    CL11     6   37   11  A  U N             T        Y              
WRKCSTH  DS    XL8                                                              
WRKCST   DS    CL6      6   49    6  A  U N             T        Y              
WRKPRGH  DS    XL8                                                              
WRKPRG   DS    CL12     6   56   12  A  U N             T        Y              
WRKDLMH  DS    XL8                                                              
WRKDLM   DS    CL12     6   69   12  A  P H             T        Y              
WRKL2H   DS    XL8                                                              
WRKL2    DS    CL2      7    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     7   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     7   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2      8    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2      9    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      9   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      9   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     10   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     10   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     11   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     11   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     12   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   69   12  A  P H             T        Y              
WRKL8H   DS    XL8                                                              
WRKL8    DS    CL2     13    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     13   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     14   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     14   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     15   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     15   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     16   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     16   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     17   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     17   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     18   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     18   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     19   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     19   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   69   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     20   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     20   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   69   12  A  P H             T        Y              
WRKFINH  DS    XL8                                                              
WRKFIN   DS    CL2     21    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    5    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     21   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   21    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     21   29    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   37   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   49    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   69   12  A  P H             T        Y              
WRKFUTH  DS    XL8                                                              
WRKFUT   DS    CL79    24    2   79  A  P N             T        Y              
WRKLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
WRKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2592 BYTES                            
