*          DATA SET SPNWSF7D   AT LEVEL 001 AS OF 10/14/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207F7D      DATE 10/14/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TREMEDH  DS    CL8                                                              
TREMED   DS    CL1      5   10    1  A  U N             T        Y    1         
TREMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
TREBYRH  DS    CL8                                                              
TREBYR   DS    CL3      5   27    3  A  U N             T        Y    2         
TREBYRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   37    8  A  P H             T        Y              
TRENUMH  DS    CL8                                                              
TRENUM   DS    CL5      5   47    5  A  U N             T        Y    3         
TRENUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   59    7  A  P H             T        Y              
TRESTAH  DS    CL8                                                              
TRESTA   DS    CL8      5   70    8  A  U N             T        Y    0         
TRESTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
TREDAYH  DS    CL8                                                              
TREDAY   DS    CL7      6   10    7  A  U N             T        Y    0         
TREDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   20    5  A  P H             T        Y              
TRETIMH  DS    CL8                                                              
TRETIM   DS    CL11     6   27   11  A  U N             T        Y    0         
TRETIMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   47    6  A  P H             T        Y              
TREDLNH  DS    CL8                                                              
TREDLN   DS    CL5      6   54    5  A  U N             T        Y    0         
TREDLNX  DS    CL8                                                              
TRESUBH  DS    CL8                                                              
TRESUB   DS    CL10     6   64   10  A  P H             T        Y              
TRESDPH  DS    CL8                                                              
TRESDP   DS    CL1      6   75    1  A  P N             T        Y    0         
TRESDPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   47    6  A  P H             T        Y              
TRESRCH  DS    CL8                                                              
TRESRC   DS    CL3      7   54    3  A  P N             T        Y    0         
TRESRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   64    6  A  P N             T        Y              
TREWKYH  DS    CL8                                                              
TREWKY   DS    CL8      7   72    8  A  U H             T        Y    0         
TREWKYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
TRECSTH  DS    CL8                                                              
TRECST   DS    CL8      8    8    8  A  U H             T        Y    0         
TRECSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   29    7  A  P N             T        Y              
TREUPGH  DS    CL8                                                              
TREUPG   DS    CL32     8   38   32  A  U H             T        Y    0         
TREUPGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
TREBK1H  DS    CL8                                                              
TREBK1   DS    CL8      9   14    8  A  U H             T        Y    0         
TREBK1X  DS    CL8                                                              
TREBK2H  DS    CL8                                                              
TREBK2   DS    CL8      9   27    8  A  U H             T        Y    0         
TREBK2X  DS    CL8                                                              
TREBK3H  DS    CL8                                                              
TREBK3   DS    CL8      9   40    8  A  U H             T        Y    0         
TREBK3X  DS    CL8                                                              
TREBK4H  DS    CL8                                                              
TREBK4   DS    CL8      9   53    8  A  U H             T        Y    0         
TREBK4X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     9   64   17  A  P N             T        Y              
TREHD1H  DS    CL8                                                              
TREHD1   DS    CL52    10   10   52  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   77    4  A  P N             T        Y              
TREHD2H  DS    CL8                                                              
TREHD2   DS    CL52    11   10   52  A  P N             T        Y              
TREPRGH  DS    CL8                                                              
TREPRG   DS    CL17    11   63   17  A  U H             T        Y    0         
TREPRGX  DS    CL8                                                              
TREDM1H  DS    CL8                                                              
TREDM1   DS    CL7     12    2    7  A  P N             T        Y              
TRESELH  DS    CL8                                                              
TRESEL   DS    CL1     12   10    1  A  U N             T        Y    0         
TRESELX  DS    CL8                                                              
TRELN1H  DS    CL8                                                              
TRELN1   DS    CL49    12   12   49  A  P N             T        Y    0         
TRELN1X  DS    CL8                                                              
TRERTGH  DS    CL8                                                              
TRERTG   DS    CL10    12   63   10  A  U N             T        Y    0         
TRERTGX  DS    CL8                                                              
TRECPPH  DS    CL8                                                              
TRECPP   DS    CL7     12   74    7  A  P N             T        Y              
TRELN2H  DS    CL8                                                              
TRELN2   DS    CL56    13    5   56  A  P N             T        Y              
TRESHPH  DS    CL8                                                              
TRESHP   DS    CL10    13   63   10  A  U N             T        Y    0         
TRESHPX  DS    CL8                                                              
TREDM2H  DS    CL8                                                              
TREDM2   DS    CL7     14    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   10    1  A  U N             T        Y    0         
         DS    CL8                                                              
TRELN3H  DS    CL8                                                              
TRELN3   DS    CL49    14   12   49  A  P N             T        Y    0         
TRELN3X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    15    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   10    1  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    16   12   49  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    17    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   10    1  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    18   12   49  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    19    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   10    1  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    20   12   49  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    20   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    21    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   10    1  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    22   12   49  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    22   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    23    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
TRECMTH  DS    CL8                                                              
TRECMT   DS    CL10    24    2   10  A  P N             T        Y              
TRECMT1H DS    CL8                                                              
TRECMT1  DS    CL64    24   13   64  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
TRELAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
TREWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2232 BYTES                            
