*          DATA SET SPNWSFFD   AT LEVEL 006 AS OF 02/28/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207FFD      DATE 02/28/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BWSMSGH  DS    CL8                                                              
BWSMSG   DS    CL60     1    2   60  A   P    H         T        Y              
BWSSRVH  DS    CL8                                                              
BWSSRV   DS    CL17     1   63   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  A   P    N         T        Y              
BWSRECH  DS    CL8                                                              
BWSREC   DS    CL8      2   10    8  A   U    H    M    T    I   Y              
         DS    CL8                                                              
         DS    CL6      2   20    6  A   P    N         T        Y              
BWSACTH  DS    CL8                                                              
BWSACT   DS    CL8      2   27    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL3      2   37    3  A   P    N         T        Y              
BWSKEYH  DS    CL8                                                              
BWSKEY   DS    CL21     2   41   21  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4      2   63    4  A   P    N         T        Y              
BWSKY2H  DS    CL8                                                              
BWSKY2   DS    CL12     2   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      3    2    7  A   P    N         T        Y              
BWSOPTH  DS    CL8                                                              
BWSOPT   DS    CL52     3   10   52  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      3   63    3  A   P    N         T        Y              
BWSPWDH  DS    CL8                                                              
BWSPWD   DS    CL10     3   68   10  A   U    Z         T        Y              
BWSTABH  DS    CL8                                                              
BWSTAB   DS    CL1      3   79    1  A   U    N         T        Y              
BWSLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BWSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 344  BYTES                            
