*          DATA SET SPNWSFAD   AT LEVEL 008 AS OF 12/03/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207FAD      DATE 12/03/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SSKCPEH  DS    XL8                                                              
SSKCPE   DS    CL61     4    2   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   63    6  A  P N             T        Y              
SSKSCRH  DS    XL8                                                              
SSKSCR   DS    CL10     4   70   10  A  U N             T        Y              
SSKCL1H  DS    XL8                                                              
SSKCL1   DS    CL56     5   25   56  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL22     6    2   22  A  P H             T        Y              
SSKCL2H  DS    XL8                                                              
SSKCL2   DS    CL56     6   25   56  A  P H             T        Y              
SSKL1H   DS    XL8                                                              
SSKL1    DS    CL2      7    2    2  A  U N             T        Y              
SSKLSPH  DS    XL8                                                              
SSKLSP   DS    CL19     7    5   19  A  P N             T        Y              
SSKSKDH  DS    XL8                                                              
SSKSKD   DS    CL55     7   25   55  A  U N             T        Y              
SSKL2H   DS    XL8                                                              
SSKL2    DS    CL2      8    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19     8    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55     8   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19     9    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55     9   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    10    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    10   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    11    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    11   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    12    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    12   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    13    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    13   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    14    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    14   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    15    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    15   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    16    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    16   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    17    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    17   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    18    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    18   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    19    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    19   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    20    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    20   25   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    21    5   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL55    21   25   55  A  U N             T        Y              
SSKCMTH  DS    XL8                                                              
SSKCMT   DS    CL70    22    2   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  P H             T        Y              
SSKGOLH  DS    XL8                                                              
SSKGOL   DS    CL76    23    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24    2    1  A  P H             T        Y              
SSKACTH  DS    XL8                                                              
SSKACT   DS    CL76    24    4   76  A  P N             T        Y              
SSKLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SSKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
