*          DATA SET SPNWSF2D   AT LEVEL 002 AS OF 04/07/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207F2D      DATE 04/07/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL79     4    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      5    2    3  A  P H             T        Y              
ORBNUMH  DS    CL8                                                              
ORBNUM   DS    CL3      5    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      5   10    4  A  P H             T        Y              
ORBDESH  DS    CL8                                                              
ORBDES   DS    CL17     5   15   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      5   34    4  A  P H             T        Y              
ORBCSTH  DS    CL8                                                              
ORBCST   DS    CL6      5   39    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   47    5  A  P N             T        Y              
ORBDATH  DS    CL8                                                              
ORBDAT   DS    CL17     5   53   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   72    6  A  P N             T        Y              
ORBUPDH  DS    CL8                                                              
ORBUPD   DS    CL1      5   79    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
ORBDEMH  DS    CL8                                                              
ORBDEM   DS    CL70     6   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
ORBCOMH  DS    CL8                                                              
ORBCOM   DS    CL70     7   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33     8    2   33  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17     8   36   17  A  P H             T        Y              
ORBDN1H  DS    CL8                                                              
ORBDN1   DS    CL6      8   54    6  A  P H             T        Y              
ORBDN2H  DS    CL8                                                              
ORBDN2   DS    CL6      8   61    6  A  P H             T        Y              
ORBDN3H  DS    CL8                                                              
ORBDN3   DS    CL6      8   68    6  A  P H             T        Y              
ORBDN4H  DS    CL8                                                              
ORBDN4   DS    CL6      8   75    6  A  P H             T        Y              
ORBL1H   DS    CL8                                                              
ORBL1    DS    CL2      9    2    2  A  U N             T        Y              
ORBLINH  DS    CL8                                                              
ORBLIN   DS    CL3      9    5    3  A  P N             T        Y              
ORBDAYH  DS    CL8                                                              
ORBDAY   DS    CL7      9    9    7  A  U N             T        Y              
ORBTIMH  DS    CL8                                                              
ORBTIM   DS    CL11     9   17   11  A  U N             T        Y              
ORBCOSH  DS    CL8                                                              
ORBCOS   DS    CL6      9   29    6  A  U N             T        Y              
ORBPRDH  DS    CL8                                                              
ORBPRD   DS    CL45     9   36   45  A  P N             T        Y              
ORBL2H   DS    CL8                                                              
ORBL2    DS    CL2     10    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   29    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    10   36   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   29    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    11   36   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   29    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    12   36   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   29    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    13   36   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   29    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    14   36   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   29    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    15   36   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   29    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    16   36   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    5    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17    9    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   17   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   29    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    17   36   45  A  P N             T        Y              
ORBPFKH  DS    CL8                                                              
ORBPFK   DS    CL79    24    2   79  A  P N             T        Y              
ORBLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
ORBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1728 BYTES                            
