*          DATA SET SPNWSF8D   AT LEVEL 014 AS OF 04/15/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207F8D      DATE 04/15/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
REPREQH  DS    CL8                                                              
REPREQ   DS    CL3      5   20    3  A  U N             T        Y    0         
REPREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     6    2   12  A  P H             T        Y              
REPWENH  DS    CL8                                                              
REPWEN   DS    CL9      6   20    9  A  U N             T        Y    0         
REPWENX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPDIDH  DS    CL8                                                              
REPDID   DS    CL10     7   20   10  A  U N             T        Y    0         
REPDIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
REPOUTH  DS    CL8                                                              
REPOUT   DS    CL6      8   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P H             T        Y              
REPMEDH  DS    CL8                                                              
REPMED   DS    CL1     10   20    1  A  U N             T        Y    0         
REPMEDX  DS    CL8                                                              
REPMDNH  DS    CL8                                                              
REPMDN   DS    CL10    10   30   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P H             T        Y              
REPBYRH  DS    CL8                                                              
REPBYR   DS    CL3     11   20    3  A  U N             T        Y    0         
REPBYRX  DS    CL8                                                              
REPBYNH  DS    CL8                                                              
REPBYN   DS    CL20    11   30   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
REPCMPH  DS    CL8                                                              
REPCMP   DS    CL9     12   20    9  A  U N             T        Y    0         
REPCMPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
REPMSTH  DS    CL8                                                              
REPMST   DS    CL9     13   20    9  A  U N             T        Y    0         
REPMSTX  DS    CL8                                                              
REPMSNH  DS    CL8                                                              
REPMSN   DS    CL20    13   30   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
REPDPLH  DS    CL8                                                              
REPDPL   DS    CL4     14   20    4  A  U N             T        Y    0         
REPDPLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
REPRNKH  DS    CL8                                                              
REPRNK   DS    CL4     16   20    4  A  U N             T        Y    0         
REPRNKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL31    16   37   31  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A  P N             T        Y              
REPRATH  DS    CL8                                                              
REPRAT   DS    CL48    17   20   48  A  U N             T        Y    0         
REPRATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
REPOPTH  DS    CL8                                                              
REPOPT   DS    CL15    18   20   15  A  U N             T        Y    0         
REPOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    18   37   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    19    2   14  A  P N             T        Y              
REPSUMH  DS    CL8                                                              
REPSUM   DS    CL3     19   20    3  A  U N             T        Y    0         
REPSUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    19   37   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    20    2   14  A  P N             T        Y              
REPDEMH  DS    CL8                                                              
REPDEM   DS    CL1     20   20    1  A  U N             T        Y    0         
REPDEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    21    2   16  A  P N             T        Y              
REPCPMH  DS    CL8                                                              
REPCPM   DS    CL1     21   20    1  A  U N             T        Y    0         
REPCPMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
REPCSTH  DS    CL8                                                              
REPCST   DS    CL1     22   20    1  A  U N             T        Y    0         
REPCSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
REPSPCH  DS    CL8                                                              
REPSPC   DS    CL1     23   20    1  A  U N             T        Y    0         
REPSPCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     23   37    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    24    2   15  A  P N             T        Y              
REPPSTH  DS    CL8                                                              
REPPST   DS    CL1     24   20    1  A  U N             T        Y    0         
REPPSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    24   37   18  A  P N             T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 952  BYTES                            
