*          DATA SET SPNWSE4D   AT LEVEL 005 AS OF 12/03/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207E4D      DATE 12/03/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
COMMEDH  DS    XL8                                                              
COMMED   DS    CL1      5    8    1  A  U N             T        Y    1         
COMMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   12    5  A  P H             T        Y              
COMBYRH  DS    XL8                                                              
COMBYR   DS    CL3      5   18    3  A  U N             T        Y    2         
COMBYRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   23    5  A  P H             T        Y              
COMCAMH  DS    XL8                                                              
COMCAM   DS    CL5      5   29    5  A  U N             T        Y    3         
COMCAMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   40    7  A  P H             T        Y              
COMSTAH  DS    XL8                                                              
COMSTA   DS    CL8      5   48    8  A  U N             T        Y    0         
COMSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   59    4  A  P H             T        Y              
COMLINH  DS    XL8                                                              
COMLIN   DS    CL3      5   64    3  A  U N             T        Y    0         
COMLINX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   69    4  A  P H             T        Y              
COMSEQH  DS    XL8                                                              
COMSEQ   DS    CL3      5   74    3  A  U N             T        Y    0         
COMSEQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
COMDAYH  DS    XL8                                                              
COMDAY   DS    CL7      6   10    7  A  U N             T        Y    0         
COMDAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   20    5  A  P H             T        Y              
COMTIMH  DS    XL8                                                              
COMTIM   DS    CL11     6   27   11  A  U N             T        Y    0         
COMTIMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   46    7  A  P H             T        Y              
COMDLNH  DS    XL8                                                              
COMDLN   DS    CL5      6   54    5  A  U N             T        Y    0         
COMDLNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   61    4  A  P N             T        Y              
COMDEMH  DS    XL8                                                              
COMDEM   DS    CL7      6   69    7  A  U H             T        Y    0         
COMDEMX  DS    XL8                                                              
COMSUBH  DS    XL8                                                              
COMSUB   DS    CL10     7    2   10  A  P H             T        Y              
COMSDPH  DS    XL8                                                              
COMSDP   DS    CL1      7   13    1  A  P N             T        Y    0         
COMSDPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P N             T        Y              
COMWKYH  DS    XL8                                                              
COMWKY   DS    CL8      7   27    8  A  U H             T        Y    0         
COMWKYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   37    7  A  P N             T        Y              
COMUPGH  DS    XL8                                                              
COMUPG   DS    CL32     7   47   32  A  P N             T        Y    0         
COMUPGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
COMBK1H  DS    XL8                                                              
COMBK1   DS    CL8      8   12    8  A  U H             T        Y    0         
COMBK1X  DS    XL8                                                              
COMPT1H  DS    XL8                                                              
COMPT1   DS    CL4      8   21    4  A  P N             T        Y              
COMBK2H  DS    XL8                                                              
COMBK2   DS    CL8      8   26    8  A  U H             T        Y    0         
COMBK2X  DS    XL8                                                              
COMPT2H  DS    XL8                                                              
COMPT2   DS    CL4      8   35    4  A  P N             T        Y              
COMBK3H  DS    XL8                                                              
COMBK3   DS    CL8      8   40    8  A  U H             T        Y    0         
COMBK3X  DS    XL8                                                              
COMPT3H  DS    XL8                                                              
COMPT3   DS    CL4      8   49    4  A  P N             T        Y              
COMBK4H  DS    XL8                                                              
COMBK4   DS    CL8      8   54    8  A  U H             T        Y    0         
COMBK4X  DS    XL8                                                              
COMPT4H  DS    XL8                                                              
COMPT4   DS    CL4      8   63    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   68    4  A  P N             T        Y              
COMPPTH  DS    XL8                                                              
COMPPT   DS    CL5      8   75    5  A  U H             T        Y              
COMLN1H  DS    XL8                                                              
COMLN1   DS    CL65     9    2   65  A  P N             T        Y              
COMPRGH  DS    XL8                                                              
COMPRG   DS    CL12     9   68   12  A  U H             T        Y              
COMLN2H  DS    XL8                                                              
COMLN2   DS    CL65    10    2   65  A  P N             T        Y              
COMRSHH  DS    XL8                                                              
COMRSH   DS    CL12    10   68   12  A  U H             T        Y              
COMLN3H  DS    XL8                                                              
COMLN3   DS    CL79    11    2   79  A  P N             T        Y              
COMLN4H  DS    XL8                                                              
COMLN4   DS    CL79    12    2   79  A  P N             T        Y              
COMLN5H  DS    XL8                                                              
COMLN5   DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
COMCUSH  DS    XL8                                                              
COMCUS   DS    CL10    23    2   10  A  P N             T        Y              
COMCUMH  DS    XL8                                                              
COMCUM   DS    CL68    23   13   68  A  P N             T        Y              
COMFUTH  DS    XL8                                                              
COMFUT   DS    CL10    24    2   10  A  P N             T        Y              
COMFUT1H DS    XL8                                                              
COMFUT1  DS    CL54    24   13   54  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   68    6  A  P H             T        Y              
COMSRCH  DS    XL8                                                              
COMSRC   DS    CL3     24   76    3  A  P N             T        Y              
COMLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2112 BYTES                            
