*          DATA SET SPNWSDAD   AT LEVEL 004 AS OF 12/13/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207DAD      DATE 12/13/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
GLLMEDH  DS    CL8                                                              
GLLMED   DS    CL1      5    8    1  A  U N             T        Y    1         
GLLMEDX  DS    CL8                                                              
GLLMDNH  DS    CL8                                                              
GLLMDN   DS    CL10     5   10   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   21    5  A  P H             T        Y              
GLLBYRH  DS    CL8                                                              
GLLBYR   DS    CL3      5   27    3  A  U N             T        Y    2         
GLLBYRX  DS    CL8                                                              
GLLBYNH  DS    CL8                                                              
GLLBYN   DS    CL19     5   31   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   51    5  A  P H             T        Y              
GLLCAMH  DS    CL8                                                              
GLLCAM   DS    CL5      5   57    5  A  U N             T        Y    3         
GLLCAMX  DS    CL8                                                              
GLLCANH  DS    CL8                                                              
GLLCAN   DS    CL18     5   63   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     7    2   78  A  P H             T        Y              
GLLSEL1H DS    CL8                                                              
GLLSEL1  DS    CL3      8    2    3  A  U N             T        Y              
GLLMKT1H DS    CL8                                                              
GLLMKT1  DS    CL4      8    6    4  A  P N             T        Y              
GLLMKN1H DS    CL8                                                              
GLLMKN1  DS    CL24     8   15   24  A  P N             T        Y              
GLLDYP1H DS    CL8                                                              
GLLDYP1  DS    CL1      8   42    1  A  P N             T        Y              
GLLSPL1H DS    CL8                                                              
GLLSPL1  DS    CL3      8   52    3  A  P N             T        Y              
GLLSEL2H DS    CL8                                                              
GLLSEL2  DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     9   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    10   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     11    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    11   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    12   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    13   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    14   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    15   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    16   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    17   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    18   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    19   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    20   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    21   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   52    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    22   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   52    3  A  P N             T        Y              
GLLSELLH DS    CL8                                                              
GLLSELL  DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    23   15   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   52    3  A  P N             T        Y              
GLLLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
GLLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1456 BYTES                            
