*          DATA SET SPNWSD3D   AT LEVEL 001 AS OF 09/01/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207D3D      DATE 09/01/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
AUDMEDH  DS    XL8                                                              
AUDMED   DS    CL1      5   10    1  A  U N             T        Y    1         
AUDMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
AUDBYRH  DS    XL8                                                              
AUDBYR   DS    CL3      5   27    3  A  U N             T        Y    2         
AUDBYRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   37    8  A  P H             T        Y              
AUDNUMH  DS    XL8                                                              
AUDNUM   DS    CL5      5   47    5  A  U N             T        Y    3         
AUDNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   59    7  A  P H             T        Y              
AUDSTAH  DS    XL8                                                              
AUDSTA   DS    CL8      5   70    8  A  U N             T        Y    0         
AUDSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
AUDDAYH  DS    XL8                                                              
AUDDAY   DS    CL7      6   10    7  A  U N             T        Y    0         
AUDDAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   20    5  A  P H             T        Y              
AUDTIMH  DS    XL8                                                              
AUDTIM   DS    CL11     6   27   11  A  U N             T        Y    0         
AUDTIMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   47    6  A  P H             T        Y              
AUDDLNH  DS    XL8                                                              
AUDDLN   DS    CL5      6   54    5  A  U N             T        Y    0         
AUDDLNX  DS    XL8                                                              
AUDSUBH  DS    XL8                                                              
AUDSUB   DS    CL10     6   64   10  A  P H             T        Y              
AUDSDPH  DS    XL8                                                              
AUDSDP   DS    CL1      6   75    1  A  P N             T        Y    0         
AUDSDPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
AUDUPGH  DS    XL8                                                              
AUDUPG   DS    CL32     8   10   32  A  U H             T        Y    0         
AUDUPGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12    10   12   12  A  P H             T        Y              
AUDMDMH  DS    XL8                                                              
AUDMDM   DS    CL7     10   32    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL23    10   51   23  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     11   32    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     11   38    3  A  P H             T        Y              
AUDDM1H  DS    XL8                                                              
AUDDM1   DS    CL7     11   46    7  A  U N             T        Y              
AUDDM2H  DS    XL8                                                              
AUDDM2   DS    CL7     11   55    7  A  U N             T        Y              
AUDDM3H  DS    XL8                                                              
AUDDM3   DS    CL7     11   64    7  A  U N             T        Y              
AUDDM4H  DS    XL8                                                              
AUDDM4   DS    CL7     11   73    7  A  U N             T        Y              
AUDL12H  DS    XL8                                                              
AUDL12   DS    CL79    12    2   79  A  P N             T        Y              
AUDL13H  DS    XL8                                                              
AUDL13   DS    CL79    13    2   79  A  P N             T        Y              
AUDL14H  DS    XL8                                                              
AUDL14   DS    CL79    14    2   79  A  P N             T        Y              
AUDL15H  DS    XL8                                                              
AUDL15   DS    CL79    15    2   79  A  P N             T        Y              
AUDL16H  DS    XL8                                                              
AUDL16   DS    CL79    16    2   79  A  P N             T        Y              
AUDL17H  DS    XL8                                                              
AUDL17   DS    CL79    17    2   79  A  P N             T        Y              
AUDL18H  DS    XL8                                                              
AUDL18   DS    CL79    18    2   79  A  P N             T        Y              
AUDL19H  DS    XL8                                                              
AUDL19   DS    CL79    19    2   79  A  P N             T        Y              
AUDL20H  DS    XL8                                                              
AUDL20   DS    CL79    20    2   79  A  P N             T        Y              
AUDL21H  DS    XL8                                                              
AUDL21   DS    CL79    21    2   79  A  P N             T        Y              
AUDL22H  DS    XL8                                                              
AUDL22   DS    CL79    22    2   79  A  P N             T        Y              
AUDL23H  DS    XL8                                                              
AUDL23   DS    CL79    23    2   79  A  P N             T        Y              
AUDL24H  DS    XL8                                                              
AUDL24   DS    CL79    24    2   79  A  P N             T        Y              
AUDLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
AUDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1648 BYTES                            
