*          DATA SET SPNWSFDD   AT LEVEL 005 AS OF 01/02/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207FDD      DATE 01/02/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CPNMEDH  DS    XL8                                                              
CPNMED   DS    CL1      5   18    1  A  U N             T        Y    1         
CPNMEDX  DS    XL8                                                              
CPNMDNH  DS    XL8                                                              
CPNMDN   DS    CL10     5   27   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
CPNBYRH  DS    XL8                                                              
CPNBYR   DS    CL3      6   18    3  A  U N             T        Y    2         
CPNBYRX  DS    XL8                                                              
CPNBYNH  DS    XL8                                                              
CPNBYN   DS    CL20     6   27   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15     7    2   15  A  P N             T        Y              
CPNNUMH  DS    XL8                                                              
CPNNUM   DS    CL5      7   18    5  A  U N             T        Y    3         
CPNNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
CPNCLTH  DS    XL8                                                              
CPNCLT   DS    CL3      9   18    3  A  U H             T        Y    0         
CPNCLTX  DS    XL8                                                              
CPNCNMH  DS    XL8                                                              
CPNCNM   DS    CL20     9   27   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
CPNPRDH  DS    XL8                                                              
CPNPRD   DS    CL3     10   18    3  A  U H             T        Y    0         
CPNPRDX  DS    XL8                                                              
CPNPNMH  DS    XL8                                                              
CPNPNM   DS    CL20    10   27   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   54   13  A  P N             T        Y              
CPNPGRH  DS    XL8                                                              
CPNPGR   DS    CL4     10   69    4  A  U H             T        Y    0         
CPNPGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11    2    9  A  P N             T        Y              
CPNPIGH  DS    XL8                                                              
CPNPIG   DS    CL15    11   18   15  A  U H             T        Y    0         
CPNPIGX  DS    XL8                                                              
CPNPGNH  DS    XL8                                                              
CPNPGN   DS    CL24    11   54   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
CPNESTH  DS    XL8                                                              
CPNEST   DS    CL3     12   18    3  A  U H             T        Y    0         
CPNESTX  DS    XL8                                                              
CPNENMH  DS    XL8                                                              
CPNENM   DS    CL20    12   27   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    13    2   15  A  P N             T        Y              
CPNDATH  DS    XL8                                                              
CPNDAT   DS    CL17    13   18   17  A  U H             T        Y    0         
CPNDATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    13   54   14  A  P N             T        Y              
CPNCCNH  DS    XL8                                                              
CPNCCN   DS    CL5     13   69    5  A  U H             T        Y    0         
CPNCCNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
CPNLENH  DS    XL8                                                              
CPNLEN   DS    CL3     14   18    3  A  U H             T        Y    0         
CPNLENX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
CPNCANH  DS    XL8                                                              
CPNCAN   DS    CL20    15   18   20  A  U H             T        Y    0         
CPNCANX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
CPNUPGH  DS    XL8                                                              
CPNUPG   DS    CL32    16   18   32  A  U H             T        Y    0         
CPNUPGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
CPNUP2H  DS    XL8                                                              
CPNUP2   DS    CL32    17   18   32  A  U H             T        Y    0         
CPNUP2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    17   54   14  A  P N             T        Y              
CPNUPDH  DS    XL8                                                              
CPNUPD   DS    CL8     17   69    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
CPNCOMH  DS    XL8                                                              
CPNCOM   DS    CL60    18   18   60  A  U H             T        Y    0         
CPNCOMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
CPNOPTH  DS    XL8                                                              
CPNOPT   DS    CL60    19   18   60  A  U H             T        Y    0         
CPNOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
CPNSCHH  DS    XL8                                                              
CPNSCH   DS    CL3     20   18    3  A  U H             T        Y    0         
CPNSCHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    20   27   11  A  P N             T        Y              
CPNPERH  DS    XL8                                                              
CPNPER   DS    CL38    20   42   38  A  U H             T        Y    0         
CPNPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
CPNBKSH  DS    XL8                                                              
CPNBKS   DS    CL44    21   14   44  A  U H             T        Y    0         
CPNBKSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21   61    7  A  P N             T        Y              
CPNADJH  DS    XL8                                                              
CPNADJ   DS    CL2     21   69    2  A  U H             T        Y    0         
CPNADJX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    22    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   18    2  A  P N             T        Y              
CPNSL1H  DS    XL8                                                              
CPNSL1   DS    CL3     22   21    3  A  U H             T        Y    0         
CPNSL1X  DS    XL8                                                              
CPNSE1H  DS    XL8                                                              
CPNSE1   DS    CL4     22   25    4  A  U H             T        Y    0         
CPNSE1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   30    2  A  P N             T        Y              
CPNSL2H  DS    XL8                                                              
CPNSL2   DS    CL3     22   33    3  A  U H             T        Y    0         
CPNSL2X  DS    XL8                                                              
CPNSE2H  DS    XL8                                                              
CPNSE2   DS    CL4     22   37    4  A  U H             T        Y    0         
CPNSE2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   42    2  A  P N             T        Y              
CPNSL3H  DS    XL8                                                              
CPNSL3   DS    CL3     22   45    3  A  U H             T        Y    0         
CPNSL3X  DS    XL8                                                              
CPNSE3H  DS    XL8                                                              
CPNSE3   DS    CL4     22   49    4  A  U H             T        Y    0         
CPNSE3X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   54    2  A  P N             T        Y              
CPNSL4H  DS    XL8                                                              
CPNSL4   DS    CL3     22   57    3  A  U H             T        Y    0         
CPNSL4X  DS    XL8                                                              
CPNSE4H  DS    XL8                                                              
CPNSE4   DS    CL4     22   61    4  A  U H             T        Y    0         
CPNSE4X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   66    2  A  P N             T        Y              
CPNSL5H  DS    XL8                                                              
CPNSL5   DS    CL3     22   69    3  A  U H             T        Y    0         
CPNSL5X  DS    XL8                                                              
CPNSE5H  DS    XL8                                                              
CPNSE5   DS    CL4     22   73    4  A  U H             T        Y    0         
CPNSE5X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    23    2   12  A  P N             T        Y              
CPNFW1H  DS    XL8                                                              
CPNFW1   DS    CL62    23   18   62  A  U H             T        Y    0         
CPNFW1X  DS    XL8                                                              
CPNFW2H  DS    XL8                                                              
CPNFW2   DS    CL41    24   18   41  A  U H             T        Y    0         
CPNFW2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    24   60   10  A  P N             T        Y              
CPNFNDH  DS    XL8                                                              
CPNFND   DS    CL8     24   72    8  A  U H             T        Y    0         
CPNFNDX  DS    XL8                                                              
CPNLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
CPNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1688 BYTES                            
