*          DATA SET SPNWSWRK   AT LEVEL 241 AS OF 01/05/12                      
*-----------------------------------------------------------------*             
*       *** NOTE *** NOTE *** NOTE ***                            *             
*   BE VERY CAREFUL BEFORE MAKING ANY CHANGES TO THIS DSECT       *             
*   THAT WILL CHANGE THE DISPLACEMENT OF ANY LABEL.  THERE        *             
*   IS A HARDCODED TABLE IN DRIVADDS THAT CONTAINS DISPLACEMENTS! *             
* EJOR 12NOV02                                                    *             
*-----------------------------------------------------------------*             
***********************************************************************         
* GENERAL EQUATED VALUES                                              *         
***********************************************************************         
*                                  ** RECORD TYPE EQUATES **                    
RECBYR   EQU   1                   BUYER RECORD                                 
RECCAM   EQU   2                   CAMPAIGN RECORD                              
RECWRK   EQU   3                   DETAIL RECORD FOR WORK                       
RECSID   EQU   4                   SID RECORD FOR WORK                          
RECPKG   EQU   5                   PACKAGE RECORD                               
RECORB   EQU   6                   ORBIT RECORD                                 
RECNET   EQU   7                   SPILL                                        
RECCOM   EQU   8                   COMMENT                                      
RECGOL   EQU   9                   GOAL                                         
RECBUY   EQU   10                  BUYS                                         
RECTST   EQU   99                  TEST (DDS ONLY)                              
*                                                                               
*                                  ** SPECIAL ACTION EQUATES **                 
ACTDRP   EQU   ACTLFM8             DISPLAY A REPORT                             
ACTXFR   EQU   ACTAPLO             TRANSFER SID RECORD                          
ACTTFR   EQU   ACTAPLO+1           TRANSFER SID RECORD AND CHANGE               
ACTEST   EQU   ACTAPLO+2           DISPLAY AN ESTIMATE REPORT                   
ACTCOM   EQU   ACTAPLO+3           DISPLAY A COMPETITION REPORT                 
ACTCCP   EQU   ACTAPLO+4           CAMPAIGN COPY                                
ACTUPR   EQU   ACTAPLO+5           REQUEST AN UPDATE REPORT                     
ACTUDT   EQU   ACTAPLO+6           LIST RECORDS (FOR WORK SELECTION)            
ACTSKD   EQU   ACTAPLO+7           LIST RECORDS (FOR SPLIT WK UPD/SKED)         
ACTDEM   EQU   ACTAPLO+8           LIST RECORDS (FOR DEMO DISPLAY)              
ACTSSK   EQU   ACTAPLO+9           LIST RECORDS (FOR WORK SUPER-SKED)           
ACTDUP   EQU   ACTAPLO+10          LIST DUPLICATE RECORDS                       
ACTERA   EQU   ACTAPLO+11          ERASE WORK RECORDS                           
ACTFIX   EQU   ACTAPLO+12          FIX WORK RECORDS                             
ACTSPL   EQU   ACTAPLO+13          ADD SPILL DEMOS TO SPILL MARKETS             
ACTSEN   EQU   ACTAPLO+14          SEND ADDS CONFIRAMTION                       
ACTTRA   EQU   ACTAPLO+15          DMB&B SCHEDULE TRANSMIT                      
ACTTRB   EQU   ACTAPLO+16          DMB&B SCHEDULE TRANSMIT (TEST)               
ACTMKT   EQU   ACTAPLO+17          DISPLAY A SPILL MARKET REPORT                
ACTCAL   EQU   ACTAPLO+18          STATION CALL LETTER CHANGE                   
ACTLED   EQU   ACTAPLO+19          LEAD-IN/LEAD-OUT ANALYSIS                    
ACTROT   EQU   ACTAPLO+20          ROTATIONAL ANALYSIS                          
ACTRLD   EQU   ACTAPLO+21          RELOAD @#$%                                  
ACTAUD   EQU   ACTAPLO+22          AUDIENCE COMPOSITION                         
ACTBYA   EQU   ACTAPLO+23          BUYADD @#$%                                  
*                                                                               
*                                  ** KEY COMPONENT EQUATES **                  
KEYMED   EQU   1                   MEDIA                                        
KEYBYR   EQU   2                   BUYER                                        
KEYCAM   EQU   3                   CAMPAIGN                                     
KEYMKT   EQU   4                   MARKET                                       
KEYSTA   EQU   5                   STATION                                      
KEYDPL   EQU   6                   DAYPART/LENGTH                               
KEYDAY   EQU   7                   DAYS                                         
KEYTIM   EQU   8                   TIMES                                        
*                                                                               
*                                  ** OPTION NUMBERS/MASKS/ROUTNES **           
OPTSIDN  EQU   1                   NSID                                         
OPTSIDB  EQU   X'00000001'                                                      
OPTSIDR  EQU   1                                                                
OPTPRGN  EQU   2                   SID PROGRAM TYPE                             
OPTPRGB  EQU   X'00000002'                                                      
OPTPRGR  EQU   2                                                                
OPTRTGN  EQU   3                   OVERRIDE RATING                              
OPTRTGB  EQU   X'00000004'                                                      
OPTRTGR  EQU   3                                                                
OPTDEMN  EQU   4                   OVERRIDE DEMO LIST                           
OPTDEMB  EQU   X'00000008'                                                      
OPTDEMR  EQU   4                                                                
OPTPRDN  EQU   5                   ALLOCATED PRODUCT FOR POOL TRANSFER          
OPTPRDB  EQU   X'00000010'                                                      
OPTPRDR  EQU   5                                                                
OPTPERN  EQU   6                   PERIOD                                       
OPTPERB  EQU   X'00000020'                                                      
OPTPERR  EQU   6                                                                
OPTIDN   EQU   7                   ID                                           
OPTIDB   EQU   X'00000040'                                                      
OPTIDR   EQU   7                                                                
OPTSLNN  EQU   8                   SPOT LENGTHS                                 
OPTSLNB  EQU   X'00000080'                                                      
OPTSLNR  EQU   8                                                                
OPTDATN  EQU   9                   DATES                                        
OPTDATB  EQU   X'00000100'                                                      
OPTDATR  EQU   9                                                                
OPTLINN  EQU   10                  LINE                                         
OPTLINB  EQU   X'00000200'                                                      
OPTLINR  EQU   10                                                               
OPTSTAN  EQU   11                  STA                                          
OPTSTAB  EQU   X'00000400'                                                      
OPTSTAR  EQU   11                                                               
OPTSDTN  EQU   12                  START DATE                                   
OPTSDTB  EQU   X'00000800'                                                      
OPTSDTR  EQU   12                                                               
*                                                                               
OPTFRMN  EQU   17                  FORMAT                                       
OPTFRMB  EQU   X'00010000'                                                      
OPTDAYN  EQU   18                  DAYPART                                      
OPTDAYB  EQU   X'00020000'                                                      
OPTLENN  EQU   19                  LENGTH                                       
OPTLENB  EQU   X'00040000'                                                      
OPTNSPN  EQU   20                  NOSPILL                                      
OPTNSPB  EQU   X'00080000'                                                      
OPTRNKN  EQU   21                  RANK                                         
OPTRNKB  EQU   X'00100000'                                                      
OPTNCSN  EQU   22                  NOCOST                                       
OPTNCSB  EQU   X'00200000'                                                      
OPTNOGN  EQU   23                  NOGOAL                                       
OPTNOGB  EQU   X'00400000'                                                      
OPTNOTN  EQU   24                  NOTRANS                                      
OPTNOTB  EQU   X'00800000'                                                      
OPTCPMN  EQU   25                  CPM                                          
OPTCPMB  EQU   X'01000000'                                                      
OPTTSTN  EQU   26                  TEST                                         
OPTTSTB  EQU   X'02000000'                                                      
OPTADJN  EQU   27                  AUTOADJ                                      
OPTADJB  EQU   X'04000000'                                                      
OPTDPTN  EQU   28                  DPT                                          
OPTDPTB  EQU   X'08000000'                                                      
OPTSKDN  EQU   29                  SKED                                         
OPTSKDB  EQU   X'10000000'                                                      
OPTSNDN  EQU   30                  SEND                                         
OPTSNDB  EQU   X'20000000'                                                      
OPTXGLN  EQU   31                  XGOAL                                        
OPTXGLB  EQU   X'40000000'                                                      
OPTALGN  EQU   32                  ALLGOALS                                     
OPTALGB  EQU   X'80000000'                                                      
*                                                                               
*                                  ** ASSORTED EQUATES **                       
NMAXWKS  EQU   14                  MAXIMUM N'WEEKS FOR SCHEDULING               
RIEFFDT2 EQU   X'80'               RECORD IDENTIFICATION EQUATES                
RIEFFDT3 EQU   X'40'               (FOR APRECID)                                
RINSID   EQU   X'20'                                                            
RICCAMP  EQU   X'10'               COMPANION CAMPAIGN EXISTS                    
RICANAD  EQU   X'08'               CANADIAN                                     
         EJECT                                                                  
***********************************************************************         
* BWS ERROR EQUATES                                                   *         
***********************************************************************         
FVIMED   EQU   13                  INVALID MEDIA                                
FVICLI   EQU   14                  INVALID CLIENT                               
FVIPRD   EQU   15                  INVALID PRODUCT                              
FVIEST   EQU   16                  INVALID ESTIMATE                             
FVIMKT   EQU   17                  INVALID MARKET                               
FVISTA   EQU   18                  INVALID STATION                              
FVIDAT   EQU   20                  INVALID DATE                                 
FVIDPT   EQU   21                  INVALID DAYPART                              
FVISLN   EQU   23                  INVALID LENGTH                               
FVITIME  EQU   24                  INVALID TIME                                 
FVIREP   EQU   29                  INVALID REP                                  
FVIDAYS  EQU   47                  INVALID DAY EXPRESSION                       
FVITIMES EQU   48                  INVALID TIME EXPRESSION                      
FVSECLOK EQU   55                  SECURITY LOCKOUT                             
FVRECOF  EQU   58                  RECORD OVERFLOW                              
FVIBOOK  EQU   60                  INVALID BOOK                                 
FVIUPG   EQU   63                  INVALID UPGRADE EXPRESSION                   
FVIDAY   EQU   64                  INVALID DAY                                  
FVMAXLIN EQU   65                  TOO MANY LINES ON STATION/ESTIMATE           
FVIBYR   EQU   66                  INVALID BUYER                                
FVICAM   EQU   67                  INVALID CAMPAIGN                             
FVIADJ   EQU   68                  INVALID ADJACENCY CODE                       
FVNOMKTA EQU   69                  MARKET NOT AUTHORIZED                        
FVIPWD   EQU   73                  INVALID PASSWORD                             
FVNOPWD  EQU   74                  ENTER PASSWORD                               
FVCORPWD EQU   75                  ENTER CORRECT PASSWORD                       
FVNOREC  EQU   76                  NO RECORDS ON FILE                           
FVDNEP   EQU   79                  DATES NOT WITHIN ESTIMATE PERIOD             
FVSTENDT EQU   80                  START IS LATER THAN END                      
FVIPRDPL EQU   101                 PRODUCT MUST BE POL                          
FVNOPOLE EQU   125                 NO POL ESTIMATE OPEN FOR BRD POL CLT         
FVILINE  EQU   126                 INVALID LINE NUMBER                          
FVIDPT2  EQU   150                 DAYPART NOT VALID                            
FVNOCPP  EQU   168                 CPP GUIDE NOT FOUND                          
FVNOBSL  EQU   170                 NO BASE SPOT LENGTH DEFINED                  
FVIGRP   EQU   177                 NO GROUP DEFINITION REC ON FILE              
FVIPRIM  EQU   197                 PRIMARY DEMOS MUST MATCH                     
FVNOPEST EQU   226                 NO POL EST OPEN YET                          
FVINPTLG EQU   244                 INPUT IS TOO LONG                            
FVNOSLN  EQU   255                 SPOT LENGTH MISSING                          
FVNOEDT  EQU   256                 END DATE MISSING                             
FVPTL    EQU   257                 PERIOD CANNOT BE LONGER THAN 14 WKS          
FVNOMED  EQU   258                 MEDIA MISSING                                
FVNOCLT  EQU   259                 CLIENT MISSING                               
FVNOPRD  EQU   260                 PRODUCT MISSING                              
FVNOBKS  EQU   261                 MUST SPECIFY 1-4 BOOKS                       
FVISCHM  EQU   262                 INVALID SCHEME                               
FVIPERN  EQU   263                 INVALID PERIOD NAME                          
FVCSTWK  EQU   264                 CANNOT CHANGE CAMPAIGN START WEEK            
FVICST   EQU   265                 INVALID COST                                 
FVNOEFDT EQU   266                 ENTER EFFECTIVE DATE                         
FVDTLO   EQU   267                 EFF DATE MUST BE LATER THAN CPN STRT         
FVDTHI   EQU   268                 EFFECTIVE DATE BEYOND CAMPAIGN END           
FVDLL    EQU   269                 EFF DATE MUST BE LATER THAN PREV             
FVIEFDT  EQU   270                 INVALID EFFECTIVE DATE                       
FVDEMES  EQU   271                 DEMO HAS BEEN CHANGED IN THE EST HDR         
FVISDPT  EQU   272                 INVALID SUBDAYPART                           
FVSTAOV  EQU   273                 STATION OVERFLOW - CONTACT DDS               
FVCMSEQ  EQU   274                 CAMPAIGN/MARKET SEQUENCE NUMBER ERR          
FVTMD    EQU   275                 TOO MANY DUPLICATES - CONTACT DDS            
FVDUPREC EQU   276                 DUPLICATE RECORDS - CHANGE ACTION            
FVNOUPG  EQU   277                 NO UPGRADE                                   
FVSTADPT EQU   278                 MUST ENTER STATION OR DAYPART                
FVIRTGOP EQU   279                 INVALID RATING OPTION                        
FVNOCNUP EQU   280                 UPGRADE MISSING FROM CAMPAIGN RECORD         
FVPF4    EQU   281                 WARNING: PRESS PF4 TO CONTINUE               
FVIDADJ  EQU   282                 DEMO ADJUST MUST BE TURNED OFF               
FVNOSCHM EQU   283                 MUST SPECIFY VALID SCHEME IN CAM REC         
FVNOPER  EQU   284                 MUST SPECIFY VALID PERIOD IN CAM REC         
FVTMR    EQU   285                 TOO MANY RECORDS TO LIST                     
FVIDEMOP EQU   286                 INVALID DEMO OPTION                          
FVISLNOP EQU   287                 SPOT LENGTH OPTION INVALID                   
FVMKTSTA EQU   288                 MARKET INVALID - MUST ENTER STATION          
FVIDEMES EQU   289                 DEMO NOT IN ESTIMATE HEADER                  
FVIWKREC EQU   290                 WORK RECORD NOT FOUND                        
FVDUPDEM EQU   291                 DUPLICATE DEMO                               
FVNOWKRC EQU   292                 NO WORK RECORDS FOUND                        
FVNOPKOR EQU   293                 PACKAGE/ORBIT NOT FOUND                      
FVNODPT  EQU   294                 DAYPART MISSING                              
FVONECAM EQU   295                 MUST SPECIFY ONE CAM FOR NOW REQUEST         
FVCAMDPT EQU   296                 MUST ENTER CAMPAIGN FOR SINGLE DPT           
FVDPTDEM EQU   297                 DPT OPTION INVALID FOR DEMO SEQUENCE         
FVCFLWK  EQU   298                 CANNOT CHANGE CAMPAIGN FLIGHT WEEKS          
FVPTL2   EQU   299                 PERIOD CANNOT BE LONGER THAN 2 WKS           
FVNOXFR  EQU   300                 NO DATA TO TRANSFER                          
FVPKGLOK EQU   301                 PACKAGE LOCKED OUT TO BUY TRANSFER           
FVREXFR  EQU   302                 RE-TRANSFER TO BUY PROGRAM COMPLETE          
FVESTNO  EQU   303                 ESTIMATE NOT OPEN FOR ALLOCATED PRD          
FVREQERR EQU   304                 ERROR DURING REQUEST GENERATION              
FVORBNL  EQU   305                 TRANSFER ABORTED-ORBIT W/O ANY LINES         
FVIBYID  EQU   306                 INVALID BUY ID                               
FVCCST   EQU   307                 MUST SPECIFY STATION FOR CCUSA               
FVCPYMIS EQU   308                 NO WORK RECORDS TO COPY                      
FVCPYDON EQU   309                 CAMAPIGN COPY COMPLETE                       
FVCPYADJ EQU   310                 CANNOT COPY DEMOS                            
FVWRKNF  EQU   312                 WORK RECORD NOT FOUND FOR CAMPAIGN           
FVTMCC   EQU   313                 TOO MANY COPY CAMPAIGNS                      
FVIPRDPB EQU   314                 PRD MUST BE SAME AS 1ST IN P/B PAIR          
FVONESLN EQU   316                 ONLY ONE SPOT LENGTH FOR NOTRANS             
FVIDTCAM EQU   317                 DATES NOT WITHIN CAMPAIGN PERIOD             
FVIRECCA EQU   318                 RECORD ONLY VALID FOR CANADA                 
FVIACTSA EQU   319                 ACTION INVALID ON SATURDAY                   
FVFLTDPT EQU   320                 TOO MANY RECORDS - FILTER BY DPT             
FVSTAXFR EQU   321                 MUST ENTER STATION FOR TRANSFER              
FVESTST  EQU   326                 EST START MUST BE BROUGHT BACK TO &T         
FVNODEMO EQU   327                 NO DEMO INFORMATION IS AVAILABLE             
FVESTLOK EQU   328                 ESTIMATE HEADER LOCKED                       
FVNOSPL  EQU   331                 NO SPILL MARKETS DEFINED                     
FVNOSPDM EQU   332                 NO SPILL DEMOS GENERATED                     
FVNOBYR  EQU   334                 BUYER MISSING                                
FVNOREX  EQU   335                 NO CHANGES SINCE LAST TRANSFER               
FVIADDS  EQU   336                 ADDS PROCESSING ERROR                        
FVNOADDS EQU   337                 NO ADDS DATA TO SEND                         
FVCMPLRG EQU   341                 CAMPAIGN RANGE TO LARGE FOR ONLINE           
FVNEQDEM EQU   343                 DEMOS MUST BE CONSISTENT FOR CMP RNG         
FVOPTRNG EQU   344                 OPTION NOT ALLOWED WITH CAMPAIGN RNG         
FVNOADJ  EQU   345                 ADJACENCY CODE MISSING                       
FVCMPDAT EQU   346                 CANNOT CHANGE CAMPAIGN DATES                 
FVNODAT  EQU   347                 DATES OPTION MISSING                         
FVNODEL  EQU   348                 CANNOT DELETE TRANSFERRED LINES              
FVNOMGRP EQU   349                 NO MARKET GROUP FOUND                        
FVICCAM  EQU   350                 INCOMPATIBLE CAMPAIGN                        
FVCAMDT  EQU   351                 CAMPAIGN DATES OVERLAP                       
FVCAMCOM EQU   352                 CAMPAIGN ALREADY HAS A COMPANION             
FVCHACOM EQU   353                 MUST FIRST REMOVE COMPANION CAMPN            
FVNOXMIT EQU   354                 NO DATA TO TRANSMIT                          
FVXDONE  EQU   355                 DATA ALREADY TRANSMITTED                     
FVIDLYOR EQU   356                 DAILY ORBITS ARE INVALID                     
FVEREC   EQU   357                 RECORD ERROR - CALL DDS                      
FVMAXLN  EQU   358                 MAXIMUM LINE NUMBER REACHED                  
FVCMPEST EQU   359                 CAMPAIGN DATES MUST MATCH ESTIMATE           
FVICNET  EQU   360                 CABLE NETWORK NOT ON MASTER RECORD           
FVSTAEFF EQU   361                 STATION NOT EFFECIVE UNTIL ....              
FVIESTPG EQU   362                 INVALID ESTIMATE FOR PRODUCT GROUP           
FVNOPRPG EQU   363                 NO PRODUCTS FOUND FOR PRODUCT GROUP          
FVGENERR EQU   364                 PROCESSING ERROR - CALL DDS                  
FVGOLADD EQU   365                 GOAL RECORDS ADDED                           
FVIPIG   EQU   366                 PIGGYBACKS INVALID                           
FVIADINT EQU   367                 ADDS INTERFACE INVALID FOR AGENCY            
FVIORDIS EQU   368                 ORDER SENDING DISABLED FOR MEDIA 'T'         
FVPWLOCK EQU   414                 BUY DATA IS LOCKED BY PW PROGRAM             
FVTRANS  EQU   490                 CAN'T CHANGE - BUYS TRANSFERRED              
FVCNDWK  EQU   650                 CANNOT CHANGE CAMPAIGN END WEEK              
FVCFRZN  EQU   652                 CLIENT IS FROZEN - TRANSFER NOT P...         
FVESLNER EQU   780                 PRODUCTS HAVE CONFLICTING SLN SPECS          
FVNOUPGR EQU   807                 UPGRADES NOT SUPPORTED FOR RADIO             
FVC2LOCK EQU   902                 BUY DATA IS LOCKED BY PW PROGRAM             
FVOUTCAM EQU   1005                DATE OUTSIDE CAMPAIGN DATES                  
FV255BYR EQU   1074                RAN OUT OF BUYER CODES                       
FVIMKTGP EQU   1091                YOU CHANGE THE ID REFERENCE                  
FVIANTWK EQU   1101                PLEASE CALL DDS TO ACTIVATE NETWORK          
FVILOCKD EQU   1110                CANNOT TRANSFER, SPOTS IN LOCKED ...         
FVI1SPLN EQU   1111                ESTIMATE CAN BUY A SPOT LENGTH OF &1         
FVIBUYRV EQU   1126                CAMP/MKT UNDER BUY REVISION. PLEA...         
FVINAWK  EQU   1190                CAN'T HAVE SPOTS IN AN INACTIVE WEEK         
FVSAMEAM EQU   1194                NEED SAME MEDIA FOR FROM- AND TO-            
FVCMPRNG EQU   1195                INVALID CAMPAIGN RANGE                       
FVMORE18 EQU   1196                MORE THAN 18 CAMPAIGNS IN RANGE              
FVSFMBYR EQU   1202                BUYER NAME NOT FOUND IN SFM BYRREC!          
FVIMKGNC EQU   1209                MAKEGOOD ON NEW LINE - NO CHANGE             
FVIDNOGD EQU   1217                ID= ONLY USED WITH STATION IN KEY            
***********************************************************************         
* BWS ERROR EQUATES (NET SYSTEM)                                      *         
***********************************************************************         
FVDARLK  EQU   496                 BUY DATA IS LOCKED - DARE ORDER H...         
***********************************************************************         
* BWS INFORMATION MESSAGE EQUATES                                     *         
***********************************************************************         
FVSPILL  EQU   1                   SPILL MARKETS                                
FVSOON   EQU   2                   SOON REPORTS SPOOLED                         
         EJECT                                                                  
***********************************************************************         
* IO EQUATES                                                          *         
***********************************************************************         
DIRHI    EQU   IOSPTDIR+IOHI                                                    
DIRHID   EQU   IOSPTDIR+IOHID                                                   
DIRHIU   EQU   IOSPTDIR+IOHIUPD                                                 
DIRSQ    EQU   IOSPTDIR+IOSQ                                                    
DIRSQU   EQU   IOSPTDIR+IOSQUPD                                                 
DIRRD    EQU   IOSPTDIR+IORD                                                    
DIRRDD   EQU   IOSPTDIR+IORDD                                                   
DIRRDUP  EQU   IOSPTDIR+IORDUP                                                  
DIRADD   EQU   IOSPTDIR+IOADD                                                   
DIRWRT   EQU   IOSPTDIR+IOWRITE                                                 
FILRD    EQU   IOSPTFIL+IORD                                                    
FILRD1   EQU   IOSPTFIL+IORD+IO1                                                
FILRD2   EQU   IOSPTFIL+IORD+IO2                                                
FILRD3   EQU   IOSPTFIL+IORD+IO3                                                
FILGET   EQU   IOSPTFIL+IOGET                                                   
FILGET1  EQU   IOSPTFIL+IOGET+IO1                                               
FILGET2  EQU   IOSPTFIL+IOGET+IO2                                               
FILGET3  EQU   IOSPTFIL+IOGET+IO3                                               
FILGETU  EQU   IOSPTFIL+IOGETRUP                                                
FILGETU1 EQU   IOSPTFIL+IOGETRUP+IO1                                            
FILGETU2 EQU   IOSPTFIL+IOGETRUP+IO2                                            
FILGETU3 EQU   IOSPTFIL+IOGETRUP+IO3                                            
FILPUT   EQU   IOSPTFIL+IOPUT                                                   
FILPUT1  EQU   IOSPTFIL+IOPUT+IO1                                               
FILPUT2  EQU   IOSPTFIL+IOPUT+IO2                                               
FILPUT3  EQU   IOSPTFIL+IOPUT+IO3                                               
FILADD   EQU   IOSPTFIL+IOADD                                                   
FILADD1  EQU   IOSPTFIL+IOADD+IO1                                               
FILADD2  EQU   IOSPTFIL+IOADD+IO2                                               
FILADD3  EQU   IOSPTFIL+IOADD+IO3                                               
         EJECT                                                                  
***********************************************************************         
* MINIO EQUATES                                                       *         
***********************************************************************         
MINIO1   EQU   X'40'                                                            
MINIO2   EQU   X'80'                                                            
MINIO3   EQU   X'C0'                                                            
*                                                                               
MINRD1   EQU   MINRD+MINIO1                                                     
MINRD2   EQU   MINRD+MINIO2                                                     
MINRD3   EQU   MINRD+MINIO3                                                     
MINHI1   EQU   MINHI+MINIO1                                                     
MINHI2   EQU   MINHI+MINIO2                                                     
MINHI3   EQU   MINHI+MINIO3                                                     
MINSEQ1  EQU   MINSEQ+MINIO1                                                    
MINSEQ2  EQU   MINSEQ+MINIO2                                                    
MINSEQ3  EQU   MINSEQ+MINIO3                                                    
MINADD1  EQU   MINADD+MINIO1                                                    
MINADD2  EQU   MINADD+MINIO2                                                    
MINADD3  EQU   MINADD+MINIO3                                                    
MINWRT1  EQU   MINWRT+MINIO1                                                    
MINWRT2  EQU   MINWRT+MINIO2                                                    
MINWRT3  EQU   MINWRT+MINIO3                                                    
MINDEL1  EQU   MINDEL+MINIO1                                                    
MINDEL2  EQU   MINDEL+MINIO2                                                    
MINDEL3  EQU   MINDEL+MINIO3                                                    
         EJECT                                                                  
* GEGENWRK                                                                      
       ++INCLUDE GEGENWRK                                                       
         EJECT                                                                  
***********************************************************************         
* WORKD REDEFINITIONS                                                 *         
***********************************************************************         
WORKD    DSECT                                                                  
*                                                                               
         ORG   CUAREA              ** CONNECTED USER VARIABLES **               
         ORG   *+L'CUAREA-L'CUDMED-L'CUPASSWD                                   
CUDMED   DS    CL1                 MEDIA FOR DEMO FILE LOOKUPS                  
CUPASSWD DS    CL10                SECRET LOGON CODE                            
         ORG                                                                    
*                                                                               
         ORG   ACAREA              ** APPLICATION CONTROLLER AREA **            
         ORG   *+L'ACAREA-L'ACEXTRA                                             
ACEXTRA  DS    0CL9                EXTRA INFO                                   
ACSVACT  DS    XL1                 SAVED ACTION NUMBER                          
ACBASE5  DS    A                   CONTROLLER BASE REG 5                        
ACCURD   DS    XL2                 CURSOR DISPLACEMENT                          
ACCURS   DS    XL2                 CURSOR ABSOLUTE SCREEN ADDRESS               
         ORG                                                                    
*                                                                               
         ORG   INOPTS              ** OPTION VALUES **                          
INOSID   DS    CL2                 NSID (C'Y'/YEAR)                             
INODPT   DS    CL1                 DPT (M=MAS)                                  
         DS    XL1                 SPARE                                        
INOPRG   DS    CL1                 SID PROGRAM TYPE                             
INORTG   DS    XL3                 OVERRIDE RATING                              
INODEM   DS    XL14                DEMO LIST (NUM,4XL3,EOL)                     
INOPRD   DS    CL4                 PRODUCT (PRD1,PRD2,SLN1,SLN2)                
INOFRM   DS    CL2                 REPORT FORMAT                                
INODAY   DS    CL1                 DAYPART REQUEST                              
INOLEN   DS    CL2                 LENGTH REQUEST                               
INOPER   DS    CL4                 DATE REQUEST                                 
INOXFI   DS    XL1                 TRANSFER INDICATOR                           
INOXFINS EQU   X'80'               NO SPILL FOR BUY TRANSFER                    
INOXFINC EQU   X'40'               NO COST TRANSFER FOR SID TRANSFER            
INORNK   DS    XL1                 RANK INDICATOR                               
INORNKC  EQU   0                   RANK IN DPTLEN/CPP SEQUENCE                  
INORNKD  EQU   C'D'                RANK IN DPTLEN/DEMO-VALUE SEQUENCE           
INORNKS  EQU   C'S'                RANK IN DPTLEN/STA/DAY/TIME SEQUENCE         
INORNKP  EQU   C'P'                RANK IN CPP/DPTLEN SEQENCE                   
INORNKT  EQU   C'T'                RANK IN DAY/TIME/STA/DPTLEN SEQUENCE         
INORNKU  EQU   C'U'                RANK IN DAY/TIME (SPECIAL)                   
INOID    DS    CL5                 OVERRIDE ACN NUMBER                          
INOIND   DS    XL1                 GENERAL OPTION INDICATOR                     
INOINOG  EQU   X'80'               NO GOALS NECESSARY FOR SCHEDULING            
INOINOT  EQU   X'40'               NO NSID TRANSFER FOR LINE CHANGES            
INOICPM  EQU   X'20'               ALWAYS SHOW CPM COLUMN                       
INOITST  EQU   X'10'               TEST - DDS USE ONLY                          
INOISKD  EQU   X'08'               SCHEDULED SPOTS ONLY                         
INOIXGL  EQU   X'04'               SUPPRESS GOALS                               
INOIALG  EQU   X'02'               WE WANT ALL GOALS FOR T/BYR/CMP/MKT          
INOSLN   DS    XL4                 SPOT LENGTHS FOR NSID TRANSFER               
INOBUYID DS    CL12                BUY ID TO BE TRANSFERRED                     
INOSTDTE DS    XL2                 COMPRESSED START DATE                        
INOSTDTD DS    XL1                 DISP OF INOSTDTE IS FROM CAMP START          
*                                  - X'80' YEAR OMITTED, 2 YEAR BYTES 0         
         ORG                                                                    
*                                                                               
         ORG   INFORM              ** FORMAT VALUES **                          
INFPWD   DS    CL10                PASSWORD                                     
INFIND   DS    XL1                 FORMAT INDICATOR                             
INFINOAD EQU   X'80'               NO AUTO DEMO ADJUST                          
INFISEND EQU   X'40'               SEND CAMPAIGN DETAILS ONLY                   
INFDATES DS    0XL6                BUY TRANSFER DATES                           
INFSTART DS    XL3                                                              
INFEND   DS    XL3                                                              
INFLINE  DS    XL2                 DMB&B TRANSMISSION START LINE NUM            
INFCHSTA DS    CL8                 STATION FOR CALL LETTER CHANGES              
         ORG                                                                    
*                                                                               
         ORG   COREFACS            ** CORE RESIDENT FACILITIES **               
VCLPACK  DS    V                                                                
VCLUNPK  DS    V                                                                
VSPDEMUP DS    V                                                                
VSPDEMLK DS    V                                                                
VUPVAL   DS    V                                                                
VBOOKVAL DS    V                                                                
VDAYPAK  DS    V                                                                
VTIMVAL  DS    V                                                                
VDEMOCON DS    V                                                                
VDAYUNPK DS    V                                                                
VUNTIME  DS    V                                                                
VXSORT   DS    V                                                                
VEDITOR  DS    V                                                                
VMOBILE  DS    V                                                                
VDEMOVAL DS    V                                                                
VSQUASH  DS    V                                                                
VSPACNVL DS    V                                                                
VOFFICER DS    V                                                                
VRANSID  DS    V                                                                
VMSPACK  DS    V                                                                
VMSUNPK  DS    V                                                                
VGTBROAD DS    V                                                                
VCHOPPER DS    V                                                                
VTSAR    DS    V                                                                
VSPOTBUY DS    V                                                                
VGETBUBL DS    V                                                                
VSPADINT DS    V                                                                
VSTAVAL  DS    V                                                                
VPWCALC  DS    V                                                                
VSTAPACK DS    V                                                                
VRCPACK  DS    V                                                                
VSPAUTH  DS    V                                                                
*                                                                               
         ORG   AROUTS              ** CONTROLLER ROUTINES **                    
AADDELS  DS    A                                                                
ADELELS  DS    A                                                                
ARECUPA  DS    A                                                                
AVALBYR  DS    A                                                                
AGETBYR  DS    A                                                                
AVALCAM  DS    A                                                                
AGETCAM  DS    A                                                                
AVALMED  DS    A                                                                
AGETMED  DS    A                                                                
AVALCLT  DS    A                                                                
AGETCLT  DS    A                                                                
AVALPRD  DS    A                                                                
AGETPRD  DS    A                                                                
AVALEST  DS    A                                                                
AGETEST  DS    A                                                                
AGETCM   DS    A                                                                
AVALMKT  DS    A                                                                
AGETMKT  DS    A                                                                
AVALSTA  DS    A                                                                
AGETSTA  DS    A                                                                
AVALDAY  DS    A                                                                
AGETDAY  DS    A                                                                
AVALTIM  DS    A                                                                
AGETTIM  DS    A                                                                
AVALDPL  DS    A                                                                
AGETDPT  DS    A                                                                
AVALPWD  DS    A                                                                
AVALDAT  DS    A                                                                
AVALUPG  DS    A                                                                
AVALADJ  DS    A                                                                
AMIN     DS    A                                                                
ASPCLERR DS    A                   THAT'S 32 FOLKS !!                           
*                                                                               
         ORG   RECVALS             ** SAVED RECORD VALUES **                    
*                                                                               
BVALS    DS    0X                  ** BINARY VALUES **                          
BAGYMD   DS    XL1                                                              
BBYR     DS    XL1                                                              
BCAM     DS    XL2                                                              
BCMSEQ   DS    XL2                                                              
BCLT     DS    XL2                                                              
BPRD     DS    XL1                                                              
BEST     DS    XL1                                                              
BMKT     DS    XL2                                                              
BSTA     DS    XL3                                                              
BDAYS    DS    XL1                                                              
BTIMES   DS    XL4                                                              
BDPT     DS    XL1                                                              
BSLN     DS    XL1                                                              
G1WPROF  DS    XL16                SHOULDN'T BE HERE, BUT I NEED ROOM           
BVALSX   EQU   *                                                                
*                                                                               
QVALS    DS    0C                  ** DISPLAY VALUES **                         
QMED     DS    CL1                                                              
QBYR     DS    CL3                                                              
QCAM     DS    CL5                                                              
QCLT     DS    CL3                                                              
QPRD     DS    CL3                                                              
QEST     DS    CL3                                                              
QMKT     DS    CL4                                                              
QSTA     DS    CL8                                                              
QDAYS    DS    CL7                                                              
QTIMES   DS    CL11                                                             
QDPT     DS    CL3                                                              
QSLN     DS    CL3                                                              
         DS    XL4                 SPARE                                        
QVALSX   EQU   *                                                                
NWSFLAG  DS    XL1                 MISC FLAGS USED BY THIS PROGRAM              
NWSFCLST EQU   X'80'                - USES CLIENT STRING                        
*                                                                               
BBYRMASK DS    XL1                 MASK TO APPLY TO AGY/MED                     
CMPBKTYP DS    XL1                 CAMPAIGN UPGRADE BOOK TYPE                   
GBPPROF  DS    XL16                SHOULDN'T BE HERE, BUT I NEED ROOM           
*                                                                               
QBOOKTYP DS    CL1                 BOOKTYPE                                     
QCABLE   DS    CL5                 CABLE SYSTEM FILTER                          
*                                                                               
*                                  ** OTHER DATA (SAVED) **                     
MEDNM    DS    CL10                MEDIA NAME                                   
BYRNM    DS    CL20                BUYER NAME                                   
BYRPW    DS    CL10                BUYER PASSWORD                               
CMPNM    DS    CL20                CAMPAIGN NAME/COMMENT                        
CMPCLTC  DS    XL2                 CAMPAIGN CLIENT CODE                         
CMPPRDN  DS    XL1                 CAMPAIGN PRODUCT NUMBER                      
CMPPRDC  DS    XL3                 CAMPAIGN PRODUCT CODE                        
CMPESTN  DS    XL1                 CAMPAIGN ESTIMATE NUMBER                     
* THIS LABEL WAS CHANGED FROM CMPST TO CMPSTDT                                  
CMPSTDT  DS    XL3                 CAMPAIGN START DATE                          
CMPND    DS    XL3                 CAMPAIGN END DATE                            
CMPSTMON DS    CL6                 CAMPAIGN MONDAY OF START DATE WEEK           
CMPSTMNP DS    XL2                 CAMPAIGN MON OF START DATE WK PACKED         
CMPNDMNP DS    XL2                 CAMPAIGN MON OF END DATE WK PACKED           
***       SPARE BELOW USED TO BE CL90                                           
ESTIND   DS    XL1                 ESTIMATE INDICATORS                          
ESTIDLY  EQU   X'80'               - DAILY=Y                                    
ESTICS2  EQU   X'40'               - ESTPW IS ACTUALLY COST2 FACTOR             
ESTIBTYP EQU   X'20'               - STABKTYP HAS ESTIMATE BOOKTYPE             
STAIND   DS    XL1                 STATION INDICATORS                           
STAIF94A EQU   X'80'               FEB94 ARB INDICATOR                          
ESTPW    DS    XL3                 PW PERCENTAGE FOR THE ESTIMATE               
CLTIND3  DS    XL1                 MORE CLIENT INDICATORS                       
CLTIBPPF EQU   X'80'               USES BUY PROG PROFILE                        
CLTIDIYT EQU   X'40'               USES DIY TRADE                               
CLTIMSDP EQU   X'20'               MASTER/SUBDAYPART COMBINED                   
***       SPARE BELOW USED TO BE CL90                                           
         DS    CL84                SPARE - 'CMPDATSD' AND 'CMPDATSP'            
         DS    CL53                      MOVED TO SPNWSTWA                      
LSTSCROL DS    CL2                 LAST SCROLL WE WERE ON                       
RCPNWKS  DS    XL1                 TOTAL NUMBER OF WEEKS IN RECAP               
SCRLINPT DS    CL2                 SCROLL INPUT FOR PFKEYS                      
RCPDSTDT DS    XL1                 RECAP'S DISP FROM CAMP START                 
CMPDSTDT DS    XL1                 USING PFKEYS - DISP FROM CAMP START          
CMPNWKS  DS    XL1                 CAMPAIGN NUMBER OF WEEKS IN PERIOD           
CMPUF    DS    CL1                 CAMPAIGN UPGRADE FILE                        
CMPUP    DS    XL8                 CAMPAIGN UPGRADE EXPRESSION                  
CMPUPIN  DS    CL32                CAMPAIGN UPGRADE AS INPUT                    
CMPFB    DS    XL2                 CAMPAIGN OVERRIDE FROM BOOK                  
CMPFBTP  DS    XL1                 CAMPAIGN OVERRIDE FROM BOOK TYPE             
CMPUPUT  DS    CL1                 CAMPAIGN UPGRADE PUT AVERAGING               
CMPUSHR  DS    CL1                 CAMPAIGN UPGRADE SHR AVERAGING               
CMPSLN   DS    XL1                 CAMPAIGN SPOT LENGTH                         
CMPOPTS  DS    XL1                 CAMPAIGN OPTION BYTE                         
CMPBOOKS DS    CL8                 CAMPAIGN BOOKS                               
CMPBKTPS DS    XL4                 CAMPAIGN BOOK TYPES                          
CMPPRD1  DS    XL1                 CAMPAIGN PIGGYBACK PRODUCT 1                 
CMPPRD2  DS    XL1                 CAMPAIGN PIGGYBACK PRODUCT 2                 
CMPLEN1  DS    XL1                 CAMPAIGN SPOT LENGTH 1                       
CMPLEN2  DS    XL1                 CAMPAIGN SPOT LENGTH 2                       
CMPSCHEM DS    CL3                 CAMPAIGN SID SCHEME                          
CMPPERS  DS    CL48                CAMPAIGN SID PERIODS (4X12)                  
CMPIND   DS    XL1                 CAMPAIGN INDICATORS                          
CMPICMPU EQU   X'80'               -COMPETITION USER                            
CMPISKD  EQU   X'40'               -SPOTS SCHEDULED                             
CMPIFR1  EQU   X'20'               -FREE RIDER - BRAND 1 PAYS ALL               
CMPIGOAL EQU   X'08'               -GOALS ADDED FOR THIS CAMPAIGN               
CMPPSCHM DS    XL2                 CAMPAIGN SID SCHEME PACKED                   
CMPDPOPT DS    CL1                 CAMPAIGN DAYPART OPTION                      
CMPRSVC  DS    CL1                 BATCH OVERRIDE RATING SERVICE                
CMPADJ   DS    XL1                 CAMPAIGN PROGRAM ADJACENCY CODE              
CMPFLSTM DS    CL6                 CAMPAIGN FLIGHT START MONDAY                 
CMPFLND  DS    CL6                 CAMPAIGN FLIGHT END DATE                     
CMPSLEQU DS    XL15                CAMPAIGN SPOT LENGTH EQUIVALENCES            
CLTNM    DS    CL20                CLIENT NAME                                  
CLTSRC   DS    CL1                 A=ARB,N=NSI                                  
CLTOFF   DS    CL1                 CLIENT OFFICE NUMBER                         
CLTEQUIV DS    CL60                SPOT LENGTH EQUIVALENCES                     
CLTIND   DS    XL1                 CLIENT INDICATORS                            
CLTICC   EQU   X'80'               CCUSA INTERFACE                              
CLTIGOL  EQU   X'40'               GOALS REQUIRED BEFORE BUY                    
CLTIBID  EQU   X'20'               BUY ID REQUIRED FOR BUY TRANSFER             
CLTIBIMG EQU   X'10'               BUY ID IS MARKET GROUP                       
CLTINOSP EQU   X'08'               NO US SPILL                                  
CLTIADDS EQU   X'04'               ADDS USER                                    
CLTITRDT EQU   X'02'               TRANSFER DATES REQUIRED                      
CLTITRBN EQU   X'01'               TRANSFER BUYER NAME                          
CLTIFC   DS    CL8                 CLIENT INTERFACE CODE                        
CLTMGRID DS    CL1                 CLIENT BUY ID MARKET GROUP SCHEME            
CLTPROF  DS    CL15                CLIENT PROFILE                               
CLTBWPRO DS    CL16                CLIENT BW PROFILE                            
CLTAJPRO DS    CL16                CLIENT AJ PROFILE                            
PRDNM    DS    CL20                PRODUCT NAME                                 
ESTNM    DS    CL20                ESTIMATE NAME                                
ESTST    DS    CL6                 ESTIMATE START DATE                          
ESTND    DS    CL6                 ESTIMATE END DATE                            
ESTDEMS  DS    XL60                ESTIMATE DEMOS                               
ESTUSRNM DS    XL28                ESTIMATE USER DEMO NAMES                     
ESTDEMNM DS    CL7                 ESTIMATE PRIMARY DEMO NAME                   
ESTDMENU DS    CL1                 ESTIMATE DAYPART MENU CODE                   
ESTBOOK  DS    XL2                 ESTIMATE DEFAULT BOOK                        
ESTREQLO DS    CL1                 ESTIMATE REQUEST RANGE LOW                   
ESTREQHI DS    CL1                 ESTIMATE REQUEST RANGE HIGH                  
ESTOWSDY DS    XL1                 ESTIMATE OUT-OF-WEEK START DAY               
ESTRATE  DS    CL1                 ESTIMATE SPECIAL RATE TYPE                   
MKTNM    DS    CL24                MARKET NAME                                  
MKTRS    DS    XL2                 RATING SERVICE MARKET                        
MKTNOCLT DS    XL2                 NON CLIENT SPECIFIC MARKET CODE              
STANTAX  DS    XL2                 STATION TAX RATE                             
SIDUPFIL DS    CL1                 SID UPGRADE FILE                             
SIDUPGRD DS    XL8                 SID DEFAULT UPGRADE EXPRESSION               
SIDUPFBK DS    XL2                 SID OVERRIDE FROM BOOK                       
POLPRD1  DS    CL3                 ALLOCATED PRD 1                              
POLPRD2  DS    CL3                 ALLOCATED PRD 2                              
QADJCD   DS    CL1                 PROGRAM ADJACENCY CODE                       
DPTTYPE  DS    CL1                 DAYPART TYPE                                 
*                                  C'R' = REGULAR                               
*                                  C'M' = MASTER                                
*                                  C'S' = SUB                                   
DPTMAS   DS    CL1                 MASTER DAYPART                               
DPTSUBS  DS    XL16                SUB-DAYPARTS (16X1)                          
PTIMES   DS    XL2                 PACKED TIMES                                 
BSTACD   DS    XL1                 STATION CODE                                 
HDRDA    DS    XL4                 HEADER DISK ADDRESS                          
HDRKEY   DS    XL13                HEADER KEY                                   
DTLKEY   DS    XL13                DETAIL KEY SAVE                              
TSARACT  DS    CL1                 TSAR ACTION                                  
TSARNUM  DS    XL2                 TSAR RECORD NUMBER                           
CMPU2DAT DS    XL2                 CAMPAIGN 2ND UPGRADE VALUES                  
CMPUF2   DS    CL1                                                              
CMPUP2   DS    XL8                                                              
CMPUPIN2 DS    CL32                                                             
CMPFB2   DS    XL2                                                              
CMPFB2TP DS    XL1                 CMPFB2 BOOKTYPE                              
CMPUPUT2 DS    CL1                                                              
CMPUSHR2 DS    CL1                                                              
NETIND   DS    XL1                 NETWORK BUY INDICATOR                        
NETIDATA EQU   X'80'               DATA FOR THIS BUYER/CAMPAIGN/MKT             
ESTREP   DS    XL2                 ESTIMATE SPECIAL REP CODE                    
PRDNM1   DS    CL10                PIGGYBACK PRODUCT 1 NAME                     
PRDNM2   DS    CL10                PIGGYBACK PRODUCT 2 NAME                     
CMPWKDLY DS    XL8                 CAMPAIGN NON-CONTIGUOUS WEEKS FOR            
*                                  DAILY SHEDULING                              
CMPELIST DS    XL12                CANADIAN ESTIMATE LIST                       
CMPGOALS DS    CL1                 OVERRIDE MEDIA FOR GOALS                     
STAGST   DS    CL1                 CANADIAN GST CODE                            
ESTCNTRL DS    XL1                 ESTIMATE HEADER CONTROL BYTE                 
CMPFBLST DS    XL6                 CAMPAIGN FROM BOOK LIST (MAX 3)              
CMPFB2L  DS    XL6                 CAMPAIGN 2ND UPGRADE BOOK LIST               
CLTSRCDF DS    CL1                 CLIENT'S DEFAULT SOURCE A=ARB,N=NSI          
QAGY     DS    CL2                 AGENCY                                       
*                                                                               
*PROF7   DS    CL1                 AGENCY PROFILE+7 =C FOR CANADA               
APROFBTS DS    CL1                                                              
A00CANAD EQU   X'80'               AGENCY PROFILE+7 =C FOR CANADA               
A00TWODC EQU   X'40'               WE NEED 2 DECIMAL (MEDIA=T)                  
A002DOK  EQU   X'20'               AGENCY PROFILE+9 =Y FOR 2 DEC PREC           
ASDNOWRK EQU   X'10'               NOT UPDATING ON WORK                         
*                                                                               
CMPOPTS2 DS    XL1                 CAMPAIGN OPTION BYTE 2                       
MKTLKUP  DS    XL2                 AGENCY MARKET FOR DEMO LOOKUPS               
AFLAG1   DS    XL1                 AGENCY FLAG (X'80'=ADDS USER)                
CLTMTCLT DS    XL2                 CLIENT'S MASTER TRAFFIC CLT CODE             
CLTMTNUM DS    XL1                 CLIENT'S MASTER TRAFFIC CLT SEQ NUM          
CLTMTPRD DS    XL1                 CLIENT'S MASTER TRAFFIC CLT PRD CODE         
CLTIND2  DS    XL1                 MORE CLIENT INDICATORS                       
CLTIANFR EQU   X'80'               1W PROFILE CANADIAN ANGLO/FRANCO IND         
CLTIREQC EQU   X'40'               ROUND EQUIVALENCED COSTS                     
CLTISDLY EQU   X'20'               SEPARATE LINES FOR DAILY SCHED               
CLTIEST  EQU   X'10'               CAMPAIGN DATES MUST MATCH ESTIMATE           
CLTIXOUT EQU   X'08'               X-OUT SCHEDULED WEEKS FOR COPY               
CLTIUS   EQU   X'04'               CANADIAN DEMO OPTION = U                     
CLTPONLY EQU   X'02'               POL ONLY                                     
CLTFROZN EQU   X'01'               CLIENT FROZEN                                
CMPCCAM  DS    XL2                 COMPANION CAMPAIGN                           
STABKTYP DS    CL1                 STATION SPECIAL BOOK TYPE                    
CMPPGRP  DS    CL3                 CAMPAIGN PRODUCT GROUP                       
CMPPGRPN DS    XL1                 NUMBER OF PRODUCT GROUP DIGITS               
**       DS    0XL(RECVALS+RECVALSL-*)   CAN'T GO PASS RECVALS+RECVALSL         
***********************************************************************         
*** NOTE:  WE HAVE NO MORE ROOM HERE                                            
***********************************************************************         
         ORG   RECVALS+RECVALSL                                                 
         EJECT                                                                  
***********************************************************************         
* BWS APPLICATION WORK AREA                                           *         
***********************************************************************         
         ORG                                                                    
AROUTSX  DS    0A                  ** MORE COMMON CONTROLLER ROUTINES *         
AGETGOAL DS    A                   1                                            
ADTLBLD  DS    A                                                                
AXFRADD  DS    A                                                                
APACKTIM DS    A                                                                
ATSAR    DS    A                   5                                            
ACOSTEQU DS    A                                                                
ANETCOST DS    A                                                                
AGETNET  DS    A                                                                
AGETGOL2 DS    A                                                                
ASPDEMUP DS    A                   10                                           
AFMTUPG  DS    A                                                                
ASTUPNBR DS    A                                                                
ACHKBPPR DS    A                                                                
AGETCMPR DS    A                                                                
APUTCMPR DS    A                   15                                           
AGETBKTY DS    A                                                                
AADJPREC DS    A                    - DEMO RATING 2 DECIMAL ADJUSTMENT          
AADJDEMO DS    A                    - 2 DECIMAL ADJ FOR DEMO ELEMENT            
         DS    14A                 19-32                                        
NROUTSX  EQU   (*-AROUTSX)/L'AROUTSX                                            
*                                                                               
CONFACSX DS    0F                  ** MORE CONTROLLER FACILITIES **             
VRECUP   DS    V                                                                
VEQVRD   DS    V                                                                
VGETPROF DS    V                                                                
VDPTRD   DS    V                                                                
VBUFFALO DS    V                                                                
VLOADER  DS    V                                                                
VSLNTAB  DS    V                   BORROWING SPACE HERE!  MHC  05/31/06         
VSPBYVAL DS    V                   BORROWING SPACE HERE!  MHC  05/08/07         
*                                                                               
BUFFADDS DS    0F                  ** VARIOUS BUFFER ADDRESSES **               
         DS    6A                                                               
AIOAREA4 DS    A                                                                
ATSARBLK DS    A                                                                
ATSARBUF DS    A                                                                
*                                                                               
AIOAREAS DS    0F                  ** I/O AREA ADDRESSES **                     
AIOAREA1 DS    A                                                                
AIOAREA2 DS    A                                                                
AIOAREA3 DS    A                                                                
*                                                                               
MINIOADD DS    0F                  ** MINIO ADDRESSES **                        
AMINBUFF DS    A                                                                
AMINRTAB DS    A                                                                
AMINBLK  DS    A                                                                
*                                                                               
IODA1    DS    XL(L'IODA)          ** I/O AREAS **                              
IOWORK1  DS    XL(L'IOWORK)                                                     
IOAREA1  DS    XL6000                                                           
IODA2    DS    XL(L'IODA)                                                       
IOWORK2  DS    XL(L'IOWORK)                                                     
IOAREA2  DS    XL6000                                                           
IODA3    DS    XL(L'IODA)                                                       
IOWORK3  DS    XL(L'IOWORK)                                                     
IOAREA3  DS    XL6000                                                           
*                                                                               
*                                  ** MINIO AREAS **                            
MINNBUFF EQU   2                         N'MINIO BUFFERS                        
MINRECTB DS    (MINRTMAX)XL(6+L'BWDKEL)  MINIO RECORD TABLE                     
MINRTMAX EQU   200                       MAX MINIO RECORD TABLE ENTRIES         
MINBLK   DS    XL(MINBLKL)               MINIO BLOCK                            
*                                                                               
         DS    0D                                                               
APLOCAL  DS    4096X               ** APPLICATION PROGRAM LOCAL W/S **          
APLOCALX EQU   *                                                                
*                                                                               
LDRVRLOC EQU   2048                L'W/S FOR DRIVER/DROOL APPLICATIONS          
*                                                                               
WORKX    EQU   *                                                                
         EJECT                                                                  
***********************************************************************         
* TWAD REDEFINITIONS                                                  *         
***********************************************************************         
TWAD     DSECT                                                                  
         ORG   TWASCR                                                           
       ++INCLUDE SPNWSFFD                                                       
         ORG                                                                    
       ++INCLUDE SPNWSTWA                                                       
         EJECT                                                                  
***********************************************************************         
* NSID APRECKEY DSECT                                                 *         
***********************************************************************         
NSIDKEYD DSECT                                                                  
*                                                                               
NSPER    DS    CL4                                                              
NSDPT    DS    XL1                                                              
NSPRG    DS    CL1                                                              
NSDAY    DS    XL1                                                              
NSTIME   DS    XL4                                                              
NSSTA    DS    XL3                                                              
NSAGYMD  DS    XL1                                                              
NSMKT    DS    XL2                                                              
NSYEAR   DS    XL1                                                              
NSSLN    DS    XL1                                                              
         DS    XL13                                                             
         EJECT                                                                  
***********************************************************************         
* TSAR RECORD DSECT                                                   *         
***********************************************************************         
TRECD    DSECT                                                                  
*                                                                               
TREC     DS    0X                                                               
TRECL    DS    XL2                                                              
*                                                                               
TKEY     DS    XL24                                                             
         ORG   TKEY                                                             
TRECTYP  DS    XL1                                                              
TRECUPD  EQU   1                                                                
TRECSID  EQU   2                                                                
TRECEST  EQU   3                                                                
TRECCOM  EQU   4                                                                
TRECSPL  EQU   5                                                                
TRECBUY  EQU   6                   FOR AGENCY BUY RECORDS                       
TKEYREST DS    0X                                                               
         ORG                                                                    
*                                                                               
TDATA    DS    0X                                                               
*                                  UPDATE RECORD                                
         ORG   TKEYREST                                                         
TUCAMP   DS    XL1                                                              
TUDPT    DS    CL1                                                              
TUSLN    DS    XL1                                                              
TUDEMO   DS    XL3                                                              
TUCPP    DS    XL3                                                              
TUDPT3   DS    CL1                                                              
TUSLN3   DS    XL1                                                              
TUSTA    DS    CL6                                                              
TUDAYCOD DS    XL1                                                              
TUDAYS   DS    XL1                                                              
TUTIMCOD DS    XL2                                                              
TUSEQ    DS    XL1                                                              
TUINDS   DS    XL1                                                              
TUIPKG   EQU   X'80'                                                            
TUIORB   EQU   X'40'                                                            
TUIEFDT2 EQU   X'01'                                                            
TUIEFDT3 EQU   X'02'                                                            
         ORG   TKEYREST                                                         
TUDTCAMP DS    XL1                 SEQUENCE FOR PURE DAY/TIME                   
TUDTSEQ1 DS    XL1                                                              
TUDTSEQ2 DS    XL1                                                              
TUDTTIME DS    XL4                                                              
TUDTDAYS DS    XL1                                                              
TUDTSTA  DS    CL8                                                              
TUDTDPT  DS    CL1                                                              
TUDTSLN  DS    XL1                                                              
TUDTSEQ  DS    XL1                                                              
         DS    CL4                                                              
         ORG   TKEYREST                                                         
TUSTCAMP DS    XL1                 SEQUENCE FOR SPECIAL DAY/TIME                
TUSTSEQ1 DS    XL1                       ADDED  09/12/02                        
TUSTDAYS DS    XL1                                                              
TUSTTIME DS    XL4                                                              
TUSTSTA  DS    CL8                                                              
TUSTDPT  DS    CL1                                                              
TUSTSLN  DS    XL1                                                              
TUSTSEQ  DS    XL1                                                              
         DS    CL5                                                              
         ORG   TDATA                                                            
TUELKEY  DS    XL6                                                              
TUPDRECL EQU   *-TREC                                                           
*                                  NETWORK/SPILL RECORD                         
         ORG   TKEYREST                                                         
TAGYMD   DS    XL1                                                              
TBYR     DS    XL1                                                              
TCAM     DS    XL2                                                              
TMKT     DS    XL2                                                              
TTYPE    DS    CL1          N=NET,S=NET SPILL,T=TV SPILL,L=SELECTIVE TV         
TDPT     DS    CL1                                                              
TSLN     DS    XL1                                                              
         ORG   TDATA                                                            
TCOST    DS    XL4                                                              
TDEMTOT  DS    XL4                                                              
*TDOLS    DS    (NMAXWKS)XL4                                                    
TDOLS    DS    53XL4        NEED THESE FOR THE COMBIN/ADD                       
*TDEMS    DS    (NMAXWKS)XL4                                                    
TDEMS    DS    53XL4                                                            
TSPLRECL EQU   *-TREC                                                           
         EJECT                                                                  
***********************************                                             
* FOR THE AGENCY BUYS                                                           
***********************************                                             
         ORG   TKEYREST            BY DPT/SLN/DEMO/CPP/STA/DAY/TIM/DTL          
TBUYKDPT DS    CL1                 - DAYPART                                    
TBUYKSLN DS    XL1                 - SPOT LENGTH                                
TBUYKDMO DS    XL3                 - DEMO                                       
TBUYKCPP DS    XL3                 - COST PER POINT                             
TBUYKDP3 DS    CL1                 - DAYPART                                    
TBUYKSL3 DS    XL1                 - SPOT LENGTH                                
TBUYKST1 DS    XL3                 - STATION                                    
TBUYKDYC DS    XL1                 - DAY CODE                                   
TBUYKDAY DS    XL1                 - DAYS                                       
TBUYKTIM DS    XL2                 - TIME                                       
TBUYKBY1 DS    XL3                 - BUY DETAILS                                
TBUYKSQ1 DS    XL1                 - BUY REVISION SEQ                           
******                                                                          
* KEY INDICATORS THAT IS SHARED WITH THE OTHER SORT KEYS                        
******                                                                          
TBUYKIND DS    XL1                 - KEY INDICATORS                             
TBYKIPKG EQU   X'80'                   PACKAGE                                  
TBYUIORB EQU   X'40'                   ORBIT                                    
TBYUICS2 EQU   X'01'                   EFFECTIVE COST 2                         
TBYUICS3 EQU   X'02'                   EFFECTIVE COST 3                         
TBUYKCOV DS    XL1                 - COST OVERRIDE (NTH)                        
         ORG   TKEYREST            BY STATION/LINE NUMBER                       
TBDTSEQ1 DS    XL1                                                              
TBDTSEQ2 DS    XL1                                                              
TBUYKTM2 DS    XL2                 - TIME                                       
TBUYKDY2 DS    XL1                 - DAYS                                       
TBUYKST2 DS    XL3                 - STATION                                    
TBUYKDP2 DS    CL1                 - DAYPART                                    
TBUYKSL2 DS    XL1                 - SPOT LENGTH                                
TBUYKBY2 DS    XL3                 - BUY DETAILS                                
TBUYKSQ2 DS    XL1                 - BUY REVISION SEQ                           
         ORG   TDATA                                                            
TBUYFLG1 DS    XL1                 FLAGS                                        
TBF1NTCM EQU   X'80'               - NOT PART OF THIS CAMPAIGN                  
TBF1MKGD EQU   X'40'               - THIS BUY IS A MAKEGOOD                     
TBF1MANL EQU   X'20'               - MANUALLY ADDED BUY                         
TBF1PRG  EQU   X'10'               - PROGRAMMING OVERRIDE                       
TBUYSTA  DS    XL3                 STATION                                      
TBUYBUYS DS    XL3                 BUY DETAILS                                  
TBUYSEQ  DS    XL1                 BUY REVISION SEQ                             
*  WHAT IS SAVE IN THE BUY REVISION'S  SAVED DATA ELEMENT                       
TBUYLINE DS    XL1                 BUYLINE #                                    
TBUYMKMS DS    XL1                 MAKES GOOD THIS MISSED BUYLINE               
TBUYDAYS DS    XL1                 BIT 0=SPARE 1=MON 2=TUE ... 7=SUN            
TBUYTIMS DS    XL2                 START TIME                                   
TBUYTIME DS    XL2                 END TIME                                     
TBUYCOST DS    XL4                 COST                                         
TBUYDEMS DS    0XL(8*8)            DEMOS                                        
TBUYDEMO DS    8XL8                DEMO/RATING                                  
TBUYPROG DS    CL17                PROGRAM                                      
TBUYADJC DS    CL1                 PROGRAM ADJACENCY CODE                       
TBUYDYPT DS    CL1                 DAYPART                                      
TBUYSLN  DS    XL1                 SPOT LENGTH                                  
TBUYSDPT DS    CL1                 SUB-DAYPART                                  
TBUYOTOM DS    XL7                 OTO MASK                                     
TBUYSKED DS    0XL53               SCHEDULE FROM BUYS (MAX 53 WEEKS)            
         DS    53XL1                                                            
TBUYRECL EQU   *-TREC                                                           
         EJECT                                                                  
***********************************************************************         
* DSECT TO COVER BOOK TYPE (Y/M) DEFINITION                           *         
***********************************************************************         
BOOKTYPD DSECT                                                                  
BOOKYR   DS    XL1                                                              
BOOKMTH  DS    0XL1                                                             
BOOKMNTY DS    XL1                 MONTH / TYPE                                 
BMNBITSQ EQU   X'0F'               MONTH BITS                                   
BTYBITSQ EQU   X'F0'               SPECIAL TYPE BITS                            
BTY2CHAR EQU   X'80'+X'40'+X'20'   - USING 2 CHARACTER BOOKTYPES                
BTYZR4Q  EQU   X'80'+X'40'         - ZERO 4                                     
BTYZR1Q  EQU   X'80'+X'20'+X'10'   - ZERO 1                                     
BTYHPEOQ EQU   X'80'+X'20'         - HISPANIC PEOPLE METER                      
BTYPRNTQ EQU   X'80'+X'10'         - PARENT ONLY DATA                           
BTYOLYMQ EQU   X'80'               - OLYMPICS                                   
BTYHISPQ EQU   X'40'+X'20'+X'10'   - HISPANIC                                   
BTYBLAKQ EQU   X'40'+X'20'         - BLACK                                      
BTYPEOPQ EQU   X'40'+X'10'         - PEOPLE METER                               
BTYTRADQ EQU   X'40'               - TRADE                                      
BTYMTROQ EQU   X'20'+X'10'         - METRO                                      
BTYDMAQ  EQU   X'20'               - DMA                                        
BTYOTHRQ EQU   X'10'               - OTHER                                      
         EJECT                                                                  
***********************************************************************         
* BWS DETAIL RECORD DSECT                                             *         
***********************************************************************         
       ++INCLUDE SPNWSDTL                                                       
         EJECT                                                                  
***********************************************************************         
* VARIOUS OTHER DSECTS                                                *         
***********************************************************************         
* DDCOMFACS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCOMFACS                                                      
         PRINT ON                                                               
* DDCOREQUS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCOREQUS                                                      
         PRINT ON                                                               
* FASYSFAC                                                                      
         PRINT OFF                                                              
       ++INCLUDE FASYSFAC                                                       
         PRINT ON                                                               
* DDMINBLK                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDMINBLK                                                       
         PRINT ON                                                               
* DDTSARD                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDTSARD                                                        
         PRINT ON                                                               
* SPSTAPACKD                                                                    
         PRINT OFF                                                              
       ++INCLUDE SPSTAPACKD                                                     
         PRINT ON                                                               
