*          DATA SET SPNWSCOM   AT LEVEL 007 AS OF 09/20/91                      
         SPACE 1                                                                
*        NEW BUYER'S WORKSHEET COMMENT RECORD                                   
         SPACE 1                                                                
COMRECD  DSECT                                                                  
COMKEY   DS    0XL13                                                            
COMKTYP  DS    XL1                 RECORD TYPE                                  
COMKTYPQ EQU   X'0D'                                                            
COMKSUB  DS    XL1                 RECORD SUB-TYPE                              
COMKSUBQ EQU   X'69'                                                            
COMKAGMD DS    XL1                 AGENCY-MEDIA                                 
COMKBYR  DS    XL1                 BUYER CODE                                   
COMKCAM  DS    XL2                 CAMPAIGN NUMBER (ONES COMPLEMENT)            
COMKMKT  DS    XL2                 MARKET                                       
COMKSTA  DS    CL3                 STATION                                      
COMKREST DS    XL2                 N/D                                          
COMKCNTL DS    0X                  KEY CONTROL BYTE                             
*                                                                               
COMLEN   DS    XL2                                                              
COMCNTL  DS    XL1                                                              
COMLINK  DS    XL8                                                              
COMFSTEL EQU   *                   LOCATION OF FIRST ELEMENT                    
         SPACE 2                                                                
CCMEL    DS    0X                  ** COMMENT ELEMENT **                        
CCMELCD  DS    XL1                 ELEMENT CODE                                 
CCMELCDQ EQU   X'01'                                                            
CCMELLN  DS    XL1                 ELEMENT LENGTH                               
CCMELSEQ DS    XL1                 SEQUENCE NUMBER                              
CCMELCOM DS    0X                  VARIABLE LENGTH COMMENT                      
         SPACE 2                                                                
