*          DATA SET SPNWSF6D   AT LEVEL 001 AS OF 12/13/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207F6D      DATE 12/13/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   13    5  A  P H             T        Y              
CPYMEDH  DS    XL8                                                              
CPYMED   DS    CL1      5   23    1  A  U N             T        Y    1         
CPYMEDX  DS    XL8                                                              
CPYMDNH  DS    XL8                                                              
CPYMDN   DS    CL10     5   31   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   13    5  A  P H             T        Y              
CPYBYRH  DS    XL8                                                              
CPYBYR   DS    CL3      6   23    3  A  U N             T        Y    2         
CPYBYRX  DS    XL8                                                              
CPYBYNH  DS    XL8                                                              
CPYBYN   DS    CL20     6   31   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   13    8  A  P H             T        Y              
CPYNUMH  DS    XL8                                                              
CPYNUM   DS    CL6      7   23    6  A  U N             T        Y    3         
CPYNUMX  DS    XL8                                                              
CPYCNMH  DS    XL8                                                              
CPYCNM   DS    CL20     7   31   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   13    7  A  P H             T        Y              
CPYMKTH  DS    XL8                                                              
CPYMKT   DS    CL13     8   23   13  A  U N             T        Y    0         
CPYMKTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9   13    7  A  P N             T        Y              
CPYDPLH  DS    XL8                                                              
CPYDPL   DS    CL4      9   23    4  A  U N             T        Y    0         
CPYDPLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    11    2   11  A  P H             T        Y              
CPYDEMH  DS    XL8                                                              
CPYDEM   DS    CL1     11   23    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12    2   15  A  P N             T        Y              
CPYSKDH  DS    XL8                                                              
CPYSKD   DS    CL1     12   23    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   31   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    13    5   16  A  P N             T        Y              
CPYIGNDH DS    XL8                                                              
CPYIGND  DS    CL1     13   23    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   31   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
CPYCSTH  DS    XL8                                                              
CPYCST   DS    CL1     14   23    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   31   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   13    5  A  P H             T        Y              
CPYTMDH  DS    XL8                                                              
CPYTMD   DS    CL1     16   23    1  A  U N             T        Y    1         
CPYTMDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16   27    5  A  P H             T        Y              
CPYTBYH  DS    XL8                                                              
CPYTBY   DS    CL3     16   35    3  A  U N             T        Y    2         
CPYTBYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   42    8  A  P H             T        Y              
CPYTCMH  DS    XL8                                                              
CPYTCM   DS    CL5     16   53    5  A  U N             T        Y    3         
CPYTCMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   62    8  A  P N             T        Y              
CPYTPSH  DS    XL8                                                              
CPYTPS   DS    CL8     16   72    8  A  U Z             T        Y    0         
CPYTPSX  DS    XL8                                                              
CPYTM2H  DS    XL8                                                              
CPYTM2   DS    CL1     17   23    1  A  U N             T        Y    1         
CPYTM2X  DS    XL8                                                              
CPYTB2H  DS    XL8                                                              
CPYTB2   DS    CL3     17   35    3  A  U N             T        Y    2         
CPYTB2X  DS    XL8                                                              
CPYTC2H  DS    XL8                                                              
CPYTC2   DS    CL5     17   53    5  A  U N             T        Y    3         
CPYTC2X  DS    XL8                                                              
CPYTP2H  DS    XL8                                                              
CPYTP2   DS    CL8     17   72    8  A  U Z             T        Y    0         
CPYTP2X  DS    XL8                                                              
CPYTM3H  DS    XL8                                                              
CPYTM3   DS    CL1     18   23    1  A  U N             T        Y    1         
CPYTM3X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   35    3  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18   53    5  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     18   72    8  A  U Z             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   23    1  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   35    3  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19   53    5  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     19   72    8  A  U Z             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   78    1  A  U N             T        Y              
CPYLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
CPYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 864  BYTES                            
