*          DATA SET SPNWSE2D   AT LEVEL 007 AS OF 12/03/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207E2D      DATE 12/03/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
ROTMEDH  DS    XL8                                                              
ROTMED   DS    CL1      5    8    1  A  U N             T        Y    1         
ROTMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   12    5  A  P H             T        Y              
ROTBYRH  DS    XL8                                                              
ROTBYR   DS    CL3      5   18    3  A  U N             T        Y    2         
ROTBYRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   23    5  A  P H             T        Y              
ROTNUMH  DS    XL8                                                              
ROTNUM   DS    CL5      5   29    5  A  U N             T        Y    4         
ROTNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   40    7  A  P H             T        Y              
ROTSTAH  DS    XL8                                                              
ROTSTA   DS    CL8      5   48    8  A  U N             T        Y    0         
ROTSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   59    4  A  P H             T        Y              
ROTLINH  DS    XL8                                                              
ROTLIN   DS    CL3      5   64    3  A  U N             T        Y    0         
ROTLINX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   69    4  A  P H             T        Y              
ROTSEQH  DS    XL8                                                              
ROTSEQ   DS    CL3      5   74    3  A  U N             T        Y    0         
ROTSEQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
ROTDAYH  DS    XL8                                                              
ROTDAY   DS    CL7      6   10    7  A  U N             T        Y    0         
ROTDAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   20    5  A  P H             T        Y              
ROTTIMH  DS    XL8                                                              
ROTTIM   DS    CL11     6   27   11  A  U N             T        Y    0         
ROTTIMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   47    6  A  P H             T        Y              
ROTDLNH  DS    XL8                                                              
ROTDLN   DS    CL5      6   54    5  A  U N             T        Y    0         
ROTDLNX  DS    XL8                                                              
ROTSUBH  DS    XL8                                                              
ROTSUB   DS    CL10     6   64   10  A  P H             T        Y              
ROTSDPH  DS    XL8                                                              
ROTSDP   DS    CL1      6   75    1  A  P N             T        Y    0         
ROTSDPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
ROTCSTH  DS    XL8                                                              
ROTCST   DS    CL8      8    8    8  A  U H             T        Y    0         
ROTCSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   20    7  A  P N             T        Y              
ROTUPGH  DS    XL8                                                              
ROTUPG   DS    CL32     8   29   32  A  U H             T        Y    0         
ROTUPGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   62    7  A  P N             T        Y              
ROTPCTH  DS    XL8                                                              
ROTPCT   DS    CL4      8   71    4  A  U H             T        Y    0         
ROTPCTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      9    2    4  A  P N             T        Y              
ROTDEMH  DS    XL8                                                              
ROTDEM   DS    CL7      9    9    7  A  U H             T        Y    0         
ROTDEMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   20    6  A  P H             T        Y              
ROTSRCH  DS    XL8                                                              
ROTSRC   DS    CL3      9   29    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     11    2    9  A  P N             T        Y              
ROTBK1H  DS    XL8                                                              
ROTBK1   DS    CL8     11   16    8  A  U H             T        Y    0         
ROTBK1X  DS    XL8                                                              
ROTBK2H  DS    XL8                                                              
ROTBK2   DS    CL8     11   28    8  A  U H             T        Y    0         
ROTBK2X  DS    XL8                                                              
ROTBK3H  DS    XL8                                                              
ROTBK3   DS    CL8     11   40    8  A  U H             T        Y    0         
ROTBK3X  DS    XL8                                                              
ROTBK4H  DS    XL8                                                              
ROTBK4   DS    CL8     11   52    8  A  U H             T        Y    0         
ROTBK4X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    11   62   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     12   77    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  P H             T        Y              
ROTRPRH  DS    XL8                                                              
ROTRPR   DS    CL46    13   14   46  A  P N             T        Y              
ROTPPRH  DS    XL8                                                              
ROTPPR   DS    CL17    13   62   17  A  U N             T        Y    0         
ROTPPRX  DS    XL8                                                              
ROTRBKH  DS    XL8                                                              
ROTRBK   DS    CL47    14   14   47  A  P N             T        Y              
ROTRPJH  DS    XL8                                                              
ROTRPJ   DS    CL10    14   62   10  A  U N             T        Y    0         
ROTRPJX  DS    XL8                                                              
ROTRCPH  DS    XL8                                                              
ROTRCP   DS    CL7     14   74    7  A  P N             T        Y              
ROTHH1H  DS    XL8                                                              
ROTHH1   DS    CL11    15    2   11  A  P H             T        Y              
ROTH1PH  DS    XL8                                                              
ROTH1P   DS    CL58    15   14   58  A  P N             T        Y              
ROTH1DH  DS    XL8                                                              
ROTH1D   DS    CL67    16   14   67  A  P N             T        Y              
ROTHH2H  DS    XL8                                                              
ROTHH2   DS    CL11    17    2   11  A  P H             T        Y              
ROTH2PH  DS    XL8                                                              
ROTH2P   DS    CL58    17   14   58  A  P N             T        Y              
ROTH2DH  DS    XL8                                                              
ROTH2D   DS    CL67    18   14   67  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    19    2   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL58    19   14   58  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL67    20   14   67  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    2   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL58    21   14   58  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL67    22   14   67  A  P N             T        Y              
ROTCMTH  DS    XL8                                                              
ROTCMT   DS    CL75    24    2   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
ROTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
ROTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
