*          DATA SET SPNWSECAD  AT LEVEL 001 AS OF 01/04/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T207ECD      DATE 01/04/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
DUPMEDH  DS    CL8                                                              
DUPMED   DS    CL1      5   10    1  A  U N             T        Y    1         
DUPMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
DUPBYRH  DS    CL8                                                              
DUPBYR   DS    CL3      5   27    3  A  U N             T        Y    2         
DUPBYRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   40    8  A  P H             T        Y              
DUPNUMH  DS    CL8                                                              
DUPNUM   DS    CL5      5   49    5  A  U N             T        Y    3         
DUPNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   59    7  A  P H             T        Y              
DUPSTAH  DS    CL8                                                              
DUPSTA   DS    CL8      5   70    8  A  U N             T        Y    0         
DUPSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
DUPDAYH  DS    CL8                                                              
DUPDAY   DS    CL7      6   10    7  A  U N             T        Y    0         
DUPDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   20    5  A  P H             T        Y              
DUPTIMH  DS    CL8                                                              
DUPTIM   DS    CL11     6   27   11  A  U N             T        Y    0         
DUPTIMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   40    7  A  P H             T        Y              
DUPDPLH  DS    CL8                                                              
DUPDPL   DS    CL4      6   49    4  A  U N             T        Y    0         
DUPDPLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     6   59   10  A  P N             T        Y              
DUPSDPH  DS    CL8                                                              
DUPSDP   DS    CL1      6   70    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  A  P H             T        Y              
DUPHEDH  DS    CL8                                                              
DUPHED   DS    CL32     8   16   32  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17     8   50   17  A  P H             T        Y              
DUPL1H   DS    CL8                                                              
DUPL1    DS    CL2      9    2    2  A  U N             T        Y              
DUPCSTH  DS    CL8                                                              
DUPCST   DS    CL8      9    6    8  A  P N             T        Y              
DUPRTGH  DS    CL8                                                              
DUPRTG   DS    CL7      9   16    7  A  P N             T        Y              
DUPPRGH  DS    CL8                                                              
DUPPRG   DS    CL17     9   25   17  A  P N             T        Y              
DUPCODH  DS    CL8                                                              
DUPCOD   DS    CL4      9   44    4  A  U N             T        Y              
DUPDATH  DS    CL8                                                              
DUPDAT   DS    CL17     9   50   17  A  U N             T        Y              
DUPL2H   DS    CL8                                                              
DUPL2    DS    CL2     10    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    10   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    10   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    11   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    11   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    12   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    12   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    13   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    13   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    14   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    14   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    15   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    15   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    16   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    16   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    17   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    17   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    18   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    18   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    19   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    19   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    20   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    20   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    21   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    21   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    22   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    22   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    23   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    23   50   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     24    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     24   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    24   25   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     24   44    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    24   50   17  A  U N             T        Y              
DUPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DUPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2016 BYTES                            
