*          DATA SET SPOMSCAD   AT LEVEL 011 AS OF 05/31/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234CAD      DATE 05/31/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
LSLMEDH  DS    XL8                                                              
LSLMED   DS    CL1      5    8    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   12    5  A  P H             T        Y              
LSLBYRH  DS    XL8                                                              
LSLBYR   DS    CL3      5   18    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   24    7  A  P N             T        Y              
LSLSTAH  DS    XL8                                                              
LSLSTA   DS    CL8      5   32    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   43    6  A  P N             T        Y              
LSLCLTH  DS    XL8                                                              
LSLCLT   DS    CL3      5   50    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42     7    2   42  A  P N             T        Y              
LSLSEL1H DS    XL8                                                              
LSLSEL1  DS    CL3      8    2    3  A  U N             T        Y              
LSLEVT1H DS    XL8                                                              
LSLEVT1  DS    CL74     8    6   74  A  P N             T        Y              
LSLSEL2H DS    XL8                                                              
LSLSEL2  DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
LSLEVTLH DS    XL8                                                              
LSLEVTL  DS    CL74    23    6   74  A  P N             T        Y              
LSLPFLNH DS    XL8                                                              
LSLPFLN  DS    CL78    24    2   78  A  P H             T        Y              
LSLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
