*          DATA SET SPOMSC7D   AT LEVEL 002 AS OF 12/16/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234C7D      DATE 12/16/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
DOVMEDH  DS    XL8                                                              
DOVMED   DS    CL1      5    9    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   13    5  A  P H             T        Y              
DOVBYRH  DS    XL8                                                              
DOVBYR   DS    CL3      5   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   26    7  A  P N             T        Y              
DOVSTAH  DS    XL8                                                              
DOVSTA   DS    CL7      5   35    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   45    6  A  P N             T        Y              
DOVCLTH  DS    XL8                                                              
DOVCLT   DS    CL3      5   53    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   59    7  A  P N             T        Y              
DOVCOMH  DS    XL8                                                              
DOVCOM   DS    CL5      5   68    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
DOVORDH  DS    XL8                                                              
DOVORD   DS    CL8      6    2    8  A  U N             T        Y              
DOVDSTH  DS    XL8                                                              
DOVDST   DS    CL3      6   11    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL29     6   40   29  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   71    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   10    4  A  P N             T        Y              
DOVSELH  DS    XL8                                                              
DOVSEL   DS    CL3      8    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71     8   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71     9   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    10   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    11   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    12   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    13   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    14   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    15   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    16   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    17   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    18   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL71    19   10   71  A  P N             T        Y              
DOVSLDFH DS    XL8                                                              
DOVSLDF  DS    CL3     20    2    3  A  U N             T        Y              
DOVDEFH  DS    XL8                                                              
DOVDEF   DS    CL18    20   10   18  A  P N             T        Y              
DOVSLEMH DS    XL8                                                              
DOVSLEM  DS    CL3     21    2    3  A  U N             T        Y              
DOVINVH  DS    XL8                                                              
DOVINV   DS    CL55    21   10   55  A  P N             T        Y              
DOVSLFXH DS    XL8                                                              
DOVSLFX  DS    CL3     22    2    3  A  U N             T        Y              
DOVFXDSH DS    XL8                                                              
DOVFXDS  DS    CL12    22   10   12  A  P N             T        Y              
DOVFOR2H DS    XL8                                                              
DOVFOR2  DS    CL16    22   27   16  A  P N             T        Y              
DOVSLOTH DS    XL8                                                              
DOVSLOT  DS    CL3     23    2    3  A  U N             T        Y              
DOVFXTOH DS    XL8                                                              
DOVFXTO  DS    CL15    23   10   15  A  P N             T        Y              
DOVFXNOH DS    XL8                                                              
DOVFXNO  DS    CL16    23   27   16  A  U N             T        Y              
DOVPFK1H DS    XL8                                                              
DOVPFK1  DS    CL28    24    2   28  A  P N             T        Y              
DOVPFK2H DS    XL8                                                              
DOVPFK2  DS    CL30    24   30   30  A  P N             T        Y              
DOVTAGH  DS    XL8                                                              
DOVTAG   DS    CL1     24   74    1  A  P N             T        Y              
DOVLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DOVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
