*          DATA SET SPOMSB3D   AT LEVEL 001 AS OF 02/16/17                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234B3D      DATE 02/16/17                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
OPSMEDH  DS    XL8                                                              
OPSMED   DS    CL1      5    8    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   11    7  A  P H             T        Y              
OPSORDRH DS    XL8                                                              
OPSORDR  DS    CL8      5   19    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
OPSCLTH  DS    XL8                                                              
OPSCLT   DS    CL3      6    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   10    3  A  P N             T        Y              
OPSPRDH  DS    XL8                                                              
OPSPRD   DS    CL3      6   14    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   18    3  A  P N             T        Y              
OPSESTH  DS    XL8                                                              
OPSEST   DS    CL3      6   22    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   26    3  A  P N             T        Y              
OPSFLTH  DS    XL8                                                              
OPSFLT   DS    CL3      6   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   34    3  A  P N             T        Y              
OPSMKTH  DS    XL8                                                              
OPSMKT   DS    CL4      6   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   43    3  A  P N             T        Y              
OPSSTAH  DS    XL8                                                              
OPSSTA   DS    CL5      6   47    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   53    4  A  P N             T        Y              
OPSTDOLH DS    XL8                                                              
OPSTDOL  DS    CL10     6   58   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   69    5  A  P N             T        Y              
OPSTSPTH DS    XL8                                                              
OPSTSPT  DS    CL4      6   75    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     8   27   24  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
OPSFPERH DS    XL8                                                              
OPSFPER  DS    CL2     10    8    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   23    9  A  P N             T        Y              
OPSFREVH DS    XL8                                                              
OPSFREV  DS    CL3     10   35    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    10   41   14  A  P N             T        Y              
OPSFRSDH DS    XL8                                                              
OPSFRSD  DS    CL1     10   57    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11    2   13  A  P N             T        Y              
OPSFSNDH DS    XL8                                                              
OPSFSND  DS    CL5     11   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   23   10  A  P N             T        Y              
OPSFGAPH DS    XL8                                                              
OPSFGAP  DS    CL5     11   34    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
OPSFCONH DS    XL8                                                              
OPSFCON  DS    CL8     12   15    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    14   27   24  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
OPSTPERH DS    XL8                                                              
OPSTPER  DS    CL2     16    8    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   23    9  A  P H             T        Y              
OPSTREVH DS    XL8                                                              
OPSTREV  DS    CL3     16   35    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    16   41   14  A  P H             T        Y              
OPSTRSDH DS    XL8                                                              
OPSTRSD  DS    CL1     16   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    17    2   13  A  P H             T        Y              
OPSTSNDH DS    XL8                                                              
OPSTSND  DS    CL5     17   16    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   23   10  A  P H             T        Y              
OPSTGAPH DS    XL8                                                              
OPSTGAP  DS    CL5     17   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  P H             T        Y              
OPSTCONH DS    XL8                                                              
OPSTCON  DS    CL8     18   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
OPSLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
OPSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 712  BYTES                            
