*          DATA SET SPOMSFBD   AT LEVEL 010 AS OF 06/26/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234FBD      DATE 06/26/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
ORCMEDH  DS    XL8                                                              
ORCMED   DS    CL1      6   11    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL5      6   14    5  A  P H             T        Y              
ORCORDRH DS    XL8                                                              
ORCORDR  DS    CL8      6   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   30    8  A  P N             T        Y              
ORCREVNH DS    XL8                                                              
ORCREVN  DS    CL3      6   40    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71     7    2   71  A  P N             T        Y              
ORCCOM1H DS    XL8                                                              
ORCCOM1  DS    CL79     8    2   79  A  U N             T        Y              
ORCCOM2H DS    XL8                                                              
ORCCOM2  DS    CL79     9    2   79  A  U N             T        Y              
ORCPFLNH DS    XL8                                                              
ORCPFLN  DS    CL78    24    2   78  A  P H             T        Y              
ORCLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
ORCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 432  BYTES                            
