*          DATA SET SPOMSF5D   AT LEVEL 005 AS OF 06/02/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234F5D      DATE 06/02/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
FLMMEDH  DS    XL8                                                              
FLMMED   DS    CL1      5   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
FLMCLTH  DS    XL8                                                              
FLMCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
FLMPRDH  DS    XL8                                                              
FLMPRD   DS    CL3      5   46    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
FLMESTH  DS    XL8                                                              
FLMEST   DS    CL3      6   10    3  A  U N             T        Y              
FLMESDH  DS    XL8                                                              
FLMESD   DS    CL17     6   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL29     9    2   29  A  P N             T        Y              
FLMFRSTH DS    XL8                                                              
FLMFRST  DS    CL8      9   66    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL58    10    5   58  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    3    1  A  P N             T        Y              
FLMFL01H DS    XL8                                                              
FLMFL01  DS    CL17    12    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   30    1  A  P N             T        Y              
FLMFL02H DS    XL8                                                              
FLMFL02  DS    CL17    12   33   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   57    1  A  P N             T        Y              
FLMFL03H DS    XL8                                                              
FLMFL03  DS    CL17    12   60   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    3    1  A  P N             T        Y              
FLMFL04H DS    XL8                                                              
FLMFL04  DS    CL17    13    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   30    1  A  P N             T        Y              
FLMFL05H DS    XL8                                                              
FLMFL05  DS    CL17    13   33   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   57    1  A  P N             T        Y              
FLMFL06H DS    XL8                                                              
FLMFL06  DS    CL17    13   60   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    3    1  A  P N             T        Y              
FLMFL07H DS    XL8                                                              
FLMFL07  DS    CL17    14    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   30    1  A  P N             T        Y              
FLMFL08H DS    XL8                                                              
FLMFL08  DS    CL17    14   33   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   57    1  A  P N             T        Y              
FLMFL09H DS    XL8                                                              
FLMFL09  DS    CL17    14   60   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  P N             T        Y              
FLMFL10H DS    XL8                                                              
FLMFL10  DS    CL17    15    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   29    2  A  P N             T        Y              
FLMFL11H DS    XL8                                                              
FLMFL11  DS    CL17    15   33   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   56    2  A  P N             T        Y              
FLMFL12H DS    XL8                                                              
FLMFL12  DS    CL17    15   60   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  P N             T        Y              
FLMFL13H DS    XL8                                                              
FLMFL13  DS    CL17    16    6   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   29    2  A  P N             T        Y              
FLMFL14H DS    XL8                                                              
FLMFL14  DS    CL17    16   33   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   56    2  A  P N             T        Y              
FLMFL15H DS    XL8                                                              
FLMFL15  DS    CL17    16   60   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  P N             T        Y              
FLMFL16H DS    XL8                                                              
FLMFL16  DS    CL17    17    6   17  A  U N             T        Y              
FLMTAGH  DS    XL8                                                              
FLMTAG   DS    CL1     18    2    1  A  P N             T        Y              
FLMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
FLMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 816  BYTES                            
