*          DATA SET SPOMSC8D   AT LEVEL 021 AS OF 05/31/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234C8D      DATE 05/31/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
EMLMEDH  DS    XL8                                                              
EMLMED   DS    CL1      5   10    1  A  U H             T    I   Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P H             T        Y              
EMLBYRH  DS    XL8                                                              
EMLBYR   DS    CL8      5   28    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
EMLSTNH  DS    XL8                                                              
EMLSTN   DS    CL8      5   46    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   56    6  A  P N             T        Y              
EMLCLTH  DS    XL8                                                              
EMLCLT   DS    CL3      5   64    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
EMLDESTH DS    XL8                                                              
EMLDEST  DS    CL3      6   10    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
EMLROUTH DS    XL8                                                              
EMLROUT  DS    CL64     7   10   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL42     9    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28     9   44   28  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
EMLSNAMH DS    XL8                                                              
EMLSNAM  DS    CL24    11   17   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
EMLSEMLH DS    XL8                                                              
EMLSEML  DS    CL64    12   11   64  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    14    2   16  A  P N             T        Y              
EMLRNAMH DS    XL8                                                              
EMLRNAM  DS    CL30    14   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
EMLREMLH DS    XL8                                                              
EMLREML  DS    CL64    15   11   64  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL27    18    2   27  A  P N             T        Y              
EMLFAXH  DS    XL8                                                              
EMLFAX   DS    CL16    18   29   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL29    24    2   29  A  P H             T        Y              
EMLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
EMLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 704  BYTES                            
