*          DATA SET SPOMSB5D   AT LEVEL 006 AS OF 08/19/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234B5D      DATE 08/19/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
OPSMEDH  DS    XL8                                                              
OPSMED   DS    CL1      5    8    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   11    7  A  P H             T        Y              
OPSORDRH DS    XL8                                                              
OPSORDR  DS    CL8      5   19    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL45     6    6   45  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47     7    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47     8    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47     9    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    10    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    11    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    12    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    13    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    14    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    15    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    16    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    17    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    18    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    19    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    20    6   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    21    6   47  A  P N             T        Y              
OPSTAGH  DS    XL8                                                              
OPSTAG   DS    CL1     22    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
OPSLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
OPSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1144 BYTES                            
