*          DATA SET SPOMSC6D   AT LEVEL 001 AS OF 09/09/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234C6D      DATE 09/09/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
LSMMEDH  DS    XL8                                                              
LSMMED   DS    CL1      5    8    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   12    5  A  P H             T        Y              
LSMBYRH  DS    XL8                                                              
LSMBYR   DS    CL3      5   18    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   24    7  A  P H             T        Y              
LSMSTAH  DS    XL8                                                              
LSMSTA   DS    CL8      5   32    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   43    6  A  P H             T        Y              
LSMCLTH  DS    XL8                                                              
LSMCLT   DS    CL3      5   50    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
LSMDESTH DS    XL8                                                              
LSMDEST  DS    CL3      7   15    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   24    6  A  P N             T        Y              
LSMMTHDH DS    XL8                                                              
LSMMTHD  DS    CL5      7   32    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
LSMBDECH DS    XL8                                                              
LSMBDEC  DS    CL40     9   20   40  A  P N             T        Y              
LSMSHEDH DS    XL8                                                              
LSMSHED  DS    CL11    11    2   11  A  P N             T        Y              
LSMSNAMH DS    XL8                                                              
LSMSNAM  DS    CL25    11   15   25  A  P N             T        Y              
LSMFHEDH DS    XL8                                                              
LSMFHED  DS    CL3     11   43    3  A  P N             T        Y              
LSMFAXH  DS    XL8                                                              
LSMFAX   DS    CL16    11   50   16  A  P N             T        Y              
LSMDHEDH DS    XL8                                                              
LSMDHED  DS    CL5     12   43    5  A  P N             T        Y              
LSMEDATH DS    XL8                                                              
LSMEDAT  DS    CL8     12   50    8  A  P N             T        Y              
LSMTAGH  DS    XL8                                                              
LSMTAG   DS    CL1     12   74    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   33    8  A  P N             T        Y              
LSMCDTEH DS    XL8                                                              
LSMCDTE  DS    CL8     22   46    8  A  P N             T        Y              
LSMCTIMH DS    XL8                                                              
LSMCTIM  DS    CL5     22   56    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   33   12  A  P N             T        Y              
LSMADTEH DS    XL8                                                              
LSMADTE  DS    CL8     23   46    8  A  P N             T        Y              
LSMATIMH DS    XL8                                                              
LSMATIM  DS    CL5     23   56    5  A  P N             T        Y              
LSMPFLNH DS    XL8                                                              
LSMPFLN  DS    CL79    24    2   79  A  P H             T        Y              
LSMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
LSMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 544  BYTES                            
