*          DATA SET SPOMSEAD   AT LEVEL 002 AS OF 03/29/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234EAD      DATE 03/29/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
MKTMEDH  DS    XL8                                                              
MKTMED   DS    CL1      6    9    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL5      6   14    5  A  P H             T        Y              
MKTBUYRH DS    XL8                                                              
MKTBUYR  DS    CL3      6   22    3  A  U N             T        Y   25         
MKTBUYRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   31    6  A  P H             T        Y              
MKTMRKTH DS    XL8                                                              
MKTMRKT  DS    CL4      6   40    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   46    7  A  P H             T        Y              
MKTSTAH  DS    XL8                                                              
MKTSTA   DS    CL8      6   54    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
MKTCLTH  DS    XL8                                                              
MKTCLT   DS    CL3      7    9    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   14    7  A  P N             T        Y              
MKTPRDH  DS    XL8                                                              
MKTPRD   DS    CL7      7   22    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   31    8  A  P N             T        Y              
MKTESTH  DS    XL8                                                              
MKTEST   DS    CL3      7   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   46    6  A  P N             T        Y              
MKTFLTH  DS    XL8                                                              
MKTFLT   DS    CL2      7   54    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
MKTOPTNH DS    XL8                                                              
MKTOPTN  DS    CL60     8   10   60  A  U N             T        Y              
MKTPRNXH DS    XL8                                                              
MKTPRNX  DS    CL3      8   71    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      8   75    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43     9    2   43  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   46    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   51    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   77    4  A  P N             T        Y              
MKTSELH  DS    XL8                                                              
MKTSEL   DS    CL1     10    2    1  A  U N             T        Y              
MKTBUYH  DS    XL8                                                              
MKTBUY   DS    CL41    10    4   41  A  P N             T        Y              
MKTDSTH  DS    XL8                                                              
MKTDST   DS    CL4     10   46    4  A  U N             T        Y              
MKTROUH  DS    XL8                                                              
MKTROU   DS    CL26    10   51   26  A  P N             T        Y              
MKTCMTH  DS    XL8                                                              
MKTCMT   DS    CL1     10   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    3    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     11    5    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     11    7    7  A  P N             T        Y              
MKTSTDH  DS    XL8                                                              
MKTSTD   DS    CL8     11   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   24    7  A  P N             T        Y              
MKTFFTH  DS    XL8                                                              
MKTFFT   DS    CL48    11   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL41    12    4   41  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   46    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    12   51   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    3    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     13    5    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     13    7    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   24    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    13   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL41    14    4   41  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   46    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    14   51   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    3    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     15    5    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     15    7    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   24    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    15   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL41    16    4   41  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   46    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    16   51   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    3    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     17    5    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     17    7    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   24    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    17   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL41    18    4   41  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   46    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    18   51   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    3    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     19    5    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     19    7    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   24    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    19   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL41    20    4   41  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   46    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    20   51   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    3    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     21    5    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     21    7    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   24    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    21   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL41    22    4   41  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   46    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    22   51   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    3    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     23    5    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     23    7    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   24    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    23   32   48  A  U N             T        Y              
MKTPFLNH DS    XL8                                                              
MKTPFLN  DS    CL71    24    2   71  A  P H             T        Y              
MKTSENTH DS    XL8                                                              
MKTSENT  DS    CL7     24   73    7  A  P H             T        Y              
MKTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
MKTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2136 BYTES                            
