*          DATA SET SPOMSD0D   AT LEVEL 001 AS OF 08/22/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234D0D      DATE 08/22/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
COMMEDH  DS    XL8                                                              
COMMED   DS    CL1      5   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
COMORDH  DS    XL8                                                              
COMORD   DS    CL8      5   28    8  A  U N             T        Y              
COMEXPH  DS    XL8                                                              
COMEXP   DS    CL30     5   38   30  A  P N             T        Y              
COMSRC1H DS    XL8                                                              
COMSRC1  DS    CL8      7    2    8  A  P N             T        Y              
COMCOM1H DS    XL8                                                              
COMCOM1  DS    CL68     7   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68     8   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68     9   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    10   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    11   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    12   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    13   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    14   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    15   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    16   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    17   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    18   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    19   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    20   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    21   12   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    22   12   68  A  P N             T        Y              
COMSRCXH DS    XL8                                                              
COMSRCX  DS    CL8     23    2    8  A  P N             T        Y              
COMCOMXH DS    XL8                                                              
COMCOMX  DS    CL68    23   12   68  A  P N             T        Y              
COMPFKH  DS    XL8                                                              
COMPFK   DS    CL68    24    2   68  A  P N             T        Y              
COMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1736 BYTES                            
