*          DATA SET SPOMSD2D   AT LEVEL 007 AS OF 06/26/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234D2D      DATE 06/26/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
ORSMEDH  DS    XL8                                                              
ORSMED   DS    CL1      6   14    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL5      6   20    5  A  P H             T        Y              
ORSORDH  DS    XL8                                                              
ORSORD   DS    CL8      6   27    8  A  U N             T        Y              
ORSTAG1H DS    XL8                                                              
ORSTAG1  DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     8    2   32  A  P N             T        Y              
ORSUPDTH DS    XL8                                                              
ORSUPDT  DS    CL1      8   35    1  A  U N             T        Y              
ORSPFLNH DS    XL8                                                              
ORSPFLN  DS    CL78    24    2   78  A  P H             T        Y              
ORSLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
ORSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 200  BYTES                            
