*          DATA SET SPOMSFAD   AT LEVEL 003 AS OF 04/01/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234FAD      DATE 04/01/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ORBMESSH DS    XL8                                                              
ORBMESS  DS    CL79     7    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL40     9    2   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL26     9   43   26  A  P N             T        Y              
ORBUPDTH DS    XL8                                                              
ORBUPDT  DS    CL1      9   70    1  A  U N             T    I   Y              
ORBPFLNH DS    XL8                                                              
ORBPFLN  DS    CL78    24    2   78  A  P H             T        Y              
ORBLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
ORBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 272  BYTES                            
