*          DATA SET SPOMSB2D   AT LEVEL 010 AS OF 08/19/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234B2D      DATE 08/19/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
OPSMEDH  DS    XL8                                                              
OPSMED   DS    CL1      5    8    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   11    7  A  P H             T        Y              
OPSORDRH DS    XL8                                                              
OPSORDR  DS    CL8      5   19    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
OPSCLTH  DS    XL8                                                              
OPSCLT   DS    CL3      6    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   10    3  A  P N             T        Y              
OPSPRDH  DS    XL8                                                              
OPSPRD   DS    CL3      6   14    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   18    3  A  P N             T        Y              
OPSESTH  DS    XL8                                                              
OPSEST   DS    CL3      6   22    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   26    3  A  P N             T        Y              
OPSFLTH  DS    XL8                                                              
OPSFLT   DS    CL3      6   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   34    3  A  P N             T        Y              
OPSMKTH  DS    XL8                                                              
OPSMKT   DS    CL4      6   38    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   43    3  A  P N             T        Y              
OPSSTAH  DS    XL8                                                              
OPSSTA   DS    CL5      6   47    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   53    4  A  P N             T        Y              
OPSTDOLH DS    XL8                                                              
OPSTDOL  DS    CL10     6   58   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   69    5  A  P N             T        Y              
OPSTSPTH DS    XL8                                                              
OPSTSPT  DS    CL4      6   75    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     8   27   24  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  A  P N             T        Y              
OPSCSTAH DS    XL8                                                              
OPSCSTA  DS    CL6     10    9    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   16   10  A  P N             T        Y              
OPSCSNDH DS    XL8                                                              
OPSCSND  DS    CL3     10   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   31    3  A  P N             T        Y              
OPSCREVH DS    XL8                                                              
OPSCREV  DS    CL3     10   35    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   39    4  A  P N             T        Y              
OPSCDATH DS    XL8                                                              
OPSCDAT  DS    CL8     10   44    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   53    4  A  P N             T        Y              
OPSCTIMH DS    XL8                                                              
OPSCTIM  DS    CL5     10   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   64    4  A  P N             T        Y              
OPSCDLVH DS    XL8                                                              
OPSCDLV  DS    CL5     10   69    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
OPSCMTHH DS    XL8                                                              
OPSCMTH  DS    CL3     11   14    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   18    4  A  P N             T        Y              
OPSCDSTH DS    XL8                                                              
OPSCDST  DS    CL3     11   23    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   27   10  A  P N             T        Y              
OPSCRPPH DS    XL8                                                              
OPSCRPP  DS    CL8     11   38    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   47   10  A  P N             T        Y              
OPSCRPOH DS    XL8                                                              
OPSCRPO  DS    CL2     11   58    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    13   27   24  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  A  P H             T        Y              
OPSPSNDH DS    XL8                                                              
OPSPSND  DS    CL3     15   14    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   18    4  A  P H             T        Y              
OPSPDSTH DS    XL8                                                              
OPSPDST  DS    CL3     15   23    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   27   10  A  P H             T        Y              
OPSPRPPH DS    XL8                                                              
OPSPRPP  DS    CL8     15   38    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   47   10  A  P H             T        Y              
OPSPRPOH DS    XL8                                                              
OPSPRPO  DS    CL2     15   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
OPSLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
OPSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 728  BYTES                            
