*          DATA SET SPOMSE9D   AT LEVEL 002 AS OF 11/20/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T244E9D      DATE 11/20/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
ORLMEDH  DS    XL8                                                              
ORLMED   DS    CL1      6    8    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL5      6   10    5  A  P N             T        Y              
ORLBUYRH DS    XL8                                                              
ORLBUYR  DS    CL4      6   16    4  A  U N             T        Y   25         
ORLBUYRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6   21    3  A  P N             T        Y              
ORLCLTH  DS    XL8                                                              
ORLCLT   DS    CL3      6   25    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   29    4  A  P N             T        Y              
ORLORDRH DS    XL8                                                              
ORLORDR  DS    CL8      6   34    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   43    3  A  P N             T        Y              
ORLSTATH DS    XL8                                                              
ORLSTAT  DS    CL5      6   47    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      6   53    9  A  P N             T        Y              
ORLEDATH DS    XL8                                                              
ORLEDAT  DS    CL17     6   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
ORLOPTNH DS    XL8                                                              
ORLOPTN  DS    CL68     7   10   68  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    2   74  A  P N             T        Y              
ORLSEL1H DS    XL8                                                              
ORLSEL1  DS    CL3     10    2    3  A  U N             T        Y              
ORLSTT1H DS    XL8                                                              
ORLSTT1  DS    CL7     10    6    7  A  P N             T        Y              
ORLOFI1H DS    XL8                                                              
ORLOFI1  DS    CL1     10   14    1  A  P N             T        Y              
ORLSTA1H DS    XL8                                                              
ORLSTA1  DS    CL5     10   16    5  A  P N             T        Y              
ORLMKN1H DS    XL8                                                              
ORLMKN1  DS    CL10    10   22   10  A  P N             T        Y              
ORLCLT1H DS    XL8                                                              
ORLCLT1  DS    CL3     10   33    3  A  P N             T        Y              
ORLPRD1H DS    XL8                                                              
ORLPRD1  DS    CL7     10   37    7  A  P N             T        Y              
ORLEST1H DS    XL8                                                              
ORLEST1  DS    CL3     10   45    3  A  P N             T        Y              
ORLFLT1H DS    XL8                                                              
ORLFLT1  DS    CL2     10   49    2  A  P N             T        Y              
ORLODT1H DS    XL8                                                              
ORLODT1  DS    CL5     10   52    5  A  P N             T        Y              
ORLADT1H DS    XL8                                                              
ORLADT1  DS    CL5     10   58    5  A  P N             T        Y              
ORLBYR1H DS    XL8                                                              
ORLBYR1  DS    CL3     10   64    3  A  P N             T        Y              
ORLORD1H DS    XL8                                                              
ORLORD1  DS    CL9     10   68    9  A  P N             T        Y              
ORLCLR1H DS    XL8                                                              
ORLCLR1  DS    CL1     10   78    1  A  P Z             T        Y              
ORLSEL2H DS    XL8                                                              
ORLSEL2  DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   78    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   78    1  A  P Z             T        Y              
ORLSELLH DS    XL8                                                              
ORLSELL  DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23    6    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   16    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   22   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   33    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   37    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   45    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   49    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   58    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   64    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   68    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   78    1  A  P Z             T        Y              
ORLPFLNH DS    XL8                                                              
ORLPFLN  DS    CL78    24    2   78  A  P H             T        Y              
ORLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
ORLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2912 BYTES                            
