*          DATA SET SPOMSF1D   AT LEVEL 003 AS OF 07/08/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234F1D      DATE 07/08/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
BUYMEDH  DS    XL8                                                              
BUYMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      5   20    8  A  P H             T        Y              
BUYIDH   DS    XL8                                                              
BUYID    DS    CL3      5   30    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      7    2    9  A  P H             T        Y              
BUYNAMEH DS    XL8                                                              
BUYNAME  DS    CL24     7   15   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P H             T        Y              
BUYOFIDH DS    XL8                                                              
BUYOFID  DS    CL2      8   15    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P H             T        Y              
BUYTELEH DS    XL8                                                              
BUYTELE  DS    CL12     9   15   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   32    4  A  P N             T        Y              
BUYEXTH  DS    XL8                                                              
BUYEXT   DS    CL4      9   37    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   45    3  A  P N             T        Y              
BUYFAXH  DS    XL8                                                              
BUYFAX   DS    CL12     9   50   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  A  P N             T        Y              
BUYEMALH DS    XL8                                                              
BUYEMAL  DS    CL65    10   15   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
BUYBLS1H DS    XL8                                                              
BUYBLS1  DS    CL3     11   15    3  A  U N             T        Y              
BUYBLS2H DS    XL8                                                              
BUYBLS2  DS    CL3     11   19    3  A  U N             T        Y              
BUYBLS3H DS    XL8                                                              
BUYBLS3  DS    CL3     11   23    3  A  U N             T        Y              
BUYBLS4H DS    XL8                                                              
BUYBLS4  DS    CL3     11   27    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
BUYINSRH DS    XL8                                                              
BUYINSR  DS    CL7     12   15    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   35    5  A  P N             T        Y              
BUYTODOH DS    XL8                                                              
BUYTODO  DS    CL5     12   42    5  A  U N             T        Y              
BUYBRPLH DS    XL8                                                              
BUYBRPL  DS    CL17    13    2   17  A  P N             T        Y              
BUYBRPFH DS    XL8                                                              
BUYBRPF  DS    CL1     13   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14    2   17  A  P N             T        Y              
BUYSCMTH DS    XL8                                                              
BUYSCMT  DS    CL8     14   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16    2   15  A  P N             T        Y              
BUYOCMTH DS    XL8                                                              
BUYOCMT  DS    CL70    17    2   70  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL70    18    2   70  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
BUYCDATH DS    XL8                                                              
BUYCDAT  DS    CL25    20   15   25  A  P N             T        Y              
BUYDACTH DS    XL8                                                              
BUYDACT  DS    CL21    22    2   21  A  P Z             T        Y              
BUYLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BUYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
