*          DATA SET SPOMSB0D   AT LEVEL 001 AS OF 01/09/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T234B0D      DATE 01/09/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
ORLMEDH  DS    XL8                                                              
ORLMED   DS    CL1      5    8    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   11    7  A  P H             T        Y              
ORLORDRH DS    XL8                                                              
ORLORDR  DS    CL8      5   19    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   29    8  A  P H             T        Y              
ORLMKGDH DS    XL8                                                              
ORLMKGD  DS    CL3      5   39    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
ORLTITLH DS    XL8                                                              
ORLTITL  DS    CL78     6    2   78  A  P N             T        Y              
ORLSEL1H DS    XL8                                                              
ORLSEL1  DS    CL3      7    2    3  A  U N             T        Y              
ORLSTT1H DS    XL8                                                              
ORLSTT1  DS    CL7      7    6    7  A  P N             T        Y              
ORLOFI1H DS    XL8                                                              
ORLOFI1  DS    CL1      7   14    1  A  P N             T        Y              
ORLSTA1H DS    XL8                                                              
ORLSTA1  DS    CL5      7   16    5  A  P N             T        Y              
ORLMKN1H DS    XL8                                                              
ORLMKN1  DS    CL10     7   22   10  A  P N             T        Y              
ORLCLT1H DS    XL8                                                              
ORLCLT1  DS    CL3      7   33    3  A  P N             T        Y              
ORLPRD1H DS    XL8                                                              
ORLPRD1  DS    CL7      7   37    7  A  P N             T        Y              
ORLEST1H DS    XL8                                                              
ORLEST1  DS    CL3      7   45    3  A  P N             T        Y              
ORLFLT1H DS    XL8                                                              
ORLFLT1  DS    CL2      7   49    2  A  P N             T        Y              
ORLODT1H DS    XL8                                                              
ORLODT1  DS    CL5      7   52    5  A  P N             T        Y              
ORLADT1H DS    XL8                                                              
ORLADT1  DS    CL5      7   58    5  A  P N             T        Y              
ORLBYR1H DS    XL8                                                              
ORLBYR1  DS    CL3      7   64    3  A  P N             T        Y              
ORLORD1H DS    XL8                                                              
ORLORD1  DS    CL9      7   68    9  A  P N             T        Y              
ORLGRP1H DS    XL8                                                              
ORLGRP1  DS    CL3      7   77    3  A  P N             T        Y              
ORLPFLNH DS    XL8                                                              
ORLPFLN  DS    CL78    24    2   78  A  P H             T        Y              
ORLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
ORLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 448  BYTES                            
