*          DATA SET SPOTBLOCK  AT LEVEL 089 AS OF 10/20/20                      
*                                                                               
*        SPOTPAK IO AND EXTRACT BLOCK                                           
         SPACE 1                                                                
SBLOCK   DS    0X                                                               
         SPACE 1                                                                
SBACOMM  DS    0D                  ** COMMON ADDRESSES **                       
SBCOMFAC DS    A                   A(COMFACS)                                   
SBAIO1   DS    A                   A(IO1)                                       
SBAIO2   DS    A                   A(IO2)                                       
SBAIO3   DS    A                   A(IO3)                                       
SBIOHOOK DS    A                   A(IO HOOK)                                   
SBSPHOOK DS    A                   A(SPOT EXTRACT HOOK)                         
SBADATE  DS    A                   A(DATE LIST) - FOR SPOT EXTRACT              
*                                  4 BYTE ENTRIES-COMPRESSED START/END          
SBNDATES DS    F                   N'DATE ENTRIES                               
SBACHUNK DS    A                   A(EXTRACT CHUNKS)                            
SBASPTTB DS    A                   A(SPOT TABLE)-PROVIDED TO SPOTBUY            
SBLSPTTB DS    F                   L'(SPOT TABLE)                               
SBASPOT  DS    A                   A(SPOT ELEMENT)-RETURNED BY SPOTBUY          
SBPRINT  DS    A                   A(PRINT)                                     
SBACURCH DS    A                   A(CURRENT EXTRACT CHUNK)                     
SBABKLST DS    A                   A(BOOK LIST) - SET BY SPOTBOOK               
*                                  X'80'=POST OPTION                            
SBNBKS   DS    F                   N'BOOK LIST ENTRIES                          
SBLSPTEN DS    F                   L'SPOT TABLE ENTRY-SPOTBUY RETURN            
SBNSPTEN DS    F                   N'SPOT TABLE ENTRIES-SPOTBUY RETURN          
SBALMWEN DS    A                   A(MOST RECENT MKT WGT TABLE ENTRY)           
SBASVETB DS    A                   A(SAVED 256-BYTE ESTIMATE TABLE)             
SBACLTRC DS    A                   A(CLIENT RECORD)                             
SBAESTRC DS    A                   A(ESTIMATE RECORD)                           
         SPACE 1                                                                
SBABUFFS DS    CL8                 ** BUFFER ADDRESSES **                       
SBAESTBF DS    A                   A(ESTIMATE BUFFER)                           
SBAPRDBF DS    A                   A(PRODUCT BUFFER)                            
SBAMGTAB DS    A                   A(MARKET GROUP TABLE)                        
SBAESTTB DS    A                   A(ESTIMATE TABLE)                            
SBAUSNTB DS    A                   A(USER DEMO NAME TABLE)                      
SBAOFFBF DS    A                   A(OFFLINE BUFFER)                            
SBADPTTB DS    A                   A(DAYPART TABLES BUFFER)                     
SBAMWTAB DS    A                   A(MARKET WEIGHT TABLE)                       
***                                DEFUNCT NOW THAT WE TSAR THIS OFF            
***SBASTABF DS    A                   A(STATION BUFFER)                         
***                                                                             
SBTSARBF DS    A                   A(TSAR AREA)                                 
SBAMGTB2 DS    A                   A(EXCEPTION MARKET GROUP TABLE)              
SBAMGTBS DS    (SBEXMAX-1)A        A(MORE EXCEPTION MKT GRP TABLES)             
SBEXMAX  EQU   7                   MAXIMUM N'EXCEPTION MKT GRP TABLES           
         SPACE 1                                                                
SBMODEQ  DS    CL8                 ** MODES **                                  
SBMODE   DS    X                                                                
SBPROCCL EQU   1                   PROCESS A CLIENT                             
SBPROCPR EQU   2                   PROCESS A PRODUCT                            
SBPROCES EQU   3                   PROCESS A ESTIMATE                           
SBPROCMK EQU   4                   PROCESS A MARKET                             
SBPROCMG EQU   5                   PROCESS A MARKET GROUP                       
SBPROCPG EQU   6                   PROCESS A PRODUCT GROUP                      
SBPROCST EQU   7                   PROCESS A STATION                            
SBPROCAG EQU   8                   PROCESS AN AGENCY                            
SBPROCCG EQU   9                   PROCESS A CLIENT GROUP                       
SBPROCSP EQU   10                  PROCESS A BUY RECORD                         
SBPROCGL EQU   20                  PROCESS GOAL                                 
SBPROCBL EQU   30                  PROCESS STATION BILL RECORD                  
SBPROCB1 EQU   35                  PROCESS STATION BILL REC,CUR=X'01'           
SBPROCNV EQU   40                  PROCESS INVOICE RECORD                       
SBPROCBH EQU   50                  PROCESS BILL HEADER RECORD                   
SBPROCB2 EQU   52                  PROCESS BILL HEADER REC (NEW PASS)           
SBPROCSL EQU   60                  PROCESS STATION LOCKIN RECORD                
SBPROCSG EQU   80                  PROCESS A STATION GROUP                      
SBPROCCS EQU   90                  PROCESS A CLEARANCE STATUS RECORD            
SBPROCIN EQU   100                 PROCESS AN INFOMERCIAL RECORD                
SBPROCPW EQU   110                 PROCESS A WESTERN PW RECORD (MKT)            
SBPROCP2 EQU   112                 PROCESS A WESTERN PW RECORD (STA)            
SBPROCWP EQU   114                 PROCESS A WESTERN PW RECORD (MKT)            
SBPROCMS EQU   120                 PROCESS MATCHING STATUS RECORDS              
SBPROCCA EQU   130                 PROCESS CASH APPLIED    RECORDS              
SBPROCBG EQU   140                 PROCESS BUYING GUIDELINE STATUS REC          
SBPROCOM EQU   150                 PROCESS OM RECORD                            
SBPROCOB EQU   160                 TSAR OFF OM RECORD FROM BUY                  
SBPROCDO EQU   161                 DELETE OM RECORDS FROM TSAR BUFFER           
SBSKIP   EQU   254                 TELLS SPOTIO TO SKIP ENTIRE INVOICE          
SBSTOP   EQU   255                 TELLS SPOTIO TO STOP PROCESSING              
SBYORN   DS    C                   Y=EXTRACT SPOT,N=DO NOT EXTRACT              
*                                                                               
SBIOFLAG DS    XL1                 SPOTIO I/O FLAG                              
SBNOIO   EQU   X'80'               NO I/O EXECUTED IN HOOK FROM SPOTIO          
SBRDDEL  EQU   X'40'               PASS DELETED RECS (ONLY FOR 0E01)            
SBMINSK  EQU   X'20'               SKIP REST OF MINIO RECORD SET                
SBSKPCLT EQU   X'10'               APPL FLAG TO SKIP THIS CLT                   
SBXFILE  EQU   X'08'               CROSS FILE READING                           
SBRDPWS  EQU   X'04'               GET STAION RECS IN READPW                    
SBSKDEL  EQU   X'02'               SKIP DELETED RECS (BUY ONLY)                 
*                                                                               
SBINDS   DS    XL1                 INDICATORS                                   
SBINETBL EQU   X'80'               NETWORK BILLING RECORD                       
SBIRSOVR EQU   X'40'               RATING SERVICE OVERRIDE                      
SBIONLIN EQU   X'20'               FORCE ONLINE PROCESSING FOR SPOTIO           
SBIAGYMK EQU   X'10'               PASS AGENCY MKT FOR RTG SVC OVERRIDE         
SBAGYUS  EQU   X'08'               US AGENCY  (NO AGYHDR PRESENT)  (MH)         
SBAGYCAN EQU   X'04'               CAN AGENCY (NO AGYHDR PRESENT)               
SBIWRI   EQU   X'02'               SPOT WRITER IS CALLING SPOTBUY               
*                                                                               
SBAFHOOK DS    A                   A(AFFID HOOK)                                
         EJECT                                                                  
SBQAREA  DS    D                   ** REQUEST SELECTIONS **                     
SBQTRACE DS    CL1                 SPOTIO TRACE OPTION                          
SBQSKIP  DS    X                   SKIP RECORD READ SELECTOR                    
SBQSKBUY EQU   X'80'               SKIP READING BUYS                            
SBQSKGL  EQU   X'40'               SKIP READING GOALS                           
SBQSKBIL EQU   X'20'               SKIP READING STATION BILL RECORDS            
SBQSKMED EQU   X'10'               SKIP READING MEDIA RELATED RECORDS           
SBQSKMKT EQU   X'08'               SKIP READING MARKET RECORDS                  
*                                                                               
* ADDITIONAL READ SWITCHES IN SBQREAD2                                          
SBQREAD  DS    X                   READ RECORD SELECTOR                         
SBQRDINV EQU   X'80'               READ INVOICE RECORDS                         
SBQRDBLG EQU   X'40'               READ BILLING RECORDS                         
SBQRDBH  EQU   X'20'               READ BILL HEADER RECORDS                     
SBQRDSLK EQU   X'10'               READ STATION LOCKIN RECORDS                  
SBQRDPG  EQU   X'08'               READ PG ESTIMATE RECORDS                     
SBQRDCLS EQU   X'04'               READ CLEARANCE STATUS RECORDS                
SBQRDINF EQU   X'02'               READ INFOMERCIAL RECORDS                     
SBQRDMSR EQU   X'01'               READ MATCHING STATUS RECORDS                 
*                                                                               
SBQRDOPT DS    X                   READ OPTIONS                                 
SBQROMAB EQU   X'80'               READ MANUAL BILLING (MARKET=9998)            
SBQROMAO EQU   X'40'               READ MARKETS 'AS OF' REQUESTED MKT           
SBQROCGL EQU   X'20'               READ COMBINED/TV/NET GOALS                   
SBQROEST EQU   X'10'               READ ALL ESTIMATES, REGARDLESS OF            
*                                  REQUEST DATES                                
SBQROSCL EQU   X'08'               SINGLE CLIENT MODE                           
SBQROCBL EQU   X'04'               READ COMMISSION BILLING ONLY                 
SBQROSTA EQU   X'02'               SKIP STATION BILL RECS WITH                  
*                                       STABKCUR=X'01'                          
*                                                                               
SBQRDOP2 DS    X                   READ OPTIONS 2                               
*        EQU   X'80'   ***SPARE*** WAS SBQROMCY                                 
*        EQU   X'40'   ***SPARE*** WAS SBQROMCN                                 
*        EQU   X'20'               ***UNUSED***                                 
*        EQU   X'10'               ***UNUSED***                                 
*        EQU   X'08'               ***UNUSED***                                 
*        EQU   X'04'               ***UNUSED***                                 
*        EQU   X'02'               ***UNUSED***                                 
*        EQU   X'01'               ***UNUSED***                                 
*                                                                               
SBQPIND2 DS    XL1                 PRODUCT INDICATOR 2                          
SBQPIGNO EQU   X'80'               SUPPRESS PIGGYBACK SPOTS                     
*                                                                               
SBQAGY   DS    CL2                 AGENCY CODE                                  
SBQMED   DS    CL1                 MEDIA CODE (R/T)                             
SBQCLT   DS    CL3                 CLIENT CODE                                  
SBQCLOFC DS    CL1                 CLIENT OFFICE FILTER                         
SBQBCLT  DS    XL2                 PACKED CLIENT CODE                           
*                                                                               
SBQBKTYP DS    CL1                 BOOK TYPE                                    
*                                                                               
SBQPGR   DS    0CL4                PROCESS BY PRODUCT GROUP                     
SBQPGRD  DS    CL1                 PRODUCT GROUP DEFINITION                     
SBQPGRF  DS    CL3                 PRODUCT GROUP FILTER                         
SBQPRD   DS    CL3                 PRODUCT MNEMONIC                             
SBQBPRD2 DS    XL1                 SECOND PRODUCT CODE                          
SBQBPRD  DS    XL1                 PRODUCT CODE (=0 IF MORE THAN ONE)           
SBQPIND  DS    XL1                 PRODUCT INDICATOR                            
SBQPOLSP EQU   X'80'               SEPARATE PRODUCTS FOR PRODUCT POL            
SBQPOLAL EQU   X'40'               INCLUDE POL IN PRD=ALL                       
SBQPPB   EQU   X'20'               DO NOT SPLIT PIGGYBACKS                      
SBQPOLCP EQU   X'10'               READ CPP GUIDE FOR POL REQUEST               
SBQPIGS  EQU   X'08'               ONLY REPORT PIGGYBACK PRODUCTS               
SBQPNOPB EQU   X'04'               FORCE SPLIT PIGGYBACKS                       
SBQPUNA  EQU   X'02'               ONLY READ UNALLOCATED SPOTS                  
SBQPOLES EQU   X'01'               FORCE PRODUCT POOL ESTIMATES                 
*                                                                               
SBQNETWK DS    CL1                 CANADIAN NETWORK OPTION                      
*                                  N=NETWORK ONLY                               
*                                  L=LOCAL LEVEL STATIONS ONLY                  
*                                  B=BOTH (DEFAULT)                             
SBQMGR   DS    0CL5                PROCESS BY MARKET GROUP                      
SBQMGRD  DS    C                   MARKET GROUP DEFINITION                      
SBQMGRF  DS    CL4                 MARKET GROUP FILTER                          
SBQMKT   DS    CL4                 MARKET NUMBER                                
SBQSTA   DS    CL5                 STATION CALL LETTERS                         
SBQERATE DS    CL1                 ESTIMATE RATE FILTER                         
SBQSPILL DS    CL1                 N=NO SPILL (DEFAULT)                         
*                                  C=COMBINED ORIG + SPILL                      
*                                  S=SEPARATE ORIG + SPILL                      
SBQMKTWT DS    CL1                 Y=MARKET WEIGHTING                           
*                                  D=PRIMARY DEMO MARKET WEIGHTING              
SBQSTATY DS    CL1                 STATION TYPE                                 
*                                                                               
SBQEST   DS    XL1                 ESTIMATE NUMBER                              
SBQESTND DS    XL1                 LAST NUMBER IN ESTIMATE GROUP                
SBQSEPES DS    CL1                 Y=SEPARATE ESTIMATES                         
SBQESFLT DS    CL3                 ESTIMATE FILTERS                             
*                                                                               
SBEFLAG6 DS    XL1                 EXTRACT FLAG 6                               
SBE6TGMY EQU   X'80'               MTRADE=Y                                     
SBE6TGMN EQU   X'40'               MTRADE=N                                     
SBE6MS   EQU   X'20'               AGENCY USES MSTREET                          
SBE6MF   EQU   X'10'               AGENCY USES MEDIA FRAMEWORKS                 
SBE6NOOW EQU   X'08'               DON'T HONOR ESTIMATES OOWR                   
SBE6MATN EQU   X'04'               FILTER OUT BUYS WITH MATCH=NO COMMNT         
SBE6PXBL EQU   X'02'               PROGRAM EXCHANGE FOR BILLS                   
SBE6PXBY EQU   X'01'               PROGRAM EXCHANGE FOR BUYS                    
*                                                                               
AGETBFRW DS    XL4                 A(GETBFRW) BLOCK                             
*                                                                               
SBEFLAG7 DS    XL1                 EXTRACT FLAG 7                               
SBE7APXG EQU   X'80'               AFTER PROGRAM EXCHANGE CALL                  
SBE7NREP EQU   X'40'               SREP FILTER IS NEGATIVE FILTER               
SBE7BCO2 EQU   X'20'               REPORTING BILL COST2                         
SBE7COS2 EQU   X'10'               BILL RECORD IS COST2                         
SBE7SQDQ EQU   X'08'               SQAD BOOKTYPE IS Q                           
SBE7SRDS EQU   X'04'               AGENCY USES SRDS                             
SBE7MGY  EQU   X'02'               ONLY REPORT BUYS WITH MAKEGOODS              
SBE7MGN  EQU   X'01'               ONLY REPORT BUYS WITHOUT MAKEGOODS           
*                                                                               
SBEFLAG8 DS    XL1                 EXTRACT FLAG 8                               
SBE8CNWK EQU   X'80'               CANADIAN NATIONAL DEMOS NETWORK=NWK          
SBE8NPM  EQU   X'40'               USE NEW POSTING MTHODOLOGY D0 PROF           
SBE8CP1  EQU   X'20'               COMSCORE PASS 1                              
SBE8CP2  EQU   X'10'               COMSCORE PASS 2                              
SBE8CPX  EQU   X'08'               SET ECSSDTE ON COMSCORE PASS 1/2             
SBE8NTD  EQU   X'04'               GET COMSCORE NON-TRAD DEMO LIST              
SBE8PP   EQU   X'02'               COMSCORE PARENT PLUS STATION                 
SBE8NTDG EQU   X'01'               SAVE COMSCORE DEMO LIST TO ACOMLSTG          
*                                                                               
SBEFLAG9 DS    CL1                 EXTRACT FLAG 9                               
SBE9CMBK EQU   X'80'               SPOTBOOK TO SET BOOK FOR COMSCORE            
SBE9CERR EQU   X'40'               SPOTBOOK RETURNED FORCE BOOK ERROR           
SBE9GPC2 EQU   X'20'               HAVE COST2 GST/PST                           
SBE92DEC EQU   X'10'               2 DECIMAL IMPRESSIONS                        
SBE9GTUV EQU   X'08'               SPOTBUY TO GET UNIVERSE DEMOS                
*                                                                               
SBQBHIST DS    XL2                 BILL HEADER INVOIVE DATE START               
SBQBHIEN DS    XL2                 BILL HEADER INVOIVE DATE END                 
*                                                                               
* BATCH DATES USED IN IAS (WRI21)                                               
SBQBATST EQU   SBQBHIST            BATCH DATE START                             
SBQBATEN EQU   SBQBHIEN            BATCH DATE END                               
*                                                                               
SBQBHRST DS    XL2                 BILL HEADER RUN DATE START                   
SBQBHREN DS    XL2                 BILL HEADER RUN DATE END                     
SBQBHDST DS    XL2                 BILL HEADER DUE DATE START                   
SBQBHDEN DS    XL2                 BILL HEADER DUE DATE END                     
SBQBHPST DS    XL2                 BILL HEADER POST DATE START                  
SBQBHPEN DS    XL2                 BILL HEADER POST DATE END                    
SBQBILST DS    XL2                 DATE OF BILLING START (COMPRESSED)           
SBQBILEN DS    XL2                 DATE OF BILLING END (COMPRESSED)             
SBQSTART DS    CL6                 REQUEST START DATE                           
SBQEND   DS    CL6                 REQUEST END DATE                             
SBQTODAY DS    CL6                 TODAY'S DATE                                 
*                                                                               
ACOMLSTG DS    CL4                 A(COMSCORE DEMO LIST FOR GOALS)              
SBQSVI   DS    XL1                 SVI ADJUSTMENT MONTH                         
SBQSVINO EQU   X'80'               NO SVI ADJUSTMENT                            
SBQSVIAU EQU   X'40'               AUTO SVI ADJUSTMENT                          
SBQDEMOP DS    XL1                 VARIOUS DEMO OPTIONS                         
SBQDOMWZ EQU   X'80'               DEFAULT MARKET WEIGHT IS 0                   
SBQDDEMO EQU   X'40'               NEW DEMO OPTION                              
*                                                                               
SBQDATA  DS    XL1                 DATA COMPARE                                 
SBQDGOAL EQU   X'80'               GOALS                                        
SBQDPUR  EQU   X'40'               PURCHASED DEMOS                              
SBQDRERT EQU   X'20'               RERATED DEMOS                                
SBQDAFFD EQU   X'10'               AFFIDAVIT DEMOS                              
SBQDORD  EQU   X'08'               ORDERED DEMOS                                
*                                                                               
SBQDPT   DS    CL1                 DAYPART                                      
SBQDPTMN DS    CL1                 DAYPART MENU OVERRIDE                        
SBQMGOPT DS    CL1                 Y=PROCESS MAKE-GOODS IN MISSED MONTH         
*                                                                               
SBQPER   DS    CL1                 PERIODS                                      
SBQPWK   EQU   X'80'               WEEKS                                        
SBQPMN   EQU   X'40'               MONTHS                                       
SBQPQT   EQU   X'20'               QUARTERS                                     
SBQPDY   EQU   X'10'               DAYS                                         
SBQPYR   EQU   X'08'               YEARS                                        
SBQPFL   EQU   X'04'               CHILD SPOT FLIGHTS                           
SBQPHY   EQU   X'02'               HALF YEARS                                   
SBQPBIG  EQU   X'01'               EXTENDED PERIOD TABLES                       
*                                                                               
SBQSPQRT DS    CL1                 Y=INVOKE SPECIAL QUARTERS                    
SBQPERLO DS    XL1                 LOW PERIOD NUMBER                            
SBQPERHI DS    XL1                 HIGH PERIOD NUMBER                           
*                                                                               
SBQDPTLN DS    XL1                 DAYPART/LENGTH DETAIL CONTROL                
SBQDLSUP EQU   X'80'               SUPPRESS CROSS DAYPARTS                      
SBQDLTOT EQU   X'40'               CROSS DAYPARTS WITH SPOT LEN DETAIL          
SBQDLCPP EQU   X'20'               CROSS DAYPARTS WITH CPP                      
SBQDLSGR EQU   X'10'               SUPPRESS DAYPART GROUP TOTALS                
SBQDLEXC EQU   X'01'               EXCLUDE GROUP OF DAYPARTS                    
*                                                                               
SBQDEMOS DS    CL4                 DEMO MENU                                    
*                                                                               
SBQBHEST DS    XL2                 BILL HEADER INVOIVE DATE START               
SBQBHEEN DS    XL2                 BILL HEADER INVOIVE DATE END                 
*                                                                               
SBQNSIZE DS    CL1                 NETSIZE (STATION SIZE) L/CASE=EXCLUD         
SBQNSIZX DS    CL2                 2 ADDITIONAL NETSIZE VALUES                  
SBCOMSD  DS    CL1                 COMSCORE SURVEY DATES (B/S)                  
*                                                                               
SBQYMST  DS    XL1                 Y/M START FOR BILL HEADER FILTERING          
SBQYMEND DS    XL1                 Y/M END FOR BILL HEADER FILTERING            
SBQMGCLT DS    XL2                 ALTERNATE MARKET GROUP CLIENT                
SBQNBITS DS    XL1                 CANADIAN NETWORK BITS                        
SBQCAN   DS    XL1                 CANADIAN OPTIONS                             
SBQCMKT0 EQU   X'80'               READ MARKET 0 BILL RECORDS                   
SBQCBYM0 EQU   X'40'               READ MARKET 0 BUY RECORDS                    
SBQBMKTX DS    XL2                 LAST MARKET IN RANGE                         
SBQLEN   DS    XL1                 SPOT LENGTH                                  
SBQADJ   DS    XL1                 ADJACENCY CODE                               
SBQSREP  DS    XL2                 SPECIAL REP                                  
SBQGETNM DS    CL1                 Y=GET BUYER/BILLER NAMES                     
*                                                                               
SBPGRPEX DS    (SBEXMAX)XL2        PRODUCT GRP EXCEPTIONS FOR MKT GRPS          
*                                                                               
SBQNET   DS    CL4                 CANADIAN NETWORK FILTER                      
SBQCURR  DS    CL1                 C=CANADIAN,U=USA                             
SBQPAYST DS    XL2                 PAID DATE START (COMPRESSED)                 
SBQPAYEN DS    XL2                 PAID DATE END (COMPRESSED)                   
SBQMASDP DS    CL1                 MASTER DAYPART                               
SBQBHTYP DS    CL1                 BILL TYPE FILTER                             
SBQBHTYA EQU   C'A'                AOR                                          
SBQBHTYB EQU   C'B'                NOT AOR                                      
SBQBHTYC EQU   C'C'                COMMISSION                                   
SBQBHTYD EQU   C'D'                NOT COMMISSION                               
SBQBHTYE EQU   C'E'                RETAIL CONTROL BILLING                       
SBQBHTYF EQU   C'F'                NOT RETAIL CONTROL BILLING                   
SBQBHTYG EQU   C'G'                MANUAL BILLS                                 
SBQBHTYH EQU   C'H'                NOT MANUAL BILLS                             
SBQBHTYN EQU   C'N'                NET                                          
SBQBHTYO EQU   C'O'                NOT NET                                      
SBQBHTYQ EQU   C'Q'                ORDERED/UNCLEARED                            
SBQBHTYR EQU   C'R'                CLEARED/UNORDERED                            
         SPACE 2                                                                
SBQUNBK  DS    CL2                 UNIVERSE BOOK                                
SBUNVDEM DS    CL4                 A(UNIVERSE FOR FIRST 8 DEMOS)                
         DS    CL2                 SPARE                                        
SBENDEM  DS    XL1                 NUMBER OF DEMOS TO EXTRACT DEFAULT=4         
SBEMKT   DS    XL2                 MARKET NUMBER                                
SBEPRD   DS    XL1                 BRAND CODE                                   
SBEPRD2  DS    XL1                 BRAND 2 CODE (NOT SUPPORTED)                 
SBECML   DS    XL3                 COMMERCIAL FILTER                            
*                                                                               
SBEFLAG  DS    XL1                 VARIOUS EXTRACT FLAGS                        
SBE2COS  EQU   X'80'               EXTRACT 2ND COST FROM BUY                    
SBEA2COS EQU   X'40'               FLAG FOR SPOTBUY CALL AFTER SBE2COS          
SBEWIPW  EQU   X'20'               EXTRACT WESTERN PROFIT WITHIN                
SBEPWNTX EQU   X'10'               DON'T USE TAX IN PW CALCULATIONS             
SBEECNTL EQU   X'08'               FILTER FOR CONTROL 'E' ESTIMATES             
SBEPST   EQU   X'04'   ****TEMP    EXTRACT PST DATA W/GST (SUM)                 
SBEEEST  EQU   X'02'               THIS IS AN E ESTIMATE                        
SBECLSK  EQU   X'01'               RESTRICTED CLIENTS SKIPPED                   
*                                                                               
SBEIBYCK DS    CL1                 INFOMERCIAL BUYER CHECKING FILTER            
SBEDMA   DS    CL1                 DMA OVERRIDE OPTION                          
*                                                                               
SBESTTIM DS    XL2                 START TIME FILTER                            
SBEENTIM DS    XL2                 END TIME FLITER                              
SBETIMIN DS    XL1                 START/END TIME FILTER INDICATOR              
SBETISGT EQU   X'80'               START TIME GREATER THAN                      
SBETISGE EQU   X'40'               START TIME GREATER THAN OR EQUAL             
SBETISLT EQU   X'20'               START TIME LESS THAN                         
SBETISLE EQU   X'10'               START TIME LESS THAN OR EQUAL                
SBETIEGT EQU   X'08'               END TIME GREATER THAN                        
SBETIEGE EQU   X'04'               END TIME GREATER THAN OR EQUAL               
SBETIELT EQU   X'02'               END TIME LESS THAN                           
SBETIELE EQU   X'01'               END TIME LESS THAN OR EQUAL                  
*                                                                               
SBEDEMTY DS    CL1                 P=PURCH, R=RERATE, A=AFFID RERATE            
SBEACTBK DS    XL1                 ACTUAL BOOK TABLE CODE (0=NONE)              
SBESVI   DS    XL1                 SVI MONTH (0=AUTO,X'FF'=NO)                  
SBERSPDT DS    XL4                 INFOMERCIAL RESPONSE DATES FILTER            
SBEUDEF  DS    XL1                 EXTRACT USER DEFINITION FIELDS               
SBEUPRD1 EQU   X'80'               EXTRACT PRODUCT UDEF FIELD 1                 
SBEUPRD2 EQU   X'40'               EXTRACT PRODUCT UDEF FIELD 2                 
SBEUEST1 EQU   X'20'               EXTRACT ESTIMATE UDEF FIELD 1                
SBEUEST2 EQU   X'10'               EXTRACT ESTIMATE UDEF FIELD 2                
SBEUPCOM EQU   X'08'               CALLER NEEDS TO EXTRACT PRD UCOM             
SBEUECOM EQU   X'04'               CALLER NEEDS TO EXTRACT EST UCOM             
SBEUMCOM EQU   X'02'               CALLER NEEDS TO EXTRACT EST MCOM             
SBEBYCHK DS    CL1                 Y=BREAK OUT BY CHECK                         
*                                                                               
SBESPOTS DS    CL1                 SPOTS FILTER                                 
SBESPAID EQU   C'P'                PAID SPOTS ONLY                              
SBESUNPD EQU   C'U'                UNPAID SPOTS ONLY                            
SBESALL  EQU   C'A'                ALL SPOTS                                    
*                                                                               
SBEBEF   DS    CL1                 Y=INCLUDE SPOTS BEFORE REQUEST               
SBEAFTER DS    CL1                 Y=INCLUDE SPOTS AFTER REQUEST                
SBEBYPRD DS    CL1                 Y=BREAK OUT ALLOCATED PRODUCTS               
SBEUNALL DS    CL1                 Y=INCLUDE UNALLOCATED SPOTS                  
SBESPLIT DS    CL1                 N=DO NOT SPLIT PIGGYBACKS                    
SBEBYSLN DS    CL1                 Y=BREAK OUT SECONDS LENGTHS                  
SBEBYCML DS    CL1                 Y=BREAK BY COMMERCIAL                        
SBEBYCLS DS    CL1                 COMMERCIAL CLASS OPTION (NOT USED)           
*                                                                               
SBEPAID  DS    CL1                 Y=EXTRACT PAID DATA        DEFAULT=N         
SBEBILL  DS    CL1                 Y=EXTRACT BILLED DATA      DEFAULT=N         
SBECS    DS    CL1                 Y=EXTRACT CHILD-SPOT INFO. DEFAULT=N         
*                                  R=EXTRACT DIRECT RESPONSE                    
SBETAX   DS    CL1                 Y=SUBTRACT TAX FROM ORDERED GROSS            
*                                  AND GROSS EQUIV IF SPEDEMTY NE 0             
SBELOCK  DS    CL1                 Y=EXTRACT GOAL LOCK-IN DATA                  
SBESPILL DS    CL1                 O=ORIGINATING MARKET ONLY                    
*                                  S=SPILL MARKET ONLY                          
SBEEFCST DS    CL1                 Y=CALCULATE EFFECTIVE COST.DEFAULT=N         
SBENOWGT DS    CL1                 Y=DO NOT WEIGHT DEMOS BY N'SPOTS             
*                                                                               
SBEDEMOS DS    XL36                OVERRIDE DEMOS (12X3)                        
SBEDEM   DS    CL1                 N=DONT INCLUDE DEMS IN EST BUFF ENTS         
SBEFILT  DS    CL1                 Y=INCLUDE EST FILTS IN EST BUFF ENTS         
SBESREP  DS    CL1                 Y=KEEP SPECIAL REPS IN EST BUFFER            
SBEGST   DS    XL1                 CANADIAN GST/PST EXTRACT OPTION              
SBEGSTI  EQU   X'80'               EXTRACT INPUT GST                            
SBEGSTO  EQU   X'40'               EXTRACT OUTPUT GST                           
SBEGSTB  EQU   X'20'               EXTRACT BILLED GST                           
SBEPSTI  EQU   X'08'               EXTRACT INPUT PST                            
SBEPSTO  EQU   X'04'               EXTRACT OUTPUT PST                           
SBEPSTB  EQU   X'02'               EXTRACT BILLED PST                           
SBEPAYDT DS    CL1                 Y=USE PAY DATE INSTEAD OF BUY DATE           
SBEBYDT  DS    CL1                 Y=BREAK BY AFFIDAVIT DATE                    
SBEBYTM  DS    CL1                 Y=BREAK BY AFFIDAVIT TIME                    
SBEBYDPT DS    CL1                 Y=BREAK BY DIRECT RESPONSE DAYPART           
SBERTLSC DS    CL1                 Y=INCLUDE RETAIL SCHEME CODES                
         SPACE 2                                                                
SBDATA   DS    CL8                 ** EXTRACTED DATA **                         
SBAGY    DS    CL2                 AGENCY CODE                                  
*                                                                               
SBMED    DS    CL1                 MEDIA CODE                                   
SBMEDNM  DS    CL10                MEDIA NAME                                   
*                                                                               
SBCLT    DS    CL3                 CLIENT CODE                                  
SBCLTNM  DS    CL20                CLIENT NAME                                  
SBCOFF   DS    C                   CLIENT OFFICE CODE                           
SBCPROF  DS    CL15                CLIENT PROFILE VALUES                        
SBCEXTRA DS    CL15                CLIENT EXTRA PROFILE                         
SBSPPROF DS    CL16                00 PROFILE                                   
SBD0PROF DS    CL16                D0 PROFILE                                   
SB1WPROF DS    CL16                1W PROFILE                                   
SBCIDTIT DS    CL10                ID TITLE                                     
SBCACCOF DS    CL2                 ACCOUNTING OFFICE CODE                       
SBCLTIFC DS    CL8                 CLIENT INTERFACE CODE                        
*                                                                               
SBPGR1   DS    CL5                 PRODUCT GROUP LEVEL 1 CODE                   
SBPGR1LN DS    CL1                 PRODUCT GROUP LEVEL 1 LENGTH                 
SBPGR1BK DS    CL12                PRODUCT GROUP LEVEL 1 BREAK NAME             
SBPGR1NM DS    CL24                PRODUCT GROUP LEVEL 1 GROUP NAME             
SBPG1MSK DS    XL2                 PRODUCT GROUP LEVEL 1 MASK                   
*                                                                               
SBPGR2   DS    CL5                 PRODUCT GROUP LEVEL 2 CODE                   
SBPGR2LN DS    CL1                 PRODUCT GROUP LEVEL 2 LENGTH (1+2)           
SBPGR2BK DS    CL12                PRODUCT GROUP LEVEL 2 BREAK NAME             
SBPGR2NM DS    CL24                PRODUCT GROUP LEVEL 2 GROUP NAME             
*                                                                               
SBPRD    DS    CL3                 PRODUCT CODE                                 
SBPRDNM  DS    CL24                PRODUCT NAME                                 
SBPRD2   DS    CL3                 PRODUCT 2 CODE                               
*                                                                               
* INVOICE EXTRACT CONTROLS                                                      
SBEINV   DS    CL1                 INVOICE FILTER                               
SBEIPAID EQU   X'80'               PAID INVOICES ONLY                           
SBEIUNPD EQU   X'40'               UNPAID INVOICES ONLY                         
SBEIAUD  EQU   X'20'               INVOICES MARKED FOR AUDIT ONLY               
SBEIMCY  EQU   X'10'               MIDNIGHT CLEARANCES ONLY                     
SBEIMCN  EQU   X'08'               NO MIDNIGHT CLEARANCES                       
SBEIEAY  EQU   X'04'               EASI INVOICES ONLY                           
SBEIEAN  EQU   X'02'               NO EASI INVOICES                             
*                                                                               
SBPDEMOS DS    CL60                PRODUCT DEMOS (SET FOR NO PRD BUFF)          
SBPWTLST DS    CL20                WEIGHT LIST (SET FOR NO PRD BUFF)            
SBPUSN   DS    CL35                USER DEMO NAMES(SET FOR NO PRD BUFF)         
SBPRDINT DS    CL4                 PRODUCT INTERFACE CODE                       
*                                                                               
SBQEXCL  DS    C                   CLIENT EXCLUDE FILTER                        
SBEFLAG5 DS    XL1                 EXTRACT FLAG 5                               
SBE5UPOL EQU   X'80'               GET UDEFS FROM POL PRD                       
SBE5CPOL EQU   X'40'               GET UCOMS FROM POL PRD                       
SBE5HDEF EQU   X'20'               HAVE HIGHDEF KEYWORD                         
SBE5CNTR EQU   X'10'               HAVE CENTERCUT KEYWORD                       
SBE5BFRM EQU   X'08'               READ SFM BFORM                               
SBE5CLDR EQU   X'04'               USING CALENDAR MONTHS                        
SBE5GEST EQU   X'02'               GET EST REC FOR PGROUP                       
SBE5EFNP EQU   X'01'               EST FILT IS NON-POSITIONAL "OR" FILT         
*                                                                               
SBESTSR  DS    XL2                 ESTIMATE'S SPECIAL REP                       
SBEST    DS    CL3                 ESTIMATE NUMBER                              
SBESTNM  DS    CL20                ESTIMATE NAME                                
SBESTFLT DS    CL3                 ESTIMATE FILTERS                             
*                                                                               
SBBKAVG  DS    CL1                 # OF BOOKS TO AVG BACK                       
*                                                                               
SBESTDTS DS    0CL12               ESTIMATE DATES                               
SBESTST  DS    CL6                 ESTIMATE START DATE                          
SBESTND  DS    CL6                 ESTIMATE END DATE                            
SBDPTMEN DS    CL1                 DAYPART MENU                                 
SBESTDEM DS    CL6                 ESTIMATE TARGET/SECONDARY DEMOS              
SBESTOWD DS    CL1                 ESTIMATE OUT-OF-WEEK DAY                     
*                                                                               
SBMGR1   DS    CL5                 MARKET GROUP LEVEL 1 CODE                    
SBMGR1LN DS    CL1                 MARKET GROUP LEVEL 1 LENGTH                  
SBMGR1BK DS    CL12                MARKET GROUP LEVEL 1 BREAK NAME              
SBMGR1NM DS    CL24                MARKET GROUP LEVEL 1 GROUP NAME              
SBMG1MSK DS    XL2                 MARKET GROUP LEVEL 1 MASK                    
*                                                                               
SBMGR2   DS    CL5                 MARKET GROUP LEVEL 2 CODE                    
SBMGR2LN DS    CL1                 MARKET GROUP LEVEL 2 LENGTH (1+2)            
SBMGR2BK DS    CL12                MARKET GROUP LEVEL 2 BREAK NAME              
SBMGR2NM DS    CL24                MARKET GROUP LEVEL 2 GROUP NAME              
SBMG2MSK DS    XL2                 MARKET GROUP LEVEL 2 MASK                    
*                                                                               
SBMGR3   DS    CL5                 MARKET GROUP LEVEL 3 CODE                    
SBMGR3LN DS    CL1                 MARKET GROUP LEVEL 3 LENGTH (1+2+3)          
SBMGR3BK DS    CL12                MARKET GROUP LEVEL 3 BREAK NAME              
SBMGR3NM DS    CL24                MARKET GROUP LEVEL 3 GROUP NAME              
*                                                                               
SBMKT    DS    CL4                 MARKET NUMBER                                
SBMKTNM  DS    CL24                MARKET NAME                                  
SBMKTWGT DS    CL4                 MARKET WEIGHT                                
*                                                                               
SBSTA    DS    CL5                 STATION CALL LETTERS  (WABCA)                
*SBSTAPRT DS   CL7                 EXPANDED CALL LETTERS (WABC-AM)              
SBCHAN   DS    CL4                 STATION CHANNEL                              
SBPREP   DS    CL3                 STATION PAYING REP                           
SBAFFIL  DS    CL3                 STATION AFFILIATE                            
SBSTYPE  DS    CL1                 STATION TYPE                                 
*                                                                               
SBREP    DS    CL3                 REP NUMBER (CONTRACT)                        
SBREPNM  DS    CL24                REP NAME (CONTRACT)                          
*                                                                               
SBNETWK  DS    CL4                 NETWORK                                      
SBSREP   DS    CL3                 SPECIAL REP                                  
SBTREP   DS    CL3                 TIME SHEET REP                               
*                                                                               
SBMKTRNK DS    XL1                 MARKET RANK (10,20,30,40,50,60,70)           
SBMRNUM  DS    XL2                 MARKET RANK NUMBER (1,2,3,4,.....)           
SBSTAST  DS    CL3                 STATION STATE                                
SBRTLSCH DS    CL2                 RETAIL SCHEME CODE                           
SBDPTCD  DS    CL1                 DAYPART CODE                                 
*                                                                               
SBSTPROF DS    CL16                ST PROFILE                                   
*                                                                               
SBDPTLEN DS    0CL9                DAYPART/LENGTH                               
SBDPTGRP DS    XL4                 DPT GROUP                                    
SBDPT    DS    XL4                 DPT                                          
SBLEN    DS    XL1                 SPOT LENGTH                                  
*                                                                               
SBBYRNM  DS    CL12                BUYER NAME                                   
SBBLRNM  DS    CL12                BILLER NAME                                  
*                                                                               
SBBYTYPE DS    CL1                 C=CASH,T=TRADE                               
*                                                                               
SBCMLSQ  DS    XL2                 COMMERCIAL SEQUENCE NUMBER                   
SBQAFFIL DS    CL3                 AFFILIATION FILTER                           
SBGMBILL DS    CL1                 LMG/REGIONAL FOR GM BILLING                  
SBDIGTAL DS    CL1                 DIGITAL BAND FILTER                          
SBWR2PRF DS    CL16                WR2 PROFILE                                  
SBCMLSQ2 DS    XL2                 COMMERCIAL SEQUENCE NUMBER 2                 
         DS    XL2                 SPARE                                        
*                                                                               
SBACMLTB DS    A                   A(COMMERCIAL TABLE)                          
*                                                                               
SBDFPROF DS    CL16                DF PROFILE                                   
SBABINSR DS    A                   A(BINSRCH)                                   
SBRECDA  DS    XL4                 D/A OF LAST RECORD READ                      
*                                                                               
SBCOMDEM DS    A                   A(COMSCORE EXPANDED DEMO LIST)               
SBCOMDLN EQU   200                 200 BYTE COMSCORE DEMO LIST                  
*                                                                               
SBBVALS  DS    CL8                 ** BINARY DATA VALUES **                     
SBBAGY   DS    XL1                 AGENCY NUMBER                                
SBBAGYMD DS    XL1                 AGENCY/MEDIA                                 
SBBCLT   DS    XL2                 CLIENT                                       
SBBMGST  DS    XL2                 M-G IN MISSED MON START (COMPRESSED)         
SBBPGR   DS    XL2                 PRODUCT GROUP                                
SBBMPRD  DS    XL1                 MASTER PRODUCT NUMBER (POL BUYS)             
SBBPRD   DS    XL1                 PRODUCT NO.                                  
SBBEST   DS    XL1                 ESTIMATE NO.                                 
SBBESTND DS    XL1                 ESTIMATE END NO.                             
SBBFILT  DS    CL1                 FILTER VALUE                                 
SBBPRD2  DS    XL1                 PRODUCT 2                                    
SBBILFOR DS    0CL5                PRODUCT AAA BILL FORMULA                     
SBBILBAS DS    XL1                                                              
SBBILCOM DS    XL4                                                              
SBBCGR   DS    XL2                 CLIENT GROUP                                 
SBBSGR   DS    XL2                 STATION GROUP                                
SBBCMCLT DS    XL2                 MASTER TRAFFIC CLIENT CODE                   
SBBCLTEQ DS    XL2                 CLIENT FOR EQUIVALENCE RECORD                
*                                                                               
SBUP1LEN DS    XL1                 PRODUCT USER LENGTH 1                        
SBUP1TYP DS    CL1                 PRODUCT USER TYPE 1                          
SBUP2LEN DS    XL1                 PRODUCT USER LENGTH 2                        
SBUP2TYP DS    CL1                 PRODUCT USER TYPE 2                          
SBUE1LEN DS    XL1                 ESTIMATE USER LENGTH 1                       
SBUE1TYP DS    CL1                 ESTIMATE USER TYPE 1                         
SBUE2LEN DS    XL1                 ESTIMATE USER LENGTH 2                       
SBUE2TYP DS    CL1                 ESTIMATE USER TYPE 2                         
*                                                                               
SBBSTMKT DS    CL2                 STATION'S MARKET                             
*                                                                               
SBBMGR   DS    XL2                 MARKET GROUP                                 
*                                                                               
SBQETYPE DS    CL1                 ETYPE FILTER                                 
*                                                                               
SBBMKTST DS    0XL5                MARKET/STATION                               
SBBMKT   DS    XL2                 MARKET                                       
SBBSTA   DS    XL3                 STATION                                      
SBBREP   DS    XL2                 REP                                          
SBBSPL   DS    XL2                 SPILL MKT RTG SRV NUMBER                     
SBBRSM0  DS    XL2                 NSI MKT RTG SRV NUMBER                       
SBBRSM1  DS    XL2                 ARB MKT RTG SRV NUMBER                       
SBBEQCLT DS    XL2                 CLIENT FOR EQUIVALENCE TABLE                 
*                                                                               
SBBTODAY DS    XL2                 TODAY'S DATE (COMPRESSED)                    
SBBDATES DS    0CL10               DATES                                        
SBBQST   DS    XL3                 REQUEST START                                
SBBQEND  DS    XL3                 REQUEST END                                  
SBBQSTP  DS    XL2                 REQUEST START (COMPRESSED)                   
SBBQENDP DS    XL2                 REQUEST END   (COMPRESSED)                   
*                                                                               
SBESTSTB DS    XL3                 ESTIMATE START (BINARY)                      
SBESTNDB DS    XL3                 ESTIMATE END   (BINARY)                      
SBESTSTP DS    XL2                 ESTIMATE START (COMPRESSED)                  
SBESTNDP DS    XL2                 ESTIMATE END   (COMPRESSED)                  
*                                                                               
SBSIZE   DS    CL1                 STATION SIZE                                 
*                                                                               
SBSTAAGY DS    CL2                 ALTERNATE STATION FILE AGY                   
*                                                                               
SBTALMUL DS    F                   TALENT FACTOR MULTIPLIER                     
SBTALDIV DS    F                   TALENT FACTOR DIVISOR                        
SBBQBLST DS    XL2                 BILLING START MONTH NUMBER                   
SBBQBLEN DS    XL2                 BILLING END MONTH NUMBER                     
SBBILGRS DS    F                   EFFECTIVE GROSS BILLED                       
SBBILNET DS    F                   EFFECTIVE NET BILLED                         
SBBILTAX DS    F                   EFFECTIVE TAX BILLED                         
SBSTAFOR DS    CL4                 STATION FORMAT                               
SBSTAFAX DS    CL12                STATION FAX                                  
SBAINFTB DS    A                   A(INFOMERCIAL TABLE)                         
SBACHKTB DS    A                   A(CHECK TABLE)                               
SBAXSPIL DS    A                   A(CANADIAN SPILL STATION LIST)               
SBACBLBF DS    A                   A(CABLE BUFFER)                              
*                                                                               
SBCBLNET DS    CL3                 CABLE NETWORK                                
SBIOKEY  DS    XL18                SPOTIO'S CURRENT KEY                         
SBWRPROF DS    CL16                WR PROFILE                                   
SBLKPROG DS    CL16                LOOKED UP PROGRAM                            
*                                                                               
*                                  ** FURTHER REQUEST SELECTIONS **             
SBQUPVAL DS    0X                  UPGRADE VALUES                               
SBQUPGRD DS    XL8                                                              
SBQUPFIL DS    CL1                                                              
SBQUPFBK DS    XL2                                                              
SBQUPSHR DS    CL1                                                              
SBQUPPUT DS    CL1                                                              
SBQUPL   EQU   *-SBQUPVAL                                                       
*                                                                               
SBQCGR   DS    0CL5                PROCESS BY CLIENT GROUP                      
SBQCGRD  DS    C                   CLIENT GROUP DEFINITION                      
SBQCGRF  DS    CL4                 CLIENT GROUP FILTER                          
*                                                                               
SBQSGR   DS    0CL5                PROCESS BY STATION GROUP                     
SBQSGRD  DS    C                   STATION GROUP DEFINITION                     
SBQSGRF  DS    CL4                 STATION GROUP FILTER                         
*                                                                               
SBQREQST DS    CL6                 ORIGINAL REQUESTOR'S REQUEST START           
SBQREQND DS    CL6                 AND END DATES                                
*                                                                               
SBQCMLCL DS    CL4                 COMMERCIAL CLASS FILTER                      
SBQCMLTY DS    CL1                 COMMERCIAL TYPE                              
SBQCTINV EQU   C'I'                INVOICED COMMERCIALS                         
SBQCTTAS EQU   C'T'                TRAFFIC ASSIGNED COMMERCIALS                 
SBQCNET  DS    CL3                 CABLE NETWORK                                
SBQDPLST DS    CL9                 DAYPART LIST                                 
*                                                                               
SBCGR1   DS    CL5                 CLIENT GROUP LEVEL 1 CODE                    
SBCGR1LN DS    CL1                 CLIENT GROUP LEVEL 1 LENGTH                  
SBCGR1BK DS    CL12                CLIENT GROUP LEVEL 1 BREAK NAME              
SBCGR1NM DS    CL24                CLIENT GROUP LEVEL 1 GROUP NAME              
SBCG1MSK DS    XL2                 CLIENT GROUP LEVEL 1 MASK                    
*                                                                               
SBCGR2   DS    CL5                 CLIENT GROUP LEVEL 2 CODE                    
SBCGR2LN DS    CL1                 CLIENT GROUP LEVEL 2 LENGTH (1+2)            
SBCGR2BK DS    CL12                CLIENT GROUP LEVEL 2 BREAK NAME              
SBCGR2NM DS    CL24                CLIENT GROUP LEVEL 2 GROUP NAME              
*                                                                               
SBSGR1   DS    CL5                 STATION GROUP LEVEL 1 CODE                   
SBSGR1LN DS    CL1                 STATION GROUP LEVEL 1 LENGTH                 
SBSGR1BK DS    CL12                STATION GROUP LEVEL 1 BREAK NAME             
SBSGR1NM DS    CL24                STATION GROUP LEVEL 1 GROUP NAME             
SBSG1MSK DS    XL2                 STATION GROUP LEVEL 1 MASK                   
*                                                                               
SBSGR2   DS    CL5                 STATION GROUP LEVEL 2 CODE                   
SBSGR2LN DS    CL1                 STATION GROUP LEVEL 2 LENGTH (1+2)           
SBSGR2BK DS    CL12                STATION GROUP LEVEL 2 BREAK NAME             
SBSGR2NM DS    CL24                STATION GROUP LEVEL 2 GROUP NAME             
*                                                                               
SBDPTTAB DS    CL181               DAYPART TABLE                                
SBDPEQTB DS    CL16                DAYPART TRANSLATION TABLE                    
SBEQTAB  DS    CL120               EQUIVALENCE TABLE                            
SBAGYREC DS    CL150               AGENCY RECORD AREA                           
SBMKTREC DS    CL120               MARKET RECORD AREA                           
*                                                                               
SBBKOPT  DS    CL24                SPOTBOOK OPTIMIZATION AREA                   
SBMKNUM  DS    CL2                 RTG SRV MKT # FROM ALPHAMKT REC              
*                                                                               
SBAWIPW  DS    AL3                 A(PW EXTRACT AREA)                           
*                                                                               
SBCLTPW  DS    CL3                 PW PCT FROM CLT REC                          
*                                                                               
SBSVKEY  DS    XL13                SAVED KEY                                    
SBDAYS   DS    XL1                 DAYS ROTATION                                
*                                                                               
SBBKTYPE DS    XL1                 BOOK TYPE                                    
*                                                                               
SBSTAFSE DS    XL1                 ALTERNATE STATION FILE SE NUM                
*                                                                               
SBAPURVL DS    A                   A(PURCHASED DEMOS) FROM SPOTBUY              
SBSTACTY DS    CL24                STATION CITY                                 
*                                                                               
SBTALOPT DS    CL12                TALENT FACTOR OPTIMIZATION AREA              
SBATSATB DS    F                   TSAR RECORD BUFFER                           
SBEHOOK  DS    A                   HOOK FOR EST USER FIELDS                     
SBTADATE DS    XL2                 EFFECTIVE DATE FOR 2ND SET OF                
*                                  TALENT FACTORS                               
SBCMEDNM DS    CL12                CLIENT MEDIA NAME OVERRIDE                   
SBB1XPRF DS    CL16                CLIENT'S B1X PROFILE                         
*                                                                               
SBCBLMSO DS    CL15                CABLE SYSTEM MSO NAME                        
SBCBLIC  DS    CL20                CABLE SYSTEM INTERCONNECT NAME               
*                                                                               
SBUP1DES DS    CL20                PRODUCT USER FIELD DESCRIPTION 1             
SBUP2DES DS    CL20                PRODUCT USER FIELD DESCRIPTION 2             
SBUE1DES DS    CL20                ESTIMATE USER FIELD DESCRIPTION 1            
SBUE2DES DS    CL20                ESTIMATE USER FIELD DESCRIPTION 2            
SBUP1FLD DS    CL32                PRODUCT USER FIELD 1                         
SBUP2FLD DS    CL16                PRODUCT USER FIELD 2                         
SBUE1FLD DS    CL32                ESTIMATE USER FIELD 1                        
SBUE2FLD DS    CL16                ESTIMATE USER FIELD 2                        
*                                                                               
SBQADLST DS    CL9                 ADJACENY CODE LIST                           
SBSTANM  DS    CL24                STATION NAME                                 
SBMEDNMR DS    CL10                MEDIA R NAME                                 
SBMEDNMN DS    CL10                MEDIA N NAME                                 
SBMEDNMX DS    CL10                MEDIA X NAME                                 
*                                                                               
SBASTANT DS    XL3                 A(STABUFF ENTRY)                             
SBALKXTD DS    AL4                 A(SPDEMLK EXTENSION AREA)                    
*                                                                               
SBAFLTAB DS    AL4                 A(FLIGHT TABLE)                              
SBCPST   DS    XL10                CLIENT PST CODES (CPST)                      
SBQBOOK  DS    CL24                6 RATING BOOKS (YYMM OR C'ACT ')             
         DS    XL16                LEAVE THIS AS SPARE FOR MORE BOOKS!          
*                                                                               
SBBFORM  DS    0CL5                                                             
SBBFORMB DS    XL1                                                              
SBBFORMC DS    XL4                                                              
         DS    XL2                                                              
MONTAB   DS    A                   A(MONTH TABLE)                               
SBPXBILN DS    F                   PROGRAM EXCHANGE BILLED NET                  
SBEWDP   DS    CL1                 WEEKLY DATA FOR POSTS OVERRIDE OPT           
SBELKUPA DS    XL1                 LKUP=ALL OPTION                              
*                                                                               
SBERANGE DS    CL4                 START/END TIME RANGE FILTER                  
*                                                                               
SBAUTL   DS    CL4                 A(UTL) - ONLY IF ALTERNATE FILES             
*                                                                               
* ADDITIONAL READ SELECTOR SWITCHES                                             
SBQREAD2 DS    X                                                                
SBQRD2PW EQU   X'80'               READ PW MARKET RECS                          
SBQRD2NV EQU   X'40'               READ PASSIVE INVOICE RECS (MMAKER)           
SBQRD2BH EQU   X'20'               READ BILL HEADERS UP FRONT FOR TABLE         
SBQRD2CA EQU   X'10'               READ CASH APPLIED DATA FROM ACC              
SBQRD2BL EQU   X'08'               READ STATION BILLRECS BEFORE BUYS            
SBQRD2OM EQU   X'04'               READ DARE RECORDS                            
SBQRD2BP EQU   X'02'               READ BILLING PERCENTAGE RECS                 
*        EQU   X'01'               UNUSED                                       
*                                                                               
SBBUYCH  DS    X                                                                
SBBCCLT  EQU   X'80'               CLIENT HAS CHANGED                           
SBBCPRD  EQU   X'40'               PRODUCT HAS CHANGED                          
SBBCEST  EQU   X'20'               ESTIMATE HAS CHANGED                         
SBBCSTA  EQU   X'10'               STATION HAS CHANGED                          
*                                                                               
SBECDAT  DS    XL3                 CREATION DATE FILTER                         
*                                                                               
SBEFLAG2 DS    X                   MORE EXTRACT FLAGS                           
SBESRC   EQU   X'80'               FILTER BUYS FOR SRC COMMENTS                 
SBENOMIN EQU   X'40'               ERROR IF MAXNSPT EXCEEDED, AND               
*                                  SKIP 0B/0C IN TABLE IF IDENTICAL             
SBE1SPT  EQU   X'20'               BUILD CHUNKS FOR 1 SPOT ONLY                 
SBEORIG  EQU   X'10'               READ ORIGINAL BUYS (MEDIA = 8)               
SBEBOOK  EQU   X'08'               HAVE SPOTBUY RETURN BOOK                     
SBEWTP   EQU   X'04'               PASS WEEKLY OPTION TO GETDEM                 
SBESPLBY EQU   X'02'               SPLIT BUYS EVERY 1500 BYTES                  
SBEPETAB EQU   X'01'               DON'T REBUILD PRD/EST TAB                    
*                                                                               
SBB1PROF DS    CL16                CLIENT'S B1 PROFILE                          
*                                                                               
SBACHNKX DS    A                   A(END OF CHUNK AREA)                         
SBGETBRD DS    A                                                                
*                                                                               
SBTALF10 DS    F                   TALENT FACTOR 1/GRP 0                        
         DS    F                                                                
SBTALF11 DS    F                                                                
         DS    F                                                                
SBTALF12 DS    F                                                                
         DS    F                                                                
SBTALF13 DS    F                                                                
         DS    F                                                                
SBTALF20 DS    F                   TALENT FACTOR 2/GRP 0                        
         DS    F                                                                
SBTALF21 DS    F                                                                
         DS    F                                                                
SBTALF22 DS    F                                                                
         DS    F                                                                
SBTALF23 DS    F                                                                
         DS    F                                                                
SBTALFX  EQU   *                                                                
*                                                                               
SBTWAACS DS    CL4                 ACCESS LIMIT                                 
*                                                                               
SBAMKEST DS    A                   A(MKT-EST TABLE)                             
*                                                                               
SBEPROG  DS    CL19                FIRST BYTE=COMPARE LENGTH                    
*                                                                               
SBCMPST  DS    CL2                 CLIENT MAIN PST                              
*                                                                               
SBESTDM2 DS    CL6                 ESTIMATE TARGET3/TARGET4 DEMOS               
*                                                                               
         DS    CL4                 SPARE                                        
*                                                                               
SBEFLAG3 DS    CL1                 EXTRACT FLAG 3                               
SBE3TRD  EQU   X'80'               TRADE OPTION (WESTERN)                       
SBE3NTRD EQU   X'40'               SUPPRESS TRADE OPTION (WESTERN)              
SBE3XBON EQU   X'20'               BONUS FILTER (ON=EXCLUDE)                    
SBE3STYP EQU   X'10'               -S TYPE FILTER (ON=ONLY S TYPE)              
SBE3PBDM EQU   X'08'               ONLY BUYS WITH POST BUY DEMOS                
SBE3MS   EQU   X'04'               EXTRACT MSTREET DATA                         
SBE3M0DL EQU   X'02'               EXTRACT DOLLARS FOR CANADA NWK MKT0          
SBE3BCOM EQU   X'01'               READ BCOM RECORDS AT CLT LEVEL               
*                                                                               
SBACONT  DS    A                   A(BUY CONTINUATION)                          
*                                                                               
SBSQDBFA DS    A                   A(SQAD CPP BUFFER)                           
SBSQDQT1 DS    XL2                 SQAD QUARTER-1 YQ - BINARY                   
SBSQDRL1 DS    XL2                 SQAD RELEASE-1 YM - BINARY                   
SBSQDOPL EQU   *-SBSQDQT1          LENGTH OF SQAD OPTION                        
SBSQDQT2 DS    XL2                 SQAD QUARTER-2 YQ - BINARY                   
SBSQDRL2 DS    XL2                 SQAD RELEASE-2 YM - BINARY                   
SBSQDOPT DS    XL1                 SQAD OPTION NUMBER - 0,2,3,4                 
*                                                                               
SBCACCES DS    CL3                 CLIENT LIMIT ACCESS                          
*                                                                               
SBACSHRC DS    A                   A(DDCASHIER CONTROL BLOCK)                   
SBACASHR DS    A                   A(DDCASHIER)                                 
SBUSERID DS    CL2                 TWO BYTE USERID                              
SBC2FACT DS    XL4                 CLIENT COST2 FACTOR                          
*                                                                               
SBILGRSP DS    PL6                 EFFECTIVE GROSS BILLED (PL6)                 
SBILNETP DS    PL6                 EFFECTIVE NET BILLED   (PL6)                 
SBBCNTWK DS    XL3                 CANADIAN NETWORK                             
SBSQDQT3 DS    XL2                 SQAD QUARTER-3 YQ - BINARY                   
SBSQDRL3 DS    XL2                 SQAD RELEASE-3 YM - BINARY                   
SBSQDQT4 DS    XL2                 SQAD QUARTER-4 YQ - BINARY                   
SBSQDRL4 DS    XL2                 SQAD RELEASE-4 YM - BINARY                   
         DS    CL4                 SPARE                                        
*                                                                               
SBEFLAG4 DS    CL1                 EXTRACT FLAG 4                               
SBEADID  EQU   X'80'               HAVE AD-ID KEYWORD                           
SBECOMM  EQU   X'40'               HAVE COMMERCIAL KEYWORD                      
SBE42DEC EQU   X'20'               2 DECIMAL DEMO PRECISION                     
SBE4GSTA EQU   X'10'               FORCE FULL GETSTA READ                       
SBE4VOID EQU   X'08'               SUPPRESS VOID CHECKS                         
SBE4EFLD EQU   X'04'               GET ESTIMATE USER FIELDS                     
SBE4YLOK EQU   X'02'               ONLY REPORT LOCKED ESTIMATES                 
SBE4NLOK EQU   X'01'               ONLY REPORT UNLOCKED ESTIMATES               
*                                                                               
LPMOPT   DS    CL1                 FLAG TO SUPRESS LPM DATE ON MKT REC          
SBSYSCD  DS    CL2                 SYSCODE FOR FUSION CALLS                     
LPMWEEK  DS    CL1                 FLAG TO SUPRESS WEEKLY POSTING               
LPMOV    DS    CL1                 FLAG TO SUPRESS OVERNIGHT POSTING            
ACTIVDAT DS    CL3                 ACTIVITY DATE FILTER                         
CBLFLAG  DS    XL1                 CABLE FLAG TO OVERRIDE THE 00A PROF          
CFFUS    EQU   X'80'               OVERRIDE TO FUSION                           
CFNLS    EQU   X'40'               OVERRIDE TO NIELSON                          
CFNONE   EQU   X'20'               OVERRIDE TO NO CABLE                         
CFLPM    EQU   X'10'               OVERRIDE TO NO CABLE EXCEPT FOR LPM          
*        EQU   X'08'                                                            
*        EQU   X'04'                                                            
*        EQU   X'02'                                                            
*        EQU   X'01'                                                            
SBCANALF DS    CL3                 ALPHA OVERRIDE FOR CANADIAN SOFT DEM         
SBBYOVRD DS    0CL8                DEMO OVERRIDES                               
SBBYORTG DS    CL1                 RTG SVC OVERRIDE C'0'=NSI, C'1'=BBM          
SBBYOALF DS    CL3                 ALPHA MARKET OVERRIDE                        
SBBYOSTA DS    CL4                 STA OVERRIDE                                 
         DS    CL6                 SPARE                                        
         SPACE 1                                                                
SBLOCKX  EQU   *                                                                
         EJECT                                                                  
PRDBUFFD DSECT                     ** PRODUCT BUFFER DSECT **                   
PBSEQ    DS    XL1                 SEQUENCE NUMBER IN CLIST (1 BASED)           
PBBCODE  DS    XL1                 BINARY CODE                                  
PBALPH   DS    CL3                 3-BYTE ALPHA CODE                            
PBGROUP  DS    XL2                 PRODUCT GROUP                                
PBNAME   DS    CL20                PRODUCT NAME                                 
PBINT    DS    CL4                 PRODUCT INTERFACE CODE                       
PBBILFOR DS    0CL5                BILL FORMULA                                 
PBBILBAS DS    X                   BILL BASE                                    
PBBILCOM DS    XL4                 SIGNED COMMISSION PCT                        
PBGSTCD  DS    CL1                 CANADIAN GST CODE                            
PBUFLD1  DS    CL32                USER FIELD 1                                 
PBUFLD2  DS    CL16                USER FIELD 2                                 
         ORG   PBUFLD2+10                                                       
PBUFMPST DS    CL2                 MAIN PST FOR PRODUCT                         
         ORG                                                                    
PRDBUFFL EQU   *-PRDBUFFD                                                       
         SPACE 2                                                                
*                                                                               
* BE CAREFUL WHEN PUTTING THINGS IN THE EST BUFFER.  IDENTICAL ENTRIES          
* ARE SHARED BY MULTIPLE ESTS, AND THERE IS A MAX OF 255 ENTRIES.               
* THE NAMEPOOL IS A BETTER PLACE IF THEY ARE LIKELY TO BE DIFFERENT             
* FROM ESTIMATE TO ESTIMATE                                                     
*                                                                               
         SPACE 2                                                                
ESTBUFFD DSECT                     ** ESTIMATE BUFFER DSECT **                  
EBDPTMEN DS    C                   DAYPART MENU                                 
EBDEMOS  DS    XL(8*3)             8 X 3-BYTE DEMO CODES                        
EBWGTLST DS    CL8                 WEIGHTED DEMO LIST                           
EBUSER1  DS    X                   INDEX INTO USER NAME BUFFER                  
EBUSER2  DS    X                                                                
EBUSER3  DS    X                                                                
EBUSER4  DS    X                                                                
EBSVI    DS    X                   SVI ADJUSTMENT MONTH (0=AUTO ADJUST)         
EBBILFOR DS    0CL5                BILL FORMULA                                 
EBBILBAS DS    X                   BILL BASE                                    
EBBILCOM DS    XL4                 SIGNED COMMISSION PCT                        
EBFILT   DS    CL3                 ESTIMATE FILTERS                             
EBSREP   DS    XL2                 SPECIAL REP                                  
EBRTLSCH DS    XL2                 RETAIL SCHEME CODE                           
EBUFLD1  DS    CL32                USER FIELD 1                                 
EBUFLD2  DS    CL16                USER FIELD 2                                 
EBUFPCT  DS    XL3                 WESTERN PW PCT                               
ECOS2    DS    XL4                 COST2 FACTOR                                 
ESTBUFFL EQU   *-ESTBUFFD                                                       
         EJECT                                                                  
MWTABD   DSECT                     ** MARKET WEIGHT TABLE DSECT **              
MWTDEM   DS    CL3                 PRIMARY DEMO 00/C'U'/XX                      
MWTSVC   DS    CL1                 RATING SERVICE (0=NSI,1=ARB)                 
MWTUSPOP DS    XL4                 US POPULATION                                
MWTMKENT DS    0CL6                MARKET ENTRY                                 
MWTMKT   DS    XL2                 RATING SERVIVE MARKET NUMBER                 
MWTMKUNV DS    XL4                 MARKET UNIVERSE                              
MWTMKWGT EQU   X'80'               MWTMKUNV+1(3) = MARKET WEIGHT                
         DS    (MWTNMKT-1)CL(L'MWTMKENT)                                        
MWTABL   EQU   *-MWTABD                                                         
*                                                                               
MWTENTS  EQU   10                  MAX ENTRIES IN MARKET WEIGHT TABLE           
MWTNMKT  EQU   230                 MAX MARKETS IN EACH ENTRY                    
         SPACE 2                                                                
STABUFFD DSECT                     ** STATION BUFFER DSECT **                   
STBAFFIL DS    CL3                 AFFILIATE                                    
STBCHAN  DS    CL4                 CHANNEL                                      
STBREP   DS    CL3                 REP                                          
STBTYPE  DS    CL1                 TYPE                                         
STBPREP  DS    CL3                 PAYING REP                                   
STBGRP   DS    XL2                 STATION GROUP                                
STBSIZE  DS    CL1                 STATION SIZE                                 
STBSTATE DS    CL3                 STATION STATE                                
STBFORM  DS    CL4                 STATION FORMAT                               
STBFAX   DS    CL12                STATION FAX                                  
STBGRPCD DS    CL15                CABLE GROUP CODE                             
         ORG   STBGRPCD            REDEFINED FOR CANADA                         
STBGST   DS    CL1                 - GST FLAG                                   
STBPST   DS    CL10                - PST FLAGS                                  
STBNTYPE DS    CL1                 - NETWORK TYPE                               
         ORG   STBGRPCD+L'STBGRPCD                                              
STBMALPH DS    CL3                 ALPHA MARKET                                 
STBMKT   DS    XL2                 STATION MARKET                               
STBIGZIP DS    CL10                ZIP+4 CODE                                   
STBNTI   DS    CL4                 NTI STATION CODE                             
STBCALL1 DS    CL4                 RTG SVC 1 CALL LETTERS - NSI(0)              
STBCALL2 DS    CL4                 RTG SVC 2 CALL LETTERS - BBM/ARB(1)          
STABUFFL EQU   *-STABUFFD                                                       
*                                                                               
STBELEM  DS    XL1                 ELEMENT IN STA BUFF                          
STBELMLN DS    XL1                 ELEMENT LENGTH                               
STBDATA  DS    0C                  ELEMENT DATA                                 
*                                                                               
STBNAME  EQU   STBDATA             STATION NAME                                 
SNAME    EQU   X'01'               ELEMENT ID                                   
S1       EQU   26                  MAX LENGTH OF ELEMENT                        
*                                                                               
STBADDR  EQU   STBDATA             STATION ADDRESS                              
SADDR    EQU   X'02'               ELEMENT ID                                   
S2       EQU   26                  MAX LENGTH OF ELEMENT                        
*                                                                               
STBCITY  EQU   STBDATA             STATION CITY                                 
SCITY    EQU   X'03'               ELEMENT ID                                   
S3       EQU   26                  MAX LENGTH OF ELEMENT                        
*                                                                               
STBFRMAT EQU   STBDATA             MSTREET FORMAT DESCRIPTION                   
SFRMAT   EQU   X'04'               ELEMENT ID                                   
S4       EQU   27                  MAX LENGTH OF ELEMENT                        
*                                                                               
STBPRENT EQU   STBDATA             MS MED CONGLOMERATE THAT OWNS STA            
SPRENT   EQU   X'05'               ELEMENT ID                                   
S5       EQU   27                  MAX LENGTH OF ELEMENT                        
*                                                                               
STBOWNER EQU   STBDATA             MS LOWEST LEVEL OWNER OF ENTITY              
SOWNR    EQU   X'06'               ELEMENT ID                                   
S6       EQU   38                  MAX LENGTH OF ELEMENT                        
*                                                                               
         ORG   STBDATA                                                          
S07ELEM  EQU   X'07'               X'07' ELEMENT                                
STBFREQ  DS    CL5                 MS ASSIGNED DIAL POSITION                    
STBMSTA  DS    CL2                 MS STATE OF THE STATION                      
STBMOWN  DS    CL1                 MS MINORITY OWNERSHIP                        
STBUID   DS    CL6                 MS UNIQUE ID                                 
STBMOWNF DS    CL1                 MINORITY OWNERSHIP IS FEMALE?                
STBFCCM  DS    CL1                 QUALIFIED FCC MINORITY                       
*                                  A=ASIAN,B=BLACK,H=HISPANIC,                  
*                                  N=NATIVEAMERICAN,P=PACIFICISLANDER           
STBFCCMF DS    CL1                 FCC MINORITY OWNERSHIP IS FEMALE?            
S7       EQU   19                  ELEMENT LENGTH                               
         ORG                                                                    
*                                                                               
STBADD1  EQU   STBDATA             MSTREET ADDRESS 1                            
STADD1   EQU   X'08'               ELEMENT ID                                   
SMADD1   EQU   X'09'               ELEMENT ID                                   
S8       EQU   57                  MAX LENGTH OF ELEMENT                        
S9       EQU   57                  MAX LENGTH OF ELEMENT                        
*                                                                               
STBADD2  EQU   STBDATA             MSTREET ADDRESS 2                            
STADD2   EQU   X'0A'               ELEMENT ID                                   
SMADD2   EQU   X'0B'               ELEMENT ID                                   
SA       EQU   52                  MAX LENGTH OF ELEMENT                        
SB       EQU   52                  MAX LENGTH OF ELEMENT                        
*                                                                               
STBMCITY EQU   STBDATA             MSTREET ADDRESS CITY                         
STCITY   EQU   X'0C'               ELEMENT ID                                   
SMCITY   EQU   X'0D'               ELEMENT ID                                   
SC       EQU   32                  MAX LENGTH OF ELEMENT                        
SD       EQU   32                  MAX LENGTH OF ELEMENT                        
*                                                                               
         ORG   STBDATA                                                          
STADD3   EQU   X'0E'               ELEMENT ID                                   
SMADD3   EQU   X'0F'               ELEMENT ID                                   
SMSTATE  DS    CL2                 STATE                                        
SMZIP    DS    CL10                ZIP                                          
SMCTRY   DS    CL3                 COUNTRY                                      
SE       EQU   17                  MAX LENGTH OF ELEMENT                        
SF       EQU   17                  MAX LENGTH OF ELEMENT                        
*                                                                               
SPARNT   EQU   STBDATA             PARENT PLUS FLAG FOR COMSCORE                
SPARENTP EQU   X'10'               ELEMENT ID                                   
S10      EQU   3                   MAX LENGTH OF ELEMENT                        
*                                                                               
SBUFELM  EQU   S1+S2+S3+S4+S5+S6+S7+S8+S9+SA+SB+SC+SD+SE+SF+S10                 
SBUFMAX  EQU   STABUFFL+SBUFELM                                                 
*                                                                               
         SPACE 2                                                                
CBLBUFFD DSECT                     ** CABLE BUFFER DSECT **                     
CBSYS    DS    CL4                 CABLE SYSTEM                                 
CBMSONM  DS    CL15                MSO NAME                                     
CBICNM   DS    CL20                INTERCONNECT NAME                            
CBLBUFFL EQU   *-CBLBUFFD                                                       
         SPACE 2                                                                
CMLTABD  DSECT                     ** COMMERCIAL TABLE DSECT **                 
CTCLT    DS    XL2                 CLIENT                                       
CTSEQ    DS    XL2                 SEQUENCE CODE                                
CTCODE   DS    CL12                CODE                                         
CTNAME   DS    CL15                NAME                                         
CTNAME2  DS    CL15                NAME2                                        
CTNAME3  DS    CL15                NAME3                                        
CTCLASS  DS    CL4                 CLASS                                        
CTNUM    DS    CL20                                                             
CTCLSPLT DS    CL16                4 CLASSES FOR HD CLASS SPLIT                 
CTCLNUM  DS    X                   NUMBER OF CLASSES IN SPLIT                   
CTBASCD  DS    CL16                BASIC CODE (SAG/AFTRA)                       
CMLTABL  EQU   *-CMLTABD                                                        
         SPACE 2                                                                
CHKTABD  DSECT                     ** CHECK TABLE DSECT **                      
CHSTA    DS    CL3                 STATION                                      
CHCLDT   DS    XL2                 CLEARANCE DATE                               
CHCLSEQ  DS    XL1                 CLEARANCE SEQUENCE NUMBER                    
CHCHKNUM DS    CL6                 CHECK NUMBER                                 
CHCHKDT  DS    XL2                 CHECK DATE                                   
CHSTATUS DS    XL1                 STATUS (X'80'=RECONCILED)                    
CHPDREP  DS    CL4                 PAID REP                                     
CHBNKDT  DS    XL2                 BANK CLEARANCE DATE                          
CHDISKA  DS    XL4                 CLEARANCE STATUS RECORD D/A                  
CHKTABL  EQU   *-CHKTABD                                                        
         SPACE 2                                                                
BPCTTABD DSECT                                                                  
BPCTAM   DS    XL1                 A/M                                          
BPCTCLT  DS    XL2                 CLIENT                                       
BPCTPRD  DS    XL1                 PRD                                          
BPCTEST  DS    XL1                 EST                                          
BPCTMON  DS    XL2                                                              
BPCTPCT  DS    XL2                 PERCENTAGE                                   
BPCTTABL EQU   *-BPCTTABD                                                       
         SPACE 2                                                                
XSPILLD  DSECT                     ** CANADIAN SPILL TABLE DSECT **             
XSBMSTA  DS    0XL5                PACKED MARKET/STATION                        
XSBMKT   DS    XL2                                                              
XSBSTA   DS    XL3                                                              
XSSTA    DS    CL5                 STATION                                      
XSMKTS   DS    (XSNMKTS)XL28       CANADIAN SPILL MARKETS (AGY/RTG SVC,         
XSPILLL  EQU   *-XSPILLD                                   MKTNAME)             
XSNMKTS  EQU   6                   MAX N'SPILL MARKETS PER STATION              
XSNSTA   EQU   100                 MAX N'STATIONS                               
         SPACE 2                                                                
*                                                                               
INFTABD  DSECT                     ** INFOMERCIAL TABLE DSECT **                
INFMKT   DS    CL2                 MARKET                                       
INFSTA   DS    CL3                 STATION                                      
INFCPOS  DS    6XL4                COST PER ORDER                               
INFRATE  DS    6XL4                RATE                                         
INFCOST  DS    6XL4                BREAK EVEN COST                              
INFMISC  DS    2XL4                TARGET ORDER & BUDGET                        
INFPRCE  DS    6XL4                PRICES                                       
INFFLAG  DS    X                   X'FF' = USED IN BUY                          
INFTABL  EQU   *-INFTABD                                                        
         EJECT                                                                  
*        DSECT TO COVER SPOT EXTRACT CHUNKS                                     
*                                                                               
SCHUNKD  DSECT                                                                  
SCNEXT   DS    A                   A(NEXT CHUNK ENTRY) OR A(0)=EOT              
*                                                                               
SCKEY    DS    0CL20               KEY FIELDS                                   
SCPRD1   DS    X                                                                
SCPRD2   DS    X                                                                
SCSLN1   DS    X                                                                
SCSLN2   DS    X                                                                
         DS    XL1                 SPARE                                        
SCML1    DS    XL2                                                              
         DS    XL1                 SPARE                                        
SCML2    DS    XL2                                                              
         DS    XL1                 SPARE                                        
         ORG   SCML1-1                                                          
SCCHKIND DS    XL1                 CLEARANCE CHECK INDICATOR                    
SCCHKREC EQU   X'80'               CHECK RECONCILED                             
SCCHKNUM DS    CL6                 CLEARANCE CHECK NUMBER                       
         ORG                                                                    
SCDATE   DS    XL2                                                              
SCADATE  DS    XL2                 AFFIDAVIT DATE                               
SCATIME  DS    XL2                 AFFIDAVIT TIME                               
SCRSVPDP DS    XL1                 RSVP DAYPART                                 
SCCHKDT  DS    XL2                 CLEARANCE CHECK DATE                         
*                                                                               
SCDATA   DS    0F                  DATA FIELDS                                  
SCSPOTS  DS    F                   SPOTS                                        
SCGROSS  DS    F                   GROSS DOLLARS                                
SCEGROSS DS    F                   GROSS EQUIV DOLLARS                          
SCNET    DS    F                   NET                                          
SCCOM    DS    F                   COMMISSION                                   
SCTAX    DS    F                   TAX                                          
SCEFFCST DS    F                   EFFECTIVE COST                               
SCORDX   EQU   *                   END OF ORDERED DATA                          
*                                                                               
SCPAY    DS    F                   GROSS PAID                                   
SCPAYT   DS    F                   GROSS PAID TODAY                             
SCUNP    DS    F                   GROSS UNPAID                                 
SCPAYN   DS    F                   NET PAID                                     
SCPAYTN  DS    F                   NET PAID TODAY                               
SCUNPN   DS    F                   NET UNPAID                                   
SCPAYSP  DS    F                   PAID SPOT COUNT                              
SCPAYTX  DS    F                   PAID TAX AMOUNT                              
SCUNPTX  DS    F                   UNPAID TAX AMOUNT                            
SCPAYX   EQU   *                   END OF PAID DATA                             
*                                                                               
*                                  CHILD SPOT DATA                              
SCCSPAY  DS    F                   PAY DOLLARS                                  
SCCSNTP  DS    F                   NTP DOLLARS                                  
SCCSPSP  DS    F                   PAY SPOTS                                    
SCCSNSP  DS    F                   NTP SPOTS                                    
SCCSTIM  DS    F                   TIME DOLLARS                                 
SCCSTAL  DS    F                   TALENT DOLLARS                               
SCCSTPT  DS    F                   TIME + TALENT DOLLARS                        
SCCSX    EQU   *                   END OF CHILD SPOT DATA                       
*                                                                               
         ORG   SCCSPAY                                                          
SCPDREP  DS    CL4                 PAID REP (FROM CLRST REC)                    
SCBNKDT  DS    XL2                 BANK CLEARANCE DATE                          
SCPAYP   DS    PL6                 GROSS PAID PACKED                            
SCPAYNP  DS    PL6                 NET   PAID PACKED                            
         DS    XL2                 SPARE                                        
SCPAYTL  DS    F                   ORIGINAL TOTAL PAID GROSS                    
SCPAYTLN DS    F                   ORIGINAL TOTAL PAID NET                      
*                                                                               
         ORG   SCCSPAY                                                          
SCACTBK  DS    XL2                 BOOK                                         
SCBKTYP  DS    C                   BOK TYPE                                     
SCSQDOPT DS    X                   SQAD OPTION NUMBER                           
*                                                                               
         ORG   SCCSPAY                                                          
SCRSVPS  DS    F                   N'RESPONSES                                  
SCRSVPX  EQU   *                   END OF RSVP DATA                             
         ORG   SCCSPAY                                                          
SCGROSS2 DS    F                   SECOND GROSS COST                            
SCNET2   DS    F                   SECOND NET COST                              
SCNETPXG DS    F                   PROGRAM EXCHANGE NET                         
         ORG   SCNETPXG                                                         
SCGSTOC2 DS    F                   OUTPUT COST2 GST                             
         ORG   SCCSPAY                                                          
SCPWGRS  DS    F                   GROSS PW COST                                
SCPWNET  DS    F                   NET PW COST                                  
         DS    F                   SPARE                                        
SCPWCLTX DS    F                   PW CLT TAX                                   
SCPWCTXN DS    F                   PW CLT NET TAX                               
SCPWX    EQU   *                   END OF WESTERN PW DATA                       
         ORG   SCCSNSP             REDEFINE END OF CHILD SPOT DATA FOR          
SCPSTI   DS    F                   INPUT PST ON GROSS                           
SCPSTP   DS    F                   INPUT PST ON PAID                            
SCPSTU   DS    F                   INPUT PST ON UNPAID                          
SCPSTO   DS    F                   OUTPUT PST                                   
SCPSTX   EQU   *                                                                
         ORG                                                                    
SCGSTI   DS    F                   INPUT GST ON GROSS                           
SCGSTP   DS    F                   INPUT GST ON PAID                            
SCGSTU   DS    F                   INPUT GST ON UNPAID                          
SCGSTO   DS    F                   OUTPUT GST                                   
SCGSTX   EQU   *                                                                
*                                                                               
SCCLDISK DS    F                   CLEARANCE D/A                                
*                                                                               
SCDBFACT DS    F                   CUMULATIVE WEIGHTING FACTOR                  
         ORG   SCDBFACT                                                         
SCPSTOC2 DS    F                   OUTPUT COST2 PST                             
         ORG                                                                    
SCDEMOS  DS    0XL8                DEMO / EQDEMO                                
         EJECT                                                                  
* DSECT TO COVER GOAL EXTRACT CHUNKS                                            
*                                                                               
SGLCHNKD DSECT                                                                  
SGNEXT   DS    A                   A(NEXT CHUNK ENTRY) OR A(0)=EOT              
*                                                                               
SGKEY    DS    0CL8                KEY FIELDS                                   
SGDPT    DS    X                   DAYPART                                      
SGPRD1   DS    X                   PRODUCT 1                                    
SGPRD2   DS    X                   PRODUCT 2                                    
SGSLNT   DS    X                   SPOT LENGTH TOTAL                            
SGSLN1   DS    X                   SPOT LENGTH 1                                
SGSLN2   DS    X                   SPOT LENGTH 2                                
SGDATE   DS    XL2                 DATE                                         
*                                                                               
SGDATA   DS    0XL16               GOAL DATA FIELDS                             
SGDOL    DS    F                   DOLLARS                                      
SGEDOL   DS    F                   EQUIV DOLLARS                                
SGDEM    DS    F                   DEMO                                         
SGEDEM   DS    F                   EQUIV DEMO                                   
*                                                                               
SGLDATA  DS    0F                  LOCK-IN DATA FIELDS                          
SGLDOL   DS    F                   DOLLARS                                      
SGLEDOL  DS    F                   EQUIV DOLLARS                                
SGLSPTS  DS    F                   SPOTS                                        
SGLDEM   DS    F                   DEMO                                         
SGLEDEM  DS    F                   EQUIV DEMO                                   
*                                                                               
SGKDATA  DS    0XL16               GOAL LOCKIN DATA FIELDS (X'A1' ELEM)         
SGKDOL   DS    F                   LOCKIN DOLLARS                               
SGKEDOL  DS    F                   LOCKIN EQUIV DOLLARS                         
SGKDEM   DS    F                   LOCKIN DEMO                                  
SGKEDEM  DS    F                   LOCKIN EQUIV DEMO                            
*                                                                               
SGKGOLDT DS    XL2                 DATE OF LAST GOAL DATA LOCKIN                
SGKBUYDT DS    XL2                 DATE OF LAST BUY DATA LOCKIN                 
*                                                                               
SGLCHNKL EQU   *-SGLCHNKD          LENGTH OF CHUNK                              
*                                                                               
SGLPWDOL DS    F                   GROSS PW COST                                
SGLPWCTX DS    F                   CLIENT GOAL TAX                              
SGLPWATX DS    F                   AGENCY GOAL TAX                              
SGLPWL   EQU   *-SGLCHNKD          LENGTH OF CHUNK W/PW DATA                    
         EJECT                                                                  
* DSECT TO COVER STATION LOCKIN EXTRACT CHUNKS                                  
*                                                                               
SSLCHNKD DSECT                                                                  
SLNEXT   DS    A                   A(NEXT CHUNK ENTRY) OR A(0)=EOT              
*                                                                               
SLKEY    DS    0CL7                KEY FIELDS                                   
SLPRD1   DS    X                   PRODUCT 1                                    
SLPRD2   DS    X                   PRODUCT 2                                    
SLSLNT   DS    X                   SPOT LENGTH TOTAL                            
SLSLN1   DS    X                   SPOT LENGTH 1                                
SLSLN2   DS    X                   SPOT LENGTH 2                                
SLDATE   DS    XL2                 DATE                                         
*                                                                               
SLDATA   DS    0X                  LOCKIN DATA FIELDS                           
SLDOL    DS    F                   DOLLARS                                      
SLEDOL   DS    F                   EQUIV DOLLARS                                
SLNET    DS    F                   NET DOLLARS                                  
SLDOL2   DS    F                   COS2 DOLLARS                                 
SLNET2   DS    F                   NET COS2 DOLLARS                             
SLSPOTS  DS    F                   SPOTS                                        
SLDEMOS  DS    0XL8                DEMO / EQDEMO                                
         EJECT                                                                  
* DSECT TO COVER WI PW DATA EXTRACT                                             
*                                                                               
SBWIPWD  DSECT                                                                  
SBPWTAX  DS    XL2                 PW TAX RT                                    
SBPWWK   DS    14XL6               DATA FROM X'05' WEEK ELEMS                   
SBWIPWL  EQU   *-SBWIPWD                                                        
*                                                                               
