*          DATA SET SPOTSES    AT LEVEL 020 AS OF 09/13/12                      
*                                  TABLE OF SPOT                                
*                                  FILE NUMS AND SE'S                           
SPOTSES  DS    0X                                                               
         DC    C'0',X'FA'                                                       
         DC    C'1',X'02'                                                       
         DC    C'2',X'03'                                                       
         DC    C'3',X'07'                                                       
         DC    C'4',X'0D'                                                       
         DC    C'5',X'11'                                                       
         DC    C'6',X'15'                                                       
         DC    C'7',X'22'                                                       
         DC    C'8',X'23'                                                       
         DC    C'9',X'25'                                                       
         DC    C'A',X'26'                                                       
         DC    C'B',X'27'                                                       
         DC    C'C',X'28'                                                       
         DC    C'E',X'E2'                                                       
         DC    C'F',X'F2'                                                       
         DC    C'G',X'F3'                                                       
         DC    C'H',X'F4'                                                       
         DC    C'I',X'A0'  SPOTIT                                               
         DC    C'I',X'A1'  NETIN                                                
         DC    C'J',X'29'                                                       
         DC    C'K',X'2A'                                                       
         DC    C'L',X'F5'                                                       
         DC    C'M',X'F6'                                                       
         DC    C'N',X'F7'                                                       
         DC    C'P',X'D2'                                                       
         DC    C'Q',X'32'                                                       
         DC    C'R',X'D9'                                                       
         DC    C'S',X'33'                                                       
         DC    C'T',X'2E'                                                       
         DC    C'U',X'36'                                                       
         DC    C'V',X'F8'                                                       
         DC    C'W',X'2B'                                                       
         DC    C'Y',X'F9'                                                       
         DC    C'Z',X'C2'                                                       
         DC    XL2'00'                                                          
