*          DATA SET SPPAYFFD   AT LEVEL 010 AS OF 08/25/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T213FFD      DATE 08/25/06                 
         SPACE 1                                                                
T213FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PAYMSGH  DS    XL8                                                              
PAYMSG   DS    CL60     1    2   60  A  P N             T        Y              
PAYSERVH DS    XL8                                                              
PAYSERV  DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      3    2    8  A  P N             T        Y              
PAYERH   DS    XL8                                                              
PAYER    DS    CL12     3   11   12  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      3   45    7  A  P N             T        Y              
PAYOPH   DS    XL8                                                              
PAYOP    DS    CL26     3   53   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      4    2    8  A  P N             T        Y              
PAYMDH   DS    XL8                                                              
PAYMD    DS    CL12     4   11   12  A  U N             T        Y              
PAYPADRH DS    XL8                                                              
PAYPADR  DS    CL55     4   25   55  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P N             T        Y              
PAYCLH   DS    XL8                                                              
PAYCL    DS    CL12     5   11   12  A  U N             T        Y              
PAYCLXPH DS    XL8                                                              
PAYCLXP  DS    CL20     5   25   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
PAYPRH   DS    XL8                                                              
PAYPR    DS    CL12     6   11   12  A  U N             T        Y              
PAYPRXPH DS    XL8                                                              
PAYPRXP  DS    CL40     6   25   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
PAYSTH   DS    XL8                                                              
PAYST    DS    CL12     7   11   12  A  U N             T        Y              
PAYSTXPH DS    XL8                                                              
PAYSTXP  DS    CL55     7   25   55  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
PAYEEH   DS    XL8                                                              
PAYEE    DS    CL12     8   11   12  A  U N             T        Y              
PAYEEXPH DS    XL8                                                              
PAYEEXP  DS    CL55     8   25   55  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
PAYDTH   DS    XL8                                                              
PAYDT    DS    CL17     9   11   17  A  U N             T        Y              
PAYDTXPH DS    XL8                                                              
PAYDTXP  DS    CL20     9   32   20  A  P N             T        Y              
PAYHLH   DS    XL8                                                              
PAYHL    DS    CL28    10    3   28  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   52   12  A  P N             T        Y              
PAYINV1H DS    XL8                                                              
PAYINV1  DS    CL11    11    3   11  A  U N             T        Y              
PAYAMT1H DS    XL8                                                              
PAYAMT1  DS    CL13    11   19   13  A  U N             T        Y              
PAYCMT1H DS    XL8                                                              
PAYCMT1  DS    CL40    11   36   40  A  U N             T        Y              
PAYINV2H DS    XL8                                                              
PAYINV2  DS    CL11    12    3   11  A  U N             T        Y              
PAYAMT2H DS    XL8                                                              
PAYAMT2  DS    CL13    12   19   13  A  U N             T        Y              
PAYCMT2H DS    XL8                                                              
PAYCMT2  DS    CL40    12   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    13   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    14   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    15   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    16   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    17   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    18   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    19   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    20   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    21   36   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22    3   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   19   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    22   36   40  A  U N             T        Y              
PAYINVXH DS    XL8                                                              
PAYINVX  DS    CL11    23    3   11  A  U N             T        Y              
PAYAMTXH DS    XL8                                                              
PAYAMTX  DS    CL13    23   19   13  A  U N             T        Y              
PAYCMTXH DS    XL8                                                              
PAYCMTX  DS    CL40    23   36   40  A  U N             T        Y              
PAYLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
PAYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1960 BYTES                            
