*          DATA SET SPPAY00MSG AT LEVEL 003 AS OF 10/29/02                      
ENTERINV BASR  R1,RE                                                            
         DC    CL60'Please check payee and enter invoices, amounts, andx        
                comments'                                                       
VERAMTS  BASR  R1,RE                                                            
         DC    CL34'Please verify invoices and amounts'                         
DISCMSG  BASR  R1,RE                                                            
         DC    CL49'Totals do not agree. Discrepancy report requested'          
TOTSDSPL BASR  R1,RE                                                            
         DC    CL20'Totals displayed'                                           
