*          DATA SET SPRES95WRK AT LEVEL 028 AS OF 01/26/90                      
         SPACE 1                                                                
* EQUATES FOR PROGRAM PROFILE OPTIONS *                                         
         SPACE 1                                                                
PPROF1   EQU   PROGPROF+0          N=NEWSID,ELSE SID                            
         SPACE 1                                                                
* EQUATES FOR DETAIL SPECS *                                                    
         SPACE 1                                                                
DTLEQSTA EQU   1                   STATION                                      
DTLEQBK  EQU   3                   BOOK                                         
DTLEQWKS EQU   4                   WEEKS                                        
DTLEQMON EQU   5                   MONTH                                        
DTLEQQTR EQU   6                   QUARTER                                      
DTLEQYR  EQU   7                   YEAR                                         
DTLEQPRG EQU   8                   PROGRAM                                      
DTLEQDAY EQU   9                   DAY                                          
DTLEQTIM EQU   10                  TIME                                         
DTLEQRNK EQU   12                  RANK                                         
DTLEQFLT EQU   14                  FILTER                                       
DTLEQDAT EQU   15                  DATE                                         
DTLEQLEN EQU   16                  LENGTH                                       
DTLEQDPT EQU   17                  DAYPART                                      
DTLEQPT  EQU   18                  PROGTYP                                      
DTLEQPER EQU   19                  PERIOD                                       
DTLEQMKT EQU   20                  MARKET                                       
DTLEQUPG EQU   21                  UPGRADE                                      
DTLEQEFF EQU   22                  EFF DATE                                     
DTLEQMUL EQU   23                  MULTI-RANK                                   
DTLEQMGR EQU   24                  MKTGRP                                       
DTLEQCOM EQU   25                  COMMENT                                      
DTLEQMKM EQU   26                  MARKET (FOR MKTGRP)                          
         SPACE 2                                                                
SYSD     DSECT                                                                  
         ORG   OVWORK                                                           
AEBDTL   DS    A                   FIRST BLOCKED DETAIL ADDRESS                 
AEBDTLX  DS    A                   LAST  BLOCKED DETAIL ADDRESS                 
EBDISP   DS    F                   DISP TO FIRST EB DETAIL                      
AESTBK   DS    A                                                                
TOPOPT   DS    F                                                                
MINOPT   DS    F                                                                
MAXOPT   DS    F                                                                
SIDMKT   DS    H                   OUTPUT OF NEXTMGR GOES HERE                  
SIDSTAT  DS    XL3                                                              
USERTTL  DS    CL50                                                             
DETS     DS    CL40                                                             
REPAVE   DS    CL1                                                              
NDETS    DS    CL1                                                              
WDETS    DS    CL1                                                              
WDEMS    DS    CL1                                                              
START    DS    CL2                                                              
END      DS    CL2                                                              
MULTIOPT DS    CL1                                                              
ALTOPT   DS    CL1                                                              
SPACOPT  DS    CL1                                                              
QRTOPT   DS    CL1                                                              
UPOPT    DS    CL24                                                             
BOOKOPT  DS    CL3                                                              
DPOPT    DS    CL1                                                              
AVOPT    DS    CL1                                                              
SPECOPT  DS    CL1                                                              
REPOPT   DS    CL1                                                              
PTLIST   DS    CL8                                                              
DPLIST   DS    CL8                                                              
WEEKOPT  DS    CL1                                                              
UPFILE   DS    CL1                                                              
CPPOPT   DS    CL1                                                              
SIDOPT   DS    CL1                                                              
SIDPER   DS    CL1                                                              
SIDUPOPT DS    CL1                                                              
STACKOPT DS    CL1                                                              
SURVOPT  DS    CL1                                                              
MINCOL   DS    CL1                                                              
MAXCOL   DS    CL1                                                              
OVEROPT  DS    CL1                                                              
COMPOPT  DS    CL1                                                              
EFFOPT   DS    CL1                                                              
TPOPT    DS    CL1                                                              
TRACEOPT DS    CL1                                                              
SVSTART  DS    CL6                                                              
SVEND    DS    CL6                                                              
MGROPT   DS    CL1                                                              
PUTOPT   DS    CL1                                                              
RTGOPT   DS    CL1                                                              
EBOPT    DS    CL1                 C'Y'=EB FORMAT                               
SLNOPT   DS    CL1                                                              
NSIDPER  DS    CL4                                                              
NSIDYEAR DS    XL1                                                              
NSIDSCHM DS    CL3                                                              
NSIDDSKA DS    XL4                                                              
DOWNOPT  DS    CL1                 DOWNLOAD OPTION                              
