*          DATA SET SPREPWORKD AT LEVEL 244 AS OF 01/20/21                      
         SPACE                                                                  
*-----------------------------------------------------------------*             
*       *** NOTE *** NOTE *** NOTE ***                            *             
*   BE VERY CAREFUL BEFORE MAKING ANY CHANGES TO SPWORKD          *             
*   THAT WILL CHANGE THE DISPLACEMENT OF ANY LABEL.  THERE        *             
*   IS A HARDCODED TABLE IN DRIVADDS THAT CONTAINS DISPLACEMENTS! *             
* EJOR 12NOV02                                                    *             
*-----------------------------------------------------------------*             
         SPACE                                                                  
       ++INCLUDE SPSTAPACKD                                                     
         SPACE 2                                                                
SPADCONS DSECT                     ADCONLST POINTS TO THESE ADDRESSES           
TSAROFF  DS    A                                                                
ADPWREC  DS    A                                                                
VPWCALC  DS    A                                                                
VOFCLIST DS    A                                                                
VOFCLSTX DS    A                                                                
VBRDMON  DS    A                                                                
VSPDEMUP DS    A                                                                
VOFFICER DS    A                                                                
VSPGTBFR DS    A                                                                
VSPFMINO DS    A                                                                
VMQRPT   DS    A                                                                
VDBLOCK  DS    A                   AFTER MEDGETBY=A(SPGETDEM DBLOCK)            
VACTBKSR DS    A                   SOURCE=SPACTBKSR/EP=VMDACTBK                 
VACTBKG  DS    A                   SOURCE=SPACTBKG                              
VGETIUN  DS    A                   SOURCE=SPGETIUN                              
VSMTP    DS    A                   SOURCE=DDSMTP                                
VDMDDNAM DS    A                   RESOLVED IN DMDMGRL                          
         SPACE 2                                                                
*        <   >      GENERAL WORK SPACES                                         
         SPACE 3                                                                
SPWORKD  DSECT                                                                  
         DS    D                                                                
USERREGS DS    CL72                STXIT PUTS REGS HERE                         
         DS    D                   FILE CONTROL SAVE VALUES                     
SVMODE   DS    C                                                                
SVAGY    DS    CL3                                                              
SVAGYMD  DS    CL1                                                              
SVDATA   DS    CL2                                                              
SVMKGPGA DS    CL1                                                              
SVCLT    DS    XL2                                                              
SVONEPRD DS    CL1                                                              
SVPGRKEY DS    CL13                                                             
SVOLDPGR DS    CL4                                                              
SVNXTPGR DS    CL4                                                              
SVPRDADR DS    A                                                                
SVPRD    DS    XL3                                                              
SVPRDCD  DS    XL1                                                              
SVEST    DS    XL1                                                              
SVMGRKEY DS    XL13                                                             
SVOLDMGR DS    CL4                                                              
SVNXTMGR DS    CL4                                                              
         DS    CL2                                                              
SVMKTADR DS    A                                                                
SVMKT    DS    H                                                                
         DS    CL2                                                              
SVSTA    DS    XL3                                                              
SVGLKEY  DS    XL13                                                             
SVBUYKEY DS    XL13                                                             
SVPKGKEY DS    XL13                                                             
         DS    CL2                 SPARE                                        
SVIDADR  DS    A                                                                
SVSTLADR DS    A                                                                
SVIDFILT DS    F                   START/END DATES FOR ID FILTER                
         DS    CL52                                                             
SVDATAX  EQU   *                                                                
         SPACE 2                                                                
FCTAB    DS    0F                  FILE CONTROL EXTERNAL ROUTINES               
FCNXTREQ DS    A                   00                                           
FCNXTCLT DS    A                   04                                           
FCNXTPGR DS    A                   08                                           
FCNXTPRD DS    A                   0C                                           
FCNXTEST DS    A                   10                                           
FCNXTMGR DS    A                   14                                           
FCNXTMKT DS    A                   18                                           
FCNXTSTA DS    A                   1C                                           
FCFRSBUY DS    A                   20                                           
FCNXTBUY DS    A                   24                                           
FCFRSGL  DS    A                   28                                           
FCNXTGL  DS    A                   2C                                           
GO       DS    A                   30                                           
         DS    10A                 SPARE                                        
FCTABLEN EQU   (*-FCTAB)/4         NUMBER OF TABLE ENTRIES                      
         EJECT                                                                  
         DS    D                                                                
DMCB     DS    0CL24               PARAMETER LIST                               
DM1      DS    F                                                                
DM2      DS    F                                                                
DM3      DS    F                                                                
DM4      DS    F                                                                
DM5      DS    F                                                                
DM6      DS    F                                                                
         DS    D                                                                
DUB      DS    D                                                                
DOUBLE   DS    D                                                                
         DS    D                                                                
WORK     DS    CL64                                                             
         DS    D                                                                
FULL     DS    F                                                                
WORD     DS    F                                                                
HALF     DS    H                                                                
HALF2    DS    H                                                                
THREE    DS    CL3                                                              
BYTE     DS    CL1                                                              
         EJECT                                                                  
         SPACE 2                                                                
*        <   >      PRINT CONTROL                                               
         SPACE 3                                                                
         DS    D                                                                
LINE     DS    XL1                 PRESET TO 99                                 
ALLOWLIN DS    XL1                 ENSURE THAT N LINES REMAIN ON PAGE           
MAXLINES DS    XL1                 PRESET TO 60                                 
SPACING  DS    XL1                                                              
HEADHOOK DS    V                   USER SUPPLIED A(HEADLINE ROUTINE)            
CLEARHED DS    CL1                 OPTION TO CLEAR HEADLINES DEFAULT=Y          
FORCEHED DS    CL1                                                              
FORCEMID DS    CL1                                                              
FORCEFUT DS    CL1                                                              
FORCECLR DS    CL1                                                              
SKIPSPEC DS    CL1                                                              
PAGE     DS    XL2                                                              
SUBPAGE  DS    XL2                                                              
FORCECMT DS    XL1                 OPTION TO FORCE TOP COMMENTS                 
FORCECMB DS    XL1                 OPTION TO FORCE BOTTOM COMMENTS              
MIDHOOK  DS    V                   USER SUPPLIED A(MIDLINE ROUTINE)             
         DS    D                                                                
HEAD1    DS    CL132               HEADLINES                                    
HEAD2    DS    CL132                                                            
HEAD3    DS    CL132                                                            
HEAD4    DS    CL132                                                            
HEAD5    DS    CL132                                                            
HEAD6    DS    CL132                                                            
HEAD7    DS    CL132                                                            
HEAD8    DS    CL132                                                            
HEAD9    DS    CL132                                                            
HEAD10   DS    CL132                                                            
HEAD11   DS    CL132                                                            
HEAD12   DS    CL132                                                            
HEAD13   DS    CL132                                                            
HEAD14   DS    CL132                                                            
H1       EQU   HEAD1                                                            
H2       EQU   HEAD2                                                            
H3       EQU   HEAD3                                                            
H4       EQU   HEAD4                                                            
H5       EQU   HEAD5                                                            
H6       EQU   HEAD6                                                            
H7       EQU   HEAD7                                                            
H8       EQU   HEAD8                                                            
H9       EQU   HEAD9                                                            
H10      EQU   HEAD10                                                           
H11      EQU   HEAD11                                                           
H12      EQU   HEAD12                                                           
H13      EQU   HEAD13                                                           
H14      EQU   HEAD14                                                           
         EJECT                                                                  
         DS    CL8                                                              
MID1     DS    CL132               MID LINES                                    
MID2     DS    CL132                                                            
         DS    CL8                                                              
P        DS    0CL132              PRINT LINES                                  
P1       DS    CL132                                                            
P2       DS    CL132                                                            
P3       DS    CL132                                                            
P4       DS    CL132                                                            
P5       DS    CL132                                                            
P6       DS    CL132                                                            
P7       DS    CL132                                                            
P8       DS    CL132                                                            
P9       DS    CL132                                                            
P10      DS    CL132                                                            
P11      DS    CL132                                                            
P12      DS    CL132                                                            
P13      DS    CL132                                                            
P14      DS    CL132                                                            
         DS    CL8                                                              
FOOT1    DS    CL132               FOOT LINES                                   
FOOT2    DS    CL132                                                            
SPACES   DS    CL132               ALWAYS SPACES                                
MONTHS   DS    CL36                MONTH TABLE (JAN-DEC)                        
DAYTABL  DS    CL21                DAY TABLE (MON-SUN)                          
         EJECT                                                                  
         SPACE 2                                                                
*        <   >      FILE HANDLING AREAS                                         
         SPACE 3                                                                
         DS    D                                                                
KEY      DS    XL32                KEY                                          
KEYSAVE  DS    XL32                KEY SAVED BEFORE READ HIGH                   
KEY1     DS    XL32                                                             
KEY1SAVE DS    XL32                                                             
KEY2     DS    XL32                                                             
KEY2SAVE DS    XL32                                                             
DMWORK   DS    XL96                                                             
         SPACE 2                                                                
DMREAD   DS    CL8                 COMMANDS                                     
DMRDHI   DS    CL8                                                              
DMRSEQ   DS    CL8                                                              
DMADD    DS    CL8                                                              
DMWRT    DS    CL8                                                              
GETREC   DS    CL8                                                              
PUTREC   DS    CL8                                                              
ADDREC   DS    CL8                                                              
         SPACE 2                                                                
SPTFILE  DS    CL8                 FILES                                        
SPTDIR   DS    CL8                                                              
STATION  DS    CL8                                                              
         SPACE 2                                                                
AREC     DS    A                   USER SUPPLIES A(I/O AREA)                    
COMMAND  DS    CL8                                                              
FILE     DS    CL8                                                              
DATADISP DS    H                   DISPLACEMENT TO FIRST ELEMENT                
DMINBTS  DS    CL1                 SET TO X'80'                                 
DMOUTBTS DS    CL1                                                              
BASERD   DS    A                                                                
AENDREQ  DS    A                                                                
         EJECT                                                                  
*        <   >      RUN HANDLING VALUES                                         
         SPACE 3                                                                
         DS    D                                                                
RCINPUT  DS    CL1                 INPUT          PRESET TO D                   
RCSTNUM  DS    PL3                 START REQUEST            1                   
RCENNUM  DS    PL3                 END REQUEST              9999                
RCPROG   DS    CL2                 PROGRAM NUMBER                               
RCSUBPRG DS    XL1                 SUB-PROGRAM              0                   
RCTRACE  DS    CL1                 TRACE OPTION             N                   
RCWRITE  DS    CL1                 WRITE OPTION             Y                   
RCDUMP   DS    CL1                 DUMP OPTION              N                   
RCDATE   DS    CL8                 RUN DATE                 TODAY               
RCSPECNO DS    PL4                 SPECIAL NUMBER           1                   
RCUPSI   DS    CL1                 UPSI SETTING             COMRG+23            
RCLINEUP DS    CL1                 LINEUP OPTION            N                   
RCREQREP DS    CL1                 REQUEST REPORT           Y                   
RCREQSUM DS    CL1                 REQUEST SUMMARY          Y                   
RCSPACNG DS    XL1                 SPACING                  1                   
RCFLONLY DS    CL1                 SKIP PRINT SPECS         N                   
RCJOB    DS    CL8                 JOB NAME                                     
RCRQTOT  DS    PL3                 TOTAL REQUESTS                               
RCRQVAL  DS    PL3                 VALID REQUESTS                               
RCRQERR  DS    PL3                 ERROR REQUESTS                               
RCPHASE  DS    CL1                 PHASE                    1                   
RCFILTER DS    CL1                 FILTER ON AGENCY                             
RCAGENCY DS    CL2                                                              
RCAGYCRD DS    CL2                                                              
RCOUTPUT DS    CL1                 OUTPUT TYPE              P                   
RCRERUN  DS    CL1                 RERUN OPTION             N                   
TESTOPT1 DS    CL1                 OPTION TO LOAD 01T PHASE                     
TESTOPT2 DS    CL1                 OPTION TO LOAD 02T PHASE                     
FCPHASE  DS    CL8                 PHASE NAME OF FILE CONTROLLER                
MAXPAGES DS    CL2                 CAN BE SET TO LIMIT PAGES=NNN                
ACTPAGES DS    CL2                 COUNT PAGES HERE                             
RCORIGID DS    XL2                                                              
RCLANG   DS    XL1                 LANGUAGE CODE                                
RCCTRY   DS    XL1                 COUNTRY CODE                                 
RCWHATPR DS    XL1                 X'02' = PRINTER 2                            
RCUTLTRF DS    XL1                 SE NUMBER IF TRAFFIC UPDATIVE                
RCOPTS   DS    XL1                                                              
RCOPT_OFCSORT  EQU  X'80'          DO NOT SORT OFCLIST BY OFFICE                
RCOPT_PWADJTST EQU  X'40'          SPFILCON TO SET RQFLAG_PWADJ                 
RCOPT_NOCOST   EQU  X'20'          SUPPRESS ALL COSTS                           
RCOPT_INCLMKT0 EQU  X'10'          INCLUDE MKT 0 IF 'ALL' MKTS                  
RCOPT_INCLMK0$ EQU  X'08'          INCLUDE MKT 0 DOLS IF ALL MKTS               
RCOPT_NOCENT   EQU  X'04'          FOR SPMEDEQUIV - DO NOT OVERWRITE            
*                                  '$' DAYPARTS WITH C'C'                       
*                                                                               
RCMULTIQ DS    CL1                 'Y' IF DOING MULTI-MEDIA REQUEST             
         SPACE 2                                                                
         DS    0D                                                               
         DS    CL5                                                              
MODE     DS    XL1                 MODE (INTERNAL COMMUNICATION)                
MODEALPH DS    CL8                                                              
RCOUNTRY DS    CL2                 US OR UK                                     
THISMNTH DS    CL2                                                              
         EJECT                                                                  
         SPACE 2                                                                
*        <   > EXTERNAL ADDRESS DIRECTORY                                       
         SPACE 1                                                                
         DS    D                   (*EXTRNS* IN DUMP)                           
ADDAY    DS    V                                                                
APPLIC   DS    V                                                                
ASORT    DS    V                                                                
BINSRCH  DS    V                                                                
BUFFALO  DS    V                                                                
CARDS    DS    V                                                                
CENTER   DS    V                                                                
CHOPPER  DS    V                                                                
CLPACK   DS    V                                                                
CLUNPK   DS    V                                                                
CODAY    DS    V                                                                
DADDS    DS    V                                                                
DATAMGR  DS    V                                                                
DATCON   DS    V                                                                
DPTRD    DS    V                                                                
EQVRD    DS    V                                                                
EXPAND   DS    V                                                                
FILCON   DS    V                                                                
FILEC    DS    V                                                                
GETBROAD DS    V                                                                
GETDAY   DS    V                                                                
GETPROF  DS    V                                                                
GETRATE  DS    V                                                                
HEXIN    DS    V                                                                
HEXOUT   DS    V                                                                
LOADER   DS    V                                                                
LOGIO    DS    V                                                                
LOGO     DS    V                                                                
LOGOC    DS    V                                                                
MEDGET   DS    V                                                                
MKTLIST  DS    V                                                                
MKTLISTX DS    V                                                                
MOBILE   DS    V                                                                
MSPACK   DS    V                                                                
MSUNPK   DS    V                                                                
PDUMPER  DS    V                                                                
PRDLIST  DS    V                                                                
PRINT    DS    V                                                                
RECUP    DS    V                                                                
REPORT   DS    V                                                                
REQCARVE DS    V                                                                
REQREP   DS    V                                                                
REQSUM   DS    V                                                                
ROLLER   DS    V                                                                
RUNCON   DS    V                                                                
SAVE     DS    V                                                                
SPECS    DS    V                                                                
SPTWORK  DS    V                                                                
SQUASHER DS    V                                                                
SSB      DS    V                                                                
SUBCON   DS    V                                                                
TIMCON   DS    V                                                                
UNDERLIN DS    V                                                                
UNTIME   DS    V                                                                
UTL      DS    V                                                                
WORKC    DS    V                                                                
WORKER   DS    V                                                                
XSORT    DS    V                                                                
BUYLIST  DS    V                 SYMBOL BUYIDLST IN SPREPWORKC                  
BUYLISTL EQU   36000                                                            
GETCOM   DS    V                                                                
DEMOCON  DS    V                                                                
DEMAND   DS    V                                                                
ABOX     DS    V                                                                
NETIO    DS    V                                                                
BUFFSUM  DS    V                                                                
ADCONLST DS    A                 EXTENDED ADCON LIST ADDRESS                    
         SPACE 2                                                                
*        <   > ADDRESSES OF RECORDS                                             
         SPACE 1                                                                
ADAGY    DS    V                                                                
ADCLT    DS    V                                                                
ADPRD    DS    V                                                                
ADEST    DS    V                                                                
ADBILL   DS    V                                                                
ADGOAL   DS    V                                                                
ADADV    DS    V                                                                
ADPROFIL DS    V                                                                
ADBUY    DS    V                                                                
ADSTAT   DS    V                                                                
ADSTATAD DS    V                                                                
ADMARKET DS    V                                                                
ADREP    DS    V                                                                
ADPRDGRP DS    V                                                                
ADMKTGRP DS    V                                                                
ADCOMREC DS    V                                                                
ADCLTGRP DS    V                                                                
         DS    A                                                                
ADSTALST DS    V                   A(STATION LIST FOR THIS MKT)                 
         EJECT                                                                  
*        <   > DATA MANAGER FACILITIES - GOTO1 THESE ROUTINES                   
         SPACE 3                                                                
READ     DS    V                   DIRECTORY COMMANDS                           
HIGH     DS    V                                                                
SEQ      DS    V                                                                
WRITE    DS    V                                                                
ADDIR    DS    V                                                                
         SPACE 1                                                                
GETAGY   DS    V                   GET COMMANDS                                 
GETCLT   DS    V                                                                
GETPRD   DS    V                                                                
GETEST   DS    V                                                                
GETBILL  DS    V                                                                
GETGOAL  DS    V                                                                
GETADV   DS    V                                                                
GETPRFIL DS    V                                                                
GETBUY   DS    V                                                                
GETPRDGR DS    V                                                                
GETMKTGR DS    V                                                                
         SPACE 1                                                                
PUTEST   DS    V                   PUT COMMANDS                                 
PUTBILL  DS    V                                                                
PUTGOAL  DS    V                                                                
PUTBUY   DS    V                                                                
         SPACE 1                                                                
ADDBILL  DS    V                   ADD COMMANDS                                 
         SPACE 1                                                                
READSTA  DS    V                   READ STATION COMMANDS                        
READSTAD DS    V                                                                
READMKT  DS    V                                                                
READREP  DS    V                                                                
         SPACE 1                                                                
SEQSTA   DS    V                   SEQUENTIAL STATION COMMANDS                  
SEQSTAD  DS    V                                                                
SEQMKT   DS    V                                                                
SEQREP   DS    V                                                                
HIGHSTA  DS    V                   HIGH STATION COMMANDS                        
HIGHSTAD DS    V                                                                
HIGHMKT  DS    V                                                                
HIGHREP  DS    V                                                                
         SPACE 1                                                                
GET      DS    V                   GENERAL GETREC/PUTREC/ADDREC                 
PUT      DS    V                   A(RECORD) IS IN AREC                         
ADD      DS    V                                                                
         DS    CL12                                                             
         DS    A                                                                
         EJECT                                                                  
         SPACE 2                                                                
*        <   >      REQUEST RECORD LAYOUT                                       
         SPACE 3                                                                
         DS    D                                                                
QRECORD  DS    0CL80                                                            
QAREA    DS    0CL80   COLUMN                                                   
QPROG    DS    0CL2    ------                                                   
QCODE    DS    CL2        1        PROGRAM CODE                                 
QAGY     DS    CL2        3        AGENCY CODE                                  
QMED     DS    CL1        5        MEDIA CODE (R/T)                             
QCLT     DS    CL3        6        CLIENT CODE                                  
QPGR     DS    CL1        9        PROCESS BY DIVISION                          
QMGR     DS    CL1       10        PROCESS BY DISTRICT                          
QCLOFFC  DS    CL1       11        CLIENT OFFICE FILTER                         
QBYID    EQU   QCLOFFC             C'Y' IF BUYS PROCESSED BY ID                 
QPRD     DS    CL3       12        PRODUCT MNEMONIC                             
QMKT     DS    CL4       15        MARKET NUMBER                                
QSTA     DS    CL5       19        STATION CALL LETTERS                         
QEST     DS    CL3       24        ESTIMATE NUMBER                              
QESTEND  DS    CL3       27        LAST NUMBER IN ESTIMATE GROUP                
QDEMOVRD DS    CL1       30        Y=DEMO OVERRIDE ACTIVE                       
QCONTREQ DS    CL1       31        C'*' ==> DATA IN QAREA2                      
QSTAUTO  DS    CL3       32        AUTO REQUEST START DATE                      
QENDAUTO DS    CL3       35        AUTO REQUEST END DATE                        
         ORG   QSTAUTO+2                                                        
QDEMNOS  DS    CL4                 DEMO OVERRIDE NUMBERS                        
QSTART   DS    CL6       38        REQUEST START DATE                           
QEND     DS    0CL6      44        REQUEST END DATE                             
QTODAY   DS    CL6       44                                                     
QBOOK1   DS    CL4       50        RATING BOOK (YYMM) GOAL/ESTD DATA            
QHUT1    DS    CL2       54        HUT ADJUSTMENT MONTH                         
QRERATE  DS    CL1       56        RERATE TYPE  I=INVOICE                       
*                                               P=PURCHASED                     
*                                               A=ADJUST ONLY                   
*                                               U=UPGRADE (+Q2BOOK2)            
QCOMPARE DS    CL1       57        DATA COMPARE OPTION                          
*                                  A=GOAL V PURCHASED                           
*                                  B=GOAL V AFFIDAVIT                           
*                                  C=PURCHASED V PURCHASED (RERATED)            
*                                  D=PURCHASED V AFFIDAVIT                      
*                                  E=LOCKIN V PURCHASED                         
*                                  F=LOCKIN V AFFIDAVIT                         
*                                  L=GOAL V PURCHASED, LOCKIN PURCHASED         
QAFFIL   DS    CL1       58        AFFILIATION FILTER                           
QPRGTYPE DS    CL1       59        PROGRAM TYPE FILTER                          
QDPTDET  DS    CL1       60        DAYPART DETAIL CONTROL                       
*                                  A=SHOW FULL DETAIL (DEFAULT)                 
*                                  B=SUPPRESS SPOT-LENGTH                       
*                                  C=SUPPRESS SPOT-LENGTH & DAY-PART            
QDPTMENU DS    CL1       61        DAYPART MENU OVERRIDE                        
QOPT1    DS    CL1       62        OPTION 1                                     
QOPT2    DS    CL1       63        OPTION 2                                     
QOPT3    DS    CL1       64        OPTION 3                                     
QOPT4    DS    CL1       65        OPTION 4                                     
QOPT5    DS    CL1       66        OPTION 5                                     
QGRP     DS    CL2       67        GROUP                                        
QFILTER  EQU   QGRP                FILTER TYPE/VALUE                            
QUESTOR  DS    CL12      69        REQUESTOR NAME                               
         EJECT                                                                  
         ORG   QAREA+57                                                         
QCMRCL   DS    CL8       58        COMMERCIAL FILTER                            
         ORG   QAREA+29                                                         
QREP     DS    CL3       30        DISCREPANCY REP                              
QREPTYPE DS    CL1       33                                                     
QTIME    DS    CL2       34                                                     
QCONT    DS    CL1       36                                                     
         SPACE 2                                                                
         ORG   QAREA+49                                                         
QPRD2    DS    CL3       50        PRODUCT 2                                    
QPRD3    DS    CL3       53        PRODUCT 3                                    
QAMTTYPE DS    CL1       56        AMOUNT TYPE                                  
QAMT     DS    CL10      57        AMOUNT                                       
         DS    CL2       67                                                     
QIND     DS    CL12      69        INVOICE NUMBER                               
         SPACE 2                                                                
REQSTART DS    F                   START TIME FOR THIS REQUEST                  
QSAVE    DS    CL80                SAVE AREA FOR PREVIOUS REQUEST               
         SPACE 3                                                                
*        <   >      FILE CONTROL VALUES SET BY SPECS                            
         SPACE 3                                                                
         DS    CL8                                                              
FCOMMAND DS    0CL32                                                            
         DS    CL7                                                              
FCRDBUYS DS    CL1            READ BUYS                                         
FCRDGOAL DS    CL1            READ GOALS                                        
FCRDPKG  DS    CL1            READ BUYS IN PACKAGE SEQUENCE                     
         SPACE 1                                                                
         DS    CL7                                                              
FCGETMKT DS    CL1            GET MARKET RECORD ON CHANGE OF MARKET             
FCGETSTA DS    CL1            GET STATION RECORD ON CHANGE OF STATION           
FCGETDEM DS    CL1            GET DEMOS FOR BUYS                                
         SPACE 1                                                                
FCUPTRF  DS    CL1            UPDATE TRAFFIC SYSTEM FILES                       
         DS    CL7                                                              
FCUPDIR  DS    CL1            ALLOW UPDATES TO SPTDIR                           
FCUPFILE DS    CL1            ALLOW UPDATES TO SPTFILE                          
FCUPSTAT DS    CL1            ALLOW UPDATES TO STATION                          
FCOPNDEM DS    CL1            OPEN DEMO FILES                                   
         EJECT                                                                  
*        <   > TABLES AND PRESET VALUES                                         
         SPACE 3                                                                
DPTTAB   DS    CL81                DAYPART LOOK-UP TABLE (16X5-BYTE             
*                                  ENTRIES)  EQ D/01/DAY                        
SLNTAB   DS    CL15                SPOTLENGTH LOOK-UP TABLE  10/15/20/          
*                                  30/40/45/50/60/90/120/105/150/75/5//         
DPEQTAB  DS    CL16                DAYPART SECTION TRANSLATE TABLE              
*                                  SET TO 1 OR 2                                
EQTAB    DS    CL120               EQUIVALENCY TABLES                           
         SPACE 2                                                                
*                                  APPLICATION MODIFIES THESE                   
*                                  FIELDS AT RUNFRST TIME                       
         SPACE 1                                                                
RQSTDTLN DS    XL1                 QSTART LENGTH              6                 
RQNDDTLN DS    XL1                 QEND LENGTH                6                 
RQALLPOL DS    CL1                 INCLUDE POL IF QPRD=ALL    N                 
RQDAYPT  DS    CL1                 READ DAYPART HEADERS       N                 
RQEQUIV  DS    CL1                 READ EQUIVALENCE HEADERS   N                 
RQNOPSSV DS    CL1                 EXCLUDE PASSIVE POINTERS   N                 
RQLNKPKG DS    CL1                 LINK PACKAGES              N                 
RQDEL    DS    CL1                 PROCESS DELETED BUYRECS    N                 
RQMGOPT  DS    CL1                 PROCESS MG IN MSSD MONTH   N                 
RQMGRP   DS    CL1                 =Y IF MGRP PTRS POSSIBLE   N                 
RQBILLDT DS    XL3                 BILL DATE FILTER FOR ESTIMATES               
RQGETNAM DS    CL1                 =Y FOR NAMES IN SVBUYNAM/SVBILNAM            
*                                  AGYPROF+14 MUST BE Y                         
RQALLMKT DS    CL1                 =Y BUILD COMPLETE MARKET LIST                
*                                     AT NEXTMGR, NOT JUST ACTIVES              
RQESTTST DS    CL1                 =Y HOOK TO USER DURING ESTLST BUILD          
RQGETBF  DS    CL1                 =Y TO GET AND APPLY BILL FORMULAE            
*                                  =X TO GET NET DOLLARS                        
RQCRRNCY DS    CL1                 =U FOR US CURRENCY, C=CANADIAN               
RQC58OPT DS    CL1                 =N TO EXCLUDE C58 FROM GROSS $               
RQGSTOPT DS    CL1                 =Y TO INCLUDE GST IN GROSS $                 
RQFLAG   DS    CL1                 SET BY FILCON                                
RQFLAG_PWADJ   EQU  X'80'          PW ADJ BILLING FOR AT LEAST ONE MKT          
RQCOST2  DS    CL1                 =Y FOR COST2 VALUES FROM MEDGETBY            
RQREP    DS    CL3                 USED IN PLACE OF QREP                        
RQPOLFLT DS    CL1                 EST FILTERS FOR PRODUCT USE POL              
         SPACE 2                                                                
*                                  APPLICATION MODIFIES THESE                   
*                                  FIELDS AT REQFRST TIME                       
         SPACE 1                                                                
RQSTAFLT DS    CL1                 STATION AFFILIATE FILTER   BLANK             
RQNOAML  DS    CL1                 SUPPRESS FILCON ACTV MKT BUILD LOGIC         
RQPRDAAA DS    CL1                 INCLUDE PRODUCT AAA        Y                 
RQBRDMON DS    CL1                 BROADCAST MONTHS           Y                 
RQPRDEST DS    CL1                 PROCESS PRD WITHIN EST     N                 
RQESTFLT DS    CL1                 FILTER ON ESTIMATE         Y                 
RQMKTFLT DS    CL1                 FILTER ON MARKET           Y                 
RQDPOVRD DS    XL1                 DAYPART OVERRIDE NO.       O                 
RQRDPOL  DS    CL1                 READ POL POINTERS ON ALL   N                 
*                                  IF NO BRAND DATA                             
RQPRGTYP DS    CL1                 FILTER ON PROGRAM TYPE   BLANK               
         SPACE 2                                                                
SPOTHOOK DS    V                   PRE-PROCESS HOOK FOR MEDGETBY                
SPOTADDR DS    A                   A(SPOT TO BE FILTERED)                       
SPOTYORN DS    CL1                 USER SETS TO Y OR N (PRESET TO Y)            
ALLOWCWM DS    CL1                 ALLOW CALENDAR WEEKS AND MONTHS              
*                                      (PRESET TO Y)                            
SPUSRNMS DS    CL35                4 USER DEMO NAMES + WEIGHTED                 
SPILLBUY DS    CL1                 C'Y' FOR SPILL BUY (SET BY FILCON)           
RQOPTS   DS    CL1                                                              
RQOPTS_NOPIG   EQU  X'80'          FOR SDX, SUPPRESS COST P/B $ SPLIT           
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'244SPREPWORKD01/20/21'                                      
RQOPTS_HDEND   EQU  X'40'          STALAST FOR HEADEND ONLY                     
RQOPTS_CENTS   EQU  X'20'          PRINT PENNIES FOR RADIO TO $10K              
RQOPTS_2DEC    EQU  X'10'          REPORT PRINTS 2 DECIMAL RTGS                 
RQOPTS_1DEC    EQU  X'08'          ALWAYS REPORT 1 DECIMAL PRECISION            
RQOPTS_POST    EQU  X'04'          SPOT POSTING INDICATOR                       
RQOPTS_CBHLAST EQU  X'02'          GIVE HDND LAST FOR ALPHA SEQ CABLE           
RQOPTS_2DECIMP EQU  X'01'          REPORT PRINTS 2 DECIMAL IMPS                 
RQEMAIL  DS    XL1                 C'Y' WRITE TO EXTERNAL FILE                  
RQALPHA  DS    CL1                 C'Y' FOR STATIONS IN ALPHA SEQ               
RQLKGLS  DS    CL1                 C'Y' TO REPORT LOCKED GOAL DATA              
RQOPT2   DS    XL1                                                              
RQOPT2_NONTDEM EQU  X'80'          NONT DEMOS IN FORM MOD(1)/SEQNUM(2)          
RQOPT2_NETBUYS EQU  X'40'          CANADIAN BUYS AT NET FEATURE                 
         DS    XL1                 SPARE                                        
         EJECT                                                                  
*        <   > USEFUL INFORMATION EXTRACTED FROM RECORDS                        
         SPACE 3                                                                
AGENCY   DS    0CL2                                                             
AGY      DS    CL2                 AGENCY CODE                                  
AGYNM    DS    CL33                AGENCY NAME                                  
AGYADR   DS    CL33                AGENCY ADDRESS                               
         SPACE 1                                                                
MEDIA    DS    0CL1                                                             
MED      DS    CL1                 MEDIA CODE                                   
MEDNM    DS    CL10                MEDIA NAME                                   
         SPACE 1                                                                
CLIENT   DS    0CL3                                                             
CLT      DS    CL3                 CLIENT CODE                                  
CLTNM    DS    CL24                CLIENT NAME                                  
         SPACE 1                                                                
PGR1     DS    CL5                 PRODUCT GROUP LEVEL 1 CODE                   
PGR1LEN  DS    CL1                 PRODUCT GROUP LEVEL 1 LENGTH                 
PGR1BK   DS    CL12                PRODUCT GROUP LEVEL 1 BREAK NAME             
PGR1NM   DS    CL24                PRODUCT GROUP LEVEL 1 GROUP NAME             
         SPACE 1                                                                
PGR2     DS    CL5                 PRODUCT GROUP LEVEL 2 CODE                   
PGR2LEN  DS    CL1                 PRODUCT GROUP LEVEL 2 LENGTH (1+2)           
PGR2BK   DS    CL12                PRODUCT GROUP LEVEL 2 BREAK NAME             
PGR2NM   DS    CL24                PRODUCT GROUP LEVEL 2 GROUP NAME             
         SPACE 1                                                                
PGR3     DS    CL5                 PRODUCT GROUP LEVEL 3 CODE                   
PGR3LEN  DS    CL1                 PRODUCT GROUP LEVEL 3 LENGTH (1+2+3)         
PGR3BK   DS    CL12                PRODUCT GROUP LEVEL 3 BREAK NAME             
PGR3NM   DS    CL24                PRODUCT GROUP LEVEL 3 GROUP NAME             
         SPACE 1                                                                
PRODUCT  DS    0CL3                                                             
PRD      DS    CL3                 PRODUCT CODE                                 
PRDNM    DS    CL24                PRODUCT NAME                                 
         EJECT                                                                  
*        <   > OTHER RECORD DATA                                                
         SPACE 3                                                                
ESTIMATE DS    0CL3                                                             
EST      DS    CL3                 ESTIMATE NUMBER                              
ESTNM    DS    CL24                ESTIMATE NAME                                
ESTDATES DS    0CL12               ESTIMATE DATES                               
ESTST    DS    CL6                 ESTIMATE START DATE                          
ESTND    DS    CL6                 ESTIMATE END DATE                            
         SPACE 1                                                                
MGR1     DS    CL5                 MARKET GROUP LEVEL 1 CODE                    
MGR1LEN  DS    CL1                 MARKET GROUP LEVEL 1 LENGTH                  
MGR1BK   DS    CL12                MARKET GROUP LEVEL 1 BREAK NAME              
MGR1NM   DS    CL24                MARKET GROUP LEVEL 1 GROUP NAME              
         SPACE 1                                                                
MGR2     DS    CL5                 MARKET GROUP LEVEL 2 CODE                    
MGR2LEN  DS    CL1                 MARKET GROUP LEVEL 2 LENGTH (1+2)            
MGR2BK   DS    CL12                MARKET GROUP LEVEL 2 BREAK NAME              
MGR2NM   DS    CL24                MARKET GROUP LEVEL 2 GROUP NAME              
         SPACE 1                                                                
MGR3     DS    CL5                 MARKET GROUP LEVEL 3 CODE                    
MGR3LEN  DS    CL1                 MARKET GROUP LEVEL 3 LENGTH (1+2+3)          
MGR3BK   DS    CL12                MARKET GROUP LEVEL 3 BREAK NAME              
MGR3NM   DS    CL24                MARKET GROUP LEVEL 3 GROUP NAME              
         SPACE 1                                                                
MARKET   DS    0CL4                                                             
MKT      DS    CL4                 MARKET NUMBER                                
MKTNM    DS    CL24                MARKET NAME                                  
         SPACE 1                                                                
STA      DS    CL5                 STATION CALL LETTERS  (WABCA)                
STAPRINT DS    CL7                 EXPANDED CALL LETTERS (WABC-AM)              
         SPACE 1                                                                
REP      DS    CL3                 REP NUMBER                                   
REPNM    DS    CL24                REP NAME                                     
         EJECT                                                                  
*        <   > BINARY VALUES EXTRACTED FROM RECORDS                             
         SPACE 3                                                                
BAGY     DS    XL1                 AGENCY NUMBER                                
BAGYMD   DS    XL1                 AGENCY/MEDIA                                 
BCLT     DS    XL2                 CLIENT                                       
BPGR     DS    XL3                 PRODUCT GROUP                                
BPRD     DS    XL1                 PRODUCT NO.                                  
BEST     DS    XL1                 ESTIMATE NO.                                 
BESTEND  DS    XL1                 ESTIMATE END NO.                             
BFILTER  DS    CL1                 FILTER VALUE                                 
BMGR     DS    XL3                 MARKET GROUP                                 
         SPACE 1                                                                
BMKTSTA  DS    0XL5                MARKET/STATION                               
BMKT     DS    XL2                 MARKET                                       
BSTA     DS    XL3                 STATION                                      
BREP     DS    XL2                 REP                                          
         SPACE 1                                                                
BDATES   DS    0CL20               DATES                                        
         DS    CL10                SPARE                                        
BQSTART  DS    XL3 ** USER SET **  REQUEST START                                
BQEND    DS    XL3 ** USER SET **  REQUEST END                                  
BQSTARTP DS    XL2 ** USER SET **  REQUEST START (COMPRESSED)                   
BQENDP   DS    XL2 ** USER SET **  REQUEST END   (COMPRESSED)                   
         SPACE 1                                                                
TODAY    DS    CL6                 TODAY'S DATE (EBCDIC)                        
TODAYB   DS    CL3                 TODAY'S DATE (BINARY)                        
TODAYP   DS    CL2                 TODAY'S DATE (COMPRESSED)                    
         SPACE 1                                                                
ESTSTB   DS    XL3                 ESTIMATE START (BINARY)                      
ESTNDB   DS    XL3                 ESTIMATE END   (BINARY)                      
ESTSTP   DS    XL2                 ESTIMATE START (COMPRESSED)                  
ESTNDP   DS    XL2                 ESTIMATE END   (COMPRESSED)                  
         SPACE 1                                                                
SPOTS    DS    F                                                                
RATES    DS    0CL32                                                            
GROSS    DS    F                                                                
NET      DS    F                                                                
TAX      DS    F                                                                
         DS    5F                                                               
COSTIND  DS    CL1                 COST INDICATOR                               
*                                                                               
SVSTART  DS    CL6                                                              
SVEND    DS    CL6                                                              
*                                                                               
FILENUM  DS    CL1                 SPOT FILE NUMBER                             
SPOTSE   DS    XL1                 SPOT SE NUM                                  
PRNTSE   DS    XL1                 PRNT SE NUM                                  
ACCTSE   DS    XL1                 ACCT SE NUM                                  
ACCTCD   DS    XL1                 ACCT COMPANY CODE                            
         EJECT                                                                  
* DATA AREAS FOR COMMENT SELECTION                                              
*                                                                               
BCMTYPE  DS    XL1                 COMMENT TYPE                                 
BCMCLT   DS    XL2                 CLIENT                                       
BCMPGR   DS    XL3                 PRDGRP                                       
BCMPRD   DS    XL1                 PRODUCT CODE                                 
BCMEST   DS    XL1                 ESTIMATE                                     
BCMMKT   DS    XL2                 MARKET                                       
BCMSTA   DS    XL3                 STATION                                      
*                                                                               
BCMCNTL  DS    XL1              CONTROL BYTE-  X'80'=NO FURTHER SEARCH          
*                                              IF GIVEN PRD/EST                 
         SPACE 2                                                                
*        <   > ACTIVITY SWITCHES                                                
         SPACE 2                                                                
SWITCHES DS    0CL16               ALL ARE PRESET TO C'N'                       
SW       DS    0CL16                                                            
AGYSW    DS    CL1                                                              
MEDSW    DS    CL1                                                              
CLTSW    DS    CL1                                                              
PGR1SW   DS    CL1                                                              
PGR2SW   DS    CL1                                                              
PGR3SW   DS    CL1                                                              
PRDSW    DS    CL1                                                              
ESTSW    DS    CL1                                                              
MGR1SW   DS    CL1                                                              
MGR2SW   DS    CL1                                                              
MGR3SW   DS    CL1                                                              
MKTSW    DS    CL1                                                              
STASW    DS    CL1                                                              
REPSW    DS    CL1                                                              
USRSW1   DS    CL1                                                              
USRSW2   DS    CL1                                                              
         SPACE 2                                                                
ESTLST   DS    XL256                                                            
         EJECT                                                                  
*        <   > MEDIA SUMMARY ADDRESSES                                          
         SPACE 3                                                                
PRDBUFF  DS    V                   A(PRODUCT NO/NAME/DEMO LIST)                 
MEDBUFF  DS    V                   A(EXTRACT BLOCK)                             
BUFFBUFF DS    V                   A(BUFFALO CSECT)                             
BUFFIO   DS    V                   A(BUFFALO I/O AREA)                          
MEDTABLE DS    V                   A(MEDIA TABLES)                              
DEMTABLE DS    V                   A(128*7 BYTE DEM DESC. TABLE)                
ADBLOCK  DS    V                                                                
ACOMFACS DS    V                                                                
DYNALLOC DS    V                   A(DYNALLOC)                                  
PRNTBL   DS    V                                                                
         SPACE 2                                                                
GETDEMO  DS    V                                                                
ASV1W    DS    V                   SV1WPROF ADDRESS IN MEDGETBY                 
VMASTC   DS    V                                                                
ADDPTTAB DS    V                                                                
ASVD0    DS    V                   SVD0PROF ADDRESS IN MEDGETBY                 
         SPACE 2                                                                
MEDDATE  DS    V                                                                
MEDSEED  DS    V                                                                
MEDGETBY DS    V                                                                
MEDGETGL DS    V                                                                
MEDGETLK DS    V                                                                
MEDPOST  DS    V                                                                
MEDSTARS DS    V                                                                
MEDEDIT  DS    V                                                                
MEDEQUIV DS    V                                                                
MEDCLEAR DS    V                                                                
MEDMKTWT DS    V                                                                
MEDPRDRD DS    V                                                                
MEDPSL   DS    V                                                                
SPWEIGHT DS    F                   WEIGHT USED BY PRINT SPEC                    
SPSUPMKT DS    CL1                 OPTION NOT TO PUT MARKET IN HEADS            
SPDUPTOT DS    CL1                 Y=DUPLICATE TOTALS                           
PRDBUFLN DS    0CL2                                                             
MEDPRDLN DS    CL2                 LENGTH OF PRDBUFF ENTRY                      
SPNOMKTS DS    F                   NUMBER OF MARKETS                            
MEDADDWT DS    V                                                                
*        <   > MISC.                                                            
SPOTPROF DS    CL16                                                             
PROGPROF DS    CL16                                                             
BUYIDNAM DS    CL12                                                             
BUYID    DS    CL12                                                             
BIGSTA   DS    CL9                                                              
MRANK    DS    CL5                                                              
SVOFCLST DS    CL32                                                             
SVNEWOFC DS    CL1                 NEW OFFICE FLAG                              
PRODUCT2 DS    0CL3                PRODUCT 2                                    
PRD2     DS    CL3                 PRODUCT 2 CODE                               
PRDNM2   DS    CL24                PRODUCT 2 NAME                               
BPRD2    DS    XL1                 PRODUCT 2 NO.                                
SVSTAMSF DS    XL2                 STATION'S CANADIAN MEDIA SERVICE FEE         
SVBFORM  DS    XL5                 SAVED BILL FORMULA                           
         SPACE 2                                                                
*                                                                               
CURTAB   DS    XL8                 CURRENCY TABLE FOR CUREDIT                   
SPDFPROF DS    CL16                                                             
         SPACE 1                                                                
SVCGRKEY DS    XL13                                                             
*                                                                               
CGR1     DS    CL5                 CLIENT GROUP LEVEL 1 CODE                    
CGR1LEN  DS    CL1                 CLIENT GROUP LEVEL 1 LENGTH                  
CGR1BK   DS    CL12                CLIENT GROUP LEVEL 1 BREAK NAME              
CGR1NM   DS    CL24                CLIENT GROUP LEVEL 1 GROUP NAME              
         SPACE 1                                                                
CGR2     DS    CL5                 CLIENT GROUP LEVEL 2 CODE                    
CGR2LEN  DS    CL1                 CLIENT GROUP LEVEL 2 LENGTH (1+2)            
CGR2BK   DS    CL12                CLIENT GROUP LEVEL 2 BREAK NAME              
CGR2NM   DS    CL24                CLIENT GROUP LEVEL 2 GROUP NAME              
SVCGRTYP DS    CL1                 N=NETPAK, ELSE 0                             
PGRUNA   DS    CL1                 Y=INCLUDE UNA IN PRDGRP/POL REQ              
COUNTRY  DS    CL1                 COUNTRY (C=CANADA, ELSE US)                  
PACKVRSN DS    CL1                 C'N' = 256 CANADIAN NTWKS                    
NOPRDNTP DS    CL1                 SUPPRESS NTP BY PRODUCT                      
*                                                                               
MGR1N    DS    CL6                 EXTENDED MARKET GROUP CODE                   
MGR2N    DS    CL6                                                              
MGR3N    DS    CL6                                                              
MGRLEN   DS    X                   NUM OF ALPHA CHARS IN MGR CODE               
*                                                                               
CGR1N    DS    CL6                 EXTENDED CLIENT GROUP CODE                   
CGR2N    DS    CL6                                                              
CGRLEN   DS    X                   NUM OF ALPHA CHARS IN CGR CODE               
UNWSTRP  DS    XL2                 UNWIND PERIOD START DATE                     
UNWENDP  DS    XL2                 UNWIND PERIOD END DATE                       
UNWOPTS  DS    XL1                 UNWIND OPTIONS                               
*                                  X80=MG,X40=-OTO,X20=+OTO                     
FILENUM2 DS    XL2                 TWO CHARACTER FILE ID                        
CROSSFIL DS    XL1                 CROSS FILE ID (Y/N)                          
VSLNTAB  DS    A                                                                
SLNADDR  DS    A                                                                
EQVAGY   DS    CL2                                                              
EQVMED   DS    CL1                                                              
EQVSECS  DS    XL1                                                              
VGETBUY  DS    V                                                                
VBLDMGN  DS    V                                                                
VNONTNMS DS    V                   POL NONT DEMO NAMES                          
VCOMINTER DS   V                                                                
COMSCORE DS    C                   C'Y'=COMSCORE DEMOS IN REQUEST               
COMSCRSD DS    C                   COMSCORE SURVEY DATES FROM POL EST           
COMSCRBT DS    C                   COMSCORE BOOKTYPE FROM POL EST               
         DS    C                   SPARE                                        
VDEMEXT  DS    V                   A(SPDEMEXT)                                  
VPOL50EL DS    V                   A(POL NONT DEMO 50 ELEM)                     
PROFSTW  DS    CL1                 "STW ESTIMATES ON I2" FIELD FROM I2N         
         DS    38C                 SPARE SPACE IN DSECT                         
DEMINDX  DS    XL1                 DEMO INDEX VALUE                             
VCLIST   DS    V                   CLIST ADDRESS                                
VRCPACK  DS    V                   REPCODE PACK/UNPACK                          
VBLDMGA  DS    V                                                                
VSTAPACK DS    V                                                                
VXCHBLK  DS    V                   V(EXTENDED XCHAREA) USE SPXCHAREA            
VFAXINFO DS    V                   V(FAX INFO BLOCK)                            
VFAXLINK DS    V                   V(FAXLINK)                                   
SPBVAL   DS    V                   V(SPBVAL) - BILL VALUE MODULE                
MBOSS    DS    V                   V(MBOSS) MEDIABASE INITIALISER               
XMSF     DS    F                   THIS FIELD COMPUTED BY MEDGETBY              
*                                  EXCHANGED CURRENCY VALUES                    
XGROSS   DS    F                                                                
XNET     DS    F                                                                
XTAX     DS    F                                                                
XC58     DS    F                   ONLY IF CANADIAN $ REQUEST                   
XGSTCODE DS    C                                                                
XGSTRATE DS    XL3                                                              
XGSTAMT  DS    F                                                                
XGSTAMTX DS    F                                                                
         DS    F                                                                
QAREA2   DS    0CL80               REQUEST CARD 2 DATA AREA                     
QCRRNCY  DS    CL1     COL 01      CURRENCY OVRD - U=US,C=CANADA                
QLANG    DS    CL1         02      LANGUAGE (C'F' FOR FRENCH)                   
QGST     DS    CL1         03      C'I OR Y' = INCLUDE INPUT GST                
*                                  C'O'      = INCLUDE OUTPUT GST               
QCBLDEM  DS    CL1         04      F=FUSION,N=NSI,0=NONE,L=ONLY IF LPM          
QCLGID   DS    CL1         05      CLTGRP ID                                    
QCLGRP   DS    CL4         06      CLTGRP NUMBER                                
QPTNR    DS    CL3         10      PARTNER PRODUCT                              
QCBLNET  DS    CL3         13      CABLE NETWORK                                
QCOST2   DS    CL1         16      REPORT COST2 DOLLARS                         
QETYPE   DS    CL1         17      IF NOT C' ', MATCH ETYPE                     
QMGA     DS    CL1         18      PRINT MAKEGOOD ANALYSIS                      
QPWCV    DS    CL1         19      PW CLIENT VERSION                            
QORIGBUY DS    CL1         20      C'Y'= OR BUY MEDIA CODE X'08'                
Q2USER   DS    CL50        21      THESE ARE FOR USE BY PROGRAMS                
Q2BOOK2  DS    CL4         71      SHARE BOOK FOR UPGRADES                      
Q2BTYPE  DS    CL1         75      BOOK TYPE FOR UPGRADES                       
Q2INDEX  DS    CL1         76      INDEX FOR HPT PUT/INDEX UPGRADE              
Q2TRADE  DS    CL1         77      FOR WIFM, COMBINE TRADE (Y/N)                
* FOLLOWING 2 FIELDS USED BY SPACTBKSR                                          
Q2LPMWK  DS    CL1         78      Y=REPORT LPM WKLY, N=SUPPRESS                
Q2OVNITE DS    CL1         79      Y=REPORT OVERNITES, N=SUPPRESS               
*                                                                               
Q2DEMDEC DS    CL1         80      Y=2 DEC RTGS, N=1 DEC RTGS                   
DICTATE  DS    V                   A(DICTATE)                                   
CUREDIT  DS    V                   A(CUREDIT)                                   
GETBF    DS    V                                                                
SVBUYNAM DS    CL12                SEE RQGETNAM - BUYER NAME                    
SVBILNAM DS    CL12                SEE RQGETNAM - BILLER NAME                   
CMLTAB   DS    V                   CMLTAB ADDRESS                               
CMLTABX  DS    V                   CMLTAB END ADDRESS                           
CMLPTR   DS    A                   CURRENT CMLTAB POINTER                       
CONFID   DS    V                                                                
         DS    D                                                                
SPACEND  DS    0D                  START OF REMAINING WORK SPACE                
         EJECT                                                                  
