*          DATA SET SPRESC3D   AT LEVEL 005 AS OF 04/21/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FC3D      DATE 04/21/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y              
STAMEDH  DS    CL8                                                              
STAMED   DS    CL2      6   11    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6   20    6  A   P    N         T        Y              
STASRCH  DS    CL8                                                              
STASRC   DS    CL6      6   28    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  A   P    N         T        Y              
STASTAH  DS    CL8                                                              
STASTA   DS    CL8      6   46    8  A   U    N         T        Y              
STAMKTH  DS    CL8                                                              
STAMKT   DS    CL25     6   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
STAHDLNH DS    CL8                                                              
STAHDLN  DS    CL75     8    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   U    N         T        Y              
STALN1H  DS    CL8                                                              
STALN1   DS    CL75     9    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    10    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    11    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    12    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    13    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    14    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    15    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    16    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    17    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    18    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    19    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    20    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    21    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    22    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL75    23    4   75  A   P    N         T        Y              
STALAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
STAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1464 BYTES                            
