*          DATA SET SPREPDGLC  AT LEVEL 001 AS OF 07/26/04                      
* THIS DATASET INCLUDED IN SPREPDG02 TO AVOID LOWERCASE IN PROGRAM              
*                                                                               
         DS    0D                                                               
AVLHLQ   DC    C'/u/bde2/pgmx/outbound/'                                        
AVLNAME  DC    CL40' '             MAX DSN CHARS                                
*                                                                               
         DS    0D                                                               
DTLHLQ   DC    C'/u/bde2/pgmx/outbound/'                                        
DTLNAME  DC    CL32' '             MAX DSN CHARS                                
