*          DATA SET SPREQFCXD  AT LEVEL 001 AS OF 04/20/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T208FCD      DATE 04/20/90                 
         SPACE 1                                                                
T208FCD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MNUSTRTH DS    CL8                                                              
MNUSTRT  DS    CL25     7    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     7   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     7   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     8    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     8   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     8   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     9    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     9   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     9   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    10    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    10   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    10   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    11    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    11   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    11   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    12    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    12   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    12   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    13    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    13   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    13   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    14    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    14   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    14   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    15    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    15   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    15   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    16    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    16   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    16   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    17    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    17   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    17   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    18    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    18   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    18   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    19    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    19   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    19   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    20    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    20   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    20   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    21    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    21   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    21   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    22    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    22   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    22   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    23    1   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    23   28   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    23   55   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24    1    1  A   P    N         T        Y              
MNULAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
MNUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1760 BYTES                            
