*          DATA SET SPRESD5D   AT LEVEL 011 AS OF 03/15/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FD5D      DATE 03/15/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    N         T        Y              
RESSRCEH DS    CL8                                                              
RESSRCE  DS    CL8      7   13    8  A   U    N         T        Y   10         
RESSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
RESBOOKH DS    CL8                                                              
RESBOOK  DS    CL60     8   13   60  A   U    N         T        Y   20         
RESBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9    2   10  A   P    N         T        Y              
RESSTATH DS    CL8                                                              
RESSTAT  DS    CL10     9   13   10  A   U    N         T        Y   40         
RESSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9   25   10  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9   37   10  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9   49   10  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9   61   10  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    10   13   10  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    10   25   10  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    10   37   10  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     11    2    9  A   P    N         T        Y              
RESDAYH  DS    CL8                                                              
RESDAY   DS    CL8     11   13    8  A   U    N         T        Y   50         
RESDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11   23   12  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   13    8  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12   23   12  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   13    8  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13   23   12  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   13    8  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    14   23   12  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   13    8  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   23   12  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   13    8  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16   23   12  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17    2    7  A   P    N         T        Y              
RESDETH  DS    CL8                                                              
RESDET   DS    CL40    17   13   40  A   U    N         T        Y  120         
RESDETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18    2    8  A   P    N         T        Y              
RESAVEH  DS    CL8                                                              
RESAVE   DS    CL40    18   13   40  A   U    N         T        Y  130         
RESAVEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19    2    6  A   P    N         T        Y              
RESDEMOH DS    CL8                                                              
RESDEMO  DS    CL60    19   13   60  A   U    N         T        Y   30         
RESDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20    2    8  A   P    N         T        Y              
RESOPTH  DS    CL8                                                              
RESOPT   DS    CL60    20   13   60  A   U    N         T        Y  100         
RESOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     21    2    9  A   P    N         T        Y              
RESFILTH DS    CL8                                                              
RESFILT  DS    CL60    21   13   60  A   U    N         T        Y   75         
RESFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     22    2    9  A   P    N         T        Y              
RESTTLH  DS    CL8                                                              
RESTTL   DS    CL50    22   13   50  A   U    N         T        Y   70         
RESTTLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   13    1  A   U    N         T        Y              
RESLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RESWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
