*          DATA SET SPRESD3D   AT LEVEL 019 AS OF 08/03/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FD3D      DATE 08/03/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A   P    N         T        Y              
RNKSRCEH DS    CL8                                                              
RNKSRCE  DS    CL8      7   18    8  A   U    N         T        Y   10         
RNKSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   P    N         T        Y              
RNKBOOKH DS    CL8                                                              
RNKBOOK  DS    CL40     8   18   40  A   U    N         T        Y   20         
RNKBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     9    2   14  A   P    N         T        Y              
RNKMAXH  DS    CL8                                                              
RNKMAX   DS    CL8      9   18    8  A   U    N         T        Y   41         
RNKMAXX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30     9   28   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  A   P    N         T        Y              
RNKMKTH  DS    CL8                                                              
RNKMKT   DS    CL8     10   18    8  A   U    N         T        Y   42         
RNKMKTX  DS    CL8                                                              
RNKMKTNH DS    CL8                                                              
RNKMKTN  DS    CL30    10   28   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    11    2   15  A   P    N         T        Y              
RNKSTATH DS    CL8                                                              
RNKSTAT  DS    CL7     11   18    7  A   U    N         T        Y   40         
RNKSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   28    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   38    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   48    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   58    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   68    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   18    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   28    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   38    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   48    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   58    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   68    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13    2   11  A   P    N         T        Y              
RNKDEMOH DS    CL8                                                              
RNKDEMO  DS    CL40    13   18   40  A   U    N         T        Y   30         
RNKDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14    2   10  A   P    N         T        Y              
RNKCATSH DS    CL8                                                              
RNKCATS  DS    CL40    14   18   40  A   U    N         T        Y   31         
RNKCATSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    15    2   15  A   P    N         T        Y              
RNKDPTH  DS    CL8                                                              
RNKDPT   DS    CL60    15   18   60  A   U    N         T        Y   51         
RNKDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16    2    8  A   P    N         T        Y              
RNKOPTH  DS    CL8                                                              
RNKOPT   DS    CL60    16   18   60  A   U    N         T        Y  100         
RNKOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     17    2    9  A   P    N         T        Y              
RNKFILTH DS    CL8                                                              
RNKFILT  DS    CL60    17   18   60  A   U    N         T        Y   75         
RNKFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18    2   12  A   P    N         T        Y              
RNKTTLH  DS    CL8                                                              
RNKTTL   DS    CL40    18   18   40  A   U    N         T        Y   70         
RNKTTLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19    2   10  A   P    N         T        Y              
RNKUL1H  DS    CL8                                                              
RNKUL1   DS    CL60    19   18   60  A   U    N         T        Y   71         
RNKUL1X  DS    CL8                                                              
RNKUL2H  DS    CL8                                                              
RNKUL2   DS    CL60    20   18   60  A   U    N         T        Y   71         
RNKUL2X  DS    CL8                                                              
RNKUL3H  DS    CL8                                                              
RNKUL3   DS    CL60    21   18   60  A   U    N         T        Y   71         
RNKUL3X  DS    CL8                                                              
RNKLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RNKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1456 BYTES                            
