*          DATA SET SPREQFFBD  AT LEVEL 004 AS OF 02/26/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T208FFD      DATE 02/26/93                 
         SPACE 1                                                                
T208FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BVRHDRH  DS    CL8                                                              
BVRHDR   DS    CL60     1    2   60  A  P N             T        Y              
BVRSRVH  DS    CL8                                                              
BVRSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14     3    2   14  A  P N             T        Y              
BVRNAMEH DS    CL8                                                              
BVRNAME  DS    CL17     3   21   17  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL10     4    2   10  A  P N             T        Y              
BVRNUMH  DS    CL8                                                              
BVRNUM   DS    CL11     4   21   11  A  U N             T        Y              
BVRRNAMH DS    CL8                                                              
BVRRNAM  DS    CL22     4   42   22  A  P N             N        Y              
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
BVRMEDH  DS    CL8                                                              
BVRMED   DS    CL2      5   21    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     5   25   11  A  P N             T        Y              
BVRDESTH DS    CL8                                                              
BVRDEST  DS    CL10     5   38   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     5   50   11  A  P N             T        Y              
BVROUTH  DS    CL8                                                              
BVROUT   DS    CL10     5   63   10  A  U N             T        Y              
BVRFRSTH DS    CL8                                                              
BVRFRST  DS    CL1      5   76    1  A  U N             T        Y              
BVRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BVRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 384  BYTES                            
