*          DATA SET SPRESE5D   AT LEVEL 010 AS OF 03/07/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FE5D      DATE 03/07/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      6    2    9  A   P    H         T        Y              
CBLMKTH  DS    CL8                                                              
CBLMKT   DS    CL3      6   12    3  A   U    N         T    I   Y              
CBLMKTNH DS    CL8                                                              
CBLMKTN  DS    CL15     6   21   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13     6   38   13  A   P    H         T        Y              
CBLSRCEH DS    CL8                                                              
CBLSRCE  DS    CL3      6   52    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      6   58    9  A   P    H         T        Y              
CBLBTYPH DS    CL8                                                              
CBLBTYP  DS    CL1      6   68    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    H         T        Y              
CBLNAMH  DS    CL8                                                              
CBLNAM   DS    CL5      7   12    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7   20    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7   21   11  A   P    H         T        Y              
CBLDESCH DS    CL8                                                              
CBLDESC  DS    CL24     7   33   24  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9   16    8  A   P    N         T        Y              
CBLCMB1H DS    CL8                                                              
CBLCMB1  DS    CL9     11    2    9  A   U    N         T        Y              
CBLST11H DS    CL8                                                              
CBLST11  DS    CL7     11   16    7  A   U    N         T        Y              
CBLST12H DS    CL8                                                              
CBLST12  DS    CL7     11   25    7  A   U    N         T        Y              
CBLST13H DS    CL8                                                              
CBLST13  DS    CL7     11   34    7  A   U    N         T        Y              
CBLST14H DS    CL8                                                              
CBLST14  DS    CL7     11   43    7  A   U    N         T        Y              
CBLST15H DS    CL8                                                              
CBLST15  DS    CL7     11   52    7  A   U    N         T        Y              
CBLST16H DS    CL8                                                              
CBLST16  DS    CL7     11   61    7  A   U    N         T        Y              
CBLST17H DS    CL8                                                              
CBLST17  DS    CL7     11   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     12    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     13    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     14    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     15    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     16    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     17    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     18    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     19    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     20    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   70    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     21    2    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   16    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   25    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   34    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   52    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   61    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   70    7  A   U    N         T        Y              
CBLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CBLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1576 BYTES                            
