*          DATA SET SPREQFCBD  AT LEVEL 003 AS OF 01/04/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T208FCD      DATE 01/04/88                 
         SPACE 1                                                                
T208FCD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL22     7    2   22  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL22     7   29   22  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     7   56   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24     8    2   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14     8   29   14  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23     8   56   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL21     9    2   21  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23     9   29   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24     9   56   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    10    2   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    10   29   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    10   56   19  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL21    11    2   21  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    11   29   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23    11   56   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    12    2   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    12   29   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    12   56   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    13    2   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL21    13   29   21  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL22    13   56   22  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23    14    2   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    14   29   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23    14   56   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15    2   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    15   29   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    15   56   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    16    2   19  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23    16   29   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL21    16   56   21  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    17    2   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    17   29   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    17   56   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    18    2   19  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL21    18   29   21  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23    18   56   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25    19    2   25  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    19   29   19  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23    19   56   23  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    20    2   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    20   29   19  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    20   56   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    21    2   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL23    21   29   23  A   P    N         T        Y              
MNULAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
MNUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1343 BYTES                            
