*          DATA SET SPRESA3D   AT LEVEL 012 AS OF 08/17/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FA3D      DATE 08/17/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RMKMKIDH DS    CL8                                                              
RMKMKID  DS    CL4      5    2    4  A   P    Z         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
RMKMK1H  DS    CL8                                                              
RMKMK1   DS    CL1      6    2    1  A   U    N    M    T    I   Y              
RMKMKA1H DS    CL8                                                              
RMKMKA1  DS    CL17     6    4   17  A   P    N         T        Y              
RMKMK2H  DS    CL8                                                              
RMKMK2   DS    CL1      6   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     6   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     6   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     7    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     7   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     7   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     8    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     8   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     8   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     9    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     9   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     9   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    10    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    10   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    10   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    11    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    11   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    11   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    12    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    12   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    12   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    13    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    13   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    13   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    14    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    14   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    14   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    15    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    15   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    15   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    16    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    16   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    16   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    17    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    17   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    17   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    18    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    18   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    18   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    19    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    19   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    19   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    20    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    20   29   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    20   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    21    4   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   27    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    21   29   17  A   P    N         T        Y              
RMKMKLH  DS    CL8                                                              
RMKMKL   DS    CL1     21   52    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    21   54   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL27    22   21   27  A   P    N         T        Y              
RMKLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RMKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1712 BYTES                            
