*          DATA SET SPRESDAD   AT LEVEL 004 AS OF 08/17/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FDAD      DATE 08/17/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A   P    N         T        Y              
HRSSRCEH DS    CL8                                                              
HRSSRCE  DS    CL8      7   21    8  A   U    N         T        Y   10         
HRSSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   P    N         T        Y              
HRSBOOKH DS    CL8                                                              
HRSBOOK  DS    CL40     8   21   40  A   U    N         T        Y   20         
HRSBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     9    2   14  A   P    N         T        Y              
HRSMAXH  DS    CL8                                                              
HRSMAX   DS    CL2      9   21    2  A   U    N         T        Y   41         
HRSMAXX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27     9   38   27  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A   P    N         T        Y              
HRSMKTH  DS    CL8                                                              
HRSMKT   DS    CL8     10   21    8  A   U    N         T        Y   42         
HRSMKTX  DS    CL8                                                              
HRSMKTNH DS    CL8                                                              
HRSMKTN  DS    CL30    10   31   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    11    2   15  A   P    N         T        Y              
HRSSTATH DS    CL8                                                              
HRSSTAT  DS    CL30    11   21   30  A   U    N         T        Y   40         
HRSSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13    2    4  A   P    N         T        Y              
HRSDEMOH DS    CL8                                                              
HRSDEMO  DS    CL64    13   10   64  A   U    N         T        Y   30         
HRSDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    N         T        Y              
HRSCATSH DS    CL8                                                              
HRSCATS  DS    CL10    14   18   10  A   U    N         T        Y   31         
HRSCATSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     14   30    9  A   P    N         T        Y              
HRSRDEMH DS    CL8                                                              
HRSRDEM  DS    CL9     14   42    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   54   10  A   P    N         T        Y              
HRSIDEMH DS    CL8                                                              
HRSIDEM  DS    CL9     14   66    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A   P    N         T        Y              
HRSOPTH  DS    CL8                                                              
HRSOPT   DS    CL60    15   18   60  A   U    N         T        Y  100         
HRSOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     16    2    9  A   P    N         T        Y              
HRSFILTH DS    CL8                                                              
HRSFILT  DS    CL60    16   18   60  A   U    N         T        Y   75         
HRSFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17    2   12  A   P    N         T        Y              
HRSTTLH  DS    CL8                                                              
HRSTTL   DS    CL40    17   18   40  A   U    N         T        Y   70         
HRSTTLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19    2   10  A   P    N         T        Y              
HRSUL1H  DS    CL8                                                              
HRSUL1   DS    CL60    19   18   60  A   U    N         T        Y   71         
HRSUL1X  DS    CL8                                                              
HRSUL2H  DS    CL8                                                              
HRSUL2   DS    CL60    20   18   60  A   U    N         T        Y   71         
HRSUL2X  DS    CL8                                                              
HRSUL3H  DS    CL8                                                              
HRSUL3   DS    CL60    21   18   60  A   U    N         T        Y   71         
HRSUL3X  DS    CL8                                                              
HRSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HRSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1160 BYTES                            
