*          DATA SET SPRESD9D   AT LEVEL 007 AS OF 12/04/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FD9D      DATE 12/04/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A   P    N         T        Y              
HRSSRCEH DS    CL8                                                              
HRSSRCE  DS    CL8      7   18    8  A   U    N         T        Y   10         
HRSSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   P    N         T        Y              
HRSBOOKH DS    CL8                                                              
HRSBOOK  DS    CL40     8   18   40  A   U    N         T        Y   20         
HRSBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A   P    N         T        Y              
HRSMKTH  DS    CL8                                                              
HRSMKT   DS    CL8      9   18    8  A   U    N         T        Y   42         
HRSMKTX  DS    CL8                                                              
HRSMKTNH DS    CL8                                                              
HRSMKTN  DS    CL30     9   28   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
HRSSTATH DS    CL8                                                              
HRSSTAT  DS    CL30    10   18   30  A   U    N         T        Y   40         
HRSSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11    2   11  A   P    N         T        Y              
HRSDEMOH DS    CL8                                                              
HRSDEMO  DS    CL40    11   18   40  A   U    N         T        Y   30         
HRSDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    12    2   10  A   P    N         T        Y              
HRSCATSH DS    CL8                                                              
HRSCATS  DS    CL40    12   18   40  A   U    N         T        Y   31         
HRSCATSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13    2    8  A   P    N         T        Y              
HRSOPTH  DS    CL8                                                              
HRSOPT   DS    CL60    13   18   60  A   U    N         T        Y  100         
HRSOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     14    2    9  A   P    N         T        Y              
HRSFILTH DS    CL8                                                              
HRSFILT  DS    CL60    14   18   60  A   U    N         T        Y   75         
HRSFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15    2   12  A   P    N         T        Y              
HRSTTLH  DS    CL8                                                              
HRSTTL   DS    CL40    15   18   40  A   U    N         T        Y   70         
HRSTTLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16    2   10  A   P    N         T        Y              
HRSUL1H  DS    CL8                                                              
HRSUL1   DS    CL60    16   18   60  A   U    N         T        Y   71         
HRSUL1X  DS    CL8                                                              
HRSUL2H  DS    CL8                                                              
HRSUL2   DS    CL60    17   18   60  A   U    N         T        Y   71         
HRSUL2X  DS    CL8                                                              
HRSUL3H  DS    CL8                                                              
HRSUL3   DS    CL60    18   18   60  A   U    N         T        Y   71         
HRSUL3X  DS    CL8                                                              
HRSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HRSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1024 BYTES                            
