*          DATA SET SPRESD1D   AT LEVEL 002 AS OF 09/08/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FD1D      DATE 09/08/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
PURSRCEH DS    CL8                                                              
PURSRCE  DS    CL24     6   13   24  A   U    N         T    I   Y   10         
PURSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   60    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    N         T        Y              
PURBOOKH DS    CL8                                                              
PURBOOK  DS    CL24     7   13   24  A   U    N         T        Y   20         
PURBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      8    2    5  A   P    N         T        Y              
PURDEMOH DS    CL8                                                              
PURDEMO  DS    CL50     8   13   50  A   U    N         T        Y   30         
PURDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A   P    N         T        Y              
PURSTATH DS    CL8                                                              
PURSTAT  DS    CL7     10   13    7  A   U    N         T        Y   40         
PURSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   33    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   13    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   23    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   33    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
PUROPT2H DS    CL8                                                              
PUROPT2  DS    CL2     13   13    2  A   U    N         T        Y   60         
PUROPT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL33    13   22   33  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
PURSTIMH DS    CL8                                                              
PURSTIM  DS    CL7     14   13    7  A   U    N         T        Y   70         
PURSTIMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15    2    8  A   P    N         T        Y              
PURETIMH DS    CL8                                                              
PURETIM  DS    CL7     15   13    7  A   U    N         T        Y   80         
PURETIMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   13    1  A   U    N         T        Y              
PURLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PURWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 501  BYTES                            
