*          DATA SET SPRESD7D   AT LEVEL 008 AS OF 04/18/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FD7D      DATE 04/18/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A   P    N         T        Y              
TRESRCEH DS    CL8                                                              
TRESRCE  DS    CL8      7   18    8  A   U    N         T        Y   10         
TRESRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   P    N         T        Y              
TREBOOKH DS    CL8                                                              
TREBOOK  DS    CL40     8   18   40  A   U    N         T        Y   20         
TREBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    10    2   14  A   P    N         T        Y              
TREMAXH  DS    CL8                                                              
TREMAX   DS    CL8     10   18    8  A   U    N         T        Y   41         
TREMAXX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    10   28   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A   P    N         T        Y              
TREMKTH  DS    CL8                                                              
TREMKT   DS    CL8     11   18    8  A   U    N         T        Y   42         
TREMKTX  DS    CL8                                                              
TREMKTNH DS    CL8                                                              
TREMKTN  DS    CL30    11   28   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    12    2   15  A   P    N         T        Y              
TRESTATH DS    CL8                                                              
TRESTAT  DS    CL7     12   18    7  A   U    N         T        Y   40         
TRESTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   28    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   38    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   48    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   58    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12   68    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   18    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   28    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   38    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   48    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   58    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   68    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15    2   11  A   P    N         T        Y              
TREDEMOH DS    CL8                                                              
TREDEMO  DS    CL8     15   18    8  A   U    N         T        Y   30         
TREDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    16    2   13  A   P    N         T        Y              
TRECATH  DS    CL8                                                              
TRECAT   DS    CL40    16   18   40  A   U    N         T        Y   31         
TRECATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    17    2   15  A   P    N         T        Y              
TREDPTH  DS    CL8                                                              
TREDPT   DS    CL60    17   18   60  A   U    N         T        Y   51         
TREDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18    2    8  A   P    N         T        Y              
TREOPTH  DS    CL8                                                              
TREOPT   DS    CL60    18   18   60  A   U    N         T        Y  100         
TREOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19    2    9  A   P    N         T        Y              
TREFILTH DS    CL8                                                              
TREFILT  DS    CL60    19   18   60  A   U    N         T        Y   75         
TREFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20    2   12  A   P    N         T        Y              
TRETTLH  DS    CL8                                                              
TRETTL   DS    CL40    20   18   40  A   U    N         T        Y   70         
TRETTLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    21    2   10  A   P    N         T        Y              
TREUL1H  DS    CL8                                                              
TREUL1   DS    CL60    21   18   60  A   U    N         T        Y   71         
TREUL1X  DS    CL8                                                              
TREUL2H  DS    CL8                                                              
TREUL2   DS    CL60    22   18   60  A   U    N         T        Y   71         
TREUL2X  DS    CL8                                                              
TREUL3H  DS    CL8                                                              
TREUL3   DS    CL60    23   18   60  A   U    N         T        Y   71         
TREUL3X  DS    CL8                                                              
TRELAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TREWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1424 BYTES                            
