*          DATA SET SPREPI2WKN AT LEVEL 135 AS OF 02/22/21                      
*                             ORDERED/INVOICE DETAIL LINE DSECT                 
*                             ** LNA **                                         
LNAD     DSECT                                                                  
LNA      DS    0CL132              LINE A DSECT                                 
LNAORD   DS    0CL83               ORDERED DATA                                 
         DS    CL5                                                              
LNADTE   DS    CL11                                                             
         DS    CL1                 -1                                           
LNADAYS  DS    CL8                                                              
         DS    CL1                 -1                                           
LNATIM   DS    CL11                                                             
         DS    CL1                 -1                                           
LNALEN   DS    CL3                                                              
         DS    CL1                 -1                                           
LNAPRD   DS    CL7                                                              
         DS    CL1                                                              
LNACOST  DS    CL11                                                             
         DS    CL2                                                              
LNAESTL  DS    CL7                                                              
LNAIND   DS    CL1                                                              
LNAREP   DS    CL3                                                              
LNAROT   DS    CL5                                                              
*                                  INVOICE DATA                                 
LNAIDTE  DS    CL5                                                              
         DS    CL2                                                              
LNAIDAY  DS    CL3                                                              
         DS    CL2                                                              
LNAITIM  DS    CL5                                                              
         DS    CL2                                                              
LNAICOST DS    CL9                                                              
         ORG   LNAICOST                                                         
LNAIFILM DS    CL12                                                             
         DS    CL1                                                              
LNAEDEM  DS    CL6                                                              
         DS    CL1                                                              
LNAADEM  DS    CL6                                                              
         DS    CL1                                                              
LNADNAM  DS    CL7                                                              
         SPACE 3                                                                
*                                  UNORDERED SPOT DETAIL LINE                   
*                                  ** LNB **                                    
LNBD     DSECT                                                                  
LNB      DS    0CL132                                                           
         DS    CL05                                                             
LNBDTE   DS    CL5                                                              
         DS    CL3                                                              
LNBDAY   DS    CL3                                                              
         DS    CL3                                                              
LNBTIM   DS    CL5                                                              
         DS    CL3                                                              
LNBLEN   DS    CL3                                                              
         DS    CL3                                                              
LNBPRD   DS    CL7                                                              
         DS    CL2                                                              
LNBCOST  DS    CL11                                                             
         DS    CL3                                                              
LNBNTWK  DS    CL3                                                              
         ORG   LNBNTWK                                                          
LNBPKG   DS    CL3                                                              
         DS    CL3                                                              
LNBFILM  DS    CL12                                                             
         DS    CL3                                                              
LNBADEM  DS    CL4                                                              
         ORG   LNBADEM                                                          
LNBIREP  DS    CL3                                                              
         ORG                                                                    
         DS    CL3                                                              
LNBINV   DS    CL10                                                             
         DS    CL2                                                              
LNBERRS  DS    CL10                                                             
         DS    CL41                                                             
         SPACE 2                                                                
*                                  TOTALS LINE DSECT                            
*                                  ** LNC **                                    
LNCD     DSECT                                                                  
LNC      DS    0CL132                                                           
         DS    CL05                                                             
LNCWDS   DS    CL20                                                             
         DS    CL5                                                              
LNCSPTS  DS    CL5                                                              
         DS    CL3                                                              
LNCGRS   DS    CL14                                                             
         DS    CL1                                                              
LNCNET   DS    CL14                                                             
         DS    CL1                                                              
LNCRESP  DS    CL14                                                             
         DS    CL65                                                             
         SPACE 2                                                                
*                                  FILM REPORT LINE DSECT                       
LNFD     DSECT                                                                  
LNFDESC  DS    CL40                                                             
         DS    CL1                                                              
LNFROT   DS    CL3                                                              
LNFFILM  DS    CL8                                                              
         DS    CL5                                                              
LNFPCT   DS    CL3                                                              
         DS    CL6                                                              
LNFAPCT  DS    CL3                                                              
         DS    CL3                                                              
LNFINDX  DS    CL4                                                              
         DS    CL2                                                              
LNFSSHR  DS    CL4                                                              
         DS    CL3                                                              
LNFSACT  DS    CL4                                                              
         DS    CL1                                                              
LNFOTHR  DS    0C                                                               
         SPACE 2                                                                
*                                  SUMMARY LINE DSECT                           
SLD      DSECT                                                                  
SLPER    DS    CL14                                                             
         DS    CL1                                                              
SLSTA    DS    CL8                                                              
         DS    CL1                                                              
SLMKT    DS    CL4                                                              
         DS    CL1                                                              
SLMNAM   DS    CL24                                                             
         DS    CL1                                                              
SLPRD    DS    CL11                                                             
         DS    CL1                                                              
SLEST    DS    CL7                                                              
         DS    CL1                                                              
SLSTATUS DS    CL11                                                             
         DS    CL1                                                              
SLSPTS   DS    CL4                                                              
         DS    CL1                                                              
SLGRS    DS    CL13                                                             
SLNET    DS    CL13                                                             
         DS    CL4                                                              
SLPAID   DS    CL3                                                              
         DS    CL4                                                              
         ORG   SLPAID-3                                                         
SLRESP   DS    CL9                 RESPONSE COUNT OVERLAYS PAID COUNT           
         ORG                                                                    
SLPAGE   DS    CL4                                                              
*                                                                               
DTABD    DSECT                                                                  
DTABCOD  DS    XL3                                                              
DTABNAM  DS    CL7                                                              
         DS    XL2                                                              
DTABEST  DS    XL4                                                              
DTABOACH DS    XL4                                                              
DTABUACH DS    XL4                                                              
*                                                                               
DTABEL   EQU   *-DTABD                                                          
         SPACE 2                                                                
SREPD    DSECT                                                                  
SREPCOD  DS    CL2                                                              
SREPOGRS DS    XL4                                                              
SREPMGRS DS    XL4                                                              
SREPONET DS    XL4                                                              
SREPMNET DS    XL4                                                              
SREPNAM  DS    CL22                                                             
*                                                                               
SREPL    EQU   *-SREPD                                                          
         SPACE 2                                                                
BUYRTABD DSECT                                                                  
BUYRPRD  DS    X                                                                
BUYREST  DS    X                                                                
BUYRLINE DS    XL2                                                              
BUYRDA   DS    XL4                                                              
BUYRCOM  DS    XL4                                                              
BUYRTBEL EQU   *-BUYRTABD                                                       
         SPACE 2                                                                
MAXFLMS  EQU   1000                MAX FILMS FROM INVOICES                      
NPROVS   EQU   10                  CANADIAN PROVINCES                           
         SPACE 3                                                                
         EJECT                                                                  
*                                                                               
IMRWORK  DSECT                                                                  
*                                                                               
ABYBLD   DS    A                                                                
AINVBLD  DS    A                                                                
AMATCH   DS    A                                                                
APOST    DS    A                                                                
AICSOLR  DS    A                                                                
ACHKROT  DS    A                                                                
AIRTOTS  DS    A                                                                
AACHDEM  DS    A                                                                
AIRSUM   DS    A                                                                
AIMRHEAD DS    A                                                                
TIMUNPK  DS    A                                                                
AIRPRT   DS    A                                                                
AADDEL   DS    A                                                                
ACOMTAB  DS    A                                                                
ACOMTABX DS    A                                                                
         DS    A              SPARE                                             
         DS    A              SPARE                                             
AIRORB   DS    A                                                                
AIRSTAT  DS    A                                                                
AFDEM    DS    A                                                                
AFILMTOT DS    A                                                                
AGETCPAT DS    A                                                                
ATSCAN   DS    A                                                                
ABUFFC   DS    A                                                                
AIDLIST  DS    A                                                                
ASTNLIST DS    A                                                                
ADSTEQ   DS    A                                                                
AINOLST  DS    A                                                                
APIGLIST DS    A                                                                
AFRPTBUF DS    A                                                                
AFRPTBFX DS    A                                                                
AIKLIST  DS    A                                                                
ABUFFRIN DS    A                                                                
ABUFFRN2 DS    A                                                                
AFLTTAB  DS    A                                                                
APRDTAB  DS    A                                                                
         DS    A              SPARE                                             
*                                                                               
RELO     DS    A                                                                
*                                                                               
MGTBPARS DS    6F             BINSRCH PARS FOR MGR NAME TAB                     
SUMPARS  DS    6F             BINSRCH PARS FOR SUMMARY TABLE                    
MKTBPARS DS    6F                              MKT NAME TABLE                   
SREPPARS DS    6F                              SREP TABLE                       
DEMPARS  DS    6F                              DEMO TABLE                       
BUYRPARS DS    6F                              BUY REC TAB                      
STNLPARS DS    6F                              STATION LIST                     
FLMTPARS DS    6F                              FILM TABLE                       
*                                                                               
         ORG   MGTBPARS+4                                                       
APATREF  DS    A                   DOUBLES AS PATTERN REF# TABLE                
         ORG   FLMTPARS+4                                                       
AFLMTAB  DS    A                                                                
         ORG   DEMPARS+4                                                        
ADEMTAB  DS    A                                                                
         ORG                                                                    
APATLNS  DS    A                                                                
AFLMRUN  DS    A                                                                
*                                                                               
SAVMAX   DS    X                                                                
SAVSPROG DS    X                                                                
SAVSPCNG DS    X                                                                
DOTS     DS    CL20'.'                                                          
DASHES   DS    CL20'-'                                                          
FNPROF   DS    XL16                                                             
I2XPROF  DS    XL16                                                             
*                                                                               
TRAFPROF DS    XL16                                                             
TRAFSW   EQU   TRAFPROF+0                                                       
TRAFPOST EQU   TRAFPROF+1                                                       
TRAFFRPT EQU   TRAFPROF+2          OPTION FOR FILM USE REP                      
TRAFSEP  EQU   TRAFPROF+3          SEP PAGE FOR FILM REPORT                     
TRAFROT  EQU   TRAFPROF+4          PRINT ROTATION PATTERN                       
TRAFCST  EQU   TRAFPROF+5          FILM COST OPTION                             
TRAFDEM  EQU   TRAFPROF+6          FILM DELIVERY OPTION                         
TRAFDSCP EQU   TRAFPROF+7          TREAT FILM ERRS AS DISCREPANCIES             
TRAFMBF  EQU   TRAFPROF+8          MATCH BY FILM                                
TRAFRCLO EQU   TRAFPROF+9          DISCREPANT IF DATE OUT OF RANGE              
TRAFIDSC EQU   TRAFPROF+10         DISCREPANT IF INVALID FILM                   
TRAF9YR  EQU   TRAFPROF+11         MATCH BY FILM (FLD9) EFFECT YEAR             
TRAF9MON EQU   TRAFPROF+12         MATCH BY FILM EFFECT MONTH                   
*                                                                               
T0PROF   DS    XL16                                                             
*                                                                               
         DS    0F                                                               
CILASTS  DS    0CL10                                                            
CILPRD   DS    XL1                                                              
CILNET   DS    XL1                                                              
CILTIM   DS    H                                                                
CILDAT   DS    XL3                                                              
CILNTPRD DS    XL3                                                              
*                                                                               
CIPINT   DS    H                                                                
CISINT   DS    H                                                                
*                                                                               
RMCALL   DS    CL1                                                              
I2SPROF  DS    XL16                SEPARATION PROFILE                           
INTCOPT  EQU   I2SPROF+0           INTERVAL CHECKING (N,C,B)                    
INTCPI   EQU   I2SPROF+1           INTERVAL CHECK - PRIMARY INTERVAL            
INTCSI   EQU   I2SPROF+2           INTERVAL CHECK - SECONDRY INTERVAL           
SEQNOPT  DS    X                                                                
I2YPROF  DS    XL16                                                             
MISSOPT  DS    CL1                 MISSED SPOT OPTION                           
MCOMOPT  DS    CL1                 MONTHLY COMMENT OPTION                       
STAXOPT  DS    CL1                 STATION TAX OPTION                           
MCOMSW   DS    CL1                 HAVE MONTH COMMENT                           
SPAGOPT  DS    CL1                 SEP PAGE FOR MATCHED, ONR, RNO               
         DS    CL1                 SPARE                                        
MSROPT   DS    XL1                 MATCH STATUS RECORD OPTION                   
MSRCTL   DS    XL1                 MATCH STATUS CONTROL BITS                    
IBTOT    DS    F                                                                
         DS    CL1                 SPARE                                        
SVPROG   DS    CL2                                                              
BUYIDLN  DS    XL1                 LENGTH OF BUY REC ID COMPARE                 
ACNFLAG  DS    X                                                                
LOOKUP   EQU   X'80'               CHECK IF VALID ACN NO IN STATION EQ          
FNDMKT   EQU   X'40'               FOUND MARKET IN STATION EQ RECORD            
SVIBY    DS    XL3                                                              
PATCH    DS    XL20                                                             
RNAMOPT  DS    CL1                                                              
SNAMOPT  DS    CL1                                                              
SPADSW   DS    C                                                                
SAFFOPT  DS    CL1                                                              
VSPADINT DS    A                                                                
VTRPACK  DS    A                                                                
SVTRACLT DS    XL2                 TRAFFICE OVERRIDE CLIENT                     
BKTYPE   DS    CL1                 DEMO BOOK TYPE                               
MDETOPT  DS    CL1                 SHOW MATCHED DETAILS, Y OR N                 
PSEUDOPT DS    CL1                 P=PSEUDO,R=RESPONSE                          
TWOPRNT  DS    CL1                 Y=2 PRINTOUTS                                
CANADSW  DS    CL1                 Y=CANADA                                     
QCNALL   DS    CL1                                                              
REQLSW   DS    CL1                                                              
CBLHOPT  DS    XL1                 CABLE HEAD OPTION                            
CBLHNMQ  EQU   X'80'                -NEW CABLE HEAD MODE                        
CBLHHDQ  EQU   X'40'                -CABLE HEAD REQ                             
CBLHALQ  EQU   X'20'                -ALL NET REQ                                
CBLHNHQ  EQU   X'C0'                -NEW MODE AND CBH REQ                       
CBLHNHAQ EQU   X'E0'                -NEW MODE AND CBH REQ AND ALL NETS          
CBLHALLQ EQU   X'01'                -ON STA=ALL REPORT NETS SEPARATE            
CBLHSYSQ EQU   X'02'                -ON STA='ALL  ' REP NETS SEPARATE           
*                                                                               
DEFDCHG  DS    CL1           CHANGE DATES ON MATCH OF DEFERRED SPOTS            
CKSORTSW DS    CL1           HOW DID CHKINT SORT INVS?                          
WIPWSW   DS    CL1                                                              
SVINVCT  DS    XL2                    INVOICE COUNT                             
CQSW     DS    X                   'A' MEANS MULTI-CLIENT REQUEST               
IFCODADI DS    X                   IFCOD1/2 ARE AD-ID                           
SVMIRPRO DS    X                   SAVE MIRROR PROFILE                          
IELMLEN  DS    H                   INVOICE ELEMENT LENGTH                       
*                                                                               
CLRSTRT  EQU   *                   CLEAR AFTER HERE AT RUNFRST                  
*                                  (USED TO BE AT NEW REQUEST?)                 
INVCKSW  DS    C                                                                
SVKEY    DS    XL13                                                             
SVSTN    DS    XL3                                                              
SAVEQAMC DS    CL6                                                              
SAVMEDN  DS    CL10                                                             
SAVEQSTR DS    CL12                                                             
SVTRACE  DS    CL1                                                              
DIGITAL  DS    CL1                                                              
         DS    CL1                 SPARE                                        
         DS    0D                                                               
MGADWRK  DS    XL(MGALNQ)                                                       
*                                                                               
SLSTATN  DS    CL5                 SAVE STATION LAST VALUES                     
SLSTAPRT DS    CL7                                                              
SLBIGSTA DS    CL9                                                              
ABUFFER  DS    A                                                                
ABUFFX   DS    A                                                                
         DS    4F                  SPARE                                        
SVBUYID  DS    CL12                                                             
SVSPELM  DS    A                                                                
PREVWKR  DS    XL2                                                              
PREVWKRX DS    XL2                                                              
SVAFFDT  DS    XL2                                                              
*                                                                               
SVOLDMK1 DS    XL2                                                              
SVOLDMK2 DS    XL2                                                              
*                                                                               
MKPROF   DS    XL16                MATCHMAKER PROFILE                           
MKUNWIRE EQU   MKPROF+2            ALL BUYERS DO UNWIRED NET                    
MKACTV   EQU   MKPROF+3            MATCHMAKER ACTIVE                            
NETMKACT EQU   MKPROF+7            NETPAK MATCHMAKER ACTIVE                     
*                                                                               
APSTATUS DS    XL1                 AUTOPAY STATUS                               
APSREQ   EQU   X'80'               ALREADY ADDED REQUEST                        
*                                                                               
VDEFINE  DS    A                   SAVE ADDRESS OF DEFINE                       
I2IPROF  DS    XL16                INTEGRATION PROFILE                          
SLQREP   DS    CL3                 SAVED QREP FOR STALAST                       
*                                                                               
LKUPKEY  DS    CL16                LOCK KEY                                     
SVQOPT5  DS    CL1                 SAVE QOPT5 FOR RUNL                          
I2PPROF  DS    XL16                AUTOPAY PROFILE                              
*                                                                               
B0AFFDEL DS    CL1                 ALLOW AFFID DELETE IF PAID (B0 PRF)          
BFRINSW  DS    CL1                 BUFFRIN INITIALIZED                          
*                                                                               
I2ZPROF  DS    XL16                MORE MATCHING PROFILE OPTIONS                
*                                                                               
SVQEST   DS    CL3                                                              
STPROF   DS    XL16                STATUS PROFILE FOR GETBUBL                   
I2NPROF  DS    XL16                MORE MATCHING PROFILE OPTIONS                
SVMMPROC DS    CL1                                                              
SVCOPT1  DS    XL1                 CLIENT REC COPT1                             
PATREF   DS    XL2                 PATTERN REF NUMBER                           
I2APROF  DS    XL16                MORE MATCHING PROFILE OPTIONS                
SVCOPT4  DS    XL1                 CLIENT REC COPT4                             
DARREP   DS    CL2                 TRADE REP (CL2) FROM DAR PROFILE             
EDCOST   DS    XL4                 EARNED DISCOUNT COST                         
EDNET    DS    XL4                 EARNED DISCOUNT NET                          
EDFLAG   DS    XL1                 EARNED DISC FLAGS                            
EDTOTS   EQU   X'80'               PRINT ED TOTALS                              
EDCOS2   EQU   X'40'               COST ADDED TO EDCOST                         
EDC2YES  EQU   X'20'               THERE IS A COS2 ELEM ON BUYLINE              
TEMPFILM DS    CL12                TEMP FIELD FOR FILM CODE                     
*                                                                               
REMFLAG  DS    XL1                 REMATCHING FLAG                              
REMACT   EQU   X'80'               REMATCH IS ACTIVE                            
REMFOUND EQU   X'40'               REMATCH WAS FOUND                            
REMNOFLM EQU   X'20'               SKIP FILM STUFF WHEN REMATCHING              
REMFRST  EQU   X'10'               MAKING FIRST PASS THRU MATCHED               
REMPART  DS    CL1                 REMATCHING WITH PARTIAL MATCHING             
*                                                                               
SECSEPER DS    CL1                 Y=SECONDARY SEPARATION ERRORS                
ADDEDVAL DS    CL1                 Y=ADDED VALUE TO REPORT                      
*                                                                               
I2BPROF  DS    XL16                MORE MATCHING PROFILE OPTIONS                
ANXTCFLT DS    XL4                 A(NEXT FLTTAB ENTRY)                         
FLMCHK   DS    XL1                 WHAT TO CHECK ON COMML REC                   
FLMCPRD  EQU   X'80'               COMML PRDS                                   
FLMCFLT  EQU   X'40'               COMML MATCHING DATES                         
FLMCTIM  EQU   X'20'               COMML MATCHING TIMES                         
FLMCRR   EQU   X'10'               COMML RECALL/RELEASE DATES                   
FLMCLEN  EQU   X'08'               COMML LEN                                    
*                                                                               
LENLWAY  DS    CL1                 Y=HONOR LENGTH LEEWAY IN I2BPROF             
ANXTCPRD DS    XL4                 A(NEXT PRD ENTRY)                            
CMLPRD   DS    CL1                 Y=MATCH UNIT AGAINST CMML PRD LIST           
*                                                                               
I2CPROF  DS    XL16                MORE MATCHING PROFILE OPTIONS                
ALLPAID  DS    CL1                                                              
ERRLINES DS    XL6                 3 ONE OR TWO BYTE LINE NUMBERS               
A0GROSSN DS    CL1                 A0 "PAY GROSS/NET" FIELD                     
BUFFLEN  DS    F                   BUFFER LEN (SMALLER FOR SOON JOBS)           
SAVEMODE DS    XL1                 SAVED MODE                                   
COSTTOL  DS    XL1                 COST TOLERANCE                               
INOLSTQ  DS    H                   INVOICE TABLE LENGTH                         
MTRADE   DS    XL1                 MTRADE FLAG                                  
*                                                                               
*                                  LOTS OF SPARE ABOVE THIS LINE                
*                                                                               
         ORG   MGADWRK+805         KEEP THINGS WHERE THEY ARE                   
SVIKEY   DS    XL64                                                             
XKEY     DS    XL64                                                             
XKEYSAVE DS    XL64                                                             
*                                                                               
ROTPCTW  DS    F                                                                
ROTSPTSW DS    F                                                                
ROTDAYSW DS    XL28                7F                                           
ROTTIMSW DS    XL196               49F                                          
ROTPCTL  DS    F                                                                
ROTSPTSL DS    F                                                                
ROTDAYSL DS    XL28                7F                                           
ROTTIMSL DS    XL196               49F                                          
         DS    XL4                                                              
MONLST   DS    XL220                                                            
MONLSTX  EQU   *                                                                
BRDMON   DS    XL2                                                              
TIMOPT1  DS    H                                                                
TIMOPT2  DS    H                                                                
TIMOPT3  DS    H                                                                
PSTOPT   DS    X                                                                
PRTOPT   DS    C                                                                
ESTLOPT  DS    C                                                                
COMOPT   DS    C                                                                
PAYOPT   DS    C                                                                
SREPOPT  DS    C                                                                
ONROPT   DS    C                                                                
TAXOPT   DS    C                                                                
DSUMOPT  DS    C                                                                
PDOPT    DS    C                                                                
SPCONLY  DS    C                                                                
SPCRRTE  DS    C                                                                
RNOIDSW  DS    C                                                                
MSREQ    DS    C                                                                
SPILSW   DS    C                                                                
NEXTID   DS    F                                                                
HOMEMKT  DS    XL2                                                              
CANNET   DS    C                                                                
HVERROPT DS    C                                                                
BIGOPT   DS    X                                                                
NOIMR    DS    C                                                                
SVBPRD2  DS    C                                                                
PROGOPT  DS    C                                                                
COSTSUP  DS    C                                                                
PREVWKP  DS    XL2                                                              
SAVEQRSP DS    CL1                                                              
IKMONTH  DS    XL1                                                              
OPTMGA   DS    CL1                                                              
         DS    CL12                SPARE                                        
*                                                                               
MISMOPT  DS    CL1                                                              
MISPASS  DS    CL1                                                              
MISLIST  DS    XL12                                                             
CENTS    DS    C                                                                
PAYGN    DS    C                                                                
PAYTA    DS    C                                                                
MONSW    DS    C                                                                
RACTSW   DS    X                                                                
MEDPRDSW DS    X                                                                
NEWSW    DS    CL1                                                              
NEWIDSW  DS    CL1                                                              
MULTIMON DS    CL1                                                              
PIGCTL   DS    CL1                                                              
PIGFILT  DS    CL1                                                              
PRDC2    DS    CL3                                                              
*                                                                               
MEDFILT  DS    C                   NETPAK MEDIA FILTER                          
NETPSW   DS    C                   Y=NETPAK                                     
ELCODE   DS    X                                                                
NUDONE   DS    CL1                                                              
NUNETWK  DS    CL5                 NUNET NETWORK, X'FF' = EOF                   
*                                                                               
I0PROF   DS    XL16                                                             
         DS    CL4                 SPARE                                        
CLRSTRT3 EQU   *                   ALL WS AFTER THIS POINT                      
*                                  CLEAR BEFORE EACH MATCH                      
AFBY     DS    A                                                                
ALBY     DS    A                                                                
AFINV    DS    A                                                                
ALINV    DS    A                                                                
ANXTBY   DS    A                                                                
ANXTCOM  DS    A                                                                
ANXTPLN  DS    A                                                                
NXTLIN   DS    A                                                                
BUYRTX   DS    A                                                                
AGCPW    DS    A                                                                
AFTCT    DS    F                                                                
AFRCT    DS    F                                                                
GAFCNT   DS    F                                                                
GAFST    DS    XL2                                                              
GAFEND   DS    XL2                                                              
GAFSLN   DS    XL1                                                              
*                                                                               
RSET     DS    X                                                                
RSETQ    DS    XL1                                                              
RSETSW   DS    XL1                                                              
ERROR    DS    X                                                                
BYTE2    DS    X                                                                
BYTE3    DS    X                                                                
SPTCNT   DS    X                                                                
PDNLNS   DS    X                                                                
PDSTAT   DS    X                                                                
PGPRD    DS    X                                                                
OLDDAT   DS    XL2                                                              
DAYINH   DS    F                                                                
DATINH   DS    XL2                                                              
DATOUTH  DS    XL2                                                              
DATEBCH  DS    CL6                                                              
*                                                                               
MATSPTS  DS    F                                                                
MATGRS   DS    F                                                                
MATNET   DS    F                                                                
ONRSPTS  DS    F                                                                
ONRGRS   DS    F                                                                
ONRNET   DS    F                                                                
RNOSPTS  DS    F                                                                
RNOGRS   DS    F                                                                
RNONET   DS    F                                                                
OSPTS    DS    F                                                                
OGRS     DS    F                                                                
ONET     DS    F                                                                
ISPTS    DS    F                                                                
IGRS     DS    F                                                                
INET     DS    F                                                                
DEFSPTS  DS    F                                                                
DEFGRS   DS    F                                                                
DEFNET   DS    F                                                                
PMSPTS   DS    F                                                                
PMOGRS   DS    F                                                                
PMONET   DS    F                                                                
CSPTS    DS    F                                                                
CGRS     DS    F                                                                
CNET     DS    F                                                                
TSPTS    DS    F                                                                
TGRS     DS    F                                                                
TNET     DS    F                                                                
TOTSL    EQU   *-MATSPTS                                                        
*                                                                               
ODEMEST  DS    F                                                                
ODEMACH  DS    F                                                                
UDEMACH  DS    F                                                                
*                                                                               
EGRS     DS    F                                                                
EDEMEST  DS    F                                                                
EDEMACH  DS    F                                                                
*                                                                               
ECOUNT   DS    F                                                                
*                                                                               
TAXTOT   DS    F                                                                
TAXAMT   DS    F                                                                
PDGRS    DS    F                                                                
PDNET    DS    F                                                                
*                                                                               
         DS    0F                                                               
FMFWK    DS    0XL24                                                            
FMFSPA   DS    F                   SPOTS ACTUAL                                 
FMFDLA   DS    F                   DOLARS                                       
FMFDMA   DS    F                   DEMO                                         
FMFSPS   DS    F                   SPOTS SHARE                                  
FMFDLS   DS    F                   DOLARS                                       
FMFDMS   DS    F                   DEMO                                         
*                                                                               
*                                  ROTATION CHECKING FIELDS                     
NDAYS    DS    F                                                                
NTIMS    DS    F                                                                
MPDAY    DS    F                                                                
MPTIM    DS    F                                                                
ROTSW    DS    X                                                                
ESTINV   DS    C                                                                
NETINV   DS    C                                                                
NETREC   DS    C                                                                
FILMREC  DS    C                                                                
*                                                                               
*                                                                               
PERSTOTS DS    5F                                                               
PERUTOTS DS    5F                                                               
*                                                                               
REPSTOTS DS    5F                                                               
REPUTOTS DS    5F                                                               
*                                                                               
LASTELAD DS    F                                                                
ORDLINW  DS    CL140                                                            
LASTSUM  DS    CL7                                                              
PAGSW    DS    X                                                                
LNEED    DS    X                                                                
SREPSW   DS    X                                                                
SUMSW    DS    X                                                                
HVROTERR DS    C                                                                
BIGSW    DS    C                                                                
DSUMMSK  DS    X                                                                
DSUMSW   DS    C                                                                
         DS    0D                                                               
X        DS    XL200                                                            
W        DS    XL200                                                            
SVADBUY  DS    F                                                                
PSTAMTS  DS    XL(NPROVS*4)                                                     
PSTTOTS  DS    XL(NPROVS*4)                                                     
PSTTOTL  DS    F                                                                
FRSTDEM  DS    XL3                                                              
LASTNTW  DS    CL1                                                              
MIRSEQ   DS    XL2                 MIRROR SEQ NUMB-TO TIE UNIT TO GHOST         
*                                                                               
BRDSTIM  DS    H                   BROADCAST START TIME                         
BRDETIM  DS    H                   BROADCAST END TIME                           
*                                                                               
BUFFERR  DS    X                   DIFFERENTIATE BUFFER OVERFLOW ERRORS         
BERRBUY  EQU   X'80'               BUY OVERFLOW                                 
BERRCOM  EQU   X'40'               BUY COMMENT TABLE OVERFLOW(BUYRPARS)         
BERRINV  EQU   X'20'               INV OVERFLOW (SBLITOVQ)                      
BERRFLM  EQU   X'10'               INV FILM TABLE OVERFLOW (SBLFTOVQ)           
BERRCID  EQU   X'08'               CONTRACT ID OVERFLOW (SBLIDOVQ)              
*                                                                               
HBDEMS   DS    0XL10               HOLD BUY DEMOS                               
HBDEMSW  DS    XL1                                                              
HBDEMVR  DS    XL4                                                              
HBDEMV   DS    XL4                                                              
HBDEMC   DS    XL1                                                              
*                                                                               
         DS    CL85                SPARE                                        
*                                                                               
HOLDS    DS    0CL38                                                            
DATINBH  DS    XL2                                                              
DATCHAH  DS    CL8                                                              
DAYOTH   DS    CL8                                                              
DAYINBH  DS    XL2                                                              
DATINB2H DS    XL2                                                              
DATCHA2H DS    CL8                                                              
PRDBH    DS    XL1                                                              
PRDB2H   DS    XL1                                                              
PRDQH    DS    CL3                                                              
PRDQ2H   DS    CL3                                                              
         DS    0F                                                               
*                                  PARAMS FOR ADDEL                             
ADDPARS  DS    0CL16                                                            
ADDPAR1  DS    F                   A(REC)                                       
ADDPAR2  DS    F                   A(ELEM)                                      
ADDPAR3  DS    F                   BYTE 0 = L'ELEM                              
*                                  BYTE 1 = REF. NO.                            
*                                  BYTE 3 = ERROR                               
ADDPAR4  DS    F                   BYTES 0 - 1  2 BYTES SPOT DATE               
*                                                                               
MFLD     DS    0CL11                                                            
MMTCH    DS    XL1                                                              
MTIM     DS    XL1                                                              
MAMPW    DS    XL2                                                              
MUNACH   DS    XL1                                                              
MSTIM    DS    XL2                                                              
MBY      DS    XL3                                                              
MSW      DS    XL1                                                              
OLDMFLD  DS    0CL11                                                            
         DS    XL7                                                              
OLDMBY   DS    XL3                                                              
         DS    XL1                                                              
RMLST    DS    CL(L'MFLD*20)                                                    
RMLSTX   EQU   *-1                                                              
RMSW     DS    X                                                                
SVLNCNT  DS    H                                                                
SAVPER   DS    CL14                                                             
AMORB    DS    A                                                                
ORBCNT   DS    X                                                                
ORBSW    DS    X                                                                
ONRSW    DS    X                                                                
HCOPY    DS    X                                                                
*                                                                               
         DS    CL6                 SPARE                                        
*                                                                               
IDNUM    DS    XL1                                                              
SUMSEQ   DS    X                                                                
PARTIAL  DS    C                                                                
FILMDSCP DS    C                                                                
IRSKIP   DS    C                                                                
DCLIST   DS    40X                                                              
SAVIKEY  DS    CL13                                                             
*                                                                               
FILMDONE DS    XL1                                                              
SVIHDEL  DS    XL40                                                             
*                                                                               
MATSTAT  DS    X                                                                
IBACT    DS    X                                                                
IFCOD1   DS    CL8                                                              
IFCOD2   DS    CL8                                                              
HAVINV   DS    CL1                                                              
*                                                                               
VATAMT   DS    F                                                                
VATTOT   DS    F                                                                
*                                                                               
RESPEL   DS    0C                  SPACE FOR RESPONSE ELEM                      
RESPCOD  DS    CL1                                                              
RESPLEN  DS    CL1                                                              
RESPDPT  DS    CL1                                                              
         DS    CL1                                                              
RESPNUM  DS    XL2                                                              
*                                                                               
UPDERROR DS    XL1                 PROBLEM UPDATING RECORDS                     
UPDERBIG EQU   X'80'               RECORD TOO BIG FOR AFFID DATA                
*                                                                               
         DS    CL1                 SPARE                                        
*                                  SUMMARY RECORD                               
SUMD     DS    0C                                                               
SUMREC   DS    0C                                                               
SUREG    DS    CL3                                                              
SUPER    DS    CL4                                                              
SUSTA    DS    CL3                                                              
SUMKT    DS    CL2                                                              
SUID     DS    CL12                                                             
SUPRD1   DS    CL3                                                              
SUPRD2   DS    CL3                                                              
SUEST    DS    CL1                                                              
SUEST2   DS    CL1                                                              
SUSEQ    DS    X                                                                
SUSTATUS DS    X                                                                
SUSPTS   DS    CL2                                                              
SUGRS    DS    CL4                                                              
SUNET    DS    CL4                                                              
SURESP   DS    CL4                                                              
SUPAGE   DS    XL2                                                              
SUMED    DS    CL1                                                              
SUMDL    EQU   *-SUMD                                                           
         SPACE 2                                                                
IMRWORKX EQU   *                                                                
*                                                                               
INVKEYD  DSECT                                                                  
       ++INCLUDE SPGENINV                                                       
         SPACE 3                                                                
*                   BUY DESCRIPTOR ELEMENTS                                     
BYELEMD  DSECT                                                                  
BYELEM   DS    0XL85                                                            
BYCBLNET DS    XL1                 CABLE NETWORK                                
BYEST    DS    XL1                 ESTIMATE                                     
BYLIN    DS    XL2                 LINE                                         
BYSDT    DS    XL2                 START DATE                                   
BYEDT    DS    XL2                 END DATE                                     
BYDAY    DS    XL1                 ROTATOR OR DAY OF WEEK                       
BYSEDAY  DS    XL1                 START/END DAYS                               
BYSTIM   DS    XL2                 START TIME - MINUTES                         
BYETIM   DS    XL2                 END TIME   - MINUTES                         
BYLEN    DS    XL1                 SPOT LENGTH                                  
BYCOST   DS    XL4                 COST                                         
BYNET    DS    XL4                 NET                                          
BYSTAT   DS    XL1                 STATUS                                       
*                                  X'80' = SPECIAL (-S)                         
*                                  X'40' = PAID                                 
*                                  X'20' = NTP SPOT (SPOT)                      
*                                  X'20' = ACTUAL COST INPUT (NET)              
*                                  X'10' = ORBIT MASTER                         
*                                  X'08' = ORBIT SLAVE                          
*                                  X'04' = MAKE GOOD                            
*                                  X'02' = POL BUY                              
*                                  X'01' = NEG COST                             
BYPRD    DS    XL1                 PRODUCT CODE                                 
BYPRD2   DS    XL1                 2ND PROD IF PIGGYBACK                        
BYPRDNT  DS    XL3                 3 CHARACTER PRODUCT CODE FOR NET             
BYPRD2NT DS    XL3                 2ND PROD IF PIGGYBACK FOR NET                
         ORG   BYPRDNT                                                          
BYXAPYGN DS    XL4                 XAPY GROSS/NET FOR COS2                      
         DS    XL2          *SPOT* SPARE                                        
*                                                                               
BYNOWK   DS    XL1                 SPOTS PER WEEK                               
BYUNACH  DS    XL1                 NO. OF SPOTS STILL UNMATCHED                 
*                                                                               
BYAMPW   DS    XL2          *SPOT* ACTIVE MINUTES PER WEEK                      
         DS    XL1          *SPOT* SPARE                                        
         ORG   BYAMPW                                                           
BYPREF   DS    XL3          *NET*  PATTERN REF NUMBER                           
*                                                                               
BYSPT    DS    XL1                 SPOT NUMBER                                  
         DS    XL2                 SPARE (WAS BYDEMVR)                          
         DS    XL2                 SPARE (WAS BYDEMV)                           
         DS    XL1                 SPARE (WAS BYDEMC)                           
BYSREP   DS    XL2                 SPECIAL REP CODE                             
BYORBNO  DS    XL1                 ORBIT LINK NO.                               
BYCOPY   DS    XL1                 COPY CODE FOR TRAFFIC                        
BYFILM   DS    XL2                 FILM NUMBER (CMML SEQ NO)                    
BYFILM2  DS    XL2                 2ND FILM NUMBER                              
BYSTAT2  DS    XL1                 STATUS BYTE 2                                
BYSTPREQ EQU   X'80'                -PREEMPTED                                  
BYSTMDGQ EQU   X'40'                -MADE GOOD                                  
BYSTMISQ EQU   X'C0'                -MISSED FOR WHATEVER REASON                 
BYSTTNEQ EQU   X'20'                -SPOT TAX NOT = STATION TAX %               
BYSTBLBQ EQU   X'10'                -BILLBOARD (NETPAK)                         
BYSTMIRQ EQU   X'08'                -MIRROR (NETPAK)                            
BYSTCS2Q EQU   X'04'   **SPOT**     -COST2 INVALID - EARNED DISCOUNT            
BYSTNOAQ EQU   X'04'   **NET**      -NO AFFID SEEDED-MIRROR NOT MATCHED         
BYSTADIQ EQU   X'02'                -BYFILMS WERE SEEDED AS AD-IDS              
BYSTMGHQ EQU   X'01'                -THIS IS THE MIRROR GHOST UNIT              
BYBKTYPE DS    CL1                 DEMO BOOK TYPE                               
         ORG   BYBKTYPE                                                         
BYNSTAT  DS    XL1                 NETPAK ONLY STATUS BYTE                      
BYNDMIR1 EQU   X'80'                -DUAL MIRROR 1                              
BYNDMIR2 EQU   X'40'                -DUAL MIRROR 2                              
BYPROGRM DS    CL1                 FIRST BYTE OF PRG (FOR DEMO LOOKUP)          
BYMGAMGC DS    CL2                 MGA - MG CODE OF MAKEGOOD LINE               
BYMGAMSC DS    CL2                 MGA - MG CODE OF MISSED SPOT                 
*                                                                               
BYDISK   DS    XL4                 DISK ADDRESS                                 
BYPKG    DS    XL1                 PACKAGE (NETPAK)                             
BYUDT    DS    XL1                 #DAYS TO ADD TO BYSDT FOR UNIT DATE          
BYINTEG  DS    XL4                 INTEGRATION COST                             
         ORG   BYINTEG                                                          
BYGCOST1 DS    XL4                 GROSS COST1 FOR MTRADE                       
BYMIRSEQ DS    XL2                 MIRROR SEQ NUMB - TIES UNIT TO GHOST         
*                                                                               
BYACTDAT DS    XL2                 ACTUAL UNIT DATE - FOR REMATCHING            
BYACTSQH DS    XL1                 START QUARTER HOUR - FOR REMATCHING          
BYACTPRG DS    CL6                 PROGRAM - FOR REMATCHING                     
BYACTDP  DS    XL1                 DAYPART - FOR REMATCHING                     
         ORG   BYACTDAT                                                         
BYDEMVR  DS    XL4                 VALUE FOR 1ST DEMO OF REQ                    
BYDEMV   DS    XL4                 VALUE FOR 1ST DEMO OF BUY EST                
BYDEMC   DS    XL1                 DEMO CODE OF ABOVE                           
         ORG                                                                    
BYTRADE  DS    XL4                 TRADE AMOUNT FOR NETPAK                      
         ORG   BYTRADE                                                          
BYTAX    DS    XL4                 TAX AMOUNT FOR SPOT AUTOPAY                  
BYSTAT3  DS    XL1                 STATUS BYTE 3                                
BYELEML  EQU   *-BYELEM                                                         
*                                                                               
         ORG                                                                    
         SPACE 2                                                                
*INCLUDE SPSNVBLK                                                               
       ++INCLUDE SPSNVBLK                                                       
         SPACE 2                                                                
*        DSECT FOR ROTATION CHECK COUNTS                                        
ROTD     DSECT                                                                  
ROTPCT   DS    F                                                                
ROTSPTS  DS    F                                                                
ROTDAYS  DS    XL28                7F                                           
ROTTIMS  DS    XL196               49F                                          
         SPACE 2                                                                
*        DSECT FOR CMML TABLE BUILT BY GETCPAT                                  
CMTABD   DSECT                                                                  
CMFILM   DS    CL16                                                             
CMADID   DS    CL16                                                             
CMROT    DS    C                                                                
CMACTV   DS    XL1                                                              
CMFSTAT1 DS    XL1                                                              
CMFSTAT2 DS    XL1                                                              
CMPOCC   DS    XL4                                                              
CMSPTS   DS    XL4                                                              
CMDOLS   DS    XL4                                                              
CMDEMV   DS    XL4                                                              
CMTBELC  EQU   *-CMROT             LENGTH OF PATTERN DATA                       
*                                                                               
CMSPTST  DS    XL4                 AS RUN TOTALS                                
CMDOLST  DS    XL4                                                              
CMDEMT   DS    XL4                                                              
CMSPTSTS DS    XL4                 SHARE TOTALS                                 
CMDOLSTS DS    XL4                                                              
CMDEMTS  DS    XL4                                                              
CMTBEL   EQU   *-CMTABD                                                         
         SPACE 2                                                                
PLL      EQU   40                  LENGTH OF PATTERN DESC LINES                 
PDL      EQU   13                  DOTS IN PATTERN LINES                        
*                                                                               
       ++INCLUDE SPREPPTBUF                                                     
*                                                                               
       ++INCLUDE SPMGADN                                                        
*                                                                               
*        ERROR NUMBER EQUATES                                                   
*                                                                               
BUFERR   EQU   21                                                               
