*          DATA SET SPRESD4DS  AT LEVEL 005 AS OF 03/27/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FD4D      DATE 03/27/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
LAYSRCEH DS    CL8                                                              
LAYSRCE  DS    CL24     6   13   24  A   U    N         T    I   Y   10         
LAYSRCEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   60    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      7    2    5  A   P    N         T        Y              
LAYBOOKH DS    CL8                                                              
LAYBOOK  DS    CL54     7   13   54  A   U    N         T        Y   20         
LAYBOOKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      8    2    5  A   P    N         T        Y              
LAYDEMOH DS    CL8                                                              
LAYDEMO  DS    CL44     8   13   44  A   U    N         T        Y   30         
LAYDEMOX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    N         T        Y              
LAYSTATH DS    CL8                                                              
LAYSTAT  DS    CL7      9   13    7  A   U    N         T        Y   40         
LAYSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   23    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   33    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   43    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   53    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   63    7  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    10   10   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    10   45   17  A   P    N         T        Y              
LAYDAYH  DS    CL8                                                              
LAYDAY   DS    CL8     11   11    8  A   U    N         T        Y   60         
LAYDAYX  DS    CL8                                                              
LAYTIMEH DS    CL8                                                              
LAYTIME  DS    CL12    11   23   12  A   U    N         T        Y   65         
LAYTIMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     11   46    8  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11   58   12  A   U    N         T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   11    8  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12   23   12  A   U    N         T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   46    8  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12   58   12  A   U    N         T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   11    8  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13   23   12  A   U    N         T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   46    8  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13   58   12  A   U    N         T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   11    8  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    14   23   12  A   U    N         T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   46    8  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    14   58   12  A   U    N         T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15    2   10  A   P    N         T        Y              
LAYNDXH  DS    CL8                                                              
LAYNDX   DS    CL10    15   13   10  A   U    N         T        Y   70         
LAYNDXX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15   25   10  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   13    1  A   U    N         T        Y              
LAYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LAYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 920  BYTES                            
