*          DATA SET SPSELIST   AT LEVEL 005 AS OF 04/08/85                      
         SPACE 2                                                                
**********     SPOT SYSTEM SE LIST     **********                               
         CNOP  2,4                                                              
SPOTSE   DC    H'6'                                                             
         DC    A(SPOTSEX-1)                                                     
         DC    C'SPOT1',X'02'                                                   
         DC    C'SPOT2',X'03'                                                   
         DC    C'SPOT3',X'07'                                                   
         DC    C'SPOT4',X'0D'                                                   
         DC    C'SPOT5',X'11'                                                   
         DC    C'SPOT6',X'15'                                                   
         DC    C'SPOT7',X'22'                                                   
         DC    C'SPOT8',X'23'                                                   
         DC    C'SPOT9',X'25'                                                   
         DC    C'SPOTA',X'26'                                                   
SPOTSEX  EQU   *                                                                
