*          DATA SET SPSFMD1D   AT LEVEL 007 AS OF 11/13/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217D1D      DATE 11/13/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
SELMEDH  DS    CL8                                                              
SELMED   DS    CL8      5   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
SELCLIH  DS    CL8                                                              
SELCLI   DS    CL8      5   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
SELPROH  DS    CL8                                                              
SELPRO   DS    CL8      6   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6   20    8  A   P    N         T        Y              
SELESTH  DS    CL8                                                              
SELEST   DS    CL4      6   30    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    N         T        Y              
SELHEDH  DS    CL8                                                              
SELHED   DS    CL70     8   10   70  A   P    N         T        Y              
SELSELH  DS    CL8                                                              
SELSEL   DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70     9   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    10   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    11   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    12   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    13   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    14   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    15   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    16   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    17   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    18   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    19   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    20   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    21   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    22   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    23   10   70  A   P    N         T        Y              
SELLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1560 BYTES                            
