*          DATA SET SPSFMA1D   AT LEVEL 013 AS OF 06/28/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297A1D      DATE 06/28/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
DMVNTWKH DS    XL8                                                              
DMVNTWK  DS    CL4      5   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   20    4  A  P H             T        Y              
DMVSHOWH DS    XL8                                                              
DMVSHOW  DS    CL4      5   28    4  A  U N             T        Y              
DMVPGMDH DS    XL8                                                              
DMVPGMD  DS    CL40     5   38   40  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
DMVRATSH DS    XL8                                                              
DMVRATS  DS    CL3      6   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   20    4  A  P H             T        Y              
DMVDEMOH DS    XL8                                                              
DMVDEMO  DS    CL7      6   28    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
DMVCLTH  DS    XL8                                                              
DMVCLT   DS    CL3      6   46    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   56    5  A  P N             T        Y              
DMVSEQH  DS    XL8                                                              
DMVSEQ   DS    CL1      6   63    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   68    5  A  P N             T        Y              
DMVCOPYH DS    XL8                                                              
DMVCOPY  DS    CL1      6   74    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
DMVMSGH  DS    XL8                                                              
DMVMSG   DS    CL78     7    2   78  A  P N             T        Y              
DMVHD1H  DS    XL8                                                              
DMVHD1   DS    CL5      8    3    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   31    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   45    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   66    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   73    5  A  P N             T        Y              
DMVDVL1H DS    XL8                                                              
DMVDVL1  DS    CL5      9    3    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   24    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   38    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   52    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   66    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   73    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    3    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   31    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   45    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   66    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11    3    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   24    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   38    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   52    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   66    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   73    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    3    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   31    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   45    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   66    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    3    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   24    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   38    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   52    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   66    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   73    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    3    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   31    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   45    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   66    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    3    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   24    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   38    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   52    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   66    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   73    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    3    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   31    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   45    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   66    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    3    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   24    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   38    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   52    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   66    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   73    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    3    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   31    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   45    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   66    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    3    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   24    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   38    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   52    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   66    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   73    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20    3    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   31    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   45    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   66    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21    3    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   24    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   38    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   52    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   66    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   73    5  A  U N             T        Y              
DMVHDLH  DS    XL8                                                              
DMVHDL   DS    CL5     22    3    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   17    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   24    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   31    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   38    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   45    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   52    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   59    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   66    5  A  P N             T        Y              
DMVHDLLH DS    XL8                                                              
DMVHDLL  DS    CL5     22   73    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     23    3    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   24    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   31    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   38    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   52    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   59    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   66    5  A  U N             T        Y              
DMVDVLLH DS    XL8                                                              
DMVDVLL  DS    CL5     23   73    5  A  U N             T        Y              
DMVLN24H DS    XL8                                                              
DMVLN24  DS    CL78    24    2   78  A  P H             T        Y              
DMVLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DMVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2696 BYTES                            
