*          DATA SET SPSFME4D   AT LEVEL 007 AS OF 05/17/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297E4D      DATE 05/17/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PDMMEDH  DS    XL8                                                              
PDMMED   DS    CL1      5   10    1  A  U H             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PDMCLTH  DS    XL8                                                              
PDMCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
PDMGIDH  DS    XL8                                                              
PDMGID   DS    CL1      5   46    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
PDMMDNH  DS    XL8                                                              
PDMMDN   DS    CL10     6    2   10  A  P N             T        Y              
PDMCLNH  DS    XL8                                                              
PDMCLN   DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
PDMBK1H  DS    XL8                                                              
PDMBK1   DS    CL12     8   20   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   38    6  A  P N             T        Y              
PDMLN1H  DS    XL8                                                              
PDMLN1   DS    CL1      8   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
PDMBK2H  DS    XL8                                                              
PDMBK2   DS    CL12     9   20   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   38    6  A  P N             T        Y              
PDMLN2H  DS    XL8                                                              
PDMLN2   DS    CL1      9   46    1  A  U N             T        Y              
PDMSMIDH DS    XL8                                                              
PDMSMID  DS    CL20    10    2   20  A  P N             T        Y              
PDMSMI1H DS    XL8                                                              
PDMSMI1  DS    CL1     10   22    1  A  P N             T        Y              
PDMSCM1H DS    XL8                                                              
PDMSCM1  DS    CL8     10   24    8  A  U N             T        Y  111         
PDMSCM1X DS    XL8                                                              
PDMSMI2H DS    XL8                                                              
PDMSMI2  DS    CL1     11   22    1  A  P N             T        Y              
PDMSCM2H DS    XL8                                                              
PDMSCM2  DS    CL8     11   24    8  A  U N             T        Y  111         
PDMSCM2X DS    XL8                                                              
PDMSMI3H DS    XL8                                                              
PDMSMI3  DS    CL1     12   22    1  A  P N             T        Y              
PDMSCM3H DS    XL8                                                              
PDMSCM3  DS    CL8     12   24    8  A  U N             T        Y  111         
PDMSCM3X DS    XL8                                                              
PDMSMI4H DS    XL8                                                              
PDMSMI4  DS    CL1     13   22    1  A  P N             T        Y              
PDMSCM4H DS    XL8                                                              
PDMSCM4  DS    CL8     13   24    8  A  U N             T        Y  111         
PDMSCM4X DS    XL8                                                              
PDMSMI5H DS    XL8                                                              
PDMSMI5  DS    CL1     14   22    1  A  P N             T        Y              
PDMSCM5H DS    XL8                                                              
PDMSCM5  DS    CL8     14   24    8  A  U N             T        Y  111         
PDMSCM5X DS    XL8                                                              
PDMSMI6H DS    XL8                                                              
PDMSMI6  DS    CL1     15   22    1  A  P N             T        Y              
PDMSCM6H DS    XL8                                                              
PDMSCM6  DS    CL8     15   24    8  A  U N             T        Y  111         
PDMSCM6X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    16    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   38   15  A  P N             T        Y              
PDMGSTH  DS    XL8                                                              
PDMGST   DS    CL4     16   56    4  A  U N             T        Y              
PDMLISTH DS    XL8                                                              
PDMLIST  DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
PDMDONEH DS    XL8                                                              
PDMDONE  DS    CL8     23   33    8  A  P N             T        Y              
PDMCDTEH DS    XL8                                                              
PDMCDTE  DS    CL8     23   46    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   56    8  A  P N             T        Y              
PDMCRTRH DS    XL8                                                              
PDMCRTR  DS    CL8     23   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    24   33   12  A  P N             T        Y              
PDMADTEH DS    XL8                                                              
PDMADTE  DS    CL8     24   46    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    24   56   11  A  P N             T        Y              
PDMCWHOH DS    XL8                                                              
PDMCWHO  DS    CL8     24   68    8  A  P N             T        Y              
PDMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PDMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1200 BYTES                            
