*          DATA SET SPSFMFED   AT LEVEL 002 AS OF 05/17/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297FED      DATE 05/17/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PGMMEDH  DS    XL8                                                              
PGMMED   DS    CL1      5   10    1  A  U H             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PGMCLTH  DS    XL8                                                              
PGMCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
PGMGRPH  DS    XL8                                                              
PGMGRP   DS    CL4      5   46    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
PGMMDNH  DS    XL8                                                              
PGMMDN   DS    CL10     6    2   10  A  P N             T        Y              
PGMCLNH  DS    XL8                                                              
PGMCLN   DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
PGMBK1H  DS    XL8                                                              
PGMBK1   DS    CL12     8   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   38    4  A  P N             T        Y              
PGMNM1H  DS    XL8                                                              
PGMNM1   DS    CL24     8   46   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
PGMBK2H  DS    XL8                                                              
PGMBK2   DS    CL12     9   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   38    4  A  P N             T        Y              
PGMNM2H  DS    XL8                                                              
PGMNM2   DS    CL24     9   46   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   33   12  A  P N             T        Y              
PGMADTEH DS    XL8                                                              
PGMADTE  DS    CL8     10   46    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   56   11  A  P N             T        Y              
PGMCWHOH DS    XL8                                                              
PGMCWHO  DS    CL8     10   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    11    2   25  A  P N             T        Y              
PGMUSERH DS    XL8                                                              
PGMUSER  DS    CL3     11   29    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
PGMPRD1H DS    XL8                                                              
PGMPRD1  DS    CL3     12   18    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   24    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   36    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   54    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   60    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   66    3  A  U N             T        Y              
PGMPRDXH DS    XL8                                                              
PGMPRDX  DS    CL3     12   72    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    14    2   16  A  P N             T        Y              
PGMLSH   DS    XL8                                                              
PGMLS    DS    CL72    15    2   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL72    16    2   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL72    17    2   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL72    18    2   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL72    19    2   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL72    20    2   72  A  P N             T        Y              
PGMENLSH DS    XL8                                                              
PGMENLS  DS    CL72    21    2   72  A  P N             T        Y              
PGMSEPAH DS    XL8                                                              
PGMSEPA  DS    CL78    22    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
PGMADD1H DS    XL8                                                              
PGMADD1  DS    CL30    23   10   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   42    6  A  P N             T        Y              
PGMADD2H DS    XL8                                                              
PGMADD2  DS    CL30    23   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     24    2    6  A  P N             T        Y              
PGMADD3H DS    XL8                                                              
PGMADD3  DS    CL30    24   10   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   42    6  A  P N             T        Y              
PGMADD4H DS    XL8                                                              
PGMADD4  DS    CL30    24   50   30  A  U N             T        Y              
PGMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PGMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1416 BYTES                            
