*          DATA SET SPSFMB2D   AT LEVEL 005 AS OF 08/05/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297B2D      DATE 08/05/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
ADMMEDIH DS    XL8                                                              
ADMMEDI  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  L  P H             T        Y              
ADMSTATH DS    XL8                                                              
ADMSTAT  DS    CL8      5   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   38    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  L  P N             T        Y              
ADMNAMEH DS    XL8                                                              
ADMNAME  DS    CL20     7   20   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   45    5  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1      7   52    1  A  P Z             T        Y              
ADMACODH DS    XL8                                                              
ADMACOD  DS    CL3      7   54    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1      7   58    1  A  P Z             T        Y              
ADMFSTNH DS    XL8                                                              
ADMFSTN  DS    CL3      7   60    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1      7   64    1  A  P Z             T        Y              
ADMLSTNH DS    XL8                                                              
ADMLSTN  DS    CL4      7   66    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14     8    2   14  L  P N             T        Y              
ADMADDRH DS    XL8                                                              
ADMADDR  DS    CL24     8   20   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    2    4  L  P N             T        Y              
ADMCITYH DS    XL8                                                              
ADMCITY  DS    CL24     9   20   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  L  P N             T        Y              
ADMSTTEH DS    XL8                                                              
ADMSTTE  DS    CL3     10   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  L  P N             T        Y              
ADMBZIPH DS    XL8                                                              
ADMBZIP  DS    CL10    11   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  L  P N             T        Y              
ADMCTRYH DS    XL8                                                              
ADMCTRY  DS    CL1     12   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13    2   17  L  P N             T        Y              
ADMDATEH DS    XL8                                                              
ADMDATE  DS    CL8     13   20    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    2   10  L  P N             T        Y              
ADMUSIDH DS    XL8                                                              
ADMUSID  DS    CL8     14   20    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  L  P N             T        Y              
ADMCOMMH DS    XL8                                                              
ADMCOMM  DS    CL35    15   20   35  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  L  P N             T        Y              
ADMMAILH DS    XL8                                                              
ADMMAIL  DS    CL40    16   20   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17    2   17  L  P N             T        Y              
ADMSAPH  DS    XL8                                                              
ADMSAP   DS    CL10    17   20   10  A  U N             T        Y              
ADMLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
ADMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 608  BYTES                            
