*          DATA SET SPSFMC0D   AT LEVEL 010 AS OF 02/04/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217C0D      DATE 02/04/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y   10         
         DS    CL8                                                              
BXFMEDH  DS    CL8                                                              
BXFMED   DS    CL8      6   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A   P    N         T        Y   20         
         DS    CL8                                                              
BXFOPTSH DS    CL8                                                              
BXFOPTS  DS    CL50     7   11   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20     9    2   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A   P    N         T        Y   30         
         DS    CL8                                                              
BXFFRCLH DS    CL8                                                              
BXFFRCL  DS    CL8     11   11    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   20    8  A   P    N         T        Y   40         
         DS    CL8                                                              
BXFFRPRH DS    CL8                                                              
BXFFRPR  DS    CL8     11   29    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   P    N         T        Y   50         
         DS    CL8                                                              
BXFFRESH DS    CL8                                                              
BXFFRES  DS    CL8     12   11    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   20    8  A   P    N         T        Y   60         
         DS    CL8                                                              
BXFFRSTH DS    CL8                                                              
BXFFRST  DS    CL8     12   29    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14    2   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A   P    N         T        Y   30         
         DS    CL8                                                              
BXFTOCLH DS    CL8                                                              
BXFTOCL  DS    CL8     16   11    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16   20    8  A   P    N         T        Y   40         
         DS    CL8                                                              
BXFTOPRH DS    CL8                                                              
BXFTOPR  DS    CL8     16   29    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A   P    N         T        Y   50         
         DS    CL8                                                              
BXFTOESH DS    CL8                                                              
BXFTOES  DS    CL8     17   11    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   20    8  A   P    N         T        Y   60         
         DS    CL8                                                              
BXFTOSTH DS    CL8                                                              
BXFTOST  DS    CL8     17   29    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   38    8  A   P    N         T        Y   70         
         DS    CL8                                                              
BXFTODTH DS    CL8                                                              
BXFTODT  DS    CL20    17   47   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    19    2   20  A   P    N         T        Y              
BXFOPT1H DS    CL8                                                              
BXFOPT1  DS    CL1     19   23    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   25   12  A   P    N         T        Y              
BXFOPT2H DS    CL8                                                              
BXFOPT2  DS    CL1     19   38    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   48   12  A   P    N         T        Y              
BXFOPT3H DS    CL8                                                              
BXFOPT3  DS    CL1     19   61    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    20    2   15  A   P    N         T        Y              
BXFOPT4H DS    CL8                                                              
BXFOPT4  DS    CL1     20   18    1  A   U    N         T        Y              
BXFLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
BXFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 686  BYTES                            
