*          DATA SET SPSFMF3D   AT LEVEL 005 AS OF 10/21/19                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297F3D      DATE 10/21/19                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
STLMEDH  DS    XL8                                                              
STLMED   DS    CL1      5   10    1  A  U N             T    I   Y              
STLMDNH  DS    XL8                                                              
STLMDN   DS    CL12     5   16   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
STLCLTH  DS    XL8                                                              
STLCLT   DS    CL3      5   47    3  A  U N             T        Y              
STLCLNH  DS    XL8                                                              
STLCLN   DS    CL20     5   56   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
STLSTAH  DS    XL8                                                              
STLSTA   DS    CL5      6   10    5  A  U N             T        Y              
STLMKNH  DS    XL8                                                              
STLMKN   DS    CL16     6   16   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
STLPD1H  DS    XL8                                                              
STLPD1   DS    CL7      6   47    7  A  U N             T        Y              
STLPN1H  DS    XL8                                                              
STLPN1   DS    CL16     6   56   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
STLESTH  DS    XL8                                                              
STLEST   DS    CL3      7   10    3  A  U N             T        Y              
STLENMH  DS    XL8                                                              
STLENM   DS    CL20     7   16   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      7   38    3  A  P N             T        Y              
STLDPTH  DS    XL8                                                              
STLDPT   DS    CL1      7   47    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
STLLN1H  DS    XL8                                                              
STLLN1   DS    CL7      8   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
STLSWKH  DS    XL8                                                              
STLSWK   DS    CL10    10   18   10  A  U N             T        Y              
STLDAYH  DS    XL8                                                              
STLDAY   DS    CL3     10   60    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL35    11    2   35  A  P N             T        Y              
STLDM1H  DS    XL8                                                              
STLDM1   DS    CL8     11   44    8  A  P N             T        Y              
STLDM2H  DS    XL8                                                              
STLDM2   DS    CL8     11   53    8  A  P N             T        Y              
STLDM3H  DS    XL8                                                              
STLDM3   DS    CL8     11   62    8  A  P N             T        Y              
STLDM4H  DS    XL8                                                              
STLDM4   DS    CL8     11   71    8  A  P N             T        Y              
STLWKH   DS    XL8                                                              
STLWK    DS    CL9     12    2    9  A  P N             T        Y              
STLSPTH  DS    XL8                                                              
STLSPT   DS    CL4     12   13    4  A  P N             T        Y              
STLDOLH  DS    XL8                                                              
STLDOL   DS    CL10    12   20   10  A  P N             T        Y              
STLDOL2H DS    XL8                                                              
STLDOL2  DS    CL10    12   32   10  A  P N             T        Y              
STLD1H   DS    XL8                                                              
STLD1    DS    CL8     12   43    8  A  P N             T        Y              
STLD2H   DS    XL8                                                              
STLD2    DS    CL8     12   52    8  A  P N             T        Y              
STLD3H   DS    XL8                                                              
STLD3    DS    CL8     12   61    8  A  P N             T        Y              
STLD4H   DS    XL8                                                              
STLD4    DS    CL8     12   70    8  A  P N             T        Y              
STLWK2H  DS    XL8                                                              
STLWK2   DS    CL9     13    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     15    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     16    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     17    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     18    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     19    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     20    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     21    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     22    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     23    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     24    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     24   13    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    24   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    24   32   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   61    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   70    8  A  P N             T        Y              
STLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
STLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2144 BYTES                            
