*          DATA SET SPSFMB5D   AT LEVEL 001 AS OF 07/14/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297B5D      DATE 07/14/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFLMEDH  DS    XL8                                                              
SFLMED   DS    CL1      5   10    1  A  U H             T        Y    0         
SFLMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   20    2  A  P N             T        Y              
SFLIDH   DS    XL8                                                              
SFLID    DS    CL2      5   28    2  A  U H             T        Y    0         
SFLIDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   65    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36     7    2   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL45     8    2   45  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72     9    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    10    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    11    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    12    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    13    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    14    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    15    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    16    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    17    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    18    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    19    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    20    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    21    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    22    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    23    7   72  A  P N             T        Y              
SFLTAGH  DS    XL8                                                              
SFLTAG   DS    CL1     24    2    1  A  P N             T        Y              
SFLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SFLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1544 BYTES                            
