*          DATA SET SPSFMA6D   AT LEVEL 010 AS OF 04/28/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297A6D      DATE 04/28/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SPLMEDH  DS    XL8                                                              
SPLMED   DS    CL2      5   10    2  A  U H             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SPLRATH  DS    XL8                                                              
SPLRAT   DS    CL4      5   28    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SPLSTAH  DS    XL8                                                              
SPLSTA   DS    CL8      5   46    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   56    6  A  P H             T        Y              
SPLCLTH  DS    XL8                                                              
SPLCLT   DS    CL4      5   64    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   69    6  A  P H             T        Y              
SPLMKTH  DS    XL8                                                              
SPLMKT   DS    CL5      5   76    5  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL21     7    2   21  A  P H             T        Y              
SPLHDR2H DS    XL8                                                              
SPLHDR2  DS    CL56     7   25   56  A  P H             T        Y              
SPLSELH  DS    XL8                                                              
SPLSEL   DS    CL3      8    2    3  A  U N             T        Y              
SPLLIN1H DS    XL8                                                              
SPLLIN1  DS    CL74     8    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
SPLENDH  DS    XL8                                                              
SPLEND   DS    CL74    22    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    24    2   79  A  P N             T        Y              
SPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1728 BYTES                            
