*          DATA SET SPSFMBAD   AT LEVEL 014 AS OF 04/15/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217BAD      DATE 04/15/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CBLMEDIH DS    CL8                                                              
CBLMEDI  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
CBLCALLH DS    CL8                                                              
CBLCALL  DS    CL8      5   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
CBLOPTH  DS    CL8                                                              
CBLOPT   DS    CL32     5   46   32  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      7   10    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   14    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17     7   39   17  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      7   60    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      8   10    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      8   14    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17     8   39   17  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8   60    8  A  P H             T        Y              
CBLLISTH DS    CL8                                                              
CBLLIST  DS    CL78     9    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
CBLTAGH  DS    CL8                                                              
CBLTAG   DS    CL1     24    2    1  A  P N             T        Y              
CBLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
CBLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1576 BYTES                            
