*          DATA SET SPSFM9FD   AT LEVEL 007 AS OF 09/29/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2179FD      DATE 09/29/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
BILMEDH  DS    CL8                                                              
BILMED   DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
BILCLTH  DS    CL8                                                              
BILCLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   20    7  A  P H             T        Y              
BILPRDH  DS    CL8                                                              
BILPRD   DS    CL3      7   28    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      7   38    8  A  P H             T        Y              
BILESTH  DS    CL8                                                              
BILEST   DS    CL3      7   48    3  A  U N             T        Y              
BILESTDH DS    CL8                                                              
BILESTD  DS    CL17     7   52   17  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      8   20    6  A  P H             T        Y              
BILMKTH  DS    CL8                                                              
BILMKT   DS    CL4      8   28    4  A  U N             T        Y              
BILMKNMH DS    CL8                                                              
BILMKNM  DS    CL25     8   38   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL42    10    2   42  A  P H             T        Y              
BILPRD1H DS    CL8                                                              
BILPRD1  DS    CL3     11    2    3  A  U N             T        Y              
BILEST1H DS    CL8                                                              
BILEST1  DS    CL3     11    7    3  A  U N             T        Y              
BILMKT1H DS    CL8                                                              
BILMKT1  DS    CL4     11   12    4  A  U N             T        Y              
BILMOS1H DS    CL8                                                              
BILMOS1  DS    CL17    11   18   17  A  U N             T        Y              
BILFML1H DS    CL8                                                              
BILFML1  DS    CL40    11   37   40  A  U N             T        Y              
BILPRD2H DS    CL8                                                              
BILPRD2  DS    CL3     12    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    12   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    12   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    13   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    13   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    14   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    14   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    15   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    15   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    16   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    16   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    17   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    17   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    18   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    18   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    19   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    19   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    20   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    20   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    21   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    21   37   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    22   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    22   37   40  A  U N             T        Y              
BILPRDLH DS    CL8                                                              
BILPRDL  DS    CL3     23    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   12    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    23   18   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    23   37   40  A  U N             T        Y              
BILLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
BILWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1664 BYTES                            
