*          DATA SET SPSFME5D   AT LEVEL 004 AS OF 11/19/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297E5D      DATE 11/19/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
SPBMEDH  DS    XL8                                                              
SPBMED   DS    CL1      6   12    1  A  U N             T        Y              
SPBMNMH  DS    XL8                                                              
SPBMNM   DS    CL10     6   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SPBCLTH  DS    XL8                                                              
SPBCLT   DS    CL3      7   12    3  A  U N             T        Y              
SPBCNMH  DS    XL8                                                              
SPBCNM   DS    CL20     7   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SPBPRDH  DS    XL8                                                              
SPBPRD   DS    CL3      8   12    3  A  U N             T        Y              
SPBPNMH  DS    XL8                                                              
SPBPNM   DS    CL20     8   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P H             T        Y              
SPBESTH  DS    XL8                                                              
SPBEST   DS    CL3      9   12    3  A  U N             T        Y              
SPBENMH  DS    XL8                                                              
SPBENM   DS    CL20     9   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   75    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   12    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   42    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   52    7  A  P N             T        Y              
SPBPRD1H DS    XL8                                                              
SPBPRD1  DS    CL3     13    2    3  A  U N             T        Y              
SPBPCT1H DS    XL8                                                              
SPBPCT1  DS    CL6     13   12    6  A  U N             T        Y              
SPBPNM1H DS    XL8                                                              
SPBPNM1  DS    CL20    13   20   20  A  P N             T        Y              
SPBPRD2H DS    XL8                                                              
SPBPRD2  DS    CL3     13   42    3  A  U N             T        Y              
SPBPCT2H DS    XL8                                                              
SPBPCT2  DS    CL6     13   52    6  A  U N             T        Y              
SPBPNM2H DS    XL8                                                              
SPBPNM2  DS    CL20    13   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   52    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   52    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   52    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   52    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   52    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   52    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   52    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    21   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   52    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    21   60   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   12    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    22   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   42    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   52    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    22   60   20  A  P N             T        Y              
SPBLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SPBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1336 BYTES                            
