*          DATA SET SPSFMADD   AT LEVEL 049 AS OF 12/03/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217ADD      DATE 12/03/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  L  P N             T        Y              
SIRSTAH  DS    CL8                                                              
SIRSTA   DS    CL8      5   10    8  A  U H             T    I   Y    2         
SIRSTAX  DS    CL8                                                              
SIRDMKTH DS    CL8                                                              
SIRDMKT  DS    CL24     5   20   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  L  P N             T        Y              
SIRPERH  DS    CL8                                                              
SIRPER   DS    CL4      6   10    4  A  U H             T        Y   10         
SIRPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   20    6  L  P N             T        Y              
SIRSCHH  DS    CL8                                                              
SIRSCH   DS    CL3      6   28    3  A  U H             T        Y   12         
SIRSCHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    7    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   37    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   47    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   52    7  L  P N             T        Y              
SIRSELH  DS    CL8                                                              
SIRSEL   DS    CL3      9    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
SIRTAGH  DS    CL8                                                              
SIRTAG   DS    CL1     24    2    1  A  P N             T        Y              
SIRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SIRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1624 BYTES                            
