*          DATA SET SPSFMBCD   AT LEVEL 062 AS OF 02/14/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217BCD      DATE 02/14/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  L   P    H         T        Y              
SIRYRH   DS    CL8                                                              
SIRYR    DS    CL2      5   10    2  A   U    H         T    I   Y    8         
SIRYRX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  L   P    N         T        Y              
SIRSCHH  DS    CL8                                                              
SIRSCH   DS    CL3      5   28    3  A   U    H         T        Y   12         
SIRSCHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      7    7    5  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL7      7   19    7  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL11     7   54   11  L   P    N         T        Y              
SIRDPERH DS    CL8                                                              
SIRDPER  DS    CL4      8    2    4  A   P    N         T        Y              
SIRPERH  DS    CL8                                                              
SIRPER   DS    CL11     8    7   11  A   U    H         T        Y   20         
SIRPERX  DS    CL8                                                              
SIRUPGH  DS    CL8                                                              
SIRUPG   DS    CL34     8   19   34  A   U    H         T        Y   22         
SIRUPGX  DS    CL8                                                              
SIRBKSH  DS    CL8                                                              
SIRBKS   DS    CL27     8   54   27  A   U    H         T        Y   24         
SIRBKSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34     9   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27     9   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     10    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    10    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    10   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    10   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    11   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    11   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     12    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    12   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    12   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    13    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    13   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    13   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     14    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    14    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    14   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    14   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     15    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    15    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    15   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    15   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     16    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    16    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    16   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    16   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    17    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    17   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    17   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    18    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    18   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    18   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     19    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    19    7   11  A   U    H         T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    19   19   34  A   U    H         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    19   54   27  A   U    H         T        Y   24         
         DS    CL8                                                              
SIRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SIRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
