*          DATA SET SPSFMD2D   AT LEVEL 004 AS OF 11/17/20                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297D2D      DATE 11/17/20                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
MKMMEDIH DS    XL8                                                              
MKMMEDI  DS    CL1      5   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  L  P H             T        Y              
MKMMRKTH DS    XL8                                                              
MKMMRKT  DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   38    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  L  P N             T        Y              
MKMNAMEH DS    XL8                                                              
MKMNAME  DS    CL24     7   20   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      8    2    9  L  P N             T        Y              
MKMTZONH DS    XL8                                                              
MKMTZON  DS    CL1      8   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  L  P N             T        Y              
MKMRANKH DS    XL8                                                              
MKMRANK  DS    CL3      9   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  L  P N             T        Y              
MKMHOMSH DS    XL8                                                              
MKMHOMS  DS    CL8     10   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  L  P N             T        Y              
MKMNTAH  DS    XL8                                                              
MKMNTA   DS    CL2     11   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    12    2   13  L  P N             T        Y              
MKMWTH   DS    XL8                                                              
MKMWT    DS    CL5     12   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  L  P N             T        Y              
MKMSHRH  DS    XL8                                                              
MKMSHR   DS    CL5     13   20    5  A  U N             T        Y              
MKMRST1H DS    XL8                                                              
MKMRST1  DS    CL15    14    2   15  L  P N             T        Y              
MKMRSM1H DS    XL8                                                              
MKMRSM1  DS    CL4     14   20    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   28   11  L  P N             T        Y              
MKMSCL1H DS    XL8                                                              
MKMSCL1  DS    CL1     14   42    1  A  U N             T        Y              
MKMRSN1H DS    XL8                                                              
MKMRSN1  DS    CL30    14   46   30  L  P N             T        Y              
MKMRST2H DS    XL8                                                              
MKMRST2  DS    CL15    15    2   15  L  P N             T        Y              
MKMRSM2H DS    XL8                                                              
MKMRSM2  DS    CL4     15   20    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   28   11  L  P N             T        Y              
MKMSCL2H DS    XL8                                                              
MKMSCL2  DS    CL1     15   42    1  A  U N             T        Y              
MKMRSN2H DS    XL8                                                              
MKMRSN2  DS    CL30    15   46   30  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    16    2   16  L  P N             T        Y              
MKMLOCKH DS    XL8                                                              
MKMLOCK  DS    CL3     16   20    3  A  U N             T        Y              
MKMCSMTH DS    XL8                                                              
MKMCSMT  DS    CL17    16   46   17  L  P Z             T        Y              
MKMCSMKH DS    XL8                                                              
MKMCSMK  DS    CL5     16   64    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17    2   13  L  P N             T        Y              
MKMMKTSH DS    XL8                                                              
MKMMKTS  DS    CL35    17   20   35  A  U N             T        Y              
MKMRSTXH DS    XL8                                                              
MKMRSTX  DS    CL14    17   57   14  L  P N             T        Y              
MKMRSVCH DS    XL8                                                              
MKMRSVC  DS    CL3     17   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    2    5  L  P N             T        Y              
MKMUNITH DS    XL8                                                              
MKMUNIT  DS    CL4     18   20    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    19    2   14  L  P N             T        Y              
MKMSDATH DS    XL8                                                              
MKMSDAT  DS    CL6     19   20    6  A  U N             T        Y              
MKMCABH  DS    XL8                                                              
MKMCAB   DS    CL11    20    2   11  L  P N             T        Y              
MKMCDEMH DS    XL8                                                              
MKMCDEM  DS    CL1     20   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    21    2   13  L  P N             T        Y              
MKMTALMH DS    XL8                                                              
MKMTALM  DS    CL4     21   20    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22    2    8  L  P N             T        Y              
MKMBTYPH DS    XL8                                                              
MKMBTYP  DS    CL2     22   20    2  A  U N             T        Y              
MKMCBTXH DS    XL8                                                              
MKMCBTX  DS    CL17    22   28   17  L  P Z             T        Y              
MKMCBTYH DS    XL8                                                              
MKMCBTY  DS    CL2     22   46    2  A  P N             T        Y              
MKMLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
MKMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 848  BYTES                            
