*          DATA SET SPSFM6AD   AT LEVEL 006 AS OF 04/20/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2176AD      DATE 04/20/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
SSTMEDH  DS    XL8                                                              
SSTMED   DS    CL1      6   10    1  A  U N             T        Y    1         
SSTMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P H             T        Y              
SSTSTAH  DS    XL8                                                              
SSTSTA   DS    CL8      6   28    8  A  U N             T        Y    2         
SSTSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
SSTCLIH  DS    XL8                                                              
SSTCLI   DS    CL3      6   46    3  A  U N             T        Y    3         
SSTCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
SSTOPTH  DS    XL8                                                              
SSTOPT   DS    CL12     6   65   12  A  U N             T        Y   28         
SSTOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   69   11  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL17     8    2   17  A  P N             T        Y              
SSTCSNH  DS    XL8                                                              
SSTCSN   DS    CL24     8   20   24  A  U N             T        Y   23         
SSTCSNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8   55    6  A  P H             T        Y              
SSTGRPCH DS    XL8                                                              
SSTGRPC  DS    CL15     8   62   15  A  P N             T        Y   30         
SSTGRPCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     9    2   17  A  P N             T        Y              
SSTCNL1H DS    XL8                                                              
SSTCNL1  DS    CL60     9   20   60  A  U N             T        Y   24         
SSTCNL1X DS    XL8                                                              
SSTCNL2H DS    XL8                                                              
SSTCNL2  DS    CL79    10    2   79  A  U N             T        Y   24         
SSTCNL2X DS    XL8                                                              
SSTCNL3H DS    XL8                                                              
SSTCNL3  DS    CL79    11    2   79  A  U N             T        Y   24         
SSTCNL3X DS    XL8                                                              
SSTCNL4H DS    XL8                                                              
SSTCNL4  DS    CL79    12    2   79  A  U N             T        Y   24         
SSTCNL4X DS    XL8                                                              
SSTCNL5H DS    XL8                                                              
SSTCNL5  DS    CL79    13    2   79  A  U N             T        Y   24         
SSTCNL5X DS    XL8                                                              
SSTPFKYH DS    XL8                                                              
SSTPFKY  DS    CL79    24    2   79  A  P H             T        Y              
SSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
