*          DATA SET SPSFM67D   AT LEVEL 002 AS OF 10/10/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21767D      DATE 10/10/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
C2BMEDH  DS    CL8                                                              
C2BMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
C2BCLTH  DS    CL8                                                              
C2BCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
C2BPRDH  DS    CL8                                                              
C2BPRD   DS    CL3      5   46    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      5   56    8  A  P H             T        Y              
C2BESTH  DS    CL8                                                              
C2BEST   DS    CL3      5   65    3  A  U H             T        Y              
C2BEFLGH DS    CL8                                                              
C2BEFLG  DS    CL6      5   71    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
C2BMKTH  DS    CL8                                                              
C2BMKT   DS    CL5      6   10    5  A  U H             T        Y              
C2BMKNMH DS    CL8                                                              
C2BMKNM  DS    CL22     6   16   22  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL13     6   56   13  A  P H             T        Y              
C2BPRCTH DS    CL8                                                              
C2BPRCT  DS    CL8      6   70    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
C2BOPTNH DS    CL8                                                              
C2BOPTN  DS    CL25     7   10   25  A  U N             T        Y              
C2B1TIMH DS    CL8                                                              
C2B1TIM  DS    CL2      7   78    2  A  P Z             T        Y              
C2BESDTH DS    CL8                                                              
C2BESDT  DS    CL20     8    2   20  A  P H             T        Y              
C2BM1H   DS    CL8                                                              
C2BM1    DS    CL8      8   25    8  A  P H             T        Y              
C2BM2H   DS    CL8                                                              
C2BM2    DS    CL8      8   36    8  A  P H             T        Y              
C2BM3H   DS    CL8                                                              
C2BM3    DS    CL8      8   47    8  A  P H             T        Y              
C2BM4H   DS    CL8                                                              
C2BM4    DS    CL8      8   58    8  A  P H             T        Y              
C2BTTLH  DS    CL8                                                              
C2BTTL   DS    CL8      8   69    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     9    2   20  A  P N             T        Y              
C2BLCLTH DS    CL8                                                              
C2BLCLT  DS    CL8      9   25    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8      9   36    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8      9   47    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8      9   58    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8      9   69    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    10    2   20  A  P N             T        Y              
C2BCCLTH DS    CL8                                                              
C2BCCLT  DS    CL8     10   25    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   36    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   58    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   69    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    11    2   20  A  P N             T        Y              
C2BCBILH DS    CL8                                                              
C2BCBIL  DS    CL8     11   25    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   36    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   58    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   69    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
C2BLC2H  DS    CL8                                                              
C2BLC2   DS    CL8     13   25    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8     13   36    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8     13   47    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8     13   58    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8     13   69    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
C2BCC2H  DS    CL8                                                              
C2BCC2   DS    CL8     14   25    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   36    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   58    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   69    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  A  P N             T        Y              
C2BLWIMH DS    CL8                                                              
C2BLWIM  DS    CL8     16   25    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8     16   36    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8     16   47    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8     16   58    8  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL8     16   69    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    17    2   20  A  P N             T        Y              
C2BCWIMH DS    CL8                                                              
C2BCWIM  DS    CL8     17   25    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   36    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   47    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   58    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   69    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    18    2   20  A  P H             T        Y              
C2BDWIMH DS    CL8                                                              
C2BDWIM  DS    CL8     18   25    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   36    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   47    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   58    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     18   69    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    20    2   20  A  P H             T        Y              
C2BDCLTH DS    CL8                                                              
C2BDCLT  DS    CL8     20   25    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   36    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   47    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   58    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     20   69    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    21    2   20  A  P N             T        Y              
C2BBILLH DS    CL8                                                              
C2BBILL  DS    CL8     21   25    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   36    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   47    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   69    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    22    2   20  A  P N             T        Y              
C2BPJBLH DS    CL8                                                              
C2BPJBL  DS    CL8     22   25    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   36    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   47    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   58    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   69    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    23    2   20  A  P H             T        Y              
C2BPJC2H DS    CL8                                                              
C2BPJC2  DS    CL8     23   25    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     23   36    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     23   47    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     23   58    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8     23   69    8  A  U H             T        Y              
C2BPFLNH DS    CL8                                                              
C2BPFLN  DS    CL50    24    2   50  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     24   54    3  A  P N             T        Y              
C2BBYSTH DS    CL8                                                              
C2BBYST  DS    CL8     24   58    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     24   68    2  A  P N             T        Y              
C2BC2STH DS    CL8                                                              
C2BC2ST  DS    CL8     24   71    8  A  P H             T        Y              
C2BLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
C2BWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
