*          DATA SET SPSFM66D   AT LEVEL 020 AS OF 10/30/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21766D      DATE 10/30/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
C2MMEDH  DS    XL8                                                              
C2MMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
C2MCLTH  DS    XL8                                                              
C2MCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
C2MPRDH  DS    XL8                                                              
C2MPRD   DS    CL3      5   46    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      5   56    8  A  P H             T        Y              
C2MESTH  DS    XL8                                                              
C2MEST   DS    CL3      5   65    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
C2MMKTH  DS    XL8                                                              
C2MMKT   DS    CL5      6   10    5  A  U H             T        Y              
C2MMKNMH DS    XL8                                                              
C2MMKNM  DS    CL19     6   16   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   36    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
C2MGLTXH DS    XL8                                                              
C2MGLTX  DS    CL6      6   46    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      6   56    9  A  P H             T        Y              
C2MPRCTH DS    XL8                                                              
C2MPRCT  DS    CL8      6   68    8  A  P N             T        Y              
C2M1TIMH DS    XL8                                                              
C2M1TIM  DS    CL2      6   78    2  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
C2MOPTNH DS    XL8                                                              
C2MOPTN  DS    CL25     7   10   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      7   38    9  A  P N             T        Y              
C2MRQIDH DS    XL8                                                              
C2MRQID  DS    CL3      7   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      7   56    9  A  P H             T        Y              
C2MLOCKH DS    XL8                                                              
C2MLOCK  DS    CL8      7   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  P H             T        Y              
C2MSTATH DS    XL8                                                              
C2MSTAT  DS    CL12     9    2   12  A  P N             T        Y              
C2MCBUDH DS    XL8                                                              
C2MCBUD  DS    CL7      9   16    7  A  P N             T        Y              
C2MWBUDH DS    XL8                                                              
C2MWBUD  DS    CL7      9   25    7  A  P N             T        Y              
C2MCLCKH DS    XL8                                                              
C2MCLCK  DS    CL7      9   34    7  A  P N             T        Y              
C2MWLCKH DS    XL8                                                              
C2MWLCK  DS    CL7      9   43    7  A  P N             T        Y              
C2MCCOSH DS    XL8                                                              
C2MCCOS  DS    CL7      9   52    7  A  P N             T        Y              
C2MWCOSH DS    XL8                                                              
C2MWCOS  DS    CL7      9   61    7  A  P N             T        Y              
C2MCOS2H DS    XL8                                                              
C2MCOS2  DS    CL8      9   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   70    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   70    8  A  P Z             T        Y              
C2MLSTWH DS    XL8                                                              
C2MLSTW  DS    CL12    21    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   16    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   25    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   34    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   43    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   52    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   61    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   70    8  A  P Z             T        Y              
C2MSTTLH DS    XL8                                                              
C2MSTTL  DS    CL12    22    2   12  A  P H             T        Y              
C2MSACGH DS    XL8                                                              
C2MSACG  DS    CL7     22   16    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   25    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   34    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   43    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   52    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   61    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22   70    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     23    2    9  A  P N             T        Y              
C2MTGRPH DS    XL8                                                              
C2MTGRP  DS    CL7     23   16    7  A  P N             T        Y              
C2MESDTH DS    XL8                                                              
C2MESDT  DS    CL20    23   29   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   53    3  A  P N             T        Y              
C2MBYSTH DS    XL8                                                              
C2MBYST  DS    CL8     23   57    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     23   67    3  A  P N             T        Y              
C2MPWSTH DS    XL8                                                              
C2MPWST  DS    CL8     23   71    8  A  P H             T        Y              
C2MPFLNH DS    XL8                                                              
C2MPFLN  DS    CL78    24    2   78  A  P H             T        Y              
C2MLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
C2MWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2400 BYTES                            
