*          DATA SET SPSFMF2D   AT LEVEL 017 AS OF 08/14/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217F2D      DATE 08/14/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
LSTMEDH  DS    CL8                                                              
LSTMED   DS    CL1      5   10    1  A  U N             T    I   Y              
LSTMDNH  DS    CL8                                                              
LSTMDN   DS    CL10     5   20   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
LSTCLTH  DS    CL8                                                              
LSTCLT   DS    CL3      5   46    3  A  U N             T        Y              
LSTCLNH  DS    CL8                                                              
LSTCLN   DS    CL16     5   56   16  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
LSTMKTH  DS    CL8                                                              
LSTMKT   DS    CL4      6   10    4  A  U N             T        Y              
LSTMKNH  DS    CL8                                                              
LSTMKN   DS    CL16     6   20   16  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
LSTSTAH  DS    CL8                                                              
LSTSTA   DS    CL5      6   46    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
LSTPRDH  DS    CL8                                                              
LSTPRD   DS    CL7      7   10    7  A  U N             T        Y              
LSTPDNH  DS    CL8                                                              
LSTPDN   DS    CL16     7   20   16  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   38    4  A  P N             T        Y              
LSTESTH  DS    CL8                                                              
LSTEST   DS    CL3      7   46    3  A  U N             T        Y              
LSTESDH  DS    CL8                                                              
LSTESD   DS    CL19     7   56   19  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22     9    2   22  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28     9   27   28  A  P H             T        Y              
LSTSELH  DS    CL8                                                              
LSTSEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1656 BYTES                            
