*          DATA SET SPSFME7D   AT LEVEL 003 AS OF 10/07/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297E7D      DATE 10/07/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SPCOFFH  DS    XL8                                                              
SPCOFF   DS    CL2      5   10    2  A  U H             T    I   Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SPCSUPH  DS    XL8                                                              
SPCSUP   DS    CL4      5   28    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   35    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
SPCOPTH  DS    XL8                                                              
SPCOPT   DS    CL12     5   64   12  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SPCFNMH  DS    XL8                                                              
SPCFNM   DS    CL10     6   10   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6   28    6  A  P N             T        Y              
SPCLNMH  DS    XL8                                                              
SPCLNM   DS    CL14     6   38   14  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      6   56    3  A  P N             T        Y              
SPCPIDH  DS    XL8                                                              
SPCPID   DS    CL8      6   60    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SPCLISH  DS    XL8                                                              
SPCLIS   DS    CL1      7   20    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL21     7   28   21  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   56    5  A  P N             T        Y              
SPCMEDH  DS    XL8                                                              
SPCMED   DS    CL1      7   64    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
SPCFCLH  DS    XL8                                                              
SPCFCL   DS    CL9      8   15    9  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      8   25    9  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      8   35    9  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      8   45    9  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      8   55    9  A  U H             T        Y              
SPCLCLH  DS    XL8                                                              
SPCLCL   DS    CL9      8   65    9  A  U H             T        Y              
SPCSTRTH DS    XL8                                                              
SPCSTRT  DS    CL79    10    2   79  A  P H             T        Y              
SPCSELH  DS    XL8                                                              
SPCSEL   DS    CL1     11    2    1  A  U N             T        Y              
SPCCODEH DS    XL8                                                              
SPCCODE  DS    CL33    11    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    11   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    12    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    12   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    13    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    13   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    14    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    14   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    15    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    15   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    16    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    16   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    17    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    17   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    18    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    18   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    19    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    19   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    20    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    20   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    21    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    21   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    22    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    22   48   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL33    23    7   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   43    1  A  U N             T        Y              
SPCENDH  DS    XL8                                                              
SPCEND   DS    CL33    23   48   33  A  P N             T        Y              
SPCPFKYH DS    XL8                                                              
SPCPFKY  DS    CL64    24    2   64  A  P H             T        Y              
SPCREH   DS    XL8                                                              
SPCRE    DS    CL11    24   68   11  A  P Z             T        Y              
SPCLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SPCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1872 BYTES                            
