*          DATA SET SPSFMDCD   AT LEVEL 003 AS OF 07/31/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217DCD      DATE 07/31/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  L   P    H         T        Y              
PSRMEDH  DS    CL8                                                              
PSRMED   DS    CL1      5   10    1  A   U    H         T    I   Y              
PSRMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  L   P    H         T        Y              
PSRCLTH  DS    CL8                                                              
PSRCLT   DS    CL3      5   28    3  A   U    H         T        Y              
PSRCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   38    3  L   P    H         T        Y              
PSRREPH  DS    CL8                                                              
PSRREP   DS    CL3      5   46    3  A   U    H         T        Y              
PSRREPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      7   15    4  L   P    H         T        Y              
PSRDATEH DS    CL8                                                              
PSRDATE  DS    CL6      9    3    6  A   U    H         T        Y              
PSRDATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60     9   15   60  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10    3    6  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    10   15   60  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    3    6  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    11   15   60  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12    3    6  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    12   15   60  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13    3    6  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    13   15   60  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    3    6  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    14   15   60  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    3    6  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    15   15   60  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    3    6  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL60    16   15   60  A   U    H         T        Y              
         DS    CL8                                                              
PSRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
PSRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 917  BYTES                            
