*          DATA SET SPSFMB8D   AT LEVEL 007 AS OF 12/10/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217B8D      DATE 12/10/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
RNKMEDH  DS    CL8                                                              
RNKMED   DS    CL4      5   10    4  A  U N             T        Y    0         
RNKMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
RNKCLTH  DS    CL8                                                              
RNKCLT   DS    CL3      5   45    3  A  U N             T        Y    0         
RNKCLTX  DS    CL8                                                              
RNKCLTNH DS    CL8                                                              
RNKCLTN  DS    CL20     5   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
RNKPRDH  DS    CL8                                                              
RNKPRD   DS    CL3      6   10    3  A  U N             T        Y    0         
RNKPRDX  DS    CL8                                                              
RNKPRDNH DS    CL8                                                              
RNKPRDN  DS    CL20     6   15   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   38    3  A  P N             T        Y              
RNKESTH  DS    CL8                                                              
RNKEST   DS    CL3      6   45    3  A  U N             T        Y    0         
RNKESTX  DS    CL8                                                              
RNKESTNH DS    CL8                                                              
RNKESTN  DS    CL20     6   50   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
RNKSTAH  DS    CL8                                                              
RNKSTA   DS    CL8      7   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   19    7  A  P N             T        Y              
RNKDPTH  DS    CL8                                                              
RNKDPT   DS    CL8      7   27    8  A  U N             T        Y    0         
RNKDPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   38    6  A  P N             T        Y              
RNKLENH  DS    CL8                                                              
RNKLEN   DS    CL3      7   45    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   51    7  A  P N             T        Y              
RNKPERSH DS    CL8                                                              
RNKPERS  DS    CL8      7   59    8  A  U N             T        Y    0         
RNKPERSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   68    4  A  P N             T        Y              
RNKYRH   DS    CL8                                                              
RNKYR    DS    CL2      7   73    2  A  U N             T        Y    0         
RNKYRX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
RNKOPTH  DS    CL8                                                              
RNKOPT   DS    CL50     8   10   50  A  U N             T        Y    0         
RNKOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8   62    6  A  P N             T        Y              
RNKSCRLH DS    CL8                                                              
RNKSCRL  DS    CL3      8   69    3  A  U N             T        Y    0         
RNKSCRLX DS    CL8                                                              
RNKDEMH  DS    CL8                                                              
RNKDEM   DS    CL31     9   47   31  A  P N             T        Y              
RNKSEL1H DS    CL8                                                              
RNKSEL1  DS    CL2     10    2    2  A  U N             T        Y    0         
RNKSEL1X DS    CL8                                                              
RNKDET1H DS    CL8                                                              
RNKDET1  DS    CL32    10    6   32  A  P H             T        Y              
RNKDEM1H DS    CL8                                                              
RNKDEM1  DS    CL38    10   40   38  A  P N             T        Y              
RNKPRG1H DS    CL8                                                              
RNKPRG1  DS    CL24    11    2   24  A  P N             T        Y              
RNKCOS1H DS    CL8                                                              
RNKCOS1  DS    CL10    11   28   10  A  U N             T        Y    0         
RNKCOS1X DS    CL8                                                              
RNKCPP1H DS    CL8                                                              
RNKCPP1  DS    CL38    11   40   38  A  P N             T        Y              
RNKCOM1H DS    CL8                                                              
RNKCOM1  DS    CL30    12    2   30  A  U N             T        Y    0         
RNKCOM1X DS    CL8                                                              
RNKIDX1H DS    CL8                                                              
RNKIDX1  DS    CL38    12   40   38  A  P N             T        Y              
RNKSEL2H DS    CL8                                                              
RNKSEL2  DS    CL2     13    2    2  A  U N             T        Y    0         
RNKSEL2X DS    CL8                                                              
RNKDET2H DS    CL8                                                              
RNKDET2  DS    CL32    13    6   32  A  P H             T        Y              
RNKDEM2H DS    CL8                                                              
RNKDEM2  DS    CL38    13   40   38  A  P N             T        Y              
RNKPRG2H DS    CL8                                                              
RNKPRG2  DS    CL24    14    2   24  A  P N             T        Y              
RNKCOS2H DS    CL8                                                              
RNKCOS2  DS    CL10    14   28   10  A  U N             T        Y    0         
RNKCOS2X DS    CL8                                                              
RNKCPP2H DS    CL8                                                              
RNKCPP2  DS    CL38    14   40   38  A  P N             T        Y              
RNKCOM2H DS    CL8                                                              
RNKCOM2  DS    CL30    15    2   30  A  U N             T        Y    0         
RNKCOM2X DS    CL8                                                              
RNKIDX2H DS    CL8                                                              
RNKIDX2  DS    CL38    15   40   38  A  P N             T        Y              
RNKSEL3H DS    CL8                                                              
RNKSEL3  DS    CL2     16    2    2  A  U N             T        Y    0         
RNKSEL3X DS    CL8                                                              
RNKDET3H DS    CL8                                                              
RNKDET3  DS    CL32    16    6   32  A  P H             T        Y              
RNKDEM3H DS    CL8                                                              
RNKDEM3  DS    CL38    16   40   38  A  P N             T        Y              
RNKPRG3H DS    CL8                                                              
RNKPRG3  DS    CL24    17    2   24  A  P N             T        Y              
RNKCOS3H DS    CL8                                                              
RNKCOS3  DS    CL10    17   28   10  A  U N             T        Y    0         
RNKCOS3X DS    CL8                                                              
RNKCPP3H DS    CL8                                                              
RNKCPP3  DS    CL38    17   40   38  A  P N             T        Y              
RNKCOM3H DS    CL8                                                              
RNKCOM3  DS    CL30    18    2   30  A  U N             T        Y    0         
RNKCOM3X DS    CL8                                                              
RNKIDX3H DS    CL8                                                              
RNKIDX3  DS    CL38    18   40   38  A  P N             T        Y              
RNKSEL4H DS    CL8                                                              
RNKSEL4  DS    CL2     19    2    2  A  U N             T        Y    0         
RNKSEL4X DS    CL8                                                              
RNKDET4H DS    CL8                                                              
RNKDET4  DS    CL32    19    6   32  A  P H             T        Y              
RNKDEM4H DS    CL8                                                              
RNKDEM4  DS    CL38    19   40   38  A  P N             T        Y              
RNKPRG4H DS    CL8                                                              
RNKPRG4  DS    CL24    20    2   24  A  P N             T        Y              
RNKCOS4H DS    CL8                                                              
RNKCOS4  DS    CL10    20   28   10  A  U N             T        Y    0         
RNKCOS4X DS    CL8                                                              
RNKCPP4H DS    CL8                                                              
RNKCPP4  DS    CL38    20   40   38  A  P N             T        Y              
RNKCOM4H DS    CL8                                                              
RNKCOM4  DS    CL30    21    2   30  A  U N             T        Y    0         
RNKCOM4X DS    CL8                                                              
RNKIDX4H DS    CL8                                                              
RNKIDX4  DS    CL38    21   40   38  A  P N             T        Y              
RNKPFH   DS    CL8                                                              
RNKPF    DS    CL78    24    2   78  A  P H             T        Y              
RNKLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
RNKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
