*          DATA SET SPSFM65D   AT LEVEL 009 AS OF 07/14/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21765D      DATE 07/14/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CS2MEDH  DS    CL8                                                              
CS2MED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
CS2CLTH  DS    CL8                                                              
CS2CLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
CS2PRDH  DS    CL8                                                              
CS2PRD   DS    CL3      5   46    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL8      5   56    8  A  P H             T        Y              
CS2ESTH  DS    CL8                                                              
CS2EST   DS    CL3      5   65    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
CS2MKTH  DS    CL8                                                              
CS2MKT   DS    CL4      6   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
CS2OPTNH DS    CL8                                                              
CS2OPTN  DS    CL25     6   28   25  A  U N             T        Y    7         
CS2OPTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6   56    9  A  P H             T        Y              
CS2PRCTH DS    CL8                                                              
CS2PRCT  DS    CL8      6   68    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
CS2FLTRH DS    CL8                                                              
CS2FLTR  DS    CL45     7   10   45  A  U N             T        Y    8         
CS2FLTRX DS    CL8                                                              
CS2ESDTH DS    CL8                                                              
CS2ESDT  DS    CL20     7   56   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8   56    8  A  P N             T        Y              
CS2BUYRH DS    CL8                                                              
CS2BUYR  DS    CL3      8   65    3  A  U N             T        Y    9         
CS2BUYRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
CS2CHDRH DS    CL8                                                              
CS2CHDR  DS    CL78     9    2   78  L  P H             T        Y              
CS2SELH  DS    CL8                                                              
CS2SEL   DS    CL3     10    2    3  A  U N             T        Y    6         
CS2SELX  DS    CL8                                                              
CS2DATAH DS    CL8                                                              
CS2DATA  DS    CL75    10    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
CS2TOTLH DS    CL8                                                              
CS2TOTL  DS    CL75    23    6   75  A  P H             T        Y              
CS2PFLNH DS    CL8                                                              
CS2PFLN  DS    CL78    24    2   78  L  P H             T        Y              
CS2LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CS2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1856 BYTES                            
