*          DATA SET SPSFME9D   AT LEVEL 006 AS OF 09/23/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217E9D      DATE 09/23/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
BYTOFFH  DS    CL8                                                              
BYTOFF   DS    CL2      5   10    2  A  U H             T    I   Y              
         DS    CL8                                                              
         DS    CL9      5   20    9  A  P H             T        Y              
BYTBYOH  DS    CL8                                                              
BYTBYO   DS    CL4      5   31    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL9      5   38    9  A  P H             T        Y              
BYTBYNH  DS    CL8                                                              
BYTBYN   DS    CL4      5   49    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
BYTMEDH  DS    CL8                                                              
BYTMED   DS    CL1      6   10    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL18     7    2   18  A  P N             T        Y              
BYTOKH   DS    CL8                                                              
BYTOK    DS    CL2      7   22    2  A  U H             T        Y              
BYTSTRTH DS    CL8                                                              
BYTSTRT  DS    CL79    11    2   79  A  P H             T        Y              
BYTCODEH DS    CL8                                                              
BYTCODE  DS    CL23    12    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    12   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    12   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    13    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    13   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    13   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    14    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    14   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    14   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    15    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    15   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    15   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    16    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    16   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    16   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    17    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    17   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    17   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    18    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    18   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    18   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    19    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    19   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    19   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    20    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    20   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    20   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    21    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    21   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    21   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    22    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    22   29   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    22   56   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    23    2   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    23   29   23  A  P N             T        Y              
BYTENDH  DS    CL8                                                              
BYTEND   DS    CL23    23   56   23  A  P N             T        Y              
BYTPFKYH DS    CL8                                                              
BYTPFKY  DS    CL79    24    2   79  A  P N             T        Y              
BYTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BYTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1448 BYTES                            
