*          DATA SET SPSFMC5D   AT LEVEL 001 AS OF 09/26/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297C5D      DATE 09/26/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFMMEDH  DS    XL8                                                              
SFMMED   DS    CL1      5   10    1  A  U H             T        Y    0         
SFMMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   20    2  A  P H             T        Y              
SFMIDH   DS    XL8                                                              
SFMID    DS    CL2      5   28    2  A  U H             T        Y    0         
SFMIDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     7    2   13  A  P H             T        Y              
SFMBK1H  DS    XL8                                                              
SFMBK1   DS    CL12     7   17   12  A  U H             T        Y    0         
SFMBK1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   35    6  A  P H             T        Y              
SFMLN1H  DS    XL8                                                              
SFMLN1   DS    CL1      7   43    1  A  U H             T        Y    0         
SFMLN1X  DS    XL8                                                              
SFMZLN1H DS    XL8                                                              
SFMZLN1  DS    CL1      7   45    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
SFMBK2H  DS    XL8                                                              
SFMBK2   DS    CL12     8   17   12  A  U H             T        Y    0         
SFMBK2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8   35    6  A  P N             T        Y              
SFMLN2H  DS    XL8                                                              
SFMLN2   DS    CL1      8   43    1  A  U H             T        Y    0         
SFMLN2X  DS    XL8                                                              
SFMZLN2H DS    XL8                                                              
SFMZLN2  DS    CL1      8   45    1  A  P Z             T        Y              
SFMSMIDH DS    XL8                                                              
SFMSMID  DS    CL20     9    2   20  A  P Z             T        Y              
SFMSMI1H DS    XL8                                                              
SFMSMI1  DS    CL1      9   22    1  A  P Z             T        Y              
SFMSCM1H DS    XL8                                                              
SFMSCM1  DS    CL8      9   24    8  A  P Z             T        Y  111         
SFMSCM1X DS    XL8                                                              
SFMSMI2H DS    XL8                                                              
SFMSMI2  DS    CL1     10   22    1  A  P Z             T        Y              
SFMSCM2H DS    XL8                                                              
SFMSCM2  DS    CL8     10   24    8  A  P Z             T        Y  111         
SFMSCM2X DS    XL8                                                              
SFMSMI3H DS    XL8                                                              
SFMSMI3  DS    CL1     11   22    1  A  P Z             T        Y              
SFMSCM3H DS    XL8                                                              
SFMSCM3  DS    CL8     11   24    8  A  P Z             T        Y  111         
SFMSCM3X DS    XL8                                                              
SFMSMI4H DS    XL8                                                              
SFMSMI4  DS    CL1     12   22    1  A  P Z             T        Y              
SFMSCM4H DS    XL8                                                              
SFMSCM4  DS    CL8     12   24    8  A  P Z             T        Y  111         
SFMSCM4X DS    XL8                                                              
SFMSMI5H DS    XL8                                                              
SFMSMI5  DS    CL1     13   22    1  A  P Z             T        Y              
SFMSCM5H DS    XL8                                                              
SFMSCM5  DS    CL8     13   24    8  A  P Z             T        Y  111         
SFMSCM5X DS    XL8                                                              
SFMSMI6H DS    XL8                                                              
SFMSMI6  DS    CL1     14   22    1  A  P Z             T        Y              
SFMSCM6H DS    XL8                                                              
SFMSCM6  DS    CL8     14   24    8  A  P Z             T        Y  111         
SFMSCM6X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    16    2   14  A  P N             T        Y              
SFMBTKH  DS    XL8                                                              
SFMBTK   DS    CL1     16   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   33    8  A  P N             T        Y              
SFMCDTEH DS    XL8                                                              
SFMCDTE  DS    CL8     22   46    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   56    8  A  P N             T        Y              
SFMCRTRH DS    XL8                                                              
SFMCRTR  DS    CL8     22   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   33   12  A  P N             T        Y              
SFMADTEH DS    XL8                                                              
SFMADTE  DS    CL8     23   46    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    23   56   11  A  P N             T        Y              
SFMCWHOH DS    XL8                                                              
SFMCWHO  DS    CL8     23   68    8  A  P N             T        Y              
SFMTAGH  DS    XL8                                                              
SFMTAG   DS    CL1     24   78    1  A  P N             T        Y              
SFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 656  BYTES                            
