*          DATA SET SPSFMADR   AT LEVEL 004 AS OF 10/25/96                      
*                                                                               
* USED FOR ADDRESS RECORDS                                                      
* WHEN CHANGING THIS MUST RELINK SPSFM15(MAINTENANCE) AND SPSFM32(LIST)         
*                                                                               
MYSVKEY  DS    CL(L'KEY)                                                        
RECFLAG  DS    X                                                                
RECCHNGD EQU   X'80'               RECORD HAS CHANGED                           
INITLZED EQU   X'40'               ALREADY INITIALIZED                          
SVMYPSWD DS    XL2                 AUTHORIZATION NUMBER                         
SVSECAGY DS    XL2                 SECURITY AGENCY                              
SVPASSWD DS    XL2                 AUTHORIZATION NUMBER                         
