*          DATA SET SPSFM6FD   AT LEVEL 003 AS OF 12/23/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2976FD      DATE 12/23/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
CBMMEDIH DS    XL8                                                              
CBMMEDI  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
CBMCALLH DS    XL8                                                              
CBMCALL  DS    CL8      5   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
CBMCLTH  DS    XL8                                                              
CBMCLT   DS    CL3      5   46    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     7    2   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      7   23    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9      7   43    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL17     8    2   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      8   23    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9      8   43    9  A  P H             T        Y              
CBMITCH  DS    XL8                                                              
CBMITC   DS    CL20     9    2   20  A  U N             T        Y              
CBMMSOH  DS    XL8                                                              
CBMMSO   DS    CL15     9   23   15  A  U N             T        Y              
CBMMSO1H DS    XL8                                                              
CBMMSO1  DS    CL15     9   43   15  A  U N             T        Y              
CBMLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
CBMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 280  BYTES                            
