*          DATA SET SPSFMBBD   AT LEVEL 068 AS OF 06/18/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217BBD      DATE 06/18/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  L   P    H         T        Y              
SIRSCHH  DS    CL8                                                              
SIRSCH   DS    CL3      5   10    3  A   U    H         T    I   Y   12         
SIRSCHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   17    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  L   P    H         T        Y              
SIRNAMEH DS    CL8                                                              
SIRNAME  DS    CL24     7   10   24  A   U    H         T        Y   50         
SIRNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   38    6  L   P    N         T        Y              
SIRSRCH  DS    CL8                                                              
SIRSRC   DS    CL3      7   46    3  A   U    H         T        Y   47         
SIRSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  L   P    N         T        Y              
SIROPTSH DS    CL8                                                              
SIROPTS  DS    CL70     8   10   70  A   U    H         T        Y   60         
SIROPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28     9    2   28  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL21     9   31   21  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL27     9   53   27  A   P    N         T        Y              
SIRDAYH  DS    CL8                                                              
SIRDAY   DS    CL78    10    2   78  A   U    H         T        Y   52         
SIRDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    11    2   78  A   U    H         T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    12    2   78  A   U    H         T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL26    14    2   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL26    14   29   26  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL24    14   56   24  A   P    N         T        Y              
SIRPRGH  DS    CL8                                                              
SIRPRG   DS    CL78    15    2   78  A   U    H         T        Y   54         
SIRPRGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    16    2   78  A   U    H         T        Y   54         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    17    2   78  A   U    H         T        Y   54         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19    2    7  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     19   16    1  A   P    N         T        Y              
SIRPERH  DS    CL8                                                              
SIRPER   DS    CL4     19   19    4  A   U    H         T        Y   55         
SIRPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   27    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   30    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   38    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   41    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   49    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   52    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   60    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   63    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   71    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   74    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   16    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   19    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   27    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   30    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   38    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   41    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20   49    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   52    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20   60    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   63    4  A   U    H         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20   71    2  A   P    N         T        Y              
SIRPERLH DS    CL8                                                              
SIRPERL  DS    CL4     20   74    4  A   U    H         T        Y   55         
SIRPERLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     21    2    9  L   P    N         T        Y              
SIRDEMH  DS    CL8                                                              
SIRDEM   DS    CL4     21   16    4  A   U    H         T        Y   56         
SIRDEMX  DS    CL8                                                              
SIRDMNMH DS    CL8                                                              
SIRDMNM  DS    CL7     21   27    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   38    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   49    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   60    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   71    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   27    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   38    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   49    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   60    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   71    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23   27    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23   38    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23   49    7  A   P    N         T        Y              
SIRDLSTH DS    CL8                                                              
SIRDLST  DS    CL7     23   60    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    24    2   12  L   P    H         T        Y              
SIRYRH   DS    CL8                                                              
SIRYR    DS    CL2     24   16    2  A   U    H         T        Y   58         
SIRYRX   DS    CL8                                                              
SIRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SIRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1648 BYTES                            
