*          DATA SET SPSFMB7D   AT LEVEL 020 AS OF 01/05/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217B7D      DATE 01/05/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  L  P H             T        Y              
SRTSTAH  DS    CL8                                                              
SRTSTA   DS    CL8      5   10    8  A  U H             T    I   Y    2         
SRTSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   19    3  L  P H             T        Y              
SRTDPTH  DS    CL8                                                              
SRTDPT   DS    CL1      5   24    1  A  U H             T        Y    4         
SRTDPTX  DS    CL8                                                              
SRTSCRNH DS    CL8                                                              
SRTSCRN  DS    CL2      5   30    2  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL6      5   34    6  L  P H             T        Y              
SRTPERH  DS    CL8                                                              
SRTPER   DS    CL4      5   41    4  A  U H             T        Y   10         
SRTPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   55    4  L  P N             T        Y              
SRTYRH   DS    CL8                                                              
SRTYR    DS    CL2      5   60    2  A  U H             T        Y    8         
SRTYRX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   67    6  L  P N             T        Y              
SRTSCHH  DS    CL8                                                              
SRTSCH   DS    CL3      5   74    3  A  U H             T        Y   12         
SRTSCHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6    2    6  L  P N             T        Y              
SRTSRCH  DS    CL8                                                              
SRTSRC   DS    CL6      6   10    6  A  P H             T        Y   10         
SRTSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   19    4  L  P H             T        Y              
SRTDAYH  DS    CL8                                                              
SRTDAY   DS    CL7      6   24    7  A  U H             T        Y    6         
SRTDAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   34    5  L  P H             T        Y              
SRTTIMEH DS    CL8                                                              
SRTTIME  DS    CL11     6   41   11  A  U H             T        Y    7         
SRTTIMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   55    4  L  P N             T        Y              
SRTMNUH  DS    CL8                                                              
SRTMNU   DS    CL7      6   60    7  A  U H             T        Y    8         
SRTMNUX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
SRTMSGH  DS    CL8                                                              
SRTMSG   DS    CL75     7    2   75  A  P h             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
SRTCSTH  DS    CL8                                                              
SRTCST   DS    CL8      8    8    8  A  U H             T        Y    0         
SRTCSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   29    7  A  P N             T        Y              
SRTUPGH  DS    CL8                                                              
SRTUPG   DS    CL32     8   38   32  A  U H             T        Y    0         
SRTUPGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
SRTBK1H  DS    CL8                                                              
SRTBK1   DS    CL6      9   16    6  A  U H             T        Y    0         
SRTBK1X  DS    CL8                                                              
SRTBK2H  DS    CL8                                                              
SRTBK2   DS    CL6      9   29    6  A  U H             T        Y    0         
SRTBK2X  DS    CL8                                                              
SRTBK3H  DS    CL8                                                              
SRTBK3   DS    CL6      9   42    6  A  U H             T        Y    0         
SRTBK3X  DS    CL8                                                              
SRTBK4H  DS    CL8                                                              
SRTBK4   DS    CL6      9   55    6  A  U H             T        Y    0         
SRTBK4X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     9   64   17  A  P N             T        Y              
SRTHD1H  DS    CL8                                                              
SRTHD1   DS    CL52    10   10   52  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   77    4  A  P N             T        Y              
SRTHD2H  DS    CL8                                                              
SRTHD2   DS    CL52    11   10   52  A  P N             T        Y              
SRTPRGH  DS    CL8                                                              
SRTPRG   DS    CL17    11   63   17  A  U H             T        Y    0         
SRTPRGX  DS    CL8                                                              
SRTDM1H  DS    CL8                                                              
SRTDM1   DS    CL7     12    2    7  A  P N             T        Y              
SRTSELH  DS    CL8                                                              
SRTSEL   DS    CL1     12   10    1  A  U N             T        Y   66         
SRTSELX  DS    CL8                                                              
SRTLN1H  DS    CL8                                                              
SRTLN1   DS    CL49    12   12   49  A  P N             T        Y    0         
SRTLN1X  DS    CL8                                                              
SRTRTGH  DS    CL8                                                              
SRTRTG   DS    CL10    12   63   10  A  U N             T        Y    0         
SRTRTGX  DS    CL8                                                              
SRTCPPH  DS    CL8                                                              
SRTCPP   DS    CL7     12   74    7  A  P N             T        Y              
SRTLN2H  DS    CL8                                                              
SRTLN2   DS    CL56    13    5   56  A  P N             T        Y              
SRTSHPH  DS    CL8                                                              
SRTSHP   DS    CL10    13   63   10  A  U N             T        Y    0         
SRTSHPX  DS    CL8                                                              
SRTDM2H  DS    CL8                                                              
SRTDM2   DS    CL7     14    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   10    1  A  U N             T        Y   66         
         DS    CL8                                                              
SRTLN3H  DS    CL8                                                              
SRTLN3   DS    CL49    14   12   49  A  P N             T        Y    0         
SRTLN3X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    15    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   10    1  A  U N             T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    16   12   49  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    17    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   10    1  A  U N             T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    18   12   49  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    19    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   10    1  A  U N             T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    20   12   49  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    20   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    21    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   10    1  A  U N             T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    22   12   49  A  P N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    22   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22   74    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    23    5   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   63   10  A  U N             T        Y    0         
         DS    CL8                                                              
SRTCMTH  DS    CL8                                                              
SRTCMT   DS    CL75    24    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   78    1  A  U N             T        Y              
SRTLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SRTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2272 BYTES                            
