*          DATA SET SPSFMFDD   AT LEVEL 010 AS OF 10/28/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217FDD      DATE 10/28/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PGLMEDH  DS    CL8                                                              
PGLMED   DS    CL1      5   10    1  A  U H             T    I   Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
PGLCLTH  DS    CL8                                                              
PGLCLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
PGLGRPH  DS    CL8                                                              
PGLGRP   DS    CL4      5   48    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
PGLMDNH  DS    CL8                                                              
PGLMDN   DS    CL10     6    2   10  A  P N             T        Y              
PGLCLNH  DS    CL8                                                              
PGLCLN   DS    CL16     6   20   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79     8    2   79  A  P H             T        Y              
PGLSELH  DS    CL8                                                              
PGLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
PGLENDH  DS    CL8                                                              
PGLEND   DS    CL74    23    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    24    2   79  A  P N             T        Y              
PGLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PGLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
