*          DATA SET SPSFMECD   AT LEVEL 001 AS OF 01/14/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297ECD      DATE 01/14/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
MSLMEDIH DS    XL8                                                              
MSLMEDI  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  L  P N             T        Y              
MSLSTATH DS    XL8                                                              
MSLSTAT  DS    CL8      5   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  L  P N             T        Y              
MSLOPTNH DS    XL8                                                              
MSLOPTN  DS    CL32     5   46   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7    7    7  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   16    6  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   24    7  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL11     7   33   11  L  P H             T        Y              
MSLFMTH  DS    XL8                                                              
MSLFMT   DS    CL6      7   59    6  L  P H             T        Y              
MSLUIDCH DS    XL8                                                              
MSLUIDC  DS    CL6      7   67    6  L  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8    7    7  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   16    6  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8   24    7  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL24     8   33   24  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   59    6  L  P H             T        Y              
MSLUIDDH DS    XL8                                                              
MSLUIDD  DS    CL6      8   67    6  L  P Z             T        Y              
MSLSELH  DS    XL8                                                              
MSLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
MSLTAGH  DS    XL8                                                              
MSLTAG   DS    CL1     24    2    1  A  P N             T        Y              
MSLLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
MSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
