*          DATA SET SPSFMAED   AT LEVEL 039 AS OF 12/04/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217AED      DATE 12/04/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  L  P N             T        Y              
SRLSTAH  DS    CL8                                                              
SRLSTA   DS    CL8      5   10    8  A  U H             T    I   Y    2         
SRLSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   20    3  L  P N             T        Y              
SRLDPTH  DS    CL8                                                              
SRLDPT   DS    CL1      5   28    1  A  U H             T        Y    4         
SRLDPTX  DS    CL8                                                              
SRLSCRNH DS    CL8                                                              
SRLSCRN  DS    CL2      5   30    2  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  L  P N             T        Y              
SRLPERH  DS    CL8                                                              
SRLPER   DS    CL4      5   45    4  A  U H             T        Y   10         
SRLPERX  DS    CL8                                                              
SRLDPERH DS    CL8                                                              
SRLDPER  DS    CL17     5   56   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  L  P N             T        Y              
SRLYRH   DS    CL8                                                              
SRLYR    DS    CL2      6   10    2  A  U H             T        Y    8         
SRLYRX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   20    6  L  P N             T        Y              
SRLSCHH  DS    CL8                                                              
SRLSCH   DS    CL3      6   28    3  A  U H             T        Y   12         
SRLSCHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      6   38    3  L  P Z             T        Y              
         DS    CL8                                                              
         DS    CL1      6   45    1  A  P Z             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   56    7  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL1      6   65    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    7    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   38    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   47    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   52    3  L  P N             T        Y              
SRLSELH  DS    CL8                                                              
SRLSEL   DS    CL1      9    3    1  A  U H             T        Y              
SRLDATAH DS    CL8                                                              
SRLDATA  DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24    3    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    24    7   74  A  P N             T        Y              
SRLLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SRLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
