*          DATA SET SPSFMEED   AT LEVEL 004 AS OF 05/13/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217EED      DATE 05/13/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  L   P    H         T        Y              
ESRMEDH  DS    CL8                                                              
ESRMED   DS    CL1      5   10    1  A   U    H         T    I   Y              
ESRMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  L   P    N         T        Y              
ESRCLTH  DS    CL8                                                              
ESRCLT   DS    CL3      5   28    3  A   U    H         T        Y              
ESRCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7   10    3  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7   15    3  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7   20    3  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7   28    8  L   P    N         T        Y              
ESRSELH  DS    CL8                                                              
ESRSEL   DS    CL3      8    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74     8    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24    2    1  A   P    N         T        Y              
ESRLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
ESRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
