*          DATA SET SPSFMFCD   AT LEVEL 016 AS OF 02/21/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217FCD      DATE 02/21/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
STTMEDH  DS    CL8                                                              
STTMED   DS    CL7      5   11    7  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
STTCLIH  DS    CL8                                                              
STTCLI   DS    CL3      5   28    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A   P    N         T        Y              
STTKPRH  DS    CL8                                                              
STTKPR   DS    CL5      5   46    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8      5   56    8  A   P    N         T        Y              
STTKESH  DS    CL8                                                              
STTKES   DS    CL5      5   65    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6    2    8  A   P    N         T        Y              
STTSATH  DS    CL8                                                              
STTSAT   DS    CL7      6   11    7  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      6   20    6  A   P    N         T        Y              
STTPERH  DS    CL8                                                              
STTPER   DS    CL25     6   28   25  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
STTOPTH  DS    CL8                                                              
STTOPT   DS    CL66     7   11   66  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5      9   34    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      9   40    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      9   47    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   28    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   34    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   39    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   44    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     10   49    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     10   55    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     10   68    5  A   P    N         T        Y              
STTPRDH  DS    CL8                                                              
STTPRD   DS    CL3     11    2    3  A   P    N         T        Y              
STTESTH  DS    CL8                                                              
STTEST   DS    CL3     11    6    3  A   P    N         T        Y              
STTMKTH  DS    CL8                                                              
STTMKT   DS    CL4     11   10    4  A   U    N         T        Y              
STTMNMH  DS    CL8                                                              
STTMNM   DS    CL12    11   15   12  A   P    N         T        Y              
STTSTAH  DS    CL8                                                              
STTSTA   DS    CL5     11   28    5  A   U    N         T        Y              
STTBUYH  DS    CL8                                                              
STTBUY   DS    CL1     11   35    1  A   U    N         T        Y              
STTMATH  DS    CL8                                                              
STTMAT   DS    CL1     11   40    1  A   P    N         T        Y              
STTPAYH  DS    CL8                                                              
STTPAY   DS    CL1     11   45    1  A   P    N         T        Y              
STTLOCH  DS    CL8                                                              
STTLOC   DS    CL1     11   50    1  A   U    N         T        Y              
STTBYRH  DS    CL8                                                              
STTBYR   DS    CL12    11   55   12  A   U    N         T        Y              
STTPYRH  DS    CL8                                                              
STTPYR   DS    CL12    11   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    6    3  A   P    N         T        Y              
STTMK2H  DS    CL8                                                              
STTMK2   DS    CL4     12   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     21   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     22   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     23   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    23   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    23   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    23   68   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24    6    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     24   10    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    24   15   12  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     24   28    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   35    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   40    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   50    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    24   55   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    24   68   12  A   U    N         T        Y              
STTLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
STTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2448 BYTES                            
