*          DATA SET SPSFMEFD   AT LEVEL 005 AS OF 08/31/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297EFD      DATE 08/31/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
DCPNETH  DS    XL8                                                              
DCPNET   DS    CL4      5   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
DCPRTSH  DS    XL8                                                              
DCPRTS   DS    CL3      5   30    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
DCPCLTH  DS    XL8                                                              
DCPCLT   DS    CL3      5   46    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   56    5  A  P N             T        Y              
DCPSEQH  DS    XL8                                                              
DCPSEQ   DS    CL1      5   62    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P H             T        Y              
DCPFSHWH DS    XL8                                                              
DCPFSHW  DS    CL4      7   14    4  A  U N             T        Y              
DCPFPGMH DS    XL8                                                              
DCPFPGM  DS    CL40     7   20   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
DCPTSHWH DS    XL8                                                              
DCPTSHW  DS    CL4      8   14    4  A  U N             T        Y              
DCPTPGMH DS    XL8                                                              
DCPTPGM  DS    CL40     8   20   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL31    10    2   31  A  P N             T        Y              
DCPOVRWH DS    XL8                                                              
DCPOVRW  DS    CL1     10   34    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12    2    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   14    9  A  P N             T        Y              
DCPALLDH DS    XL8                                                              
DCPALLD  DS    CL1     12   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
DCPDEM1H DS    XL8                                                              
DCPDEM1  DS    CL1     13   10    1  A  U N             T        Y              
DCPDM1NH DS    XL8                                                              
DCPDM1N  DS    CL10    13   12   10  A  P N             T        Y              
DCPDEM2H DS    XL8                                                              
DCPDEM2  DS    CL1     13   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   26   10  A  P N             T        Y              
DCPDEM3H DS    XL8                                                              
DCPDEM3  DS    CL1     13   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   40   10  A  P N             T        Y              
DCPDEM4H DS    XL8                                                              
DCPDEM4  DS    CL1     13   52    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   54   10  A  P N             T        Y              
DCPDEM5H DS    XL8                                                              
DCPDEM5  DS    CL1     13   66    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   68   10  A  P N             T        Y              
DCPDEM6H DS    XL8                                                              
DCPDEM6  DS    CL1     14   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   12   10  A  P N             T        Y              
DCPDEM7H DS    XL8                                                              
DCPDEM7  DS    CL1     14   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   26   10  A  P N             T        Y              
DCPDEM8H DS    XL8                                                              
DCPDEM8  DS    CL1     14   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   40   10  A  P N             T        Y              
DCPDEM9H DS    XL8                                                              
DCPDEM9  DS    CL1     14   52    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   54   10  A  P N             T        Y              
DCPDEM0H DS    XL8                                                              
DCPDEM0  DS    CL1     14   66    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   68   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    16    2   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   14    9  A  P N             T        Y              
DCPALLIH DS    XL8                                                              
DCPALLI  DS    CL1     16   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
DCPDI1H  DS    XL8                                                              
DCPDI1   DS    CL1     17   10    1  A  U N             T        Y              
DCPDI1NH DS    XL8                                                              
DCPDI1N  DS    CL14    17   12   14  A  P N             T        Y              
DCPDI2H  DS    XL8                                                              
DCPDI2   DS    CL1     17   28    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    17   30   14  A  P N             T        Y              
DCPDI3H  DS    XL8                                                              
DCPDI3   DS    CL1     17   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    17   48   14  A  P N             T        Y              
DCPDI4H  DS    XL8                                                              
DCPDI4   DS    CL1     17   64    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    17   66   14  A  P N             T        Y              
DCPDI5H  DS    XL8                                                              
DCPDI5   DS    CL1     18   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    18   12   14  A  P N             T        Y              
DCPDI6H  DS    XL8                                                              
DCPDI6   DS    CL1     18   28    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    18   30   14  A  P N             T        Y              
DCPDI7H  DS    XL8                                                              
DCPDI7   DS    CL1     18   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    18   48   14  A  P N             T        Y              
DCPDI8H  DS    XL8                                                              
DCPDI8   DS    CL1     18   64    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    18   66   14  A  P N             T        Y              
DCPDI9H  DS    XL8                                                              
DCPDI9   DS    CL1     19   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   12   14  A  P N             T        Y              
DCPDI10H DS    XL8                                                              
DCPDI10  DS    CL1     19   28    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   30   14  A  P N             T        Y              
DCPDI11H DS    XL8                                                              
DCPDI11  DS    CL1     19   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   48   14  A  P N             T        Y              
DCPDI12H DS    XL8                                                              
DCPDI12  DS    CL1     19   64    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   66   14  A  P N             T        Y              
DCPDI13H DS    XL8                                                              
DCPDI13  DS    CL1     20   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   12   14  A  P N             T        Y              
DCPDI14H DS    XL8                                                              
DCPDI14  DS    CL1     20   28    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   30   14  A  P N             T        Y              
DCPDI15H DS    XL8                                                              
DCPDI15  DS    CL1     20   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   48   14  A  P N             T        Y              
DCPDI16H DS    XL8                                                              
DCPDI16  DS    CL1     20   64    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   66   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    22    2   14  A  P N             T        Y              
DCPADJH  DS    XL8                                                              
DCPADJ   DS    CL6     22   18    6  A  U N             T        Y              
DCPLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
DCPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1232 BYTES                            
