*          DATA SET SPSFME8D   AT LEVEL 003 AS OF 03/31/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297E8D      DATE 03/31/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
BYMOFFH  DS    XL8                                                              
BYMOFF   DS    CL2      5   10    2  A  U H             T    I   Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
BYMBYCH  DS    XL8                                                              
BYMBYC   DS    CL4      5   28    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
BYMFNMH  DS    XL8                                                              
BYMFNM   DS    CL10     6   10   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6   28    6  A  P N             T        Y              
BYMLNMH  DS    XL8                                                              
BYMLNM   DS    CL14     6   38   14  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      6   56    3  A  P N             T        Y              
BYMPIDH  DS    XL8                                                              
BYMPID   DS    CL8      6   60    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10     7    2   10  A  P N             T        Y              
BYMNWSTH DS    XL8                                                              
BYMNWST  DS    CL3      7   15    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11     7   20   11  A  P N             T        Y              
BYMDARTH DS    XL8                                                              
BYMDART  DS    CL3      7   33    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4      7   38    4  A  P N             T        Y              
BYMSUPH  DS    XL8                                                              
BYMSUP   DS    CL4      7   46    4  A  U H             T        Y              
BYMSPNH  DS    XL8                                                              
BYMSPN   DS    CL24     7   56   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
BYMNWSRH DS    XL8                                                              
BYMNWSR  DS    CL3      8   15    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11     8   20   11  A  P N             T        Y              
BYMDARRH DS    XL8                                                              
BYMDARR  DS    CL3      8   33    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   38    6  A  P N             T        Y              
BYMOFOFH DS    XL8                                                              
BYMOFOF  DS    CL2      8   46    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   56    6  A  P N             T        Y              
BYMFILTH DS    XL8                                                              
BYMFILT  DS    CL1      8   64    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
BYMMEDH  DS    XL8                                                              
BYMMED   DS    CL1      9   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL5      9   20    5  A  P N             T        Y              
BYMBYRH  DS    XL8                                                              
BYMBYR   DS    CL10     9   26   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      9   38    7  A  P N             T        Y              
BYMOPTH  DS    XL8                                                              
BYMOPT   DS    CL34     9   46   34  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
BYMFMKH  DS    XL8                                                              
BYMFMK   DS    CL7     10   20    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     10   29    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     10   38    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     10   47    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     10   56    7  A  U H             T        Y              
BYMLMKH  DS    XL8                                                              
BYMLMK   DS    CL7     10   65    7  A  U H             T        Y              
BYMSTRTH DS    XL8                                                              
BYMSTRT  DS    CL79    11    2   79  A  P H             T        Y              
BYMCODEH DS    XL8                                                              
BYMCODE  DS    CL23    12    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    12   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    12   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    13    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    13   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    13   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    14    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    14   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    14   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    15    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    15   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    15   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    16    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    16   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    16   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    17    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    17   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    17   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    18    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    18   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    18   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    19    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    19   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    19   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    20    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    20   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    20   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    21    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    21   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    21   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    22    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    22   29   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    22   56   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    23    2   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    23   29   23  A  P N             T        Y              
BYMENDH  DS    XL8                                                              
BYMEND   DS    CL23    23   56   23  A  P N             T        Y              
BYMPFKYH DS    XL8                                                              
BYMPFKY  DS    CL64    24    2   64  A  P H             T        Y              
BYMREH   DS    XL8                                                              
BYMRE    DS    CL11    24   68   11  A  P Z             T        Y              
BYMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BYMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
