*          DATA SET SPSFMA7D   AT LEVEL 002 AS OF 04/03/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297A7D      DATE 04/03/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
DEMNETH  DS    XL8                                                              
DEMNET   DS    CL4      5   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   20    4  A  P H             T        Y              
DEMPGMH  DS    XL8                                                              
DEMPGM   DS    CL4      5   28    4  A  U N             T        Y              
DEMPGMDH DS    XL8                                                              
DEMPGMD  DS    CL40     5   38   40  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DEMRTSH  DS    XL8                                                              
DEMRTS   DS    CL3      6   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
DEMCLTH  DS    XL8                                                              
DEMCLT   DS    CL3      6   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   38    5  A  P N             T        Y              
DEMSEQH  DS    XL8                                                              
DEMSEQ   DS    CL1      6   44    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
DEMSRCBH DS    XL8                                                              
DEMSRCB  DS    CL7      8   15    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL23     8   25   23  A  P N             T        Y              
DEMUNTBH DS    XL8                                                              
DEMUNTB  DS    CL7      8   50    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
DEMDEM1H DS    XL8                                                              
DEMDEM1  DS    CL10    10   13   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   26   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   50   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   62   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   13   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   26   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   50   10  A  U N             T        Y              
DEMDEMXH DS    XL8                                                              
DEMDEMX  DS    CL10    11   62   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P N             T        Y              
DEMIMP1H DS    XL8                                                              
DEMIMP1  DS    CL14    13   13   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   29   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   45   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   61   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   13   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   29   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   45   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   61   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   13   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   29   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   45   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   61   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    16   13   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    16   29   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    16   45   14  A  U N             T        Y              
DEMIMPXH DS    XL8                                                              
DEMIMPX  DS    CL14    16   61   14  A  U N             T        Y              
DEMDMOVH DS    XL8                                                              
DEMDMOV  DS    CL1     17   13    1  A  U N             T        Y              
DEMMSGHH DS    XL8                                                              
DEMMSGH  DS    CL78    19    2   78  A  P Z             T        Y              
DEMMSGDH DS    XL8                                                              
DEMMSGD  DS    CL78    20    2   78  A  P Z             T        Y              
DEMMSGIH DS    XL8                                                              
DEMMSGI  DS    CL78    21    2   78  A  P Z             T        Y              
DEMLN24H DS    XL8                                                              
DEMLN24  DS    CL78    24    2   78  A  P H             T        Y              
DEMLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1184 BYTES                            
