*          DATA SET SPSFMC4D   AT LEVEL 002 AS OF 04/21/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217C4D      DATE 04/21/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    H         T        Y              
MNTMEDH  DS    CL8                                                              
MNTMED   DS    CL8      6   10    8  A   U    N         T    I   Y              
MNTMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   20    6  A   P    N         T        Y              
MNTCLTH  DS    CL8                                                              
MNTCLT   DS    CL8      6   28    8  A   U    N         T        Y              
MNTCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   56    6  A   P    N         T        Y              
MNTMKTH  DS    CL8                                                              
MNTMKT   DS    CL16     6   64   16  A   U    N         T        Y              
MNTMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
MNTSTAH  DS    CL8                                                              
MNTSTA   DS    CL8      7   10    8  A   U    N         T        Y              
MNTSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   20    4  A   P    N         T        Y              
MNTDATEH DS    CL8                                                              
MNTDATE  DS    CL8      7   28    8  A   U    N         T        Y              
MNTDATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   38    3  A   P    N         T        Y              
MNTSEQH  DS    CL8                                                              
MNTSEQ   DS    CL3      7   46    3  A   U    N         T        Y              
MNTSEQX  DS    CL8                                                              
MNTTAGH  DS    CL8                                                              
MNTTAG   DS    CL1      8    2    1  A   P    N         T        Y              
MNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 240  BYTES                            
