*          DATA SET SPSFMA5D   AT LEVEL 015 AS OF 10/21/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217A5D      DATE 10/21/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SPMMEDH  DS    CL8                                                              
SPMMED   DS    CL2      5   10    2  A  U H             T    I   Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SPMRATH  DS    CL8                                                              
SPMRAT   DS    CL4      5   28    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SPMSTAH  DS    CL8                                                              
SPMSTA   DS    CL8      5   46    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   56    6  A  P H             T        Y              
SPMCLTH  DS    CL8                                                              
SPMCLT   DS    CL4      5   64    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   32    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   38    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21     7   46   21  A  P N             T        Y              
SPMMK1H  DS    CL8                                                              
SPMMK1   DS    CL7      8    2    7  A  U N             T        Y              
SPMMKN1H DS    CL8                                                              
SPMMKN1  DS    CL20     8   10   20  A  P N             T        Y              
SPMALF1H DS    CL8                                                              
SPMALF1  DS    CL3      8   32    3  A  P N             T        Y              
SPMOFS1H DS    CL8                                                              
SPMOFS1  DS    CL4      8   38    4  A  U N             T        Y              
SPMRM1H  DS    CL8                                                              
SPMRM1   DS    CL35     8   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20     9   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35     9   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    10   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    10   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    11   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    12   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    12   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    13   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    14   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    15   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    16   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    17   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    18   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    19   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    20   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    21   46   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22   10   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   32    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35    22   46   35  A  P N             T        Y              
SPMMKLH  DS    CL8                                                              
SPMMKL   DS    CL7     23    2    7  A  U N             T        Y              
SPMMKNLH DS    CL8                                                              
SPMMKNL  DS    CL20    23   10   20  A  P N             T        Y              
SPMALFLH DS    CL8                                                              
SPMALFL  DS    CL3     23   32    3  A  P N             T        Y              
SPMOFSLH DS    CL8                                                              
SPMOFSL  DS    CL4     23   38    4  A  U N             T        Y              
SPMRMLH  DS    CL8                                                              
SPMRML   DS    CL35    23   46   35  A  P N             T        Y              
SPMENDH  DS    CL8                                                              
SPMEND   DS    CL79    24    2   79  A  P N             T        Y              
SPMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2024 BYTES                            
