*          DATA SET SPSFMB0D   AT LEVEL 031 AS OF 07/28/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217B0D      DATE 07/28/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
USMMEDIH DS    CL8                                                              
USMMEDI  DS    CL1      5   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
USMCLNTH DS    CL8                                                              
USMCLNT  DS    CL3      5   28    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
USMP1H   DS    CL8                                                              
USMP1    DS    CL20     7   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
USMP1RQH DS    CL8                                                              
USMP1RQ  DS    CL1      8   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      8   28    9  A  P N             T        Y              
USMP1EDH DS    CL8                                                              
USMP1ED  DS    CL1      8   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   48    7  A  P N             T        Y              
USMP1LNH DS    CL8                                                              
USMP1LN  DS    CL2      8   56    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   60   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     9    2   14  A  P N             T        Y              
USMP1S1H DS    CL8                                                              
USMP1S1  DS    CL1      9   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   28    6  A  P N             T        Y              
USMP1A2H DS    CL8                                                              
USMP1A2  DS    CL1      9   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   48    4  A  P N             T        Y              
USMP1MBH DS    CL8                                                              
USMP1MB  DS    CL1      9   56    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
USMP2H   DS    CL8                                                              
USMP2    DS    CL20    11   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  P N             T        Y              
USMP2RQH DS    CL8                                                              
USMP2RQ  DS    CL1     12   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   28    9  A  P N             T        Y              
USMP2EDH DS    CL8                                                              
USMP2ED  DS    CL1     12   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   48    7  A  P N             T        Y              
USMP2LNH DS    CL8                                                              
USMP2LN  DS    CL2     12   56    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   60   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
USMP2S1H DS    CL8                                                              
USMP2S1  DS    CL1     13   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   28    6  A  P N             T        Y              
USMP2A2H DS    CL8                                                              
USMP2A2  DS    CL1     13   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   48    4  A  P N             T        Y              
USMP2MBH DS    CL8                                                              
USMP2MB  DS    CL1     13   56    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15    2   15  A  P N             T        Y              
USME1H   DS    CL8                                                              
USME1    DS    CL20    15   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16    2    9  A  P N             T        Y              
USME1RQH DS    CL8                                                              
USME1RQ  DS    CL1     16   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   28    9  A  P N             T        Y              
USME1EDH DS    CL8                                                              
USME1ED  DS    CL1     16   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   48    7  A  P N             T        Y              
USME1LNH DS    CL8                                                              
USME1LN  DS    CL2     16   56    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   60   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    17    2   14  A  P N             T        Y              
USME1S1H DS    CL8                                                              
USME1S1  DS    CL1     17   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   28    6  A  P N             T        Y              
USME1A2H DS    CL8                                                              
USME1A2  DS    CL1     17   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   48    4  A  P N             T        Y              
USME1MBH DS    CL8                                                              
USME1MB  DS    CL1     17   56    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19    2   15  A  P N             T        Y              
USME2H   DS    CL8                                                              
USME2    DS    CL20    19   20   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20    2    9  A  P N             T        Y              
USME2RQH DS    CL8                                                              
USME2RQ  DS    CL1     20   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   28    9  A  P N             T        Y              
USME2EDH DS    CL8                                                              
USME2ED  DS    CL1     20   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   48    7  A  P N             T        Y              
USME2LNH DS    CL8                                                              
USME2LN  DS    CL2     20   56    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   60   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    21    2   14  A  P N             T        Y              
USME2S1H DS    CL8                                                              
USME2S1  DS    CL1     21   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   28    6  A  P N             T        Y              
USME2A2H DS    CL8                                                              
USME2A2  DS    CL1     21   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   48    4  A  P N             T        Y              
USME2MBH DS    CL8                                                              
USME2MB  DS    CL1     21   56    1  A  U N             T        Y              
USMLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
USMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 944  BYTES                            
