*          DATA SET SPSFMC7D   AT LEVEL 002 AS OF 03/16/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297C7D      DATE 03/16/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SFCMEDH  DS    XL8                                                              
SFCMED   DS    CL1      5   10    1  A  U H             T        Y    0         
SFCMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   20    2  A  P H             T        Y              
SFCIDH   DS    XL8                                                              
SFCID    DS    CL2      5   28    2  A  U H             T        Y    0         
SFCIDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   38    4  A  P H             T        Y              
SFCCODEH DS    XL8                                                              
SFCCODE  DS    CL4      5   46    4  A  U H             T        Y    0         
SFCCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     5   56   13  A  P N             T        Y              
SFCSTRTH DS    XL8                                                              
SFCSTRT  DS    CL6      5   70    6  A  U H             T        Y    0         
SFCSTRTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SFCBK1H  DS    XL8                                                              
SFCBK1   DS    CL12     7   11   12  A  P N             T        Y              
SFCBK1LH DS    XL8                                                              
SFCBK1L  DS    CL3      7   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   32    4  A  P N             T        Y              
SFCNM1H  DS    XL8                                                              
SFCNM1   DS    CL24     7   38   24  A  U H             T        Y    0         
SFCNM1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SFCBK2H  DS    XL8                                                              
SFCBK2   DS    CL12     8   11   12  A  P N             T        Y              
SFCBK2LH DS    XL8                                                              
SFCBK2L  DS    CL3      8   24    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   32    4  A  P N             T        Y              
SFCNM2H  DS    XL8                                                              
SFCNM2   DS    CL24     8   38   24  A  U H             T        Y    0         
SFCNM2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     9   33   12  A  P N             T        Y              
SFCADTEH DS    XL8                                                              
SFCADTE  DS    CL8      9   46    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   56   11  A  P N             T        Y              
SFCCWHOH DS    XL8                                                              
SFCCWHO  DS    CL8      9   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
SFCNEWH  DS    XL8                                                              
SFCNEW   DS    CL4     10   15    4  A  U H             T        Y    0         
SFCNEWX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   20    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   25    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   30    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   35    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   40    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   45    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   50    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   55    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   60    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   65    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   70    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10   75    4  A  U H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    12    2   15  A  P N             T        Y              
SFCLISTH DS    XL8                                                              
SFCLIST  DS    CL3     14    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   77    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   77    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   77    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   77    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   77    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   77    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   77    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   77    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   77    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    7    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   12    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   17    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   22    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   27    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   32    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   42    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   47    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   57    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   62    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   67    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   72    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   77    3  A  P N             T        Y              
SFCPFKH  DS    XL8                                                              
SFCPFK   DS    CL77    24    2   77  L  P H             T        Y              
SFCLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
SFCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2576 BYTES                            
