*          DATA SET SPSFME3D   AT LEVEL 006 AS OF 05/10/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217E3D      DATE 05/10/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  N   P    N         T        Y              
SELMKTH  DS    CL8                                                              
SELMKT   DS    CL4      5   10    4  A   U    N         T        Y              
SELMKTNH DS    CL8                                                              
SELMKTN  DS    CL24     5   15   24  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7   10    6  N   P    N         T        Y              
SELSELH  DS    CL8                                                              
SELSEL   DS    CL3      8    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70     8   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70     9   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    10   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    11   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    12   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    13   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    14   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    15   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    16   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    17   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    18   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    19   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    20   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    21   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    22   10   70  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    23   10   70  N   P    N         T        Y              
SELLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
SELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1520 BYTES                            
