*          DATA SET SPSFMDAD   AT LEVEL 006 AS OF 05/14/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T217DAD      DATE 05/14/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
SELMEDH  DS    CL8                                                              
SELMED   DS    CL3      5   10    3  A   U    N         T        Y    1         
SELMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    H         T        Y              
SELMKTH  DS    CL8                                                              
SELMKT   DS    CL4      5   28    4  A   U    N         T        Y    2         
SELMKTX  DS    CL8                                                              
SELMKNH  DS    CL8                                                              
SELMKN   DS    CL20     5   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   64    6  A   P    H         T        Y              
SELSCHH  DS    CL8                                                              
SELSCH   DS    CL3      5   72    3  A   U    N         T        Y    3         
SELSCHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6      7   10    6  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6      7   38    6  A   P    H         T        Y              
SELSELH  DS    CL8                                                              
SELSEL   DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70     9   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    10   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    11   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    12   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    13   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    14   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    15   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    16   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    17   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    18   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    19   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    20   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    21   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    22   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    23   10   70  A   P    N         T        Y              
SELLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1513 BYTES                            
