*          DATA SET SPSFMD7D   AT LEVEL 002 AS OF 08/07/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T297D7D      DATE 08/07/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
RPMMEDIH DS    XL8                                                              
RPMMEDI  DS    CL1      5   10    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL3      5   20    3  L  P H             T        Y              
RPMREPH  DS    XL8                                                              
RPMREP   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   38    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  L  P N             T        Y              
RPMNAMEH DS    XL8                                                              
RPMNAME  DS    CL22     7   20   22  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14     8    2   14  L  P N             T        Y              
RPMADDRH DS    XL8                                                              
RPMADDR  DS    CL24     8   20   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    2    4  L  P N             T        Y              
RPMCITYH DS    XL8                                                              
RPMCITY  DS    CL24     9   20   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  L  P N             T        Y              
RPMSTTEH DS    XL8                                                              
RPMSTTE  DS    CL3     10   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  L  P N             T        Y              
RPMBZIPH DS    XL8                                                              
RPMBZIP  DS    CL10    11   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  L  P N             T        Y              
RPMCTRYH DS    XL8                                                              
RPMCTRY  DS    CL1     12   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13    2   13  L  P N             T        Y              
RPMNTWKH DS    XL8                                                              
RPMNTWK  DS    CL1     13   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  L  P N             T        Y              
RPMOPTNH DS    XL8                                                              
RPMOPTN  DS    CL57    14   20   57  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  L  P N             T        Y              
RPMSAPH  DS    XL8                                                              
RPMSAP   DS    CL10    15   20   10  A  U N             T        Y              
RPMLAST  DS    XL1                                                              
         DS    XL2    INDICS=NN                                                 
RPMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 432  BYTES                            
