*          DATA SET SPSNVRCRD  AT LEVEL 026 AS OF 05/29/19                      
*                                  DSECT FOR REQUEST CARD                       
RCRDD    DSECT                                                                  
RCRDCTL  DS    CL26                                                             
RCRDAREA DS    0CL80                                                            
RCRDCODE DS    CL2                 1                                            
RCRDAGY  DS    CL2                 3                                            
RCRDMED  DS    CL1                 5                                            
RCRDCLT  DS    CL3                 6                                            
RCRDPGRP DS    CL1                 9                                            
RCRDMGRP DS    CL1                 10                                           
RCRDBYID DS    CL1                 11                                           
RCRDPRD  DS    CL3                 12                                           
RCRDMKT  DS    CL4                                                              
RCRDSTA  DS    CL5                 19                                           
RCRDEST  DS    CL3                                                              
         DS    CL4                                                              
RCRDCONT DS    CL1                 31                                           
         DS    CL3                                                              
RCRDPRD2 DS    CL3                                                              
RCRDSDAT DS    CL6                 38                                           
         DS    CL6                                                              
RCRDBK1  DS    CL4                                                              
RCRDHUT1 DS    CL2                                                              
         DS    CL6                                                              
RCRDOPT1 DS    CL1                 62                                           
RCRDOPT2 DS    CL1                 63                                           
RCRDOPT3 DS    CL1                 64                                           
RCRDOPT4 DS    CL1                 65                                           
RCRDOPT5 DS    CL1                 66                                           
         DS    CL1                                                              
         DS    CL1                                                              
RCRDRQTR DS    CL12                69                                           
*                                                                               
RCRDREC2 DS    0CL80               2ND CARD                                     
         DS    CL20                                                             
R2USER   DS    0CL50                                                            
         DS    CL1                                                              
RCRDMOSO DS    CL1                 MONTH OF SERVICE OVERRIDE                    
RCRDINT  DS    CL1                 INT/INTONLY OPT : 'I' OR 'O'                 
