*          DATA SET SPSNVFLDS  AT LEVEL 026 AS OF 02/12/13                      
       ++INCLUDE SPSNVFEQTB                                                     
***********************************************************************         
*  XL1         - LENGTH OF ENTRY                                                
*  XL1         - LENGTH OF FIELD                                                
*  XL1         - FIELD NUMBER                                                   
*  0C          - FIELD TITLE                                                    
***********************************************************************         
FLDTABLE DS    0C                                                               
         DC    AL1(FTBLDATX-*,LENFDATE,FLDNDATE),CL4'Date'                      
FTBLDATX EQU   *                                                                
         DC    AL1(FTBLTIMX-*,LENFTIME,FLDNTIME),CL4'Time'                      
FTBLTIMX EQU   *                                                                
         DC    AL1(FTBLLENX-*,LENFSLEN,FLDNSLEN),CL4'Len '                      
FTBLLENX EQU   *                                                                
         DC    AL1(FTBLFLMX-*,LENFFILM,FLDNFILM),CL9'Film Code'                 
FTBLFLMX EQU   *                                                                
         DC    AL1(FTBLCSTX-*,LENFCOST,FLDNCOST),CL4'Cost'                      
FTBLCSTX EQU   *                                                                
         DC    AL1(FTBLPRDX-*,LENFPROD,FLDNPROD),CL7'Product'                   
FTBLPRDX EQU   *                                                                
         DC    AL1(FTBLESTX-*,LENFESTM,FLDNESTM),CL3'Est'                       
FTBLESTX EQU   *                                                                
         DC    AL1(FTBLRCTX-*,LENFRCNT,FLDNRCNT),CL6'Rcount'                    
FTBLRCTX EQU   *                                                                
         DC    AL1(FTBLINTX-*,LENFINTG,FLDNINTG),CL5'Integ'                     
FTBLINTX EQU   *                                                                
         DC    AL1(FTBLPRGX-*,LENFPROG,FLDNPROG),CL4'Prog'                      
FTBLPRGX EQU   *                                                                
         DC    AL1(FTBLNETX-*,LENFNTWK,FLDNNTWK),CL7'Network'                   
FTBLNETX EQU   *                                                                
         DC    AL1(FTBLPFLX-*,LENFPFLM,FLDNPFLM),CL8'2nd Film'                  
FTBLPFLX EQU   *                                                                
         DC    AL1(FTBLMKGX-*,LENFMKGD,FLDNMKGD),CL2'MG'                        
FTBLMKGX EQU   *                                                                
         DC    AL1(FTBLBILX-*,LENFBILB,FLDNBILB),CL2'BB'                        
FTBLBILX EQU   *                                                                
*                                                                               
         DC    AL1(FTBLMESX-*,LENFMEST,FLDNMEST),CL3'Est'                       
FTBLMESX EQU   *                                                                
         DC    AL1(FTBLLINX-*,LENFLINE,FLDNLINE),CL3'Lin'                       
FTBLLINX EQU   *                                                                
         DC    AL1(FTBLSDTX-*,LENFSDAT,FLDNSDAT),CL8'Sp Date'                   
FTBLSDTX EQU   *                                                                
         DC    AL1(FTBLSPTX-*,LENFSPOT,FLDNSPOT),CL4'Spt#'                      
FTBLSPTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBLNESX-*,LENFNEST,FLDNNEST),CL3'EST'                       
FTBLNESX EQU   *                                                                
         DC    AL1(FTBLNDTX-*,LENFNDAT,FLDNNDAT),CL8'Date'                      
FTBLNDTX EQU   *                                                                
         DC    AL1(FTBLSUBX-*,LENFSUBL,FLDNSUBL),CL3'Sub'                       
FTBLSUBX EQU   *                                                                
         DC    AL1(FTBLNTMX-*,LENFNTIM,FLDNNTIM),CL4'Time'                      
FTBLNTMX EQU   *                                                                
         DC    AL1(FTBLNPGX-*,LENFNPGM,FLDNNPGM),CL4'Prog'                      
FTBLNPGX EQU   *                                                                
*                                                                               
         DC    AL1(FTBLNPKX-*,LENFNPKG,FLDNNPKG),CL3'Pkg'                       
FTBLNPKX EQU   *                                                                
*                                                                               
         DC    AL1(FTBLDEMX-*,LENFDEMV,FLDNDEMV),CL4'Demo'                      
FTBLDEMX EQU   *                                                                
*                                                                               
         DC    AL1(FTBLOCSX-*,LENFOCST,FLDNOCST),CL9'Orig Cost'                 
FTBLOCSX EQU   *                                                                
*                                                                               
         DC    AL1(FTBLCLKX-*,LENFCLK,FLDNCLK),CL9'Clicks'                      
FTBLCLKX EQU   *                                                                
         DC    AL1(FTBLRATX-*,LENFRAT,FLDNRAT),CL9'Rating'                      
FTBLRATX EQU   *                                                                
         DC    AL1(FTBLIMPX-*,LENFIMP,FLDNIMP),CL9'Impressn'                    
FTBLIMPX EQU   *                                                                
*                                                                               
         DC    X'FF'                                                            
