*          DATA SET SPSNVFCD   AT LEVEL 002 AS OF 06/07/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T210FCD      DATE 06/07/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
DTLKEYLH DS    CL8                                                              
DTLKEYL  DS    CL39     5   10   39  A  U H             T        Y              
DTLKYL2H DS    CL8                                                              
DTLKYL2  DS    CL31     5   50   31  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14     6    2   14  A  P H             T        Y              
DTLHNUMH DS    CL8                                                              
DTLHNUM  DS    CL20     6   17   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     6   40   17  A  P H             T        Y              
DTLDNUMH DS    CL8                                                              
DTLDNUM  DS    CL20     6   59   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P H             T        Y              
DTLSNUMH DS    CL8                                                              
DTLSNUM  DS    CL20     7   17   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     7   40   17  A  P H             T        Y              
DTLFNUMH DS    CL8                                                              
DTLFNUM  DS    CL20     7   59   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
DTLOPTNH DS    CL8                                                              
DTLOPTN  DS    CL60     8   10   60  A  U N             T        Y              
DTLTAGH  DS    CL8                                                              
DTLTAG   DS    CL1      9    2    1  A  P N             T        Y              
DTLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DTLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 416  BYTES                            
