*          DATA SET SPSNVF9D   AT LEVEL 003 AS OF 04/04/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T210F9D      DATE 04/04/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
REQMEDH  DS    XL8                                                              
REQMED   DS    CL8      5   11    8  A  U H             T        Y              
REQMDNMH DS    XL8                                                              
REQMDNM  DS    CL10     5   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y              
REQCLTH  DS    XL8                                                              
REQCLT   DS    CL8      6   11    8  A  U H             T        Y              
REQCLNMH DS    XL8                                                              
REQCLNM  DS    CL20     6   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   48    7  L  P H             T        Y              
REQSTAH  DS    XL8                                                              
REQSTA   DS    CL9      6   57    9  A  U H             T        Y              
REQSTNMH DS    XL8                                                              
REQSTNM  DS    CL14     6   67   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     8    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    2    4  L  P N             T        Y              
REQNAMEH DS    XL8                                                              
REQNAME  DS    CL10     9   11   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10    2    4  L  P N             T        Y              
REQBOOKH DS    XL8                                                              
REQBOOK  DS    CL10    10   11   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  L  P N             T        Y              
REQPRODH DS    XL8                                                              
REQPROD  DS    CL13    11   11   13  A  U N             T        Y              
REQPRNMH DS    XL8                                                              
REQPRNM  DS    CL41    11   25   41  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  L  P N             T        Y              
REQESTMH DS    XL8                                                              
REQESTM  DS    CL3     12   11    3  A  U N             T        Y              
REQESNMH DS    XL8                                                              
REQESNM  DS    CL41    12   25   41  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  L  P N             T        Y              
REQPERDH DS    XL8                                                              
REQPERD  DS    CL17    13   11   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  L  P N             T        Y              
REQOPTNH DS    XL8                                                              
REQOPTN  DS    CL70    14   11   70  A  U N             T        Y              
REQPFLNH DS    XL8                                                              
REQPFLN  DS    CL79    24    2   79  L  P H             T        Y              
REQLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
REQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 640  BYTES                            
