*          DATA SET SPSNVFABD  AT LEVEL 005 AS OF 08/18/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T210FAD      DATE 08/18/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
MOVMEDH  DS    CL8                                                              
MOVMED   DS    CL8      5   10    8  A  U H             T        Y              
MOVMDNMH DS    CL8                                                              
MOVMDNM  DS    CL10     5   19   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  L  P H             T        Y              
MOVFCLTH DS    CL8                                                              
MOVFCLT  DS    CL15     8   10   15  A  U H             T        Y              
MOVFCLNH DS    CL8                                                              
MOVFCLN  DS    CL10     8   30   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   47    7  L  P H             T        Y              
MOVFSTAH DS    CL8                                                              
MOVFSTA  DS    CL9      8   56    9  A  U H             T        Y              
MOVFSTNH DS    CL8                                                              
MOVFSTN  DS    CL15     8   66   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  L  P H             T        Y              
MOVFPERH DS    CL8                                                              
MOVFPER  DS    CL17     9   10   17  A  U H             T        Y              
MOVFPDNH DS    CL8                                                              
MOVFPDN  DS    CL17     9   28   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   47    7  L  P H             T        Y              
MOVFINVH DS    CL8                                                              
MOVFINV  DS    CL10     9   56   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  L  P H             T        Y              
MOVTCLTH DS    CL8                                                              
MOVTCLT  DS    CL15    12   10   15  A  U H             T        Y              
MOVTCLNH DS    CL8                                                              
MOVTCLN  DS    CL10    12   30   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   47    7  L  P H             T        Y              
MOVTSTAH DS    CL8                                                              
MOVTSTA  DS    CL9     12   56    9  A  U H             T        Y              
MOVTSTNH DS    CL8                                                              
MOVTSTN  DS    CL15    12   66   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   47    7  L  P H             T        Y              
MOVTINVH DS    CL8                                                              
MOVTINV  DS    CL10    13   56   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL5     15    2    5  L  P N             T        Y              
MOVOKAYH DS    CL8                                                              
MOVOKAY  DS    CL1     15    8    1  A  U N             T        Y              
MOVPFLNH DS    CL8                                                              
MOVPFLN  DS    CL79    24    2   79  L  P H             T        Y              
MOVLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MOVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 560  BYTES                            
