*          DATA SET SPSNVFBD   AT LEVEL 004 AS OF 12/02/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T210FBD      DATE 12/02/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
NETMEDH  DS    CL8                                                              
NETMED   DS    CL8      5   10    8  A  U H             T        Y              
NETMDNMH DS    CL8                                                              
NETMDNM  DS    CL10     5   19   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y              
NETCLTH  DS    CL8                                                              
NETCLT   DS    CL8      6   10    8  A  U H             T        Y              
NETCLNMH DS    CL8                                                              
NETCLNM  DS    CL20     6   19   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   47    7  L  P H             T        Y              
NETSTAH  DS    CL8                                                              
NETSTA   DS    CL9      6   56    9  A  U H             T        Y              
NETSTNMH DS    CL8                                                              
NETSTNM  DS    CL15     6   66   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  L  P H             T        Y              
NETPERDH DS    CL8                                                              
NETPERD  DS    CL17     7   10   17  A  U H             T        Y              
NETPDNMH DS    CL8                                                              
NETPDNM  DS    CL17     7   28   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   47    7  L  P H             T        Y              
NETINVCH DS    CL8                                                              
NETINVC  DS    CL10     7   56   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9    2    5  L  P N             T        Y              
NETOKAYH DS    CL8                                                              
NETOKAY  DS    CL1      9   10    1  A  U N             T        Y              
NETPFLNH DS    CL8                                                              
NETPFLN  DS    CL79    24    2   79  L  P H             T        Y              
NETLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
NETWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 384  BYTES                            
