*          DATA SET SPSNVFAD   AT LEVEL 016 AS OF 08/18/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T210FAD      DATE 08/18/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
MOVMEDH  DS    CL8                                                              
MOVMED   DS    CL8      5   10    8  A  U H             T        Y              
MOVMDNMH DS    CL8                                                              
MOVMDNM  DS    CL10     5   20   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  L  P H             T        Y              
MOVFCLTH DS    CL8                                                              
MOVFCLT  DS    CL8      8   11    8  A  U H             T        Y              
MOVFCLNH DS    CL8                                                              
MOVFCLN  DS    CL20     8   26   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  L  P H             T        Y              
MOVFPRDH DS    CL8                                                              
MOVFPRD  DS    CL8      9   11    8  A  P H             T        Y              
MOVFPRNH DS    CL8                                                              
MOVFPRN  DS    CL20     9   26   20  A  P N             T        Y              
MOVFPR2H DS    CL8                                                              
MOVFPR2  DS    CL20     9   47   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  L  P H             T        Y              
MOVFESTH DS    CL8                                                              
MOVFEST  DS    CL8     10   11    8  A  P H             T        Y              
MOVFESNH DS    CL8                                                              
MOVFESN  DS    CL20    10   26   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   47    7  L  P H             T        Y              
MOVFSTAH DS    CL8                                                              
MOVFSTA  DS    CL9     10   56    9  A  U H             T        Y              
MOVFSTNH DS    CL8                                                              
MOVFSTN  DS    CL15    10   66   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  L  P H             T        Y              
MOVFPERH DS    CL8                                                              
MOVFPER  DS    CL15    11   11   15  A  U H             T        Y              
MOVFPDNH DS    CL8                                                              
MOVFPDN  DS    CL17    11   28   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   47    7  L  P H             T        Y              
MOVFINVH DS    CL8                                                              
MOVFINV  DS    CL10    11   56   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  L  P H             T        Y              
MOVTCLTH DS    CL8                                                              
MOVTCLT  DS    CL8     14   11    8  A  U H             T        Y              
MOVTCLNH DS    CL8                                                              
MOVTCLN  DS    CL20    14   26   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  L  P H             T        Y              
MOVTPRDH DS    CL8                                                              
MOVTPRD  DS    CL8     15   11    8  A  U H             T        Y              
MOVTPRNH DS    CL8                                                              
MOVTPRN  DS    CL20    15   26   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   47    7  L  P H             T        Y              
MOVTSTAH DS    CL8                                                              
MOVTSTA  DS    CL9     15   56    9  A  U H             T        Y              
MOVTSTNH DS    CL8                                                              
MOVTSTN  DS    CL15    15   66   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  L  P H             T        Y              
MOVTESTH DS    CL8                                                              
MOVTEST  DS    CL8     16   11    8  A  U H             T        Y              
MOVTESNH DS    CL8                                                              
MOVTESN  DS    CL20    16   26   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   47    7  L  P H             T        Y              
MOVTINVH DS    CL8                                                              
MOVTINV  DS    CL10    16   56   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL5     18    2    5  L  P N             T        Y              
MOVOKAYH DS    CL8                                                              
MOVOKAY  DS    CL1     18    8    1  A  U N             T        Y              
MOVPFLNH DS    CL8                                                              
MOVPFLN  DS    CL79    24    2   79  L  P H             T        Y              
MOVLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MOVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 824  BYTES                            
