*          DATA SET SPSYNFED   AT LEVEL 002 AS OF 12/07/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21CFED      DATE 12/07/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     7    2   18   A    P    N         T         Y           
SYNCPERH DS    CL8                                                              
SYNCPER  DS    CL17     7   22   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18     8    2   18   A    P    N         T         Y           
SYNCDAYH DS    CL8                                                              
SYNCDAY  DS    CL8      8   22    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18     9    2   18   A    P    N         T         Y           
SYNCPTSH DS    CL8                                                              
SYNCPTS  DS    CL8      9   22    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    10    2   18   A    P    N         T         Y           
SYNCDOLH DS    CL8                                                              
SYNCDOL  DS    CL8     10   22    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    11    2   18   A    P    N         T         Y           
SYNCSEGH DS    CL8                                                              
SYNCSEG  DS    CL8     11   22    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    13    2   18   A    P    N         T         Y           
SYNGPTSH DS    CL8                                                              
SYNGPTS  DS    CL8     13   22    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    14    2   18   A    P    N         T         Y           
SYNGDOLH DS    CL8                                                              
SYNGDOL  DS    CL8     14   22    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    16    2   18   A    P    N         T         Y           
SYNGPERH DS    CL8                                                              
SYNGPER  DS    CL17    16   22   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    17    2   18   A    P    N         T         Y           
SYNGAMTH DS    CL8                                                              
SYNGAMT  DS    CL8     17   22    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     19    2    8   A    P    N         T         Y           
SYNCOM1H DS    CL8                                                              
SYNCOM1  DS    CL60    19   12   60   A    U    N         T         Y           
SYNCOM2H DS    CL8                                                              
SYNCOM2  DS    CL60    20   12   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     21   12    1   A    U    N         T         Y           
SYNLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SYNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 560  BYTES                            
