*          DATA SET SPSYNFDD   AT LEVEL 002 AS OF 12/07/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21CFDD      DATE 12/07/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL20     7    2   20   A    P    N         T         Y           
SYNBPERH DS    CL8                                                              
SYNBPER  DS    CL8      7   25    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20     8    2   20   A    P    N         T         Y           
SYNBPTSH DS    CL8                                                              
SYNBPTS  DS    CL8      8   25    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20     9    2   20   A    P    N         T         Y           
SYNBDOLH DS    CL8                                                              
SYNBDOL  DS    CL8      9   25    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     10   25    1   A    U    N         T         Y           
SYNLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SYNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 144  BYTES                            
