*          DATA SET SPSYNFCD   AT LEVEL 002 AS OF 12/07/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21CFCD      DATE 12/07/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
SYNUPDTH DS    CL8                                                              
SYNUPDT  DS    CL34     5   32   34   A    P    N         T         Y           
SYNLN1H  DS    CL8                                                              
SYNLN1   DS    CL68     7    2   68   A    P    N         T         Y           
SYNLN2H  DS    CL8                                                              
SYNLN2   DS    CL68     8    2   68   A    P    N         T         Y           
SYNLN3H  DS    CL8                                                              
SYNLN3   DS    CL68     9    2   68   A    P    N         T         Y           
SYNLN4H  DS    CL8                                                              
SYNLN4   DS    CL68    10    2   68   A    P    N         T         Y           
SYNLN5H  DS    CL8                                                              
SYNLN5   DS    CL68    11    2   68   A    P    N         T         Y           
SYNLN6H  DS    CL8                                                              
SYNLN6   DS    CL68    12    2   68   A    P    N         T         Y           
SYNLN7H  DS    CL8                                                              
SYNLN7   DS    CL68    13    2   68   A    P    N         T         Y           
SYNLN8H  DS    CL8                                                              
SYNLN8   DS    CL68    14    2   68   A    P    N         T         Y           
SYNLN9H  DS    CL8                                                              
SYNLN9   DS    CL68    15    2   68   A    P    N         T         Y           
SYNLN10H DS    CL8                                                              
SYNLN10  DS    CL68    16    2   68   A    P    N         T         Y           
SYNLN11H DS    CL8                                                              
SYNLN11  DS    CL68    17    2   68   A    P    N         T         Y           
SYNLN12H DS    CL8                                                              
SYNLN12  DS    CL68    18    2   68   A    P    N         T         Y           
SYNLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SYNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 957  BYTES                            
