*          DATA SET SPSYSFAC   AT LEVEL 002 AS OF 03/03/00                      
SPSYSFAC DSECT                                                                  
*                                                                               
SDATAMGR DS    A                                                                
SCALLOV  DS    A                                                                
SCASHVAL DS    A                                                                
SDATVAL  DS    A                                                                
SADDAY   DS    A                                                                
SDTCNV   DS    A                                                                
SGETDAY  DS    A                                                                
SRECUP   DS    A                                                                
SGETMSG  DS    A                                                                
SDATCON  DS    A                                                                
SSCANNER DS    A                                                                
SUSCAN   DS    A                                                                
SGETTXT  DS    A                                                                
         DS    51A(0)                                                           
