*          DATA SET SPSYNFFD   AT LEVEL 002 AS OF 12/07/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21CFFD      DATE 12/07/83                 
         SPACE 1                                                                
T21CFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
SYNMSGH  DS    CL8                                                              
SYNMSG   DS    CL60     1    2   60   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      3    2    8   A    P    N         T         Y           
SYNPRH   DS    CL8                                                              
SYNPR    DS    CL6      3   12    6   A    U    N         T    I    Y           
SYNPRNMH DS    CL8                                                              
SYNPRNM  DS    CL24     3   22   24   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      4    2    8   A    P    N         T         Y           
SYNSTH   DS    CL8                                                              
SYNST    DS    CL6      4   12    6   A    U    N         T         Y           
SYNSTNMH DS    CL8                                                              
SYNSTNM  DS    CL38     4   22   38   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      5    2    8   A    P    N         T         Y           
SYNACTH  DS    CL8                                                              
SYNACT   DS    CL6      5   12    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      5   22    4   A    P    N         T         Y           
SYNLINH  DS    CL8                                                              
SYNLIN   DS    CL3      5   27    3   A    U    N         T         Y           
SYNORGH  DS    CL8                                                              
SYNORG   DS    CL1      6   12    1   A    U    N         T         Y           
SYNLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SYNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 296  BYTES                            
