*          DATA SET SPTRA5AD   AT LEVEL 002 AS OF 12/13/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN C2165AD      DATE 12/13/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PCMKEYH  DS    XL8                                                              
PCMKEY   DS    CL6      5    2    6  A  P H             T        Y              
PCMCLTH  DS    XL8                                                              
PCMCLT   DS    CL4      5   10    4  A  U H             T        Y    1         
PCMCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
PCMNETH  DS    XL8                                                              
PCMNET   DS    CL4      5   28    4  A  U N             T        Y    2         
PCMNETX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
PCMPROGH DS    XL8                                                              
PCMPROG  DS    CL6      5   46    6  A  U N             T        Y    3         
PCMPROGX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   56    4  A  P N             T        Y              
PCMCODEH DS    XL8                                                              
PCMCODE  DS    CL3      5   64    3  A  U N             T        Y    4         
PCMCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
PCMPRLNH DS    XL8                                                              
PCMPRLN  DS    CL8      6   10    8  A  U H             T        Y    5         
PCMPRLNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
PCMPTLNH DS    XL8                                                              
PCMPTLN  DS    CL8      6   28    8  A  U N             T        Y    6         
PCMPTLNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6   38    3  A  P N             T        Y              
PCMREFH  DS    XL8                                                              
PCMREF   DS    CL5      6   46    5  A  U N             T        Y    7         
PCMREFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   56    4  A  P N             T        Y              
PCMFEEDH DS    XL8                                                              
PCMFEED  DS    CL4      6   64    4  A  U N             T        Y    8         
PCMFEEDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PCMFLTRH DS    XL8                                                              
PCMFLTR  DS    CL70     7   10   70  A  U N             T        Y    9         
PCMFLTRX DS    XL8                                                              
PCMXXXXH DS    XL8                                                              
PCMXXXX  DS    CL1      8    2    1  A  P N             T        Y              
PCMINFOH DS    XL8                                                              
PCMINFO  DS    CL78     9    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    1    8  A  P N             T        Y              
PCMCMT1H DS    XL8                                                              
PCMCMT1  DS    CL53    11   14   53  A  U N             T        Y              
PCMCMT2H DS    XL8                                                              
PCMCMT2  DS    CL53    12   14   53  A  U N             T        Y              
PCMCMT3H DS    XL8                                                              
PCMCMT3  DS    CL53    13   14   53  A  U N             T        Y              
PCMCMT4H DS    XL8                                                              
PCMCMT4  DS    CL53    14   14   53  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16    1   11  A  P N             T        Y              
PCMHIA1H DS    XL8                                                              
PCMHIA1  DS    CL20    16   14   20  A  U N             T        Y              
PCMHIA2H DS    XL8                                                              
PCMHIA2  DS    CL20    16   36   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   58   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   14   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   36   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   58   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   14   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   36   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   58   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   14   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   36   20  A  U N             T        Y              
PCMHIAXH DS    XL8                                                              
PCMHIAX  DS    CL20    19   58   20  A  U N             T        Y              
PCMPFKH  DS    XL8                                                              
PCMPFK   DS    CL78    24    2   78  A  P N             T        Y              
PCMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PCMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1184 BYTES                            
