*          DATA SET SPTRAC1D   AT LEVEL 001 AS OF 08/07/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216C1D      DATE 08/07/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TCMKEYH  DS    XL8                                                              
TCMKEY   DS    CL5      5    2    5  A  P H             T        Y              
TCMMEDH  DS    XL8                                                              
TCMMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TCMCLTH  DS    XL8                                                              
TCMCLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TCMPRLNH DS    XL8                                                              
TCMPRLN  DS    CL8      5   46    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TCMPTLNH DS    XL8                                                              
TCMPTLN  DS    CL7      5   64    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   72    4  A  P N             T        Y              
TCMCODEH DS    XL8                                                              
TCMCODE  DS    CL3      5   77    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
TCMREFH  DS    XL8                                                              
TCMREF   DS    CL5      6   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
TCMFLTRH DS    XL8                                                              
TCMFLTR  DS    CL40     6   28   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
TCMINFOH DS    XL8                                                              
TCMINFO  DS    CL78     8    2   78  A  P N             T        Y              
TCMDCMLH DS    XL8                                                              
TCMDCML  DS    CL75     9    2   75  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL33    10    2   33  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL33    10   41   33  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  P N             T        Y              
TCMCMLAH DS    XL8                                                              
TCMCMLA  DS    CL25    11    4   25  A  U N             T        Y              
TCMPCTAH DS    XL8                                                              
TCMPCTA  DS    CL3     11   31    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   41    1  A  P N             T        Y              
TCMCMLBH DS    XL8                                                              
TCMCMLB  DS    CL25    11   43   25  A  U N             T        Y              
TCMPCTBH DS    XL8                                                              
TCMPCTB  DS    CL3     11   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  P N             T        Y              
TCMCMLCH DS    XL8                                                              
TCMCMLC  DS    CL25    12    4   25  A  U N             T        Y              
TCMPCTCH DS    XL8                                                              
TCMPCTC  DS    CL3     12   31    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   41    1  A  P N             T        Y              
TCMCMLDH DS    XL8                                                              
TCMCMLD  DS    CL25    12   43   25  A  U N             T        Y              
TCMPCTDH DS    XL8                                                              
TCMPCTD  DS    CL3     12   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
TCMCMLEH DS    XL8                                                              
TCMCMLE  DS    CL25    13    4   25  A  U N             T        Y              
TCMPCTEH DS    XL8                                                              
TCMPCTE  DS    CL3     13   31    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   41    1  A  P N             T        Y              
TCMCMLFH DS    XL8                                                              
TCMCMLF  DS    CL25    13   43   25  A  U N             T        Y              
TCMPCTFH DS    XL8                                                              
TCMPCTF  DS    CL3     13   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  P N             T        Y              
TCMCMLGH DS    XL8                                                              
TCMCMLG  DS    CL25    14    4   25  A  U N             T        Y              
TCMPCTGH DS    XL8                                                              
TCMPCTG  DS    CL3     14   31    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   41    1  A  P N             T        Y              
TCMCMLHH DS    XL8                                                              
TCMCMLH  DS    CL25    14   43   25  A  U N             T        Y              
TCMPCTHH DS    XL8                                                              
TCMPCTH  DS    CL3     14   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
TCMCMLIH DS    XL8                                                              
TCMCMLI  DS    CL25    15    4   25  A  U N             T        Y              
TCMPCTIH DS    XL8                                                              
TCMPCTI  DS    CL3     15   31    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   41    1  A  P N             T        Y              
TCMCMLJH DS    XL8                                                              
TCMCMLJ  DS    CL25    15   43   25  A  U N             T        Y              
TCMPCTJH DS    XL8                                                              
TCMPCTJ  DS    CL3     15   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  P N             T        Y              
TCMCMLKH DS    XL8                                                              
TCMCMLK  DS    CL25    16    4   25  A  U N             T        Y              
TCMPCTKH DS    XL8                                                              
TCMPCTK  DS    CL3     16   31    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   41    1  A  P N             T        Y              
TCMCMLLH DS    XL8                                                              
TCMCMLL  DS    CL25    16   43   25  A  U N             T        Y              
TCMPCTLH DS    XL8                                                              
TCMPCTL  DS    CL3     16   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
TCMCMLMH DS    XL8                                                              
TCMCMLM  DS    CL25    17    4   25  A  U N             T        Y              
TCMPCTMH DS    XL8                                                              
TCMPCTM  DS    CL3     17   31    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   41    1  A  P N             T        Y              
TCMCMLNH DS    XL8                                                              
TCMCMLN  DS    CL25    17   43   25  A  U N             T        Y              
TCMPCTNH DS    XL8                                                              
TCMPCTN  DS    CL3     17   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P N             T        Y              
TCMCMLOH DS    XL8                                                              
TCMCMLO  DS    CL25    18    4   25  A  U N             T        Y              
TCMPCTOH DS    XL8                                                              
TCMPCTO  DS    CL3     18   31    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    2    8  A  P H             T        Y              
TCMROTH  DS    XL8                                                              
TCMROT   DS    CL68    20   11   68  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    2   11  A  P N             T        Y              
TCMDROTH DS    XL8                                                              
TCMDROT  DS    CL51    21   14   51  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   65    1  A  P N             T        Y              
TCMPFKH  DS    XL8                                                              
TCMPFK   DS    CL78    24    2   78  A  P N             T        Y              
TCMLAST  DS    XL1                                                              
         DS    XL2    INDICS=1X                                                 
TCMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1544 BYTES                            
