*          DATA SET SPTRA9DD   AT LEVEL 011 AS OF 03/11/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2169DD      DATE 03/11/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
GRDMEDH  DS    XL8                                                              
GRDMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
GRDCLTH  DS    XL8                                                              
GRDCLT   DS    CL4      5   29    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
GRDPRDH  DS    XL8                                                              
GRDPRD   DS    CL7      5   46    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
GRDPTRH  DS    XL8                                                              
GRDPTR   DS    CL7      5   64    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
GRDSTAH  DS    XL8                                                              
GRDSTA   DS    CL8      6   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   20    8  A  P N             T        Y              
GRDESTH  DS    XL8                                                              
GRDEST   DS    CL4      6   29    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P H             T        Y              
GRDPERH  DS    XL8                                                              
GRDPER   DS    CL18     6   46   18  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
GRDOPTH  DS    XL8                                                              
GRDOPT   DS    CL64     7   10   64  A  U N             T        Y              
GRDDAT1H DS    XL8                                                              
GRDDAT1  DS    CL78     8    2   78  L  P N             T        Y              
GRDDAT2H DS    XL8                                                              
GRDDAT2  DS    CL78     9    2   78  L  P N             T        Y              
GRDDAT3H DS    XL8                                                              
GRDDAT3  DS    CL78    10    2   78  L  P N             T        Y              
GRDDAT4H DS    XL8                                                              
GRDDAT4  DS    CL78    11    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  L  P N             T        Y              
GRDDATLH DS    XL8                                                              
GRDDATL  DS    CL78    23    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  L  P N             T        Y              
GRDLAST  DS    XL1                                                              
         DS    XL2    INDICS=1X                                                 
GRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1760 BYTES                            
