*          DATA SET SPTRAC0D   AT LEVEL 001 AS OF 04/19/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216C0D      DATE 04/19/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL38     6    2   38  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL38     8    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38     8   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38     9    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38     9   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    10    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    10   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    11    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    11   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    12    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    12   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    13    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    13   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    14    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    14   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    15    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    15   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    16    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    16   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    17    2   38  A  P N             T        Y              
HLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 928  BYTES                            
