*          DATA SET SPTRFLT    AT LEVEL 003 AS OF 05/30/84                      
FLTRECD  DSECT             ******* FLIGHT RECORD *******                        
*                                                                               
FLTKEY   DS    0XL13                                                            
FLTKID   DS    X'0A27'             RECORD ID                                    
FLTKAM   DS    XL1                 AGENCY/MEDIA                                 
FLTKCLT  DS    XL2                 CLIENT                                       
FLTKPRD  DS    XL1                 PRODUCT CODE (OR 0)                          
FLTKEDT  DS    XL3                 END DATE (YMD)                               
         DS    XL4                                                              
*                                                                               
         DS    XL2                 RECORD LENGTH                                
         DS    XL4                 CONTROL                                      
         DS    XL1                                                              
FLTAGYA  DS    CL2                 AGENCY ALPHA                                 
         DS    XL2                                                              
*                                                                               
FLTDTAEL DS    X'10'                 FLT DATA ELEMENT                           
FLTDTALN DS    AL1(FLTDTAX-FLTDTAEL) ELEMENT LENGTH                             
FLTSTART DS    XL3                 FLIGHT START                                 
FLTEND   DS    XL3                 FLIGHT END                                   
FLTDTAX  EQU   *                                                                
