*          DATA SET SPTRA7AD   AT LEVEL 005 AS OF 06/30/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2167AD      DATE 06/30/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   46    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   56    5  A  P N             T        Y              
TRACLASH DS    CL8                                                              
TRACLAS  DS    CL4      5   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
TRADESCH DS    CL8                                                              
TRADESC  DS    CL24     7   15   24  A  U N             T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1      8   13    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 176  BYTES                            
