*          DATA SET SPTRAFBD   AT LEVEL 055 AS OF 09/14/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216FBD      DATE 09/14/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
TRASTAH  DS    CL8                                                              
TRASTA   DS    CL7      5   28    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRAFLTRH DS    CL8                                                              
TRAFLTR  DS    CL26     5   46   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P H             T        Y              
TRAAL1H  DS    CL8                                                              
TRAAL1   DS    CL25     7   18   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  A  P H             T        Y              
TRAAL2H  DS    CL8                                                              
TRAAL2   DS    CL25     8   18   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14     9    2   14  A  P H             T        Y              
TRAAL3H  DS    CL8                                                              
TRAAL3   DS    CL25     9   18   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
TRAAL4H  DS    CL8                                                              
TRAAL4   DS    CL25    10   18   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
TRACMLTH DS    CL8                                                              
TRACMLT  DS    CL5     11   18    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
TRATWXH  DS    CL8                                                              
TRATWX   DS    CL21    12   18   21  A  U N             T        Y              
TRAAMSTH DS    CL8                                                              
TRAAMST  DS    CL17    15    2   17  A  P N             T        Y              
TRAAMSDH DS    CL8                                                              
TRAAMSD  DS    CL50    15   20   50  A  P N             T        Y              
TRAAMSGH DS    CL8                                                              
TRAAMSG  DS    CL14    16    2   14  A  P N             T        Y              
TRAAMSCH DS    CL8                                                              
TRAAMSC  DS    CL14    16   20   14  A  P N             T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     17    2    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 560  BYTES                            
