*          DATA SET SPTRA87D   AT LEVEL 013 AS OF 09/27/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21687D      DATE 09/27/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    H         T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   29    4  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL3      5   38    3  A   P    H         T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   46    4  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   75    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
TRAOPTH  DS    CL8                                                              
TRAOPT   DS    CL61     6   10   61  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A   P    H         T        Y              
TRALENFH DS    CL8                                                              
TRALENF  DS    CL3      8   14    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      8   19    7  A   P    H         T        Y              
TRAPTRFH DS    CL8                                                              
TRAPTRF  DS    CL7      8   28    7  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4      8   37    4  A   P    H         T        Y              
TRACODFH DS    CL8                                                              
TRACODF  DS    CL3      8   43    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      8   48    6  A   P    H         T        Y              
TRAPERFH DS    CL8                                                              
TRAPERF  DS    CL18     8   56   18  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8     10    4    8  A   P    H         T        Y              
TRALENTH DS    CL8                                                              
TRALENT  DS    CL3     10   14    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7     10   19    7  A   P    H         T        Y              
TRAPTRTH DS    CL8                                                              
TRAPTRT  DS    CL7     10   28    7  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4     10   37    4  A   P    H         T        Y              
TRACODTH DS    CL8                                                              
TRACODT  DS    CL3     10   43    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6     10   48    6  A   P    H         T        Y              
TRAPERTH DS    CL8                                                              
TRAPERT  DS    CL18    10   56   18  A   U    H         T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     10   78    1  A   U    N         T        Y              
TRAOUT1H DS    CL8                                                              
TRAOUT1  DS    CL74    12    2   74  A   P    N         T        Y              
TRAOUT2H DS    CL8                                                              
TRAOUT2  DS    CL74    13    2   74  A   P    N         T        Y              
TRAOUT3H DS    CL8                                                              
TRAOUT3  DS    CL74    14    2   74  A   P    N         T        Y              
TRAOUT4H DS    CL8                                                              
TRAOUT4  DS    CL74    15    2   74  A   P    N         T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 752  BYTES                            
