*          DATA SET SPTRA6FD   AT LEVEL 002 AS OF 04/12/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2166FD      DATE 04/12/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRBMEDH  DS    XL8                                                              
TRBMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRBCLTH  DS    XL8                                                              
TRBCLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   38    5  A  P H             T        Y              
TRBCMLH  DS    XL8                                                              
TRBCML   DS    CL13     5   46   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TRBFLTRH DS    XL8                                                              
TRBFLTR  DS    CL30     6   10   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL21     8    2   21  A  P N             T        Y              
TRBPCMLH DS    XL8                                                              
TRBPCML  DS    CL16     8   25   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     8   44   15  A  P N             T        Y              
TRBBCDEH DS    XL8                                                              
TRBBCDE  DS    CL16     8   62   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P H             T        Y              
TRBBAGYH DS    XL8                                                              
TRBBAGY  DS    CL2      9   25    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
TRBJOBNH DS    XL8                                                              
TRBJOBN  DS    CL6     10   25    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   44   10  A  P N             T        Y              
TRBADTEH DS    XL8                                                              
TRBADTE  DS    CL8     10   56    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
TRBMDTEH DS    XL8                                                              
TRBMDTE  DS    CL8     11   25    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    12    2   13  A  P N             T        Y              
TRBIDTEH DS    XL8                                                              
TRBIDTE  DS    CL9     12   25    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
TRBIRSNH DS    XL8                                                              
TRBIRSN  DS    CL50    13   25   50  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14    2   20  A  P N             T        Y              
TRBCADTH DS    XL8                                                              
TRBCADT  DS    CL9     14   25    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  A  P N             T        Y              
TRBACDTH DS    XL8                                                              
TRBACDT  DS    CL8     15   25    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    16    2   15  A  P N             T        Y              
TRBPRDTH DS    XL8                                                              
TRBPRDT  DS    CL9     16   25    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL24    17    2   24  A  P N             T        Y              
TRBBAPPH DS    XL8                                                              
TRBBAPP  DS    CL2     17   27    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18    2   11  A  P N             T        Y              
TRBREFH  DS    XL8                                                              
TRBREF   DS    CL8     18   25    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
TRBRSNH  DS    XL8                                                              
TRBRSN   DS    CL50    19   25   50  A  U N             T        Y              
TRBTAGH  DS    XL8                                                              
TRBTAG   DS    CL1     19   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    24    2   70  A  P H             T        Y              
TRBLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 848  BYTES                            
