*          DATA SET SPTRA4CD   AT LEVEL 002 AS OF 04/30/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2164CD      DATE 04/30/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL1      5   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRAPRDH  DS    XL8                                                              
TRAPRD   DS    CL3      5   46    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   56    8  A  P H             T        Y              
TRAESTH  DS    XL8                                                              
TRAEST   DS    CL3      5   66    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL16     6    2   16  A  P H             T        Y              
TRAMLNH  DS    XL8                                                              
TRAMLN   DS    CL5      6   20    5  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
TRAMKT1H DS    XL8                                                              
TRAMKT1  DS    CL4      9    3    4  A  U N             T        Y              
TRAMKT2H DS    XL8                                                              
TRAMKT2  DS    CL4      9   14    4  A  U N             T        Y              
TRAMKT3H DS    XL8                                                              
TRAMKT3  DS    CL4      9   25    4  A  U N             T        Y              
TRAMKT4H DS    XL8                                                              
TRAMKT4  DS    CL4      9   36    4  A  U N             T        Y              
TRAMKT5H DS    XL8                                                              
TRAMKT5  DS    CL4      9   47    4  A  U N             T        Y              
TRAMKT6H DS    XL8                                                              
TRAMKT6  DS    CL4      9   58    4  A  U N             T        Y              
TRAMKT7H DS    XL8                                                              
TRAMKT7  DS    CL4      9   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22    3    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   14    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   25    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   36    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   58    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   69    4  A  U N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     23    2    1  A  U N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
