*          DATA SET SPTRADDD   AT LEVEL 001 AS OF 07/13/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216DDD      DATE 07/13/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
TRAMKTH  DS    XL8                                                              
TRAMKT   DS    CL8      5   46    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   56    5  A  P N             T        Y              
TRACMLH  DS    XL8                                                              
TRACML   DS    CL13     5   64   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
TRAPERH  DS    XL8                                                              
TRAPER   DS    CL18     6   10   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
TRAOPTH  DS    XL8                                                              
TRAOPT   DS    CL16     6   46   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    4   11  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL24     8   34   24  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL12     8   67   12  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1      9    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL76     9    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    10    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    11    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    12    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    13    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    14    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    15    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    16    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    17    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    18    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    19    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    20    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    21    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    22    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    23    4   76  A  P N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     24    2    1  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1560 BYTES                            
