*          DATA SET SPTRAB4D   AT LEVEL 012 AS OF 01/20/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216B4D      DATE 01/20/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   28    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   46    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      5   56    3  A  P N             T        Y              
TRAESTH  DS    CL8                                                              
TRAEST   DS    CL4      5   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
TRASTAH  DS    CL8                                                              
TRASTA   DS    CL8      6   10    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      6   20    6  A  P H             T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL18     6   28   18  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL10     6   56   10  A  P N             T        Y              
TRAPREFH DS    CL8                                                              
TRAPREF  DS    CL13     6   67   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
TRATAGSH DS    CL8                                                              
TRATAGS  DS    CL64     7   10   64  A  U N             T        Y              
TRATABH  DS    CL8                                                              
TRATAB   DS    CL1      7   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
TRAINFOH DS    CL8                                                              
TRAINFO  DS    CL76     8    4   76  A  P N             T        Y              
TRAHDGH  DS    CL8                                                              
TRAHDG   DS    CL77     9    2   77  A  P N             T        Y              
TRAEST1H DS    CL8                                                              
TRAEST1  DS    CL56    10    2   56  A  P N             T        Y              
TRACML1H DS    CL8                                                              
TRACML1  DS    CL5     10   59    5  A  U H             T        Y              
TRADLR1H DS    CL8                                                              
TRADLR1  DS    CL16    10   65   16  A  P N             T        Y              
TRAEST2H DS    CL8                                                              
TRAEST2  DS    CL56    11    2   56  A  P N             T        Y              
TRACML2H DS    CL8                                                              
TRACML2  DS    CL5     11   59    5  A  U H             T        Y              
TRADLR2H DS    CL8                                                              
TRADLR2  DS    CL16    11   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    12    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    12   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    13    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    13   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    14    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    14   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    15    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    15   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    16    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    16   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    17    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    17   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    18    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    18   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    19    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    19   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    20    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    20   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    21    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    21   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    22    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    22   65   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56    23    2   56  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   59    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    23   65   16  A  P N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=1X                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1904 BYTES                            
