*          DATA SET SPTRA7DD   AT LEVEL 022 AS OF 02/27/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2167DD      DATE 02/27/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   29    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   47    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TRAPTRH  DS    CL8                                                              
TRAPTR   DS    CL4      5   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   20    8  A  P N             T        Y              
TRAESTH  DS    CL8                                                              
TRAEST   DS    CL4      6   29    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL17     6   47   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
TRACONTH DS    CL8                                                              
TRACONT  DS    CL16     7   47   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
TRATYPEH DS    CL8                                                              
TRATYPE  DS    CL4      8   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
TRAOPTH  DS    CL8                                                              
TRAOPT   DS    CL53     9   10   53  A  U N             T        Y              
TRACPYH  DS    CL8                                                              
TRACPY   DS    CL20    11    5   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
TRAPOH   DS    CL8                                                              
TRAPO    DS    CL24    13   20   24  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
TRACMT1H DS    CL8                                                              
TRACMT1  DS    CL58    15   20   58  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    16    2   14  A  P N             T        Y              
TRACMT2H DS    CL8                                                              
TRACMT2  DS    CL58    16   20   58  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    17    2   14  A  P N             T        Y              
TRACMT3H DS    CL8                                                              
TRACMT3  DS    CL58    17   20   58  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    18    2   14  A  P N             T        Y              
TRACMT4H DS    CL8                                                              
TRACMT4  DS    CL58    18   20   58  A  U N             T        Y              
TRAPIDH  DS    CL8                                                              
TRAPID   DS    CL20    19   30   20  A  P N             T        Y              
TRASLVH  DS    CL8                                                              
TRASLV   DS    CL13    20    2   13  A  P Z             T        Y              
TRALEVH  DS    CL8                                                              
TRALEV   DS    CL4     20   16    4  A  U N             T        Y              
TRACDEH  DS    CL8                                                              
TRACDE   DS    CL4     20   22    4  A  P Z             T        Y              
TRACODEH DS    CL8                                                              
TRACODE  DS    CL3     20   29    3  A  U N             T        Y              
TRABLLH  DS    CL8                                                              
TRABLL   DS    CL7     20   38    7  A  P Z             T        Y              
TRABILLH DS    CL8                                                              
TRABILL  DS    CL3     20   47    3  A  U N             T        Y              
TRATABH  DS    CL8                                                              
TRATAB   DS    CL1     21    2    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 880  BYTES                            
