*          DATA SET SPTRAB8D   AT LEVEL 013 AS OF 02/08/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216B8D      DATE 02/08/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
TRANETH  DS    CL8                                                              
TRANET   DS    CL4      5   10    4  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    N         T        Y              
TRAPRGH  DS    CL8                                                              
TRAPRG   DS    CL6      5   28    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     7    2   15  A   P    N         T        Y              
TRANADRH DS    CL8                                                              
TRANADR  DS    CL30     7   20   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    N         T        Y              
TRANAMEH DS    CL8                                                              
TRANAME  DS    CL30     9    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30     9   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    10    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    10   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    11    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    11   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    12    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    12   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    13    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    13   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    14    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    14   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    15    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    15   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    16    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    16   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    17    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    17   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    18    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    18   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    19    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    19   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    20    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    20   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    21    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    21   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    22    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    22   44   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    23    2   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL30    23   44   30  A   U    N         T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     24    2    1  A   P    N         T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1288 BYTES                            
