*          DATA SET SPTRA8BD   AT LEVEL 007 AS OF 11/01/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2168BD      DATE 11/01/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
TRANETH  DS    XL8                                                              
TRANET   DS    CL4      5   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     5   20   12  A  P N             T        Y              
TRADPCH  DS    XL8                                                              
TRADPC   DS    CL2      5   34    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRAPRGH  DS    XL8                                                              
TRAPRG   DS    CL6      5   47    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL3      6   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     6   20   13  A  P N             T        Y              
TRAOFCH  DS    XL8                                                              
TRAOFC   DS    CL3      6   34    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   14    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   73    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   77    3  A  P N             T        Y              
TRAFAX1H DS    XL8                                                              
TRAFAX1  DS    CL10     9    2   10  A  U N             T        Y              
TRAEML1H DS    XL8                                                              
TRAEML1  DS    CL57     9   14   57  A  U N             T        Y              
TRATYP1H DS    XL8                                                              
TRATYP1  DS    CL1      9   74    1  A  U N             T        Y              
TRARSP1H DS    XL8                                                              
TRARSP1  DS    CL1      9   78    1  A  U N             T        Y              
TRAFAX2H DS    XL8                                                              
TRAFAX2  DS    CL10    10    2   10  A  U N             T        Y              
TRAEML2H DS    XL8                                                              
TRAEML2  DS    CL57    10   14   57  A  U N             T        Y              
TRATYP2H DS    XL8                                                              
TRATYP2  DS    CL1     10   74    1  A  U N             T        Y              
TRARSP2H DS    XL8                                                              
TRARSP2  DS    CL1     10   78    1  A  U N             T        Y              
TRAFAX3H DS    XL8                                                              
TRAFAX3  DS    CL10    11    2   10  A  U N             T        Y              
TRAEML3H DS    XL8                                                              
TRAEML3  DS    CL57    11   14   57  A  U N             T        Y              
TRATYP3H DS    XL8                                                              
TRATYP3  DS    CL1     11   74    1  A  U N             T        Y              
TRARSP3H DS    XL8                                                              
TRARSP3  DS    CL1     11   78    1  A  U N             T        Y              
TRAFAX4H DS    XL8                                                              
TRAFAX4  DS    CL10    12    2   10  A  U N             T        Y              
TRAEML4H DS    XL8                                                              
TRAEML4  DS    CL57    12   14   57  A  U N             T        Y              
TRATYP4H DS    XL8                                                              
TRATYP4  DS    CL1     12   74    1  A  U N             T        Y              
TRARSP4H DS    XL8                                                              
TRARSP4  DS    CL1     12   78    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14    2   15  A  P H             T        Y              
TRANADRH DS    XL8                                                              
TRANADR  DS    CL30    14   20   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15    2    9  A  P N             T        Y              
TRANAMEH DS    XL8                                                              
TRANAME  DS    CL30    16    2   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    16   45   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    17    2   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   45   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    18    2   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    18   45   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    19    2   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    19   45   30  A  U N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     23    2    1  A  U N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1000 BYTES                            
