*          DATA SET SPTRAA1D   AT LEVEL 010 AS OF 08/01/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216A1D      DATE 08/01/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDLH DS    XL8                                                              
TRAMEDL  DS    CL2      5   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTLH DS    XL8                                                              
TRACLTL  DS    CL4      5   28    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRAPRDLH DS    XL8                                                              
TRAPRDL  DS    CL4      5   46    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   56    3  A  P N             T        Y              
TRAESTLH DS    XL8                                                              
TRAESTL  DS    CL3      5   60    3  A  U N             T        Y              
TRAESDLH DS    XL8                                                              
TRAESDL  DS    CL16     5   64   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TRASTALH DS    XL8                                                              
TRASTAL  DS    CL8      6   10    8  A  U N             T        Y              
TRAMKNLH DS    XL8                                                              
TRAMKNL  DS    CL17     6   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
TRAPERLH DS    XL8                                                              
TRAPERL  DS    CL17     6   46   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TRAFLTLH DS    XL8                                                              
TRAFLTL  DS    CL40     7   10   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
TRAHL1H  DS    XL8                                                              
TRAHL1   DS    CL28     9    6   28  A  P N             T        Y              
TRAHL2H  DS    XL8                                                              
TRAHL2   DS    CL42     9   36   42  A  P N             T        Y              
TRASELH  DS    XL8                                                              
TRASEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24    2    1  A  U N             T        Y              
TRAPFKSH DS    XL8                                                              
TRAPFKS  DS    CL74    24    6   74  A  P N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1784 BYTES                            
