*          DATA SET SPTRA8DD   AT LEVEL 002 AS OF 03/25/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2168DD      DATE 03/25/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
TRNMEDH  DS    CL8                                                              
TRNMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
TRNCLTH  DS    CL8                                                              
TRNCLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRNPRDH  DS    CL8                                                              
TRNPRD   DS    CL4      5   46    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TRNPTRH  DS    CL8                                                              
TRNPTR   DS    CL4      5   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     6    2   13  A  P N             T        Y              
TRNTALH  DS    CL8                                                              
TRNTAL   DS    CL6      6   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
TRNMKTH  DS    CL8                                                              
TRNMKT   DS    CL8      6   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      6   56    5  A  P N             T        Y              
TRNCMLH  DS    CL8                                                              
TRNCML   DS    CL9      6   64    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
TRNPERH  DS    CL8                                                              
TRNPER   DS    CL18     7   10   18  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
TRNOPTH  DS    CL8                                                              
TRNOPT   DS    CL34     7   46   34  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9    4   11  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL24     9   34   24  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL12     9   67   12  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    10    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    11    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    12    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    13    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    14    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    15    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    16    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    17    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    18    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    19    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    20    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    21    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    22    4   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL76    23    4   76  A  P N             T        Y              
TRNTAGH  DS    CL8                                                              
TRNTAG   DS    CL1     24    2    1  A  P N             T        Y              
TRNLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1576 BYTES                            
