*          DATA SET SPTRRLC    AT LEVEL 010 AS OF 05/30/84                      
RLCRECD  DSECT       ******* STANDARD RUN LIMIT CODE RECORD *******             
*                                                                               
RLCKEY   DS    0XL13                                                            
RLCKID   DS    X'0A2A'             RECORD ID                                    
RLCKAM   DS    XL1                 AGENCY/MEDIA                                 
RLCKCLT  DS    XL2                 CLIENT                                       
         DS    XL8                                                              
*                                                                               
         DS    XL2                 RECORD LENGTH                                
         DS    XL4                 CONTROL                                      
         DS    XL1                                                              
RLCAGYA  DS    CL2                 AGENCY ALPHA                                 
         DS    XL2                                                              
         SPACE 2                                                                
RLCDTAEL DS    XL1'40'             RUN LIMIT ELEMENT                            
RLCDTALN DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
RLCRCDE  DS    CL1                 RUN LIMIT CODE                               
RLCRLMT  DS    0CL5                RUN LIMIT(S) 1 TO 3                          
RLCLDAY  DS    CL1                 DAY LIMIT(S)                                 
RLCLTIME DS    2XL2                TIME LIMITS                                  
