*          DATA SET SPTRAB1D   AT LEVEL 003 AS OF 06/27/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216B1D      DATE 06/27/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   28    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRAPRDH  DS    XL8                                                              
TRAPRD   DS    CL4      5   46    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   56    3  A  P N             T        Y              
TRAESTH  DS    XL8                                                              
TRAEST   DS    CL3      5   60    3  A  U N             T        Y              
TRAESTDH DS    XL8                                                              
TRAESTD  DS    CL16     5   64   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TRASTAH  DS    XL8                                                              
TRASTA   DS    CL8      6   10    8  A  U N             T        Y              
TRAMKNMH DS    XL8                                                              
TRAMKNM  DS    CL17     6   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
TRAPERH  DS    XL8                                                              
TRAPER   DS    CL17     6   46   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TRAFLTRH DS    XL8                                                              
TRAFLTR  DS    CL40     7   10   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     9    2   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     9   29   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     9   56   24  A  P N             T        Y              
TRADSP1H DS    XL8                                                              
TRADSP1  DS    CL78    10    2   78  A  P N             T        Y              
TRADSP2H DS    XL8                                                              
TRADSP2  DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24    2    1  A  U N             T        Y              
TRAPFKLH DS    XL8                                                              
TRAPFKL  DS    CL60    24    6   60  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
