*          DATA SET SPTRAD5D   AT LEVEL 003 AS OF 06/18/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216D5D      DATE 06/18/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL5      5   28    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRASTAH  DS    XL8                                                              
TRASTA   DS    CL8      5   46    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TRAFLTRH DS    XL8                                                              
TRAFLTR  DS    CL60     6   10   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL40     8    4   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     8   45   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9    2    1  A  U N             T        Y              
TRALN1H  DS    XL8                                                              
TRALN1   DS    CL76     9    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    10    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    11    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    12    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    13    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    14    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    15    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    16    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    17    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    18    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    19    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    20    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    21    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    22    4   76  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    23    4   76  A  P N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     24    2    1  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1544 BYTES                            
