*          DATA SET SPTRAF0D   AT LEVEL 004 AS OF 12/18/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216F0D      DATE 12/18/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   28    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  A   P    N         T        Y              
TRAMKTH  DS    CL8                                                              
TRAMKT   DS    CL7      5   46    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     5   55   10  A   P    N         T        Y              
TRACMLH  DS    CL8                                                              
TRACML   DS    CL9      5   66    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL20     6   10   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  A   P    N         T        Y              
TRAOPTSH DS    CL8                                                              
TRAOPTS  DS    CL25     6   47   25  A   U    N         T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1      6   77    1  A   U    N         T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 216  BYTES                            
