*          DATA SET SPTRAF4D   AT LEVEL 001 AS OF 11/11/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216F4D      DATE 11/11/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   38    5  A  P H             T        Y              
TRACMLH  DS    XL8                                                              
TRACML   DS    CL13     5   46   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TRAFLTRH DS    XL8                                                              
TRAFLTR  DS    CL30     6   10   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   45    1  A  P N             T        Y              
TRADELH  DS    XL8                                                              
TRADEL   DS    CL9      6   55    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P H             T        Y              
TRAPLSTH DS    XL8                                                              
TRAPLST  DS    CL58     7   21   58  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL58     8   21   58  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P H             T        Y              
TRADSC1H DS    XL8                                                              
TRADSC1  DS    CL24     9   16   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   43    5  A  P N             T        Y              
TRAADIDH DS    XL8                                                              
TRAADID  DS    CL13     9   56   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
TRADSC2H DS    XL8                                                              
TRADSC2  DS    CL24    10   16   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   43   10  A  P N             T        Y              
TRAHDEFH DS    XL8                                                              
TRAHDEF  DS    CL12    10   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   70    7  A  P N             T        Y              
TRASWAPH DS    XL8                                                              
TRASWAP  DS    CL1     10   78    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
TRADSC3H DS    XL8                                                              
TRADSC3  DS    CL24    11   16   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   43    9  A  P N             T        Y              
TRACNTRH DS    XL8                                                              
TRACNTR  DS    CL12    11   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
TRASOLOH DS    XL8                                                              
TRASOLO  DS    CL2     12   21    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   43   11  A  P N             T        Y              
TRAPRNTH DS    XL8                                                              
TRAPRNT  DS    CL12    12   56   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P H             T        Y              
TRARLSEH DS    XL8                                                              
TRARLSE  DS    CL11    13   16   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   28    8  A  P H             T        Y              
TRARCLH  DS    XL8                                                              
TRARCL   DS    CL11    13   41   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   54   12  A  P N             T        Y              
TRADSDTH DS    XL8                                                              
TRADSDT  DS    CL8     13   68    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    2   10  A  P H             T        Y              
TRASTIMH DS    XL8                                                              
TRASTIM  DS    CL6     14   16    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   28    8  A  P H             T        Y              
TRAETIMH DS    XL8                                                              
TRAETIM  DS    CL6     14   41    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   54   12  A  P N             T        Y              
TRADSTMH DS    XL8                                                              
TRADSTM  DS    CL5     14   68    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  P H             T        Y              
TRASLNH  DS    XL8                                                              
TRASLN   DS    CL5     15   16    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   28   12  A  P N             T        Y              
TRAOVRDH DS    XL8                                                              
TRAOVRD  DS    CL7     15   41    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   54   20  A  P H             T        Y              
TRADLYH  DS    XL8                                                              
TRADLY   DS    CL1     15   76    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    16    2   14  A  P H             T        Y              
TRADT1H  DS    XL8                                                              
TRADT1   DS    CL17    16   21   17  A  U N             T        Y              
TRADT2H  DS    XL8                                                              
TRADT2   DS    CL17    16   39   17  A  U N             T        Y              
TRADT3H  DS    XL8                                                              
TRADT3   DS    CL17    16   57   17  A  U N             T        Y              
TRADT4H  DS    XL8                                                              
TRADT4   DS    CL17    17   21   17  A  U N             T        Y              
TRADT5H  DS    XL8                                                              
TRADT5   DS    CL17    17   39   17  A  U N             T        Y              
TRADT6H  DS    XL8                                                              
TRADT6   DS    CL17    17   57   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    2    4  A  P H             T        Y              
TRATYPEH DS    XL8                                                              
TRATYPE  DS    CL5     18   21    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   39    3  A  P N             T        Y              
TRANET1H DS    XL8                                                              
TRANET1  DS    CL5     18   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   51    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   57    5  A  U N             T        Y              
TRANET4H DS    XL8                                                              
TRANET4  DS    CL5     18   63    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    19    2   13  A  P N             T        Y              
TRACLTNH DS    XL8                                                              
TRACLTN  DS    CL20    19   21   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   44   17  A  P N             T        Y              
TRATTEXH DS    XL8                                                              
TRATTEX  DS    CL2     19   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
TRAACT1H DS    XL8                                                              
TRAACT1  DS    CL12    20   13   12  A  U N             T        Y              
TRAACT2H DS    XL8                                                              
TRAACT2  DS    CL12    20   26   12  A  U N             T        Y              
TRAACT3H DS    XL8                                                              
TRAACT3  DS    CL12    20   39   12  A  U N             T        Y              
TRAACT4H DS    XL8                                                              
TRAACT4  DS    CL12    20   52   12  A  U N             T        Y              
TRACTXTH DS    XL8                                                              
TRACTXT  DS    CL15    20   65   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
TRACLSH  DS    XL8                                                              
TRACLS   DS    CL50    21   21   50  A  U N             T        Y              
TRATYPLH DS    XL8                                                              
TRATYPL  DS    CL75    22    2   75  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL75    23    2   75  A  P H             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     23   79    1  A  P N             T        Y              
TRAPFKH  DS    XL8                                                              
TRAPFK   DS    CL75    24    2   75  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
