*          DATA SET SPTRAEFD   AT LEVEL 016 AS OF 07/10/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216EFD      DATE 07/10/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL50     6    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     7    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     8    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     9    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    10    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    11    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    12    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    13    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    14    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    15    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    16    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    17    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50    18    2   50   A    P    N         T         Y           
PRTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 757  BYTES                            
