*          DATA SET SPTRADAD   AT LEVEL 024 AS OF 04/13/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216DAD      DATE 04/13/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   29    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   46    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TRAPTRH  DS    CL8                                                              
TRAPTR   DS    CL4      5   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
TRAMKTH  DS    CL8                                                              
TRAMKT   DS    CL5      6   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   20    8  A  P N             T        Y              
TRAESTH  DS    CL8                                                              
TRAEST   DS    CL4      6   29    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   38    6  A  P H             T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL18     6   46   18  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
TRASHIPH DS    CL8                                                              
TRASHIP  DS    CL3      7   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P N             T        Y              
TRAFMTH  DS    CL8                                                              
TRAFMT   DS    CL4      7   29    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
TRACONTH DS    CL8                                                              
TRACONT  DS    CL16     7   46   16  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      7   64    3  A  P N             T        Y              
TRAFAXH  DS    CL8                                                              
TRAFAX   DS    CL1      7   68    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
TRAOPTH  DS    CL8                                                              
TRAOPT   DS    CL53     8   10   53  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL62    10    2   62  A  P N             T        Y              
TRAPQIDH DS    CL8                                                              
TRAPQID  DS    CL8     10   65    8  A  P N             T        Y              
TRASEL1H DS    CL8                                                              
TRASEL1  DS    CL3     11    2    3  A  P N             T        Y              
TRADSP1H DS    CL8                                                              
TRADSP1  DS    CL75    11    6   75  A  P N             T        Y              
TRASEL2H DS    CL8                                                              
TRASEL2  DS    CL3     12    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
TRATABH  DS    CL8                                                              
TRATAB   DS    CL1     24    2    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1712 BYTES                            
