*          DATA SET SPTRAE4D   AT LEVEL 007 AS OF 02/07/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216E4D      DATE 02/07/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   28    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      5   38    2  A   P    N         T        Y              
TRACMLH  DS    CL8                                                              
TRACML   DS    CL9      5   46    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
TRAFLTRH DS    CL8                                                              
TRAFLTR  DS    CL30     6   10   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
TRADELH  DS    CL8                                                              
TRADEL   DS    CL9      8   21    9  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A   P    H         T        Y              
TRAPLSTH DS    CL8                                                              
TRAPLST  DS    CL37     9   18   37  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A   P    H         T        Y              
TRATLEH  DS    CL8                                                              
TRATLE   DS    CL15    10   18   15  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A   P    H         T        Y              
TRASLNH  DS    CL8                                                              
TRASLN   DS    CL5     11   18    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A   P    H         T        Y              
TRARLSEH DS    CL8                                                              
TRARLSE  DS    CL9     12   18    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    12   33   11  A   P    H         T        Y              
TRARCLH  DS    CL8                                                              
TRARCL   DS    CL9     12   47    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13    2    4  A   P    H         T        Y              
TRATYPEH DS    CL8                                                              
TRATYPE  DS    CL5     13   18    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    14    2   13  A   P    N         T        Y              
TRACLTNH DS    CL8                                                              
TRACLTN  DS    CL20    14   18   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A   P    N         T        Y              
TRASOLOH DS    CL8                                                              
TRASOLO  DS    CL2     15   18    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   33    5  A   P    N         T        Y              
TRACLSH  DS    CL8                                                              
TRACLS   DS    CL5     15   47    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A   P    N         T        Y              
TRACRTCH DS    CL8                                                              
TRACRTC  DS    CL7     17   18    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   33    8  A   P    N         T        Y              
TRACDTEH DS    CL8                                                              
TRACDTE  DS    CL9     17   47    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A   P    N         T        Y              
TRAREGNH DS    CL8                                                              
TRAREGN  DS    CL11    18   18   11  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   33    5  A   P    N         T        Y              
TRATCNOH DS    CL8                                                              
TRATCNO  DS    CL9     18   47    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     18   60    6  A   P    N         T        Y              
TRACBCH  DS    CL8                                                              
TRACBC   DS    CL6     18   70    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A   P    N         T        Y              
TRAASCH  DS    CL8                                                              
TRAASC   DS    CL9     19   18    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     19   33    8  A   P    N         T        Y              
TRAADTEH DS    CL8                                                              
TRAADTE  DS    CL9     19   47    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL38    21   18   38  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    22    2   14  A   P    H         T        Y              
TRATC1H  DS    CL8                                                              
TRATC1   DS    CL18    22   18   18  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   39    1  A   P    N         T        Y              
TRATC2H  DS    CL8                                                              
TRATC2   DS    CL18    22   42   18  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   15    1  A   P    N         T        Y              
TRATC3H  DS    CL8                                                              
TRATC3   DS    CL18    23   18   18  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   39    1  A   P    N         T        Y              
TRATC4H  DS    CL8                                                              
TRATC4   DS    CL18    23   42   18  A   U    N         T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     24    2    1  A   P    N         T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 920  BYTES                            
