*          DATA SET SPTRAWORKD AT LEVEL 013 AS OF 03/11/19                      
*                                                                               
*  SAVED STORAGE AT BOTTOM OF TWA0 - NOTE TWA IS 18K LONG 18,432                
*                                                                               
T216FFD  DSECT                                                                  
TWAMAX   EQU   18*1024             MAX TWA LEN!!                                
         ORG   T216FFD+TWAENDLQ    ORG TO BOTTOM OF TWA0                        
*                                                                               
*        DS    CL1280              SAVE AREA FOR SYSD                           
* THIS IS FOR SAVED START AS SAVED AND RESTORED BY GENCON IN TWA0               
*                                                                               
UNTABLE  DS    XL11060             ROOM FOR 140 ENTRIES                         
ENDUNTBL EQU   *                                                                
*                                                                               
         ORG   UNTABLE                                                          
STADRTAB DS    XL5760              60 96 CHAR STA ADDR                          
ENDSTADR EQU   *                                                                
*                                                                               
         ORG   UNTABLE                                                          
SVNETLST DS    XL241                                                            
SVNETLSX EQU   *                                                                
SVOLDLST DS    XL241                                                            
SVOLDLSX EQU   *                                                                
*                                                                               
         ORG   UNTABLE+11060                                                    
*                                                                               
SECBLK   DS    CL1024              SECRET PARAMETER BLOCK                       
*                                                                               
LENSVCLS DS    0C                                                               
         DS    XL8                 FOR MARKER - *SVCLST*                        
SVNCLIST DS    XL1024              ROOM FOR 253 PRODUCTS                        
NCLSTSIZ EQU   256                 NO. OF 4 BYTE ENTRIES IN SVNCLIST            
*                                                                               
ENDNSVC  EQU   *      <====>      MUST NOT BE MORE THAN X'4800'                 
*                                                                               
LENSVCL  EQU   *-LENSVCLS                                                       
                                                                                
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -         
         ORG   LSTSCMAP+10                                                      
PCDRIVE  DS    XL(PCDRIVEL)                                                     
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -         
* ENDNSVC  EQU   *      <====>      MUST NOT BE MORE THAN X'4800'               
                                                                                
GLVFMTD  DSECT                     THID IS FOR SPOT/LINK INTFC ELEM             
FMTBLSUB DS    CL3                 BLD/SUBMIT                                   
FMTSHIP  DS    CL1                                                              
FMTFAX   DS    CL1                                                              
FMTRPT   DS    XL2                                                              
FMTDOALL DS    CL1                                                              
FMTSVKEY DS    CL8                 SEQ/DATE/A-M/CLT FOR 0A7F REC                
                                                                                
* SPECIAL AREAS FOR TRAFFIC SYSTEM *                                            
         SPACE                                                                  
SYSD     DSECT                                                                  
         SPACE                                                                  
SYSV     DS    0C                                                               
CLPACK   DS    V                   EXTERNAL ADDRESSES                           
CLUNPK   DS    V                                                                
MSPACK   DS    V                                                                
MSUNPK   DS    V                                                                
VDUMMY   DS    V                                                                
ATIOB    DS    V                                                                
STAVAL   DS    V                                                                
STAPACK  DS    V                                                                
VRECUP   DS    A                                                                
ASVNCLST DS    A                   ADDRESS OF NEW SAVED CLIST                   
ASVCLIST EQU   ASVNCLST                                                         
SOXSW    DS    XL1                 SOX SWITCHES-R/O FILE, R/O MODE, TST         
         SPACE                                                                  
* IF READ ONLY SYSTEM OR READ ONLY MODE OR WRONG ADV, ERROR                     
         SPACE                                                                  
SOXERFLG EQU   XIROSYS+XIROMODE+XIWRONGF                                        
         SPACE                                                                  
* DDS AND FACTEST, OKAY TO PROCEED                                              
         SPACE                                                                  
SOXOKFLG EQU   XIDDSPER+XITSTADV IF DDS, AND FACTEST, OKAY TO GO                
         SPACE                                                                  
XMLCOM   DS    XL1                 X'80'=HDRCOM PRTD, X'40'=FTRCOM PRTD         
INSCRIPT DS    CL1                                                              
PFKEY    DS    XL1                                                              
         SPACE                                                                  
SYSCOMM  DS    0A                  COMMON FACILITIES FOR SYSTEM                 
GETAGY   DS    V                   FILLS IN USERNAME USERADD                    
VALIMED  DS    V                   FILLS IN BAGYMD MEDNM                        
VALICLT  DS    V                                                                
VALIPRD  DS    V                                                                
VALIMKT  DS    V                                                                
VALISTA  DS    V                                                                
VALISLN  DS    V                                                                
VALILOC  DS    V                                                                
VALIEST  DS    V                                                                
VTRAERR  DS    V                                                                
VSWITCH  DS    V                                                                
VALPER   DS    V                                                                
VALIDPT  DS    V                                                                
VSOXERR  DS    V                                                                
VALIPGR  DS    A                                                                
SVADGEND DS    A                                                                
*                                  EXTRACT AREAS                                
         SPACE                                                                  
SVSTART  DS    0C                                                               
         SPACE                                                                  
BAGYMD   DS    XL1                 BINARY VALUES                                
BCLT     DS    XL2                                                              
BPRD     DS    XL1                                                              
BSLN     DS    XL1                                                              
BPRD2    DS    XL1                                                              
BSLN2    DS    XL1                                                              
BMKTSTA  DS    0XL5                                                             
BMKT     DS    XL2                                                              
BSTA     DS    XL3                                                              
BEST     DS    XL1                                                              
BESTEND  DS    XL1                                                              
QPRD     DS    CL3                                                              
SPOTNETF DS    CL1                 S=SPOT, N=NET                                
SPOTCAN  DS    CL1                 C=SPOT CANADA                                
QDPT     DS    CL1                 DAYPART EQUATE                               
QDPT2    DS    CL2                 2 CHAR DAYPART CODE                          
*                                                                               
SECFLAG  DS    CL1                 SECURITY FLAG                                
BLSSW    EQU   X'80'               BRAND LEVEL SECURITY                         
NOCLOFF  EQU   X'40'               NO MATCH ON CLIENT OFFICE                    
NEPRDOFF EQU   X'20'               PRODUCT OFFICES NOT EQUAL                    
PRDTHTR  EQU   X'04'               PRODUCT IS THEATRICAL                        
NECONPRD EQU   X'02'               NET FULLY CONVERTED - NO OLD PAT/REV         
NEMORPRD EQU   X'01'               NETPAK MORE PRODUCTS SET ON                  
*                                                                               
TRLSTPGM DS    CL1                 LAST ACTIVE PROGRAM                          
CSYSTEMT DS    CL1                 CURRENT SYSTEM TRAFFIC USED                  
QPRD2    DS    CL3                                                              
QESTDESC DS    XL20                                                             
AGYORIG  DS    CL10                                                             
         SPACE                                                                  
SVCLTOFF DS    CL1                 SAVED OFFICE FROM CLIENT REC                 
*                                  USES CTRAFOFC OR COFFICE                     
SVPRDOFF DS    XL1                 SAVE OFFICE FROM PROD RECORD                 
         DS    XL1           **** DO NOT USE (PROD OFFICE FUTURE USE)           
STANET   DS    CL8                                                              
QEST     DS    XL3                                                              
QMED     DS    CL1                                                              
QCLT     DS    CL3                                                              
MEDNM    DS    CL10                MEDIA NAME                                   
MEDCAPT  DS    CL7                 MEDIA CAPTION                                
CLTNM    DS    CL20                CLIENT NAME                                  
PRDNM    DS    CL20                PRODUCT NAME                                 
PRD2NM   DS    CL20                PARTNER NAME                                 
MKTNM    DS    CL24                MARKET NAME                                  
STAPRNT  DS    CL7                 CALL LETTERS IN PRINTABLE FMT                
QSTA     DS    CL5                 CALL LETTERS IN REQUEST FORMAT               
QMKT     DS    CL4                 MARKET NUMBER EBCDIC                         
         SPACE                                                                  
SVKEY    DS    XL24                                                             
*                                  THIS IS SPARE/USED TO BE SVCLIST             
SVADDWHN DS    XL3                 FOR PATTERNS, VRSN 1 ADD DATE                
ATR07AMS DS    A                   A(AUTO AMS REQUEST FILE)                     
SVT3PROF DS    CL16                T3 PROFILE SAVE AREA                         
SVPRVDA  DS    A                   PREVIOUS DISK ADDRESS SAVE AREA              
ATSARFIL DS    A                                                                
SVELDSP  DS    H                                                                
         DS    H                                                                
ASVCMLX  DS    A                   USED BY SPTRA04                              
ASHPLSTX DS    A                   USED BY SPTRA04                              
PRVPATDA DS    F                   USED BY SPTRA03                              
PRVPATMD DS    X                                                                
PRVPATCL DS    XL2                                                              
SVMENU   DS    X                                                                
ADIDFLAG DS    C                                                                
SVLSTKEY DS    XL24                                                             
SVNETNEW DS    C                                                                
SV8AOLD  DS    XL2                 OLD 8A POINTER DATE                          
SV8ANEW  DS    XL2                 NEW 8A POINTER DATE                          
SV8ABAS2 DS    XL2                 2-BYTE FILE LOAD DATE FOR 8A                 
SV8ABASE DS    CL6                                                              
SVPOLQ   DS    CL9                 ALPHA POL PRD LIST                           
SVPOLFLG DS    C                   FLAG FOR 1ST/2ND BUY PASS                    
SVXFRSID DS    XL2                 SESSION CALLER ID'S                          
SVXFROV  DS    X                   TRANSFER CONTROL OVERLAY NUMBER              
         DS    X                                                                
SVXFRMOD DS    CL3                 C'BLD' OR C'SUB' FROM SPOT/LINK              
*                                                                               
SVINDEX  DS    CL24                                                             
SVWRKFNO EQU   SVINDEX+8,2                                                      
SVWRKREC DS    CL40                                                             
SVRUNALL DS    C                                                                
SVUNIQID DS    CL60                                                             
SVTRFUSR DS    CL3                                                              
SVTRFRPN DS    XL2                                                              
ERRTEXT  DS    CL36                                                             
OPTICWHO DS    CL3                 REQUESTOR INITIALS FOR OPTICA                
*                                                                               
DDLNKSW1 DS    X                                                                
TRALNKRQ EQU   X'80'               TRAFFIC/LINK REQUEST                         
VALERROQ EQU   X'40'               VALIDATION ERROR OCCURRED                    
EDICTHSQ EQU   X'20'               EDICT HEADER IS SET                          
FAKERROQ EQU   X'10'               FAKE ERROR                                   
*                                                                               
DDLNKSW2 DS    X                                                                
LKIOEOFQ EQU   X'80'               LINKIO EOF REACHED                           
LKIOHDRQ EQU   X'40'               LINKIO HEADER MAP RECORD REPLIED             
SVXMLFLG DS    XL1                 SPARE                                        
         DS    XL1                                                              
*                                                                               
SVXMLPAR DS    0XL16                                                            
SVXMLP1  DS    A                                                                
SVXMLP2  DS    A                                                                
SVXMLBUF DS    A                   A(31-BIT BUFFER)+4096                        
SVXMLCMF DS    A                                                                
*                                                                               
SVXMLUSR DS    A                                                                
*                                                                               
XMLWORK  DS    CL152                                                            
XMLWORK2 DS    CL48                                                             
*                                                                               
SAVFILD  DS    CL8                                                              
SAVFILF  DS    CL8                                                              
SAVLKEY  DS    CL48                                                             
SAVDDISP DS    H                                                                
SAVLSTAT DS    H                                                                
SPTR00RR DS    A                                                                
         DS    265C                SPARE                                        
SEEDFLG  DS    CL1                                                              
SVTN3PRO DS    CL16                                                             
SVTN2PRO DS    CL16                                                             
SVTN2PR1 EQU   SVTN2PRO+0                                                       
SVTN2PR3 EQU   SVTN2PRO+2                                                       
SVTN2PR5 EQU   SVTN2PRO+4                                                       
SVTN2PR6 EQU   SVTN2PRO+5                                                       
SVTN2PR8 EQU   SVTN2PRO+7                                                       
SVTN2PR9 EQU   SVTN2PRO+8                                                       
SVTN2PRC EQU   SVTN2PRO+11                                                      
SVPGRP   DS    XL2                                                              
PGRLEN   DS    X                   NUMBER OF DIGITS IN PGRP                     
INSOLDLN DS    X                   PTTN DATA LEN IN RECAP RECS                  
INSNEWLN DS    X                   PTTN DATA LEN IN RECAP RECS                  
MYSCREEN DS    CL1                                                              
GRIDST   DS    XL1                 GRID STATUS                                  
GRIDSON  EQU   X'80'               PCPAK HAS GRIDS PREFERENCE ON                
HEADFLAG DS    CL1                 FOR 04/H=HL,X=XHL                            
SVAMSOPT DS    CL1                                                              
SVAMSAUT DS    CL1                 AMS GEN TO FOLLOW AUTO/GEN                   
SVNXTCHG DS    X                   FOR COMHIST, NEXT ELEM TO DISPLAY            
*                                                                               
SVPROF   DS    CL16                                                             
SVUSER   DS    CL66                SAVE AREA FOR AGYNAME/ADDR                   
SVQSTART DS    CL6                                                              
SVQEND   DS    CL6                                                              
QBEST    DS    CL1                 REQUESTED START EST (BINARY)                 
QBESTEND DS    CL1                 REQUESTED END EST                            
SVT1PROF DS    CL16                                                             
EQVPRDS  DS    XL30                15 EQUIV PRDS(AND ACT/INACT FLG)             
*                                                                               
GBLOCK   DS    0XL7                GETTXT PARAMETER AREA                        
GINDEX   DS    X                   INDEX FOR GETTXT                             
GERROR   DS    XL2                 ERROR NUMBER FOR GETTXT                      
         ORG   *-1                                                              
GERROR1  DS    X                   ONE BYTE ERROR NUMBER                        
GMSGTYPE DS    X                   MESSAGE TYPE (X'00' = ERROR)                 
GASUBST  DS    AL3                 A(SUBST TEXT TABLE)                          
*  FORMAT OF TABLE IS (FOR EA. ENTRY):  1 BYTE LEN, FOLLOWED                    
*  BY TEXT (LENGTH IS L'TEXT + 1 FOR LEN BYTE).  TABLE IS ENDED                 
*  WITH A ZERO LENGTH ENTRY                                                     
*                                                                               
SVSPARE  DS   0CL51                                                             
SVBCLTH  DS    XL2                 USED TO RENEW NEW SAVE CLIST                 
WORKSEC  DS    CL48                OFFICER                                      
SVCPROF6 DS    CL1                 SAVE CPROF+6 FROM CLT RECORD                 
SVSPAREX DS    0C                                                               
CABLESTA EQU   X'E8'              ALL PACKED STA BELOW THIS ARE                 
*                                 STD STA CALL LETTERS (ALPHA)                  
*                                 ANY THIS OR HIGHER ARE NUMERIC                
*                                 LOCAL CABLE STATIONS                          
CABLENET EQU    X'80'             USED TO DROP LOCAL CABLE NET                  
*                                 AND THEN COMBINE ALL NETS TO                  
*                                 1 CABLE STATION                               
         SPACE                                                                  
* EQUATES FOR T0 PROFILE VALUES *                                               
         SPACE                                                                  
SVPROF1  EQU   SVPROF+0            RESHIP PERIOD IN DAYS                        
SVPROF2  EQU   SVPROF+1            SHIPPING ORDERS BY PRODUCT                   
*                              WAS RUN LIMIT CODES BY CMML/PTTN                 
SVPROF3  EQU   SVPROF+2            AUTO BOXES FOR PTTN COMMNETS                 
SVPROF4  EQU   SVPROF+3            PRINT PURCHASE ORDER ON INST                 
SVPROF5  EQU   SVPROF+4            PRINT REQUESTOR/REPORT ON INST               
SVPROF6  EQU   SVPROF+5            SHIPPING OPTION (Y/N/A)                      
SVPROF7  EQU   SVPROF+6            PRINT POL INST IF PATTERN ERRORS             
SVPROF8  EQU   SVPROF+7            AUTO MAILERS FOR INST                        
SVPROF9  EQU   SVPROF+8            PRINT AUTO PURCHASE ORDER - SHIPPERS         
SVPROF10 EQU   SVPROF+9            AUTO T/A REPTS N(ONE)/D(DS)/R(EMOTE)         
SVPROF11 EQU   SVPROF+10         D/Y = DAYPARTS        = COPY CODES             
*                                  A = ADJACENCY CODES = COPY CODE              
*                                  E = ESTIMATE CODE   = COPY CODE              
SVPROF12 EQU   SVPROF+11           SPECIAL COMMENT CODE                         
SVPROF13 EQU   SVPROF+12           PRODUCT EQUIVALENCY CLIENT                   
SVPROF14 EQU   SVPROF+13       WAS DLR MKT/GRP ID                               
SVPROF15 EQU   SVPROF+14           USE TRAFFIC BUYS, NOT SPOT BUYS              
SVPROF16 EQU   SVPROF+15           ALT INSTR COMMENT CODE                       
         SPACE                                                                  
* EQUATES FOR T1 PROFILE VALUES *                                               
         SPACE                                                                  
SVT1PR1  EQU   SVT1PROF+0          ROTATOR DAYS TO BE ADJUSTED                  
SVT1PR2  EQU   SVT1PROF+1   0-6    NUMBER OF DAYS TO ADJUST BY                  
SVT1PR3  EQU   SVT1PROF+2          Y=PRT PROD INSTR TBA IF PAT ERR              
*                                  S=PROCESS PAT ERRS, BUT SUPPRESS             
*                                    PRINTING TBA LINE                          
SVT1PR4  EQU   SVT1PROF+3   Y,N,S  ONLY SHOW CHANGED PATTERNS OR                
*                                  SUPPRESS                                     
*                                  PATTERN RECAP T/A                            
SVT1PR5  EQU   SVT1PROF+4   Y,N,B  FTD/LTD, FLIGHT DATES, OR BLANK              
SVT1PR6  EQU   SVT1PROF+5   Y,N,E  Y = INSTEAD OF SHOWING                       
*   YOU SHOULD HAVE ALL CMLS EXCEPT THE FOLLOWING WHICH WILL BE SHIPPED         
*                                                       ARE ENCLOSED            
*                                  E = ELIMINATE SHIPPING MSG                   
SVT1PR7  EQU   SVT1PROF+6    Y,N   PRINT CLT CMML AFTER COMML TITLE             
SVT1PR8  EQU   SVT1PROF+7    Y,N   CREATE AUTO P/B PATTERN                      
SVT1PR9  EQU   SVT1PROF+8    Y,N   COVER LETTER INSTR (NO PRINT INS)            
SVT1PR10 EQU   SVT1PROF+9    Y,N   NON-STD COMML CODES-RADIO ONLY               
SVT1PR11 EQU   SVT1PROF+10   Y,N   STATION CML TYPE OVERRIDES CML               
SVT1PR12 EQU   SVT1PROF+11   Y,N   SUPPRESS PATTERN ROTATION                    
SVT1PR13 EQU   SVT1PROF+12   Y,N   USE FLT/EST DATES, NOT FTD/LTD               
SVT1PR14 EQU   SVT1PROF+13   Y,N   PRINT EST DESC                               
SVT1PR15 EQU   SVT1PROF+14   Y,N   DO NOT USE UFN IN PATTERNS                   
SVT1PR16 EQU   SVT1PROF+15   Y,N   REQUIRE PRODUCT ON INST, TWX,                
*                                   COV GEN, AND SHIP GEN                       
         SPACE                                                                  
* EQUATES FOR TN PROFILE VALUES *                                               
         SPACE                                                                  
SVTNPR1  EQU   SVPROF+0    0-99   NUMBER OF PREV REV CMTS TO PRINT              
SVTNPR2  EQU   SVPROF+1           CALENDAR/BROADCAST MONTH (TRAFFIC)            
*                                  W=PERIOD = WEEK, DATE MUST BE MONDAY         
SVTNPR3  EQU   SVPROF+2    Y/N    ALLOW INSTR FOR UNALLOCATED UNITS             
SVTNPR4  EQU   SVPROF+3    Y/N    ALLOW -'S IN CML AS PADDING                   
SVTNPR5  EQU   SVPROF+4    Y/N    TRAFFIC DELETES ALLOWED                       
SVTNPR6  EQU   SVPROF+5    Y/N    BLANK AGENCY NAME & ADDRESS                   
SVTNPR7  EQU   SVPROF+6    Y/N/A  BLANK AGENCY OF RECORD N & A                  
*                                  A=BLANK TITLE AS WELL                        
SVTNPR8  EQU   SVPROF+7    Y/N    NET BUYACT MULT NETS ON 1 PAGE                
SVTNPR9  EQU   SVPROF+8           M=MEDIA, S=SKED UNITS, B=BOTH                 
SVTNPR10 EQU   SVPROF+9    Y/N    BLANK NETWORK ADDRESS FROM PROGLIST           
SVTNPR11 EQU   SVPROF+10   Y/N    DO NOT PRINT DISTRIBUTION COPIES LIST         
SVTNPR12 EQU   SVPROF+11   Y/N    SHOW ALL REVISION NUMBERS BY AIRDATE          
SVTNPR13 EQU   SVPROF+12   Y/N    FORCE DIFF PROG NAMES TO MULTI PAGES          
SVTNPR14 EQU   SVPROF+13   Y/N    ALLOW INSTR FOR UNASSIGNED UNITS              
SVTNPR15 EQU   SVPROF+14   Y/N    OPT TO PRINT EXTRA LINE AT DATE CHG           
SVTNPR16 EQU   SVPROF+15   Y/N    SUPPRESS PRINTING-COMPARING DAY/TIME          
         SPACE                                                                  
* EQUATES FOR TN1 PROFILE VALUES *                                              
         SPACE                                                                  
SVTN1PR1 EQU   SVT1PROF+0   Y,N  DO NOT USE UFN IN NET PATTERNS                 
SVTN1PR2 EQU   SVT1PROF+1   Y,N  SUPPRESS AUTO SEED CMT(NINS)                   
SVTN1PR3 EQU   SVT1PROF+2   Y,N  SUPPRESS PGMS COVERED (CABLE)                  
SVTN1PR4 EQU   SVT1PROF+3   Y,N  BYPASS PRINT NET SEED REPORT                   
SVTN1PR5 EQU   SVT1PROF+4   Y,N  NINS GEN-PRINT RECAP/CHANGES ONLY              
SVTN1PR6 EQU   SVT1PROF+5   Y,N  NINS GEN-BLANK TYPE FIELD                      
SVTN1PR7 EQU   SVT1PROF+6                                                       
SVTN1PR8 EQU   SVT1PROF+7                                                       
SVTN1PR9 EQU   SVT1PROF+8   Y,N  BYPASS PREVIOUSLY ASSIGNED CMLS                
SVTN1PRA EQU   SVT1PROF+9   Y,N  NINS/GEN PRT LEGEND MG MAKEGOOD                
SVTN1PRB EQU   SVT1PROF+10                                                      
SVTN1PRC EQU   SVT1PROF+11                                                      
SVTN1PRD EQU   SVT1PROF+12                                                      
SVTN1PRE EQU   SVT1PROF+13                                                      
SVTN1PRF EQU   SVT1PROF+14                                                      
SVTN1PRG EQU   SVT1PROF+15                                                      
         EJECT                                                                  
* PF KEY EQUATES                                                                
         SPACE                                                                  
PF1      EQU   1                   PF KEYS 1 AND 13                             
PF2      EQU   2                   PF KEYS 2 AND 14                             
PF3      EQU   3                   PF KEYS 3 AND 15                             
PF4      EQU   4                   PF KEYS 4 AND 16                             
PF5      EQU   5                   PF KEYS 5 AND 17                             
PF6      EQU   6                   PF KEYS 6 AND 18                             
PF7      EQU   7                   PF KEYS 7 AND 19                             
PF8      EQU   8                   PF KEYS 8 AND 20                             
PF9      EQU   9                   PF KEYS 9 AND 21                             
PFA      EQU   10                  PF KEYS 10 AND 22                            
PFB      EQU   11                  PF KEYS 11 AND 23                            
PFC      EQU   12                  PF KEYS 12 AND 24                            
         EJECT                                                                  
* ERROR MESSAGES FOR TRAFFIC (61-100)                                           
         SPACE                                                                  
INVMED   EQU   61                  INVALID MEDIA                                
INVCLI   EQU   62                  INVALID CLIENT                               
INVPROD  EQU   63                  INVALID PRODUCT                              
INVCOMM  EQU   64                  INVALID COMMERCIAL                           
INVTYPE  EQU   65                  INVALID TYPE                                 
INVSTA   EQU   66                  INVALID STATION                              
INVMKT   EQU   67                  INVALID MARKET                               
BADSLN   EQU   68                  BAD SPOT LENGTH                              
NOMKTACC EQU   69                                                               
*                                                                               
NOPTTRN  EQU   70                                                               
NOFLTREC EQU   71                                                               
NOFLTEL  EQU   72                                                               
FLTOVLAP EQU   73                                                               
NOSTAADR EQU   74                  NO STATION ADDRESS                           
NOINSTR  EQU   75                  NO INSTRUCTION RECORD FOUND                  
PATCMLER EQU   76                  PAT/CML SPOT LENS DIFFERENT                  
BDCMLDTS EQU   77                  COMML RELEASE AFTER PATTN START              
UNMCMLTP EQU   78                  CML PAIR HAVE DIFFERENT TYPES                
DUPLSTA  EQU   79                  DUPLICATE STATION IN LIST                    
*                                                                               
*        EQU   80             ???  CANADIAN TRAFFIC NOT RUNNING                 
RECLOCKD EQU   81                  RECORD BEING UPDATED BY SOON JOB             
NOCBLNET EQU   82                  CABLE NETWORK NOT ON MASTER RECORD           
INVHFCDE EQU   83                  MUST BE H(EADLINE) OR F(OOTNOTE)             
INVBOXCD EQU   84                  BOXES MUST BE Y(ES) OR N(O)                  
INVFNSZ  EQU   85                  MORE THAN 2 LINES OF FOOTNOTE                
INVREFSZ EQU   86                  REF NUMBER TOO LARGE                         
INVEQPRD EQU   87                  PROD/PARTNER PROD THE SAME                   
INVPRDSQ EQU   88                  PROD/PARTNER PAIR OUT OF SEQ                 
INVCMLRT EQU   89                  MISSING/EXTRA ROTATION                       
*                                                                               
INVCMLDL EQU   90                  TRYING TO DELETE AN EMPTY CMML SLOT          
BDCMLRCD EQU   91                  COMML RECALL BEFORE PATTN START              
*INVCPLMT EQU   91                  RUN LMITS IN PATTERN AND COMMERCIAL         
INVAFFIL EQU   92                  AFFILIATE MUST BE ABC, CBS, OR NBC           
BDCMLDTE EQU   93                  COMML RECALL BEFORE PATTN END                
CMLPRDER EQU   94                  PAT PROD(S) NOT IN COMMERCIAL                
DUPLCMML EQU   95                  DUPLICATE COMMERCIALS IN LIST                
INVPRHSE EQU   96                  PRODUCTION HOUSE NOT FOUND                   
INVCMMLN EQU   97                  COMMERCIAL ID MUST BE 8 CHAR                 
NOPRDFND EQU   98                  NO PROD FOUND FOR THIS CLT                   
INVTXTLN EQU   99                  TEXT LINE LONGER THAN 60 CHAR                
INVPRDCD EQU   100                 PROD POOL & AAA NOT VALID                    
*                                                                               
* MESSAGES 200 - 220 FOR COMMERCIAL INSTRUCTIONS *                              
*                                                                               
BADKEYWD EQU   200                 INVALID KEYWORD                              
NODATE   EQU   201                 DATE FIELD IS REQUIRED                       
NOCOMM   EQU   202                 COMMERCIAL NOT FOUND                         
NEWFLT   EQU   203                 DATES NOT IN SAME FLIGHT AS PREVIOUS         
BADFLT   EQU   204                 DATES NOT WITHIN ONE FLIGHT                  
BADPIG   EQU   88                  INVALID PIGGYBACK PAIR                       
BADESTS  EQU   205                 INVALID ESTIMATE SERIES                      
NOTFLTDT EQU   206                 DATES DO NOT MATCH A FLIGHT                  
NOESTS   EQU   207                 NO ESTIMATES IN REQUEST PERIOD               
NOPRDHS  EQU   208                 NO CMML 99999999 RECORD OPEN                 
INVCMLMT EQU   209                 PIGGY-BACK CML'S DIFF RUN LMTS               
*                                                                               
INVEQCML EQU   210                 CML AND PIGGY BACK CML THE SAME              
*******   EQU   211                 CLT PROFILE-RLC BY CMML OR PAT              
*                                                                               
* GETTXT ERROR MESSAGES FOR SPOT/NET TRAFFIC (500+) ARE NOW IN                  
* SYSTEM STRAFFIC (X'0D')                                                       
*                                                                               
*MISCLTE  EQU   500--->641          MUST ENTER CLIENT TO ENTER ESTIMATE         
*BADESTSZ EQU   501--->642          EST MUST BE 1-3 DIGITS VALUE 1-255          
*ESTNF    EQU   502--->643          ESTIMATE NOT FOUND                          
BADOFF   EQU   500                 OFFICE MUST BE * AND 1 CHARACTER             
NOCLTS   EQU   501                 NO CLIENTS FOUND FOR OFFICE                  
NOPROG   EQU   502                 NO PROGRAM FOUND                             
NONET    EQU   503                 NO NETWORK FOUND                             
NOPOSF   EQU   504                 NO POSF ON MULTIPLE CLIENTS                  
ONEDATE  EQU   506                 FOR FROM/TO DATES MUST ENTER                 
DATSEQER EQU   507                 FROM/TO DATES OUT OF SEQUENCE                
DATPERER EQU   508                 ENTER MONTH/YEAR OR FROM/TO DATES            
BDCMLLN  EQU   509                 COMMERCIAL MUST BE 4 OR 8 CHARS              
BDNETTYP EQU   510                 NETWORK TYPE MUST BE 1 CHAR-N/C/S            
INVPRDE  EQU   511                 PRODUCT &T NOT A VALID PRODUCT               
PRDLENER EQU   512                 PRODUCT MUST BE 2 OR 3 CHARS LONG            
BADPRD   EQU   513                 ENTER PRODUCT OR PRODUCT/PARTNER             
UNITERR  EQU   514                 UNITS=B(OTH),N(ETWORK),T(RAFFIC)             
BDPGRSZ  EQU   515                 PRODUCT GP CAN ONLY USE 1ST 2 DIGITS         
PGRSCH   EQU   516                 ENTER PRODUCT GROUP SCHEME V,W,X             
PRDGRPNF EQU   517                 NO PRODUCT GROUP &1 FOUND                    
BADPRGR  EQU   518                 ENTER PRODUCT GROUP AS SNN                   
OFFCNG   EQU   520                 OFFICE CODE SUPPORTED OFFLINE ONLY           
BDSPTLN  EQU   521                 UNT LEN-XXX NOT CML LEN-XXX                  
CSPRDNG  EQU   522                 PRD=ONLY FOR CPY SPLT W/NO PRD ASSN          
NOIPCS   EQU   523                 IP NOT ALLOWED ON CPY SPLT                   
IPREQPB  EQU   524                 IP REQUIRES PARTNER PROD                     
BDRESDT  EQU   525                 NO UNIT FOR RESTORE DATE                     
BDCMLLN2 EQU   526                 CML MUST BE AT LEAST 1 CHAR                  
BDCMLDT  EQU   527                 CML RELEASE = &1, RECALL = &2                
NOFD2FD  EQU   528                 CAN'T ADD A FEED TO A FEED                   
NODELUNT EQU   529                 CAN'T DEL A NAT'L UNT, ONLY FEEDS            
NODELFD  EQU   530                 CAN'T DEL FEED SET UP BY MEDIA               
BDPOSLN  EQU   531                 POSITION MUST BE 1-4 CHARS                   
BDPRDLN  EQU   532                 PRODUCT NOT MORE THAN 3 CHARS                
NOUNT4CM EQU   533                 NO UNIT FOUND FOR THIS CML                   
BDCMLLN3 EQU   534                 8 CHAR CML MUST PRECEED BY 4 CHAR CM         
CMLISDEL EQU   535                 COMMERCIAL IS DELETED                        
DELPB    EQU   536                 DELETE CML ON FIRST LINE OF PAIR             
BDDEL    EQU   537                 CAN'T DEL CML, NONE ASSIGNED                 
PBCML1ST EQU   538                 PIGGYBACK CML FOR FIRST PRODUCT              
PBNINCML EQU   539                 PB PROD NOT IN CML, LEN=BOTH                 
BDUNTPRD EQU   540                 UNIT PRODUCT NOT IN COMMERCIAL               
DTNINPER EQU   541                 DATE= MUST HAVE ST/ED DT IN PER              
WASWEEK  EQU   542                 PGM WAS RUN WKLY, MUST NOW RUN WKLY          
WASMON   EQU   543                 PGM WAS RUN MONLY,MUST NOW RUN MONLY         
MEDCHUNT EQU   544                 MED CHG UNTS-REASGN(S) NEEDED                
SVUNTINC EQU   545                 MED SVD UNTS INCLDED REASGN(S) NEDED         
UNTUPDT  EQU   546                 UNITS UPDATED WITH ASSIGNED CMMLS            
NOUNTPER EQU   547                 NO UNITS FOR THIS PERIOD                     
PGMISLCK EQU   548                 PROGRAM IS LOCKED                            
NALLOCUN EQU   549                 NO ALLOCATED UNITS                           
FEDONFED EQU   550                 &1 UNIT HAS FEED ON A FEED                   
TOMNYUNT EQU   551                 TOO MANY UNITS TO ASSIGN **********          
FEEDNF   EQU   552                 NO FEED &1 FOUND                             
FEEDEXST EQU   553                 FEED &1 ALREADY EXISTS FOR THIS UNT          
BDFEEDLN EQU   554                 FEED MUST BE 1-4 CHARACTERS                  
BDPGRPLN EQU   555                 PROD GROUP MUST BE 1-4 DIGITS                
PRODNA   EQU   556                 PRODUCT CAN'T BE ENTERED W/PROD GRP          
PRDREQD  EQU   557                 PROFILE REQUIRES PRODUCT,ENTER PRD=          
PGRPREQD EQU   558                 PROFILE REQ PROD GRP, ENTER PGRP=            
PATPROD  EQU   559                 PAT PROD &1 NOT IN COMMERCIAL &2             
NOEQUIV  EQU   560                 CAN'T ENTER EQUIVALENT PROG CODE             
CSNALLOC EQU   561                 CPY SPLT UNT FOR &1 NOT ALLCD PROD           
ONEPROD  EQU   562                 CPY SPLT UNT FOR &1 NOT USING PRD &2         
REVCMTRQ EQU   563                 REVISION COMMENT(S) MUST BE ENTERED          
NOSTXFND EQU   564                 NO SPECIAL TEXT FOUND                        
ONLYMMYY EQU   565                 ENTER MONTH AND YEAR ONLY                    
MONSTDT  EQU   566                 DATE MUST START WITH MON, NOT &1             
WKDTER   EQU   567                 ENTER MO/DA/YR AND DATE MUST BE MON          
CSVALPRD EQU   568                 &1 ONLY VALID PRODS FOR CPY SPLT UNT         
MANYPATT EQU   569                 RUN NET SEED,TOO MNY PATS FOR ONLINE         
PATPER   EQU   570                 ONLY USE PATTERNS FOR FULL PERIOD            
NOPATT   EQU   571                 NO PATTERNS FOR THIS PROGRAM                 
MEDREQBB EQU   572                 MEDIA REQUIRED BILLBOARD                     
MISSDESC EQU   573                 DESCRIPTION 2 REQUIRED FOR DESC 3            
BADOVRD  EQU   574                 OVERRIDE MUST BE NN/NN                       
INVOVRD  EQU   575                 OVERRIDE MUST ADD UP TO LENGTH               
SLNALL   EQU   576                 ONLY TYPS CSL/SSL/CSS/ACD CN BE ALL          
BADCML   EQU   577                 CML MUST BE 4 ALPHA/4 NUM OR -3 NUM          
BDCMLD   EQU   578                 CML NON-BLANK & DASH PADDED                  
BADCLS   EQU   579                 CLASS MUST BE 1-4 CHARS                      
SOLOERR  EQU   580                 MUST BE BLANK, P(IGGYBACK) OR S(OLO)         
NORESTOR EQU   581                 CAN'T RESTORE, RECORD NOT DELETED            
DUPPRD   EQU   582                 FLD &1 = &2 IN PRODUCT LIST                  
NOOVRD   EQU   583                 PRN OVRD N/A FOR SLN=ALL                     
NOGDPRG  EQU   584                 ALL PROGRAMS FOR REQUEST HAVE ERRORS         
MANYUNT  EQU   585                 MORE THAN &1 UNTS FOR ONLN, RUN OV           
MANYPGM  EQU   586                 MORE THAN &1 PGMS, MUST RUN OV               
BDPGMDAT EQU   587                 LAST PROGRAM &1 DATE IS &2                   
BDSOON   EQU   588                 SOON ONLY ALLOWED FOR OPTION TEST            
NOUNTSEL EQU   589                 NO UNITS SELECTED                            
BDNETMED EQU   590                 INVALID MEDIA ON NETWORK                     
BDPARPER EQU   591                 PARTIAL PER DATE MUST BE IN PERIOD           
UNTNOCML EQU   592                 UNITS HAVE NO COMMERCIALS ASSIGNED           
EQVUNCV  EQU   593                 EQUIV PROGRAM CODE NOT COVERED               
UNALERR  EQU   594                 ONLY UNALLOCTD UNITS FOR THIS PGM            
NOFAX    EQU   595                 NO FAX NUMBER IN NETWORK RECORD              
UNALPRD  EQU   596                 UNALLOCATED PRODS FOR THIS PGM               
INITREQD EQU   597                 MUST ENTER INITIALS                          
NOTWAUTH EQU   598                 MUST HAVE TW PROFILE AUTHORIZATION           
BADFAX   EQU   599                 ONLY VALID ENTRIES ARE Y, 2, OR N            
FLD2BIG  EQU   600                 FIELD TOO LARGE, REENTER                     
NOPGM4DT EQU   601                 NO PROGRAM &1 FOR DATE &2                    
BYWEEK   EQU   602                 PGM &1 WAS RUN BY WEEK, NOT BY MON           
BYMON    EQU   603                 PGM &1 WAS RUN BY MONTH, NOT BY WK           
UNASERR  EQU   604                 ONLY UNASSIGNED UNITS FOR THIS PGM           
UNALASER EQU   605                 ONLY UNAS/UNAL UNITS FOR THIS PGM            
BDPGRLN2 EQU   606                 PROD GROUP MUST BE 1-2 DIGITS                
BADMEDIA EQU   607                 VALID MEDIA IS C,S,N,O                       
NETMDRQD EQU   608                 MEDIA OR NETWORK REQD FOR PROD               
PFUNDEF  EQU   609                 UNDEFINED FUNCTION KEY                       
LINERR   EQU   610                 CUR MUST BE ON TXT LNE FOR PF3/4             
NOPREVPG EQU   611                 NO PREVIOUS PAGE EXISTS                      
DELLAST  EQU   612                 MUST DELETE FOLLOWING PAGE(S) FIRST          
MISCLTL  EQU   613                 CLIENT REQUIRED FOR ONLINE LIST              
MISCLTP  EQU   614                 CLIENT REQUIRED FOR FILT BY PRD              
TOOBIG   EQU   615                 JOB TOO BIG FOR ONLINE, TRY SOON             
BBASGND  EQU   616                 PROGRAM &1 HAS BILLBOARDS ASSIGNED           
POSASGND EQU   617                 PROGRAM &1 HAS POSITIONS ASSIGNED            
NASSRUN  EQU   618                 NET ASS RUN ON &1,USE NINS/RUN SEED          
MANYPAT  EQU   619                 >THAN &1 PATTERNS FOR ONLINE, RUN OV         
BDCMLLN4 EQU   620                 ENTER XXXXXXXX OR XXXXXXXX-XXXXXXXX          
PBCMLSAM EQU   621                 PIGGYBACK CMLS SAME                          
CMLISMIS EQU   622                 NO CML 4 PTR PRD (1 D/N CVR BTH PRDS         
DATOVLAP EQU   623                 PATTERN REF &1 DATES &2-&3 OVERLAP           
NETREQD  EQU   624                 MUST ENTER NET IF PGM FD OR CODE ENT         
NOPGMFED EQU   625                 PGM & FEED N'ALLOWED WITH M=                 
NOPGMCOD EQU   626                 CAN'T HAVE PROGRAM & CODE                    
INVDPT   EQU   627                 DAYPART CODE MUST BE 1 OR 2 CHAR             
NOFEED   EQU   628                 FEED NOT FOUND                               
NOFEDPGM EQU   629                 CAN'T HAVE PROGRAM & FEED                    
BADFEED  EQU   630                 FEED CODE MORE THAN 4 CHARS                  
PGMUNCOV EQU   631                 PGM IS NOT COV FOR THIS DATE                 
NOUFN    EQU   632                 UFN DATE NOT VALID  - TN1 PROF 1             
NOPCT1CM EQU   633                 NO PERCENT ALLOWED FOR 1 CML                 
NOMIXPCT EQU   634                 MUST HAVE ALL PCTS OR NONE                   
ROTPCT   EQU   635                 ALL %'S MUST ADD TO 99 OR 100                
INVPCT   EQU   636                 %'S MUST BE 1 OR 2 DIGITS                    
ZEROPCT  EQU   637                 % MUST BE NON-ZERO                           
LIST2LNG EQU   638                 LIST TOO LONG TO CREATE                      
COMLENER EQU   639                 COMMENT LENGTH MORE THAN 52                  
PRDPRDLN EQU   640                 ENTER AS PRD OR PRD-LEN                      
MISCLTE  EQU   641                 MUST ENTER CLIENT TO ENTER ESTIMATE          
BADESTSZ EQU   642                 EST MUST BE 1-3 DIGITS VALUE 1-255           
ESTNF    EQU   643                 ESTIMATE NOT FOUND                           
CMLNOBLK EQU   644                 COMMERCIAL CODE HAS EMBEDDED BLANK           
*                                                                               
ESTREQD  EQU   645                 EST NEEDED FOR COPY CDE=EST                  
ESTHASCC EQU   646                 EST HAS COPY CODE                            
BADSHIP  EQU   647                 MUST BE Y(ES), N(O), OR A(UTO)               
PTRINV   EQU   648                 PARTNER INVALID WITH POL REQUEST             
CMLDEL2  EQU   649                 COMMERCIAL &1 IS DELETED                     
UNASSPOT EQU   650                 STATION HAS ALL UNASSIGNED SPOTS             
NOSPTSEL EQU   651                 NO SPOTS SELECTED                            
CMTREQD  EQU   652                 CMT= REQUIRED                                
BADCMT   EQU   653                 CMT MUST BE * && @ # /                       
WRONGMKT EQU   654                 STATION IN MARKET &1, NOT MARKET &2          
BADCMT2  EQU   655                 CMT= MUST BE * OR &1 - ONLY 1 CHAR           
MANYSTA  EQU   656                 TOO MANY STATIONS FOR ONLINE                 
SPDLRTAG EQU   657                 SPOTS HAVE DEALER TAGS                       
MANYSPOT EQU   658                 TOO MANY SPOTS FOR ONLINE, RUN OV            
DTNINEST EQU   659                 DATE(S) NOT IN EST PERIOD                    
BDESTEND EQU   660                 END DATE MUST BE EST END                     
*                                                                               
CMLCOVRD EQU   661                 CMML IS USED BY COV - CANNOT DEL             
CMLISCOV EQU   662                 CMML IS COV CMML                             
CMLBDDT  EQU   663                 ACT CMML DATES DONT MATCH COV DATES          
NOPRDHIT EQU   664                 NO PRDS IN ACT MATCH PRDS IN COV             
COVREQ2  EQU   665                 COVER CMML REQUIRES 2+ ACT CMMLS             
SLNNEQ   EQU   666                 ACT SLN'S <> COV SLN                         
NOCOVCOV EQU   667                 COVERED CMML CANT BE COVER CMML              
SAMECMML EQU   668                 COMMERCIAL CAN'T COVER ITSELF                
TYPEERR  EQU   669                 ACT CMML TYPE <> COV CMML TYPE               
*                                                                               
NOADDDEL EQU   670                 ACTION ADD/DELETE NOT ALLOWED                
TALAGYNF EQU   671                 INVALID TALENT AGENCY                        
TALNAUTH EQU   672                 UNAUTHORIZED TALENT AGENCY                   
*                                                                               
SUNEDDT  EQU   673                 DATE MUST END WITH SUN, NOT &1               
MXTSARMS EQU   674                 MAX ONLINE, HIT ENTER TO CONTINUE            
*                                  TSAR CAPACITY EXCEEDED                       
SPTRDONL EQU   675                 SPTDIR/FIL READ ONLY                         
NOCHGUNT EQU   676                 NINS GEN - NO CHANGED UNITS TO PRT           
*                                  TN1 PROFILE 5 IS ON                          
SPUFNINV EQU   677                 SPOT PAT UFN INVALID T1 PR 15                
BDMGRENT EQU   678                 ENTRY &1 NOT CNNN C=MKT GROUP SCHEME         
*                                   + 1-4 DIGITS                                
NOMGRENT EQU   679                 ENTRY &1 NO MARKET GROUP FOUND               
DUPMSER  EQU   680                 ENTRY &1 & &2 IN MKT/STA LIST ARE            
*                                   SAME(&3)                                    
MAXLSTEX EQU   681                MAX ENTRIES IN MARKET/STATION LIST=44         
AFFENTER EQU   682                 ENTER 1 AFFILIATE OR AFF,AFF                 
AFFDUPMS EQU   683                 AFFILIATE IS DUPLICATED                      
BADTYPMS EQU   684                 T=A(FF)/M(ARKET)/S(TA)/T(YPE)/               
*                                   B(MKT/AFF)/G(MKT GRP)                       
MISMKTMS EQU   685                 NO MARKETS ENTERED IN LIST                   
MISAFFMS EQU   686                 NO AFFILIATES ENTERED IN LIST                
STATYPER EQU   687                 STATION TYPE MUST BE ENTERED AS              
*                                   1 CHARACTER                                 
ESTCCDE  EQU   688                 ESTIMATE HAS COPY CODE                       
INVMSENT EQU   689                 ENTRY &1 IS AN INVALID MARKET/STA-           
*                                   TION ENTRY                                  
MISEQVPR EQU   690                 PRODUCT MUST BE SET UP AS BASE               
CANREGIS EQU   691                 XXXXXXX DATE EXPIRES BEFORE PATTERN          
MSTALCYC EQU   692                 NO TALENT CYCLE(S) FOR COMMERCIAL            
CANTALCY EQU   693                 NO TALENT CYCLE IN COMML FOR PATTERN         
MSMAXLST EQU   694                 TOO MANY ENTRIES TO FIT IN LIST,             
*                                   TAKE ONE OUT                                
VCCLEN   EQU   695                 COPY CODE MORE THAN 1 CHARACTER LONG         
INVPGSO  EQU   696                 COMML PIGGYBACK/SOLO CODE MUST MATCH         
UNTACTER EQU   697                 OPT=ACT & NEG CAN'T BE USED TOGETHER         
NETCHERR EQU   698                 NETWORK CAN'T BE CHANGED                     
POLNOWER EQU   699                 CAN'T RUN POL NOW - COV GEN/AUTO REP         
MOPROCES EQU   700                 PRESS ENTER TO PROCESS MORE REQUESTS         
INVCMLN  EQU   701                 INVALID CML FOR THIS NETWORK                 
CHDPRD   EQU   702                 UNIT FOR &1 THE PRD &2 WAS CHGD              
CHCALBRD EQU   703                 CAN'T SWITCH FRMO &1 TO &2 PERIOD            
PATPRDER EQU   704                 PAT PROD & NOT IN COMMERCIAL                 
CMLPATER EQU   705                 &1 HAS DIFFERENT SPOT LEN FROM PAT           
PATPROER EQU   706                 PAT PROD CML ERROR, RUN SOON FOR REP         
PROGCOVR EQU   707                 PROG DOESN'T COVER PERIOD + ROTATION         
CMLERRER EQU   708                 PATTERN CML ERROR CML=&1 &2                  
CMMLSQER EQU   709                 ENTER COMMERCIALS IN PRD SEQUENCE            
UNTASDEL EQU   710                 CMLS ASSIGNED - &1 DELETED UNITS             
ENTCMLMS EQU   711                 AUTO ASSIGN CML, NO ENTRY ALLOWED            
BDTSUPP  EQU   712                 TRAFFIC SUPPLIER ERROR                       
BDTSOPT  EQU   713                 TSUPP REC &1 NOT FOUND                       
PRDGRPSW EQU   714                 PROGRAM RAN &1 NOT BY &2                     
BDCONTC  EQU   715                 PROD &1 AND &2 HAVE DIFF CONTACT             
NOCLADTE EQU   716                 CLIENT APPROVAL DATE MISSING (&1)            
NAPRTAIR EQU   717                 CML &1 NOT APPROVED TO AIR                   
INVENTRY EQU   718                 INVALID &1                                   
NPATFNET EQU   719                 NO PAT FOUND FOR NETWORK &1                  
NOOLDER  EQU   720                 OLDEST VERSION IS DISPLAYED                  
NONEWER  EQU   721                 LATEST VERSION IS DISPLAYED                  
INVADID  EQU   722                 INVALID ADID                                 
INVTSUP  EQU   723                 INVALID TRAFFIC SUPPLIER                     
INVPADID EQU   724                 OPTION PADID VALID FOR OFFLINE ONLY          
FORMADID EQU   725                 ADID MUST BE 12 ALPHA/NUM CHARS              
INVASSGN EQU   726                 OPTION REASSIGN FOR OFFLINE ONLY             
HELPMSG  EQU   727                 OPTIONS HELP INFO                            
GRIDOPT  EQU   728                 OPTION IS NOW A GRID COLUMN                  
INVGROPT EQU   729                 OPTION IS NOT A VALID GRID OPTION            
CANTCHG  EQU   730                 CANNOT CHANGE EXISTING AD-ID!                
ADID12AN EQU   731                 AD-ID MUST BE 12 ALPHA/NUM CHARS             
MAXPGRP  EQU   732                 MAX PRODS FOR THIS PGRP EXCEEDED             
CMLLENMS EQU   733                 COMMERCIAL MUST BE 8 CHARS                   
CMLBADMS EQU   734                 CMML MUST BE ALPHA-NUM ONLY                  
PRCNTMS  EQU   735                 PERCENTS MUST SUM TO 100                     
BADTELMS EQU   736                 TELECASTER MUST BE 8 CHARS                   
DUPTELMS EQU   737                 TELECASTER NUMBER ALREADY ON FILE            
BADBJPRD EQU   738                 MASTER CLT MUST ENTER PRD=ALL OR F1          
CANMEDMS EQU   739                 CAN ONLY ADD FOR MED T WITH T2 PROF7         
BADAUTH  EQU   740                 INSUFFICIENT AUTHORIZATION                   
PRDALLMS EQU   741                 NO TAL TRANSFER FOR PRD=ALL                  
TALTRNMS EQU   742                 TAL TRANSFER MUST BE Y OR N                  
REFNOMSG EQU   743                 REFERENCE FIELD SHOULD BE BLANK              
NOTALMS  EQU   744                 MISSING TALENT AGENCY                        
MISEQVMS EQU   745                 PRODUCT MUST BE SET UP AS A BASE             
INVPERMS EQU   746                 INVALID PERIOD                               
INVTIMMS EQU   747                 INVALID TIME                                 
MISSPRDM EQU   748                 PRD DOES NOT EXIST ON NET CLT                
PRDSMSG  EQU   749                 ONLY ONE PRODUCT PER CMML                    
CMML812  EQU   750                 COMMERCIAL SHOULD BE 8-12 CHARS              
DESTERR  EQU   751                 DESTROY DTE MUST BE AFTER RLS DTE            
NOPBTHTR EQU   752                 NO P/B FOR THEATRICAL PRODUCTS               
BPATTHTR EQU   753                 USE BPAT FOR THEATRICAL PRODUCTS             
HIATTHTR EQU   754                 HIATUS NOT ALLOWED FOR THTR                  
UPATTERR EQU   755                 USE PAT FOR NON THEATRICAL PRODUCTS          
DUPHIDEF EQU   756                 DUPLICATE HIDEF CML ON FILE                  
DUPCNTRC EQU   757                 DUPLICATE CENTERCUT CML ON FILE              
OBPATHTR EQU   758                 USE OPTION BPAT FOR THTR PRODS               
NOBPATMS EQU   759                 BPAT OPT IS NOT VALID FOR NON-THTR           
BINSTMS  EQU   760                 USE BINST RECAP FOR THTR PROD                
UINSTMS  EQU   761                 USE INST RECAP FOR NON-THTR PROD             
DUPCMFIL EQU   762                 DUPLICATED SPCL CMML CODE ON FILE            
DUPCMSCR EQU   763                 DUPLICATED SPCL CMML CODE ON SCREEN          
INVAMSGN EQU   764                 AMS GEN INVALID FOR BPAT                     
CMML912  EQU   765                 COMMERCIAL SHOULD BE 9-12 CHARS              
ADID912  EQU   766                 AD-ID MUST BE 9-12 ALPHA/NUM CHARS           
THTRFMS  EQU   767                 ERROR THEATRICAL PRODUCT FOUND               
ROTORPCT EQU   768                 ENTER ROT OR PCTS/NOT BOTH                   
BADLTTR  EQU   769                 INVALID LETTER IN ROTATION                   
*CMML8CH  EQU   770                 COMMERCIAL MUST BE 8 CHARACTERS             
RUNETLST EQU   770                 MUST RUN NET LIST                            
MUSTBEST EQU   771                 MUST USE COPYCD=EST TO ENTER DPT             
BADDPT   EQU   772                 INVALID DAYPART ENTRY                        
STENDTIM EQU   773                 START TIME NOT BEFORE END TIME               
TIMORDPT EQU   774                 ENTER TIME OR DPT, NOT BOTH                  
DTNOTSAM EQU   775                 PTTNS HAVE DIFFERENT DATES                   
NEEDDPT  EQU   776                 NEED TO HAVE A DPT CODE                      
CMLHASTM EQU   777                 PTTN CAN'T HAVE TIME IF CMML DOES            
DPTTMERR EQU   778                 CAN'T HAVE DPTS AND TIMES IN PTTNS           
NOCHGDPT EQU   779                 CAN'T CHANGE DPT - DELETE AND READD          
BADCMLDT EQU   780                 CMML DATES OUTSIDE PATTERN PERIOD            
NOHAVTIM EQU   781                 CAN'T HAVE TIME WITH DPT OR PGM              
ASGNMSG  EQU   782                 SEED/ASSIGN FOR PROGRAM &1                   
NOT812   EQU   783                 CMML MUST BE 8 (ISCI) OR 9-12 (ADID)         
NOCPYAVL EQU   784                 NO PREVIOUS PATTERN TO BE COPIED             
NETCMML  EQU   785                 CANNOT USE NTWK SPEC CMML                    
NOSTAGRP EQU   786                 STATION GROUP NOT FOUND                      
BADSEND  EQU   787                 SPECIFY SEND OR DOWN =ALL/UPDATE             
PGRPNG   EQU   788                 PRODUCT GROUP NOT VALID                      
NOPGMALL EQU   789                 CAN'T DO ONE PROG FOR ALL NETS               
DLYTIME1 EQU   790                 IF DPT=*, MUST ENTER TIMES                   
DLYTIME2 EQU   791                 FILE HAS DAILY, NEW DOES NOT                 
DLYTIME3 EQU   792                 NEW HAS DAILY, FILE DOES NOT                 
BADNLST  EQU   793                 &1 IS NOT A VALID NETWORK                    
NONLST   EQU   794                 NETWORK &1 NOT FOUND                         
NODELNET EQU   797                 CANNOT ADD A DELETED NETWORK                 
NEED1NET EQU   798                 HAVE TO HAVE AT LEAST 1 NET                  
DUPNET   EQU   799                 DUPLICATE ENTRY IN NETWORK LIST              
NOTINPER EQU   800                 SUBSTITUTE DATES NOT IN CMML PERIOD          
STENDERR EQU   801                 SUBSTITUTE START DT NOT BEFORE END           
NOCHGSUB EQU   802                 CHANGE LEAVES SUBST DTS OUT OF PER           
SUBOVLAP EQU   803                 PERIODS OVERLAP                              
DAYSONCE EQU   804                 ONLY ONE DAY(S) ENTRY ALLOWED                
INPUTYY  EQU   805                 PLEASE INPUT MMMDD/YY                        
BADDATE  EQU   806                 INPUT FORMAT IS MMMDD OR MMMDD/YY            
DAYSOVLP EQU   807                 HIATUS DAYS ENTRY OVERLAP                    
DATEOVLP EQU   808                 HIATUS DATES ENTRIES OVERLAP                 
NOTINPAT EQU   809                 DATE NOT IN PATTERN PERIOD                   
DAYSNDTS EQU   810                 CAN'T HAVE DAYS AND DATE ENTRIES             
NODELADD EQU   811                 CAN'T ADD A SOFT DELETED RECORD              
NOTVCMML EQU   812                 ONLY ADD MED N IT TV EXISTS                  
NETTHERE  EQU  813                 MEDIA N REC NOT ADDED - ALRDY THERE          
CMLCHKSUM EQU  814                 COMML REC HAS CHANGED - CHKSUM ERR           
CMLFORMH EQU   815                 H IS THE ONLY VALID FORMAT (HIDEF)           
CLILOCK  EQU   816                 CLIENT LOCKED FOR SOON PROCESSING            
ESDTERRQ EQU   817                 END DATE NOT ESTIMATE END                    
BADDTESQ EQU   818                 DATE(S) NOT IN EST PERIOD                    
ESTCPYQ  EQU   819                 EST HAS COPY CODE BUT CPY CD BY DPT          
NEEDPRDQ EQU   820                 POL NOT VALID - ENTER SPECIFIC PRD           
CCESTERQ EQU   821                 ONLY ONE EST FOR CPY CD = EST                
BADINPQ  EQU   822                 UNKNOWN INPUT                                
BADCMT1  EQU   823                 CMT MUST BE $ && @ # / N *'                  
ENTCMT2  EQU   824                 CMT= IS REQUIRED                             
EXTCOMMA EQU   825                 YOU'VE GOT A COMMA BUT NO INPUT              
NOMKLERQ EQU   826                 NO MARKET LIST FOUND                         
MKTLNAMQ EQU   827                 ENTER MARKET LIST NAME                       
MKTOPTQ  EQU   828                 RUN EITHER MLIST OR MKT/MGROUP *'            
******** EQU   829                                                              
DOFAXNO  EQU   830                 DO FAX=NO WITH NOPRT OPTION                  
DOFAXNO2 EQU   831                 DO FAX=NO WITH TEST REQUEST                  
NOBUYSFD EQU   832                                                              
PRDSREQV EQU   833                 PRDS &1 ARE EQUIVALENT                       
ESTDTER1 EQU   834                 END DATE NOT EST END                         
ESTDTER2 EQU   835                 DATE(S) NOT IN EST PERIOD                    
ESTCCERR EQU   836                 CAN'T DO CPYCD BY DPT IF EST HAS CC          
POLNOTOK EQU   837                 CANNOT RUN FOR POL - ENTER A PRD             
NOAUTPIG EQU   838                 CAN'T RUN AUTO P/B SOON                      
ONECCEST EQU   839                                                              
BADCMT3  EQU   840                 CMT= MUST BE * OR X * (1 CHAR)               
AMSERRQ  EQU   841                 ENTER AMS=Y/N                                
ONLY1MGR EQU   842                 ONLY 1 MKTGRP AT A TIME                      
MGPROFER EQU   843                 MUST HAVE T2 PROFILE 1 SET                   
MGNF     EQU   844                 MKTGRP NOT FOUND                             
NTRMGRAS EQU   845                 ENTER MKTGRP AS NNNN                         
OPTHELPQ EQU   846                 OPTIONS ARE ....                             
BADCCEST EQU   847                 COPY CODED EST HAS EQUIV TABLE               
BADADJCD EQU   848                 BAD ADJACENCY CODE                           
POLPRDER EQU   849                 BAD POL PRD                                  
FLTERR1  EQU   850                 END=  <<FLIGHT DATES>>                       
FLTERR2  EQU   851                 ESTIMATE DATES ARE                           
MANYDAYS EQU   852                 MAX 371 DAYS                                 
MANYPTNS EQU   853                 MAX 36 PATTERNS                              
ESTNECC  EQU   854                 CANNOT RUN BY EST IF EST NE COPYCD           
DOFAXNO3 EQU   855                 CANNOT FAX FOR REPRINT REQUEST               
OPHLPAMS EQU   856                 AMS HELP OPTIONS ARE ...                     
POLPTRMS EQU   857                 CAN'T DO PRD POL AND LIMIT PTR PRD           
AMSPRFER EQU   858                 RUNNING BY EST, CHANGE T2 PROF 16            
NOAUTAMS EQU   859                 CAN'T DO AUTOAMS IF RUNNING BY EST           
IDUNNO   EQU   860                                                              
OTHERR   EQU   861                 NET/ASSIGN OTHER FIELD                       
MAXDTMS  EQU   862                 MAX USE DATE =                               
DUPREQ   EQU   863                 ONE COMMERCIAL AT A TIME                     
FLTRERR  EQU   864                 FILTER HELP MESSAGE                          
PTRCMLER EQU   865                 PARTNER CMML TYPE ERROR                      
MULPRDMS EQU   866                 MULTIPLE PRD ERROR                           
TSUPPMSG EQU   867                 ALL UNITS MUST HAVE SAME TSUPP               
DELPRDMS EQU   868                 DELETED PRODUCT IN UNIT DATED ...            
NOCHGMS  EQU   869                 NO CHANGES MADE - CAN'T SAVE                 
DPTMSMCH EQU   870                 DAYPART MISMATCH ON UNITS  E                 
LASTERR  EQU   *                   EQUATE TO FIND NEXT ERROR NUMBER             
*                                                                               
* INFO MESSAGES FOR NET                                                         
*                                                                               
NORECSEL EQU   500                 NO RECORDS SELECTED                          
VTYPDIS  EQU   501                 VALID TYPE ENTRIES DISPLAYED                 
SELMSG   EQU   502                 ALL SEL PGMS SEEDED, ENTER FOR MORE          
ENDMSG   EQU   503                 ALL SEL PGMS SEEDED, ENTER NXT REQ           
MOREMSG  EQU   504                 DATA DISP, ENTER SEL, HIT ENT FOR +          
DONEMSG  EQU   505                 DATA DISP, ENTER SEL, LAST SCREEN            
PERHLP   EQU   506                 PERIOD IS &1 FROM &2 TO &3                   
SELMSG2  EQU   507                 ALL SEL INS GENERTD, ENTER FOR MORE          
ENDMSG2  EQU   508                 ALL SEL INS GENERTD, ENTER NXT REQ           
ACMLMSG  EQU   509                 PRESS PF3 TO ADD COMMERCIALS                 
NTRCMMLS EQU   510                 ENTER COMMERCIALS NOW!                       
*                                                                               
* I/O EQUATES                                                                   
*                                                                               
AIOCALL  EQU   VALIEST                                                          
READQ    EQU   0001                READ ON DIRECTORY                            
SEQQ     EQU   0002                SEQUENTIAL READ ON DIRECTORY                 
HIGHQ    EQU   0003                READ HIGH ON DIRECTORY OR IS FILE            
WRITEQ   EQU   0004                WRITE TO DIRECTORY                           
ADDQ     EQU   0005                ADD TO DIRECTORY                             
GETQ     EQU   0006                GETREC ON DIRECT ACCESS FILE                 
PUTQ     EQU   0007                PUTREC ON DIRECT ACCESS FILE                 
ADDRECQ  EQU   0008                ADDREC ON DIRECT ACCESS FILE                 
SPTQ     EQU   1*EQU0016Q          SPOT FILE/DIRECTORY                          
UNTQ     EQU   2*EQU0016Q          UNIT FILE/DIRECTORY                          
STAQ     EQU   3*EQU0016Q          STATION FILE/DIRECTORY                       
TRFQ     EQU   4*EQU0016Q          TRAFFIC FILE/DIRECTORY                       
NTIQ     EQU   5*EQU0016Q          NTI(PAV) FILE/DIRECTORY                      
CTLQ     EQU   6*EQU0016Q          CONTROL FILE/DIRECTORY                       
XSPQ     EQU   7*EQU0016Q          XSPOT FILE                                   
DIRQ     EQU   X'80'               READ DIRECTORY                               
FILQ     EQU   X'00'               READ FILE                                    
PASSDELQ EQU   X'0100'             RETURN DELETED RECORDS                       
UPDATEQ  EQU   X'0200'             READ FOR UPDATE - LOCKS RECORD               
EQU0016Q EQU   0016                                                             
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -         
LIOALBLQ EQU   (3*6000)+(3*8)      LEN OF 3 6000 BYTE IO AREAS PLUS             
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -         
       ++INCLUDE FAXTRAINF                                                      
*                                                                               
       ++INCLUDE DDGRIDD                                                        
*                                                                               
       ++INCLUDE DDFH                                                           
*                                                                               
       ++INCLUDE NEDDEQUS                                                       
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -         
