*          DATA SET SPTRAA4D   AT LEVEL 011 AS OF 06/06/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216A4D      DATE 06/06/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    H         T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   28    4  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A   P    H         T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   46    4  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   56    6  A   P    H         T        Y              
TRAMKTH  DS    CL8                                                              
TRAMKT   DS    CL5      5   64    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL18     6   10   18  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77     8    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   U    N         T        Y              
TRALN1H  DS    CL8                                                              
TRALN1   DS    CL77     9    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    10    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    11    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    12    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    13    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    14    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    15    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    16    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    17    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    18    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    19    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    20    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    21    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    22    4   77  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL77    23    4   77  A   P    N         T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     24    2    1  A   P    N         T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1536 BYTES                            
