*          DATA SET SPTRNEBID  AT LEVEL 002 AS OF 03/25/19                      
*********************************************************************           
*        EQUATES AND DSECTS FOR EBI INSTRUCTION (BXF)                           
*********************************************************************           
*                                                                               
* TSAR RECODS DSECTS                                                            
*                                                                               
BLDEBID  DSECT                                                                  
*                                                                               
BLKLN    EQU   10                  KEY LENGTH                                   
BLRECL   EQU   220                 MAX RECORD LENGTH                            
BLSIZE   EQU   300000              BUFFER SIZE FOR OFFLINE                      
BLSIZEN  EQU   200000              BUFFER SIZE FOR ON-LINE                      
*                                                                               
BLREC    DS    XL2                 RECORD LENGTH                                
BLKEY    DS    XL(BLKLN)           KEY LENGTH                                   
         ORG   BLKEY                                                            
*                                                                               
BLKRCLS  DS    XL1                 TSAR RECORD CLASS (FOR SORT)                 
BLKSCLS  DS    XL2                 TSAR RECORD SUB-CLASS (FOR SORT)             
BLKSEQ   DS    XL2                 TO PRESERVE INPUT SEQUENCE                   
BLKRCD   DS    XL1                 RECORD CODE                                  
         DS    XL4                 SPARE                                        
*                                                                               
BLDATA   DS    0X                                                               
*                                                                               
*                                                                               
***************************************************************                 
*     SENDING COMPANY 'HEADER USER' RECORD                                      
***************************************************************                 
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLUHR    DS    XL2                 USER HEADER RECORD LEN                       
BLUHK    DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLUNAME  DS    CL33                USER NAME                                    
BLUADDR  DS    CL33                ADDRESS                                      
BLUHRLN  EQU   *-BLUHR                                                          
*                                                                               
*                                                                               
***************************************                                         
* DSECT FOR 'HEADER PERIOD' RECORD                                              
***************************************                                         
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLHPER   DS    CL2                 HEADER PERIOD RECORD LEN                     
BLHPK    DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLHSPER  DS    XL2                 PERIOD START                                 
BLHEPER  DS    XL2                 PERIOD END                                   
BLHPELN  EQU   *-BLHPER                                                         
*                                                                               
*                                                                               
***************************************                                         
* DSECT FOR 'HEADER SEND' RECORD                                                
***************************************                                         
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLHSNR   DS    CL2                 HEADER SEND RECORD LEN                       
BLHSNK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLSID    DS    CL4                 REPORT ID                                    
BLSDTE   DS    CL2                 SEND DATE (TODAY'S DATE)                     
BLSTME   DS    CL8                 SEND TIME HH:MM:SS                           
BLSINT   DS    CL3                 REPORT INITIALS                              
BLSREV   DS    CL3                 REPORT REVISION                              
BLHSNLN  EQU   *-BLHSNR                                                         
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'ADVERTISER' RECORD                                                 
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLADR    DS    CL2                 ADVERTISER RECORD LEN                        
BLADRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLADCDE  DS    CL3                 CODE                                         
BLADNME  DS    CL20                NAME                                         
BLADRLN  EQU   *-BLADR                                                          
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'PRODUCT' DEFINITION RECORD                                         
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLPR     DS    CL2                 HEADER PRODUCT RECORD LEN                    
BLPRK    DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLPRCDE DS     CL3                 CODE                                         
BLPRNME DS     CL20                NAME                                         
BLPRLN   EQU   *-BLPR                                                           
*                                                                               
*                                                                               
**************************************************                              
* DSECT FOR 'VARIOUS' PRODUCT DEFINITION RECORD                                 
**************************************************                              
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLVR     DS    CL2                 HEADER PRODUCT RECORD LEN                    
BLVRK    DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLVARNM DS     CL7                 "VARIOUS"                                    
BLVRLN   EQU   *-BLVR                                                           
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'PGROUP' DEFINITION RECORD                                          
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLGR     DS    CL2                 HEADER PRODUCT RECORD LEN                    
BLGRK    DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLGRCDE DS     CL4                 GROUP CODE                                   
BLGRNME DS     CL24                GROUP NAME                                   
BLGRLN   EQU   *-BLGR                                                           
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'CUT-IN' RECORD (MKT/STA)                                           
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLHCI    DS    CL2                 HEADER CUTIN RECORD LEN                      
BLHCIK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLHMKT   DS    CL4                 MKT                                          
BLHSTA   DS    CL4                 STATION                                      
BLHCILN  EQU   *-BLHCI                                                          
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'HEADER NETWORK' RECORD                                             
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLHNR    DS    CL2                 HEADER NETWORK RECORD LEN                    
BLHNRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLHNCDE  DS    CL4                 CODE                                         
BLHNNAME DS    CL24                NAME                                         
BLHNADDR DS    CL30                ADDRESS                                      
BLHNRLN  EQU   *-BLHNR                                                          
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'HEADER OUTLET' RECORD                                              
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLHOR    DS    CL2                 HEADER NETWORK RECORD LEN                    
BLHORK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLHOCDE  DS    CL4                 CODE (NETWORK)                               
BLHOMED  DS    CL1                 MEDIA (N,C,S,H,O)                            
BLHORLN  EQU   *-BLHOR                                                          
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR HEADER 'AGENCY OF RECORD' RECORD                                    
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLAOR    DS    CL2                'AGENCY OF RECORD' RECORD LEN                 
BLAORK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLAONME  DS    CL33                NAME                                         
BLAORLN  EQU   *-BLAOR                                                          
*                                                                               
*                                                                               
******************************************************                          
* DSECT FOR 'HEADER CONTACT' RECORD (ISSUED BY)                                 
******************************************************                          
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLHCR    DS    CL2                 HEADER CONTACT RECOR LEN                     
BLHCRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLHCNME  DS    CL30                NAME                                         
BLHCTEL  DS    CL24                TELEPHONE                                    
BLHCFAX  DS    CL24                FAX                                          
BLHCEML  DS    CL40                EMAIL                                        
BLHCRLN  EQU   *-BLHCR                                                          
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'HEADER COMMENT' RECORD                                             
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLCOR    DS    CL2                 HEADER COMMENT RECORD LEN                    
BLCORK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLCOLNUM DS    XL2                 LINE NUMBER                                  
BLCOTXT  DS    CL60                TEXT DATA                                    
BLCORLN  EQU   *-BLCOR                                                          
*                                                                               
*                                                                               
*****************************************************************               
* DSECT FOR 'REVISION COMMENT' RECORD (COMMENT ENTERED ON SCREEN)               
*****************************************************************               
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLRCR    DS    CL2                 REVISION COMMENT RECORD LEN                  
BLRCRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLRCLNUM DS    XL2                 LINE NUMBER                                  
BLRCTXT  DS    CL60                TEXT DATA                                    
BLRCRLN  EQU   *-BLRCR                                                          
*                                                                               
*                                                                               
******************************************************                          
* DSECT FOR 'PRODUCT LEVEL COMMENT' (X'0A23)                                    
******************************************************                          
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLDCR    DS    CL2                 PRODUCT COMMENT RECORD LEN                   
BLDCRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLDCLNUM DS    XL2                 LINE NUMBER                                  
BLDCTXT  DS    CL60                TEXT DATA                                    
BLDCRLN  EQU   *-BLDCR                                                          
*                                                                               
*                                                                               
********************************************************                        
* DSECT FOR 'FOOTER COMMENT' RECORD (STEXT)                                     
********************************************************                        
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLFCR    DS    CL2                 FOOTER COMMENT REC LEN (STEXT)               
BLFCRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLFCLNUM DS    XL2                 LINE NUMBER                                  
BLFCTXT  DS    CL60                TEXT DATA                                    
BLFCRLN  EQU   *-BLFCR                                                          
*                                                                               
*                                                                               
********************************************************                        
* DSECT FOR 'DISTRIBUTION LIST' RECORD                                          
********************************************************                        
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLDLR    DS    CL2                 DISTRIBUTION LIST REC LEN                    
BLDLRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLDLLNUM DS    XL2                 LINE NUMBER                                  
BLDLNAME DS    CL30                NAME DATA                                    
BLDLRLN  EQU   *-BLDLR                                                          
*                                                                               
*                                                                               
*************************************************************                   
* DSECT FOR 'TBA' INSTRUCTION LINE  RECORD                                      
*************************************************************                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLTBR    DS    CL2                 TBA INSTRUCTION LINE RECORD LEN              
BLTBRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLTBPSTR DS    XL2                 PERIOD START                                 
BLTBPEND DS    XL2                 PERIOD END                                   
BLTBPDF  DS    CL6                 PROG OR DAYPT OR FEED (BLTBFLAG)             
BLTBPRD1 DS    CL3                 PROD 1                                       
BLTBSLN1 DS    XL1                 LEN 1                                        
BLTBPRD2 DS    CL3                 PROD 2                                       
BLTBSLN2 DS    XL1                 LEN 2                                        
BLTBFLAG DS    XL1                 FLAG                                         
BLTBFEED EQU   X'01'               FEED ENTRY                                   
BLTBDAYP EQU   X'02'               DAYPART ENTRY                                
BLTBPRG  EQU   X'04'               PROGRAM ENTRY                                
BLTBTAGY EQU   X'08'               UNITS WITH TAGS                              
BLTBRLN  EQU   *-BLTBR                                                          
*                                                                               
         ORG   BLTBPSTR       **** FOLLOWING IS FOR NINS GEN  ****              
BLTBNMKT DS    CL4                 CUTIN MARKET (OPTIONAL)                      
BLTBNSTA DS    CL4                 CUTIN STATION (OPTIONAL)                     
BLTBNADT DS    XL2                 AIR DATE                                     
BLTBNROT DS    XL1                 ROTATION                                     
BLTBNPR1 DS    CL3                 PROD 1                                       
BLTBNSL1 DS    XL1                 LEN 1                                        
BLTBNPR2 DS    CL3                 PROD 2                                       
BLTBNSL2 DS    XL1                 LEN 2                                        
BLTBNFLG DS    XL1                 FLAG                                         
BLTBNTAG EQU   X'80'               TAG                                          
BLTBNCIN EQU   X'40'               CUTIN                                        
BLTBNDEL EQU   X'20'               DELETED UNIT                                 
BLTBNCHG EQU   X'10'               UNIT CHANGED THIS REVISION                   
BLTBNNEW EQU   X'08'               NEW UNIT                                     
BLTBNBON EQU   X'04'               BONUS                                        
BLTBNADU EQU   X'02'               ADU                                          
BLTBNMG  EQU   X'01'               MAKEGOOD                                     
BLTBNFL2 DS    XL1                 FLAG                                         
BLTBNNAT EQU   X'80'               UNIT IS NATIONAL                             
BLTBNSCT EQU   X'40'               SCATTER                                      
BLTBNUPF EQU   X'20'               UPFORNT                                      
BLTBNOPR EQU   X'10'               OPPORTUNISTIC                                
BLTBNBB  EQU   X'08'               BILLBOARD                                    
BLTBNRLN EQU   *-BLTBR                                                          
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'INSTRUCTION LINE' RECORD                                           
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLILR    DS    CL2                 INSTRUCTION LINE RECORD LEN                  
BLILRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLILSTME DS    XL2                 START TIME                                   
BLILPSTR DS    XL2                 PERIOD START                                 
BLILETME DS    XL2                 END TIME                                     
BLILPEND DS    XL2                 PERIOD END                                   
BLILPDF  DS    CL6                 PROG OR DAYPT OR FEED (BLILFLAG)             
BLILPRD1 DS    CL3                 PROD 1                                       
BLILPRD2 DS    CL3                 PROD 2                                       
BLILSLN1 DS    XL1                 LEN 1                                        
BLILSLN2 DS    XL1                 LEN 2                                        
BLILFLAG DS    XL1                 FLAG                                         
BLILFEED EQU   X'01'               FEED ENTRY                                   
BLILDAYP EQU   X'02'               DAYPART ENTRY                                
BLILPRG  EQU   X'04'               PROGRAM ENTRY                                
*BLILTAGY EQU   X'08'              UNITS WITH TAGS                              
BLILRLN  EQU   *-BLILR                                                          
*                                                                               
         ORG   BLILSTME       **** FOR NINS GEN  ****                           
*BLILNMKT DS    CL4   <<<           CUTIN MARKET (OPTIONAL)                     
*BLILNSTA DS    CL4   <<<           CUTIN STATION (OPTIONAL)                    
BLILNADT DS    XL2                 AIR DATE                                     
BLILNFEE DS    XL4                 FEED                                         
BLILNROT DS    XL1                 ROTATION                                     
BLILNPR1 DS    CL3                 PROD 1                                       
BLILNSL1 DS    XL1                 LEN 1                                        
BLILNPR2 DS    CL3                 PROD 2                                       
BLILNSL2 DS    XL1                 LEN 2                                        
BLILCML1 DS    CL12                COMMERCIAL 1                                 
BLILCML2 DS    CL12                COMMERCIAL 2                                 
BLILNPOS DS    CL4                 UNIT POSN                                    
BLILNREV DS    XL1                 UNIT REVISION #                              
BLILNCST DS    XL4                 UNIT COST                                    
BLILNFLG DS    XL1                 FLAG                                         
BLILNTAG EQU   X'80'               TAG                                          
BLILNCIN EQU   X'40'               CUTIN                                        
BLILNDEL EQU   X'20'               DELETED UNIT                                 
BLILNCHG EQU   X'10'               UNIT CHANGED THIS REVISION                   
BLILNNEW EQU   X'08'               NEW UNIT                                     
BLILNBON EQU   X'04'               BONUS                                        
BLILNADU EQU   X'02'               ADU                                          
BLILNMG  EQU   X'01'               MAKEGOOD                                     
BLILNFL2 DS    XL1                 FLAG 2                                       
BLILNNAT EQU   X'80'               UNIT IS NATIONAL                             
BLILNSCT EQU   X'40'               SCATTER                                      
BLILNUPF EQU   X'20'               UPFORNT                                      
BLILNOPR EQU   X'10'               OPPORTUNISTIC                                
BLILNBB  EQU   X'08'               BILLBOARD                                    
BLILBBSL DS    CL3                 BB LEN                                       
BLILBBC1 DS    CL12                BB COMMERCIAL 1                              
BLILBBC2 DS    CL12                BB COMMERCIAL 2                              
BLILNRLN EQU   *-BLILR                                                          
*                                                                               
*                                                                               
**************************************************                              
* DSECT FOR 'BILLBOARD' INSTRUCTION LINE RECORD                                 
**************************************************                              
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLBBR    DS    CL2                 BB INSTRUCTION LINE RECORD LEN               
BLBBRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLBB     DS    C                   IS BB 'Y'                                    
BLBBPOS  DS    XL4                 BB POSITION                                  
BLBBSLN  DS    CL3                 BB LEN                                       
BLBBCML1 DS    CL12                BB COMMERCIAL 1                              
BLBBCML2 DS    CL12                BB COMMERCIAL 2                              
BLBBRLN  EQU   *-BLBBR                                                          
*                                                                               
*                                                                               
***************************************************                             
* DSECT FOR 'ESTIMATE/PACKAGE' INSTR LINE RECORD                                
***************************************************                             
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLEPR    DS    CL2                 E/P INSTRUCTION LINE RECORD LEN              
BLEPRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLEST    DS    CL3                 ESTIMATE                                     
BLPACK   DS    CL3                 PACKAGE                                      
BLEPRLN  EQU   *-BLEPR                                                          
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION LINE 'DIFFERENT PROGRAM INFORMATION' RECORD             
********************************************************************            
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLILDR   DS    CL2                 INSTRUCTION LINE RECORD LEN                  
BLILDRK  DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLILDPGM DS    CL16                DIFFERENT PROGRAM NAME                       
BLILDDAY DS    XL1                 DAY                                          
BLILDTME DS    CL4                 TIME                                         
BLILDRLN EQU   *-BLILDR                                                         
*                                                                               
*                                                                               
*                                                                               
***************************************************************                 
* DSECT FOR 'COMMERCIAL ROTATION' RECORD                                        
***************************************************************                 
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLCRR    DS    CL2                 COMMERCIAL ROTATION REC LEN                  
BLCRRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLCRPOS  DS    XL1                 ROTATION POSITION                            
BLCRCML  DS    CL12                COMMERCIAL                                   
BLCRRLN  EQU   *-BLCRR                                                          
*                                                                               
*                                                                               
***************************************************************                 
* DSECT FOR 'PIGGYBACK ROTATION' RECORD                                         
***************************************************************                 
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLBRR    DS    CL2                 PIGGYBACK ROTATION REC LEN                   
BLBRRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLBRPOS  DS    XL1                 ROTATION POSITION                            
BLBRCML1 DS    CL12                COMMERCIAL 1                                 
BLBRCML2 DS    CL12                COMMERCIAL 2                                 
BLBRRLN  EQU   *-BLBRR                                                          
*                                                                               
*                                                                               
***************************************************************                 
* DSECT FOR 'ROTATION LIST' RECORD                                              
***************************************************************                 
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLRTR    DS    CL2                 PIGGYBACK ROTATION REC LEN                   
BLROTK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLROT    DS    CL100               ROTATION LIST                                
BLROTLN  EQU   *-BLRTR                                                          
*                                                                               
*                                                                               
***************************************************************                 
* DSECT FOR 'COMMERCIAL PERCENTAGE' ROTATION ALLOCATION RECORD                  
***************************************************************                 
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLCPR    DS    CL2                 COMMERCIAL PERCENTAGE REC LEN                
BLCPRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLCPPCT  DS    XL1                 PERCENTAGE ALLOCATION                        
BLCPCML  DS    CL12                COMMERCIAL                                   
BLCPRLN  EQU   *-BLCPR                                                          
*                                                                               
*                                                                               
***************************************************************                 
* DSECT FOR 'COMMERCIAL EQUAL' ALLOCATION RECORD                                
***************************************************************                 
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLCER    DS    CL2                 COMMERCIAL EQUAL ALLOCATION REC LEN          
BLCERK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLCECML  DS    CL12                COMMERCIAL                                   
BLCERLN  EQU   *-BLCER                                                          
*                                                                               
*                                                                               
***************************************************************                 
* DSECT FOR 'PIGGYBACK PERCENTAGE' ROTATION ALLOCATION RECORD                   
***************************************************************                 
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLBPR    DS    CL2                 P/B PERCENTAGE ALLOCATION REC LEN            
BLBPRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLBPPCT  DS    XL1                 PERCENTAGE ALLOCATION                        
BLBPCML1 DS    CL12                COMMERCIAL 1                                 
BLBPCML2 DS    CL12                COMMERCIAL 2                                 
BLBPRLN  EQU   *-BLBPR                                                          
*                                                                               
*                                                                               
***************************************************************                 
* DSECT FOR 'PIGGYBACK EQUAL' ALLOCATION RECORD                                 
***************************************************************                 
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLBER    DS    CL2                 P/B EQUAL ALLOCATION REC LEN                 
BLBERK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLBECML1 DS    CL12                COMMERCIAL 1                                 
BLBECML2 DS    CL12                COMMERCIAL 2                                 
BLBERLN  EQU   *-BLBER                                                          
*                                                                               
*                                                                               
***************************************************************                 
* DSECT FOR 'TAG' EXISTS RECORD                                                 
***************************************************************                 
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLTGR    DS    CL2                 TAG RECORD LEN                               
BLTGRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLTGTAG  DS    CL3                 "TAG"                                        
BLTGRLN  EQU   *-BLTGR                                                          
*                                                                               
*                                                                               
**********************************************************                      
* DSECT FOR INSTRUCTION 'PATTERN COMMENT'  RECORD                               
**********************************************************                      
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLPCR    DS    CL2                 PATTERN COMMENT REC LEN                      
BLPCRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLPCNUM  DS    XL1                 LINE NUMBER                                  
BLPCMNT  DS    CL60                PATTERN COMMENT                              
BLPCRLN  EQU   *-BLPCR                                                          
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'SCHEDULE SUMMARY' RECORD                                           
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLSSR    DS    CL2                 SCHEDULE SUMMARY RECORD LEN                  
BLSSRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLSSPRC  DS    CL6                 PROGRAM CODE                                 
BLSSPRN  DS    CL16                PROGRAM NAME                                 
BLSSPRD  DS    CL3                 PRODUCT CODE                                 
BLSSADTE DS    XL2                 AIR DATE                                     
BLSSROT  DS    XL1                 ROTATION                                     
BLSSCOST DS    XL4                 COST                                         
BLSSUCNT DS    XL2                 UNIT COUNT                                   
BLSSRLN  EQU   *-BLSSR                                                          
*                                                                               
*                                                                               
************************************************************                    
* DSECT FOR INSTRUCTION 'PROGRAM' DEFINITION  RECORD                            
************************************************************                    
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLPGR    DS    CL2                 INSTRUCTION PROGRAM RECORD LEN               
BLPGRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLPGCDE  DS    CL6                 CODE                                         
BLPGNME  DS    CL16                NAME                                         
BLPGRLN  EQU   *-BLPGR                                                          
*                                                                               
*                                                                               
************************************************************                    
* DSECT FOR 'PROGRAM INFORMATION' RECORD DETAIL                                 
************************************************************                    
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLPIR    DS    CL2                 PROGRAM  INFO RECORD LEN                     
BLPIRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLPICOD  DS    XL6                 PROGRAM CODE                                 
BLPINME  DS    XL16                        NAME                                 
BLPIDAY  DS    XL1                         DAY                                  
BLPITME  DS    XL4                         TIME                                 
BLPIDPT  DS    CL2                         DAYPART                              
BLPIRLN  EQU   *-BLPIR                                                          
*                                                                               
*                                                                               
*********************************************************                       
* DSECT FOR INSTRUCTION 'FEED' DEFINITION  RECORD                               
*********************************************************                       
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLFDR    DS    CL2                 INSTUCTION FEED RECORD LEN                   
BLFDRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLFDCDE  DS    CL4                 CODE                                         
BLFDNME  DS    CL60                NAME                                         
BLFDRLN  EQU   *-BLFDR                                                          
*                                                                               
*                                                                               
************************************************************                    
* DSECT FOR INSTRUCTION 'DAYPART' DEFINITION  RECORD                            
************************************************************                    
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLDPR    DS    CL2                 INSTRUCTION DAYPART RECORD LEN               
BLDPRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLDPCDE  DS    CL2                 CODE                                         
BLDPNME  DS    CL14                NAME                                         
BLDPRLN  EQU   *-BLDPR                                                          
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'COMMERCIAL' DEFINITION RECORD                                      
*********************************************                                   
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLCMR    DS    CL2                 COMMERCIAL RECORD LEN                        
BLCMRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLCML    DS    CL12                COMMERCIAL                                   
BLCMDSC  DS    CL24                DESCRIPTION 1                                
BLCMDSC2 DS    CL24                DESCRIPTION 2                                
BLCMDSC3 DS    CL24                DESCRIPTION 3                                
BLCMLEN  DS    XL1                 LEN                                          
BLCMHCDE DS    CL12                HIDEF CODE                                   
BLCMCCDE DS    CL12                CNTRCUT CODE                                 
BLCMACDE DS    CL20                ALTERNATE CODE                               
BLCMTYPE DS    CL4                 TYPE                                         
BLCMDTME DS    XL2                 DESTROY TIME                                 
BLCMDDTE DS    XL2                 DESTROY DATE YYYY-MM-DD                      
BLCMSEG1 DS    XL1                 LENGTH SEGMENT 1 (LEN OVERRIDE)              
BLCMSEG2 DS    XL1                 LENGTH SEGMENT 2                             
BLCMTXT  DS    CL1                 Y=COMTEXT                                    
BLCMRLN  EQU   *-BLCMR                                                          
*                                                                               
*                                                                               
*******************************************************                         
* DSECT FOR 'COMMERCIAL TEXT' RECORD (COMTEXT)                                  
*******************************************************                         
*                                                                               
         ORG   BLDEBID                                                          
*                                                                               
BLCTR    DS    CL2                 COMMERCIAL TEXT RECORD LEN                   
BLCTRK   DS    XL(BLKLN)           RECORD KEY                                   
*                                                                               
BLCTCML  DS    CL12                COMMERCIAL                                   
BLCTLNUM DS    XL2                 LINE NUMBER                                  
BLCTTXT  DS    CL60                TEXT DATA                                    
BLCTRLN  EQU   *-BLCTR                                                          
                                                                                
*                                                                               
*        EQUATES FOR BLDEBI CALL MODES (FOR TSAR RECORDS)                       
*                                                                               
EBAHCI   EQU   08                  ADD HEADER CUTIN (MKT/STA)                   
EBAHNE   EQU   10                  ADD HEADER NETWORK                           
EBAHCM   EQU   11                  ADD HEADER COMMENT                           
EBAFCM   EQU   12                  ADD FOOTER COMMENT (STEXT)                   
EBAHDT   EQU   14                  ADD HEADER SEND DATE                         
EBARCM   EQU   15                  ADD REVISION COMMENT                         
EBAHCO   EQU   16                  ADD HEADER CONTACT                           
EBADCM   EQU   17                  ADD PRODUCT LEVEL COMMENT                    
EBADLS   EQU   18                  ADD DISTRIBUTION LIST                        
EBAHGR   EQU   19                  ADD HEADER PGROUP                            
EBAHVR   EQU   20                  ADD HEADER PRODUCT VARIOUS                   
EBAADV   EQU   21                  ADD AVERTISER (CLT)                          
EBAHOU   EQU   22                  ADD HEADER OUTLET                            
EBAUNM   EQU   23                  ADD USER NAME ADDRESS                        
EBAHPD   EQU   24                  ADD PRODUCT DEFINITION (BY PROD REQ)         
EBAPRD   EQU   24                  ADD PRODUCT DEFINITION                       
EBAFEE   EQU   25                  ADD FEED DEFINITION                          
EBADAY   EQU   26                  ADD DAYPART DEFINITION                       
EBAHPER  EQU   27                  ADD HEADER PERIOD                            
EBACML   EQU   28                  ADD COMMERCIAL DEFINITION                    
EBACTX   EQU   29                  ADD COMMERCIAL TEXT (COMTEXT)                
EBAPGM   EQU   30                  ADD PROGRAM DEFINITION                       
EBAPGI   EQU   31                  ADD PROGRAM DEFINITION                       
EBAILI   EQU   32                  ADD INSTRUCTION LINE INFO                    
EBAIBB   EQU   33                  ADD BILLBOARD INFO                           
EBAIEP   EQU   34                  ADD ESTIMATE/PACKAGE                         
EBAILD   EQU   35                  ADD INSTRUCTION LINE DIFF PGM INFO           
EBAILC   EQU   36                  ADD INSTRUCTION LINE COMMENT                 
EBAICR   EQU   37                  ADD INSTRUCTION COMML ROTATION               
EBAIRT   EQU   38                  ADD INSTRUCTION LINE ROTATION LIST           
EBAICP   EQU   39                  ADD INSTRUCTION COMML PERCENTAGE             
EBAICE   EQU   40                  ADD INSTRUCTION COMML EQUAL ALLOC            
EBAIBR   EQU   41                  ADD INSTRUCTION P B ROTATION                 
EBAIBP   EQU   42                  ADD INSTRUCTION P B PERCENTAGE               
EBAIBE   EQU   43                  ADD INSTRUCTION P B EQUAL ALLOC              
EBAITG   EQU   44                  ADD TAG EXISTS RECORD                        
EBAISS   EQU   46                  ADD INSTRUCTION SCHEDULE SUMMARY             
EBATBA   EQU   48                  ADD TBA INSTRUCTION LINE INFO                
EBATSS   EQU   50                  ADD TBA INSTR SCHEDULE SUMMARY               
                                                                                
                                                                                
* DSECTS FOR FLAT FILE ENTRIES                                                  
*                                                                               
********************************************************************            
*       SENDING COMPANY 'HEADER USER' NAME AND ADDRESS RECORD                   
********************************************************************            
*                                                                               
HUD      DSECT                                                                  
HUR      DS    CL2                 RECORD TYPE - 'HU'                           
         DS    XL1                                                              
HUNAME   DS    CL33                USER NAME                                    
         DS    XL1                                                              
HUADDR   DS    CL33                ADDRESS                                      
HURLN    EQU   *-HUR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR 'HEADER PERIOD' RECORD                                              
********************************************************************            
*                                                                               
HPD      DSECT                                                                  
HPER     DS    CL2                 RECORD TYPE - 'HP'                           
         DS    XL1                                                              
HSPER    DS    CL10                PERIOD START YYYY-MM-DD                      
         DS    XL1                                                              
HEPER    DS    CL10                PERIOD END YYYY-MM-DD                        
         DS    XL1                                                              
HPELN    EQU   *-HPER                                                           
*                                                                               
*                                                                               
***************************************                                         
* DSECT FOR 'HEADER SEND' RECORD                                                
***************************************                                         
*                                                                               
HSD      DSECT                                                                  
HSNR     DS    CL2                 RECORD TYPE - 'HS'                           
         DS    XL1                                                              
HSID     DS    CL4                 REPORT ID (NEPG OR NENI)                     
         DS    XL1                                                              
HSDTE    DS    CL10                SEND DATE YYYY-MM-DD                         
         DS    CL1                                                              
HSTME    DS    CL8                 SEND TIME HH:MM:SS                           
         DS    XL1                                                              
HSINT    DS    CL3                 PWX                                          
         DS    XL1                                                              
HSREV    DS    CL3                 REVISION NUMBER                              
HSNLN    EQU   *-HSNR                                                           
*                                                                               
*NOP     ORG   HSIID           *** NINS GEN                                     
NSIID    DS    CL26                INSTR ID (N/AGY/CLT/NET/PRG/PER/PRD)         
         DS    XL1                                                              
NSVER    DS    CL3                 VERSION                                      
         DS    XL1                                                              
NSDTE    DS    CL10                SEND DATE YYYY-MM-DD                         
NST      DS    CL1                 C'T'                                         
NSTME    DS    CL8                 SEND TIME HH:MM:SS                           
NSNLN    EQU   *-HSNR                                                           
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'HEADER VERSION' RECORD                                             
*********************************************                                   
*                                                                               
*HVD      DSECT                                                                 
*HVR      DS    CL2                 RECORD TYPE - 'HV'                          
*         DS    XL1                                                             
*HVREV    DS    CL3                 INSTRUCTION REVISION                        
*HVRLN    EQU   *-HVR                                                           
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR HEADER 'CUT-IN'(MKT/STA) RECORD                                     
*********************************************                                   
*                                                                               
CID      DSECT                                                                  
CIR      DS    CL2                 RECORD TYPE - 'CI'                           
         DS    XL1                                                              
CIID     DS    CL6                 CUTIN MKT/STA ID (CMS001)                    
CIMKT    DS    CL4                 MARKET                                       
CISTA    DS    CL4                 STATION                                      
CIRLN    EQU   *-CID                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'HEADER NETWORK' RECORD                                             
*********************************************                                   
*                                                                               
HND      DSECT                                                                  
HNR      DS    CL2                 RECORD TYPE - 'HN'                           
         DS    XL1                                                              
HNCDE    DS    CL4                 NETWORK CODE                                 
         DS    XL1                                                              
HNNAME   DS    CL24                NETWORK NAME                                 
         DS    XL1                                                              
HNADDR   DS    CL30                NETWORK ADDRESS                              
HNRLN    EQU   *-HNR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'ADVERTISER' RECORD                                                 
*********************************************                                   
*                                                                               
ADVD     DSECT                                                                  
ADR      DS    CL2                 RECORD TYPE - 'AD'                           
         DS    XL1                                                              
ADCDE    DS    CL3                 CODE (CLIENT)                                
         DS    XL1                                                              
ADNME    DS    CL20                NAME                                         
ADRLN    EQU   *-ADR                                                            
*                                                                               
*                                                                               
*****************************************************                           
* DSECT FOR 'HEADER OUTLET' RECORD                                              
*  (THIS RECORD IS A BIT REDUNDANT - TO MATCH SCHEMA)                           
******************************************************                          
*                                                                               
HOD      DSECT                                                                  
HOR      DS    CL2                 RECORD TYPE - 'HO'                           
         DS    XL1                                                              
HOMEDIA  DS    CL17                MEDIA                                        
         DS    XL1                                                              
HOCDE    DS    CL4                 CODE (NETWORK)                               
         DS    XL1                                                              
         DS    CL4                 CODE (NETWORK)                               
         DS    XL1                                                              
         DS    CL17                MEDIA                                        
HORLN    EQU   *-HNR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR HEADER 'AGENCY OF RECORD' RECORD                                    
*********************************************                                   
*                                                                               
*AORD     DSECT                                                                 
*AOR      DS    CL2                 RECORD TYPE - 'AO'                          
          DS    XL1                                                             
*AONME    DS    CL33                NAME                                        
*AORLN    EQU   *-AOR                                                           
*                                                                               
*                                                                               
******************************************************                          
* DSECT FOR 'HEADER CONTACT' RECORD (WAS ISSUED BY)                             
******************************************************                          
*                                                                               
HCD      DSECT                                                                  
HCR      DS    CL2                 RECORD TYPE - 'HC'                           
         DS    XL1                                                              
HCNME    DS    CL30                NAME                                         
         DS    XL1                                                              
HCTEL    DS    CL24                TELEPHONE                                    
         DS    XL1                                                              
HCFAX    DS    CL24                FAX                                          
         DS    XL1                                                              
HCEML    DS    CL40                EMAIL                                        
HCRLN    EQU   *-HCR                                                            
*                                                                               
*                                                                               
*******************************************************                         
* DSECT FOR 'PRODUCT' DEFINITION RECORD  (PD=HEADER)                            
*******************************************************                         
*                                                                               
HPRD     DSECT                                                                  
HPR      DS    CL2                 RECORD TYPE - 'PR' OR 'PD'                   
         DS    XL1                                                              
HPRCDE   DS    CL3                 CODE                                         
         DS    XL1                                                              
HPRNME   DS    CL20                NAME                                         
HPRLN    EQU   *-HPR                                                            
*                                                                               
*                                                                               
*******************************************************                         
* DSECT FOR HEADER PRODUCT 'VARIOUS' RECORD                                     
*******************************************************                         
*                                                                               
HVRD     DSECT                                                                  
HVR      DS    CL2                 RECORD TYPE - 'VR'                           
         DS    XL1                                                              
HVRNME   DS    CL7                 "VARIOUS"                                    
HVRLN    EQU   *-HVR                                                            
*                                                                               
*                                                                               
*******************************************************                         
* DSECT FOR HEADER 'PGROUP' RECORD                                              
*******************************************************                         
*                                                                               
HGRD     DSECT                                                                  
HGR      DS    CL2                 RECORD TYPE - 'GR'                           
         DS    XL1                                                              
HGRCDE   DS    CL4                 PGROUP CODE                                  
         DS    XL1                                                              
HGRNME   DS    CL24                PGROUP NAME                                  
HGRLN    EQU   *-HGR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'FEED' DEFINITION RECORD                                            
*********************************************                                   
*                                                                               
FDD      DSECT                                                                  
FDR      DS    CL2                 RECORD TYPE - 'FD'                           
         DS    XL1                                                              
FDID     DS    CL6                 ID (FEE001)                                  
         DS    XL1                                                              
FDNME    DS    CL60                NAME                                         
         DS    XL1                                                              
FDCDE    DS    CL4                 CODE                                         
FDRLN    EQU   *-FDR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR UNIT IS 'NATIONAL' RECORD                                           
*********************************************                                   
*                                                                               
NTD      DSECT                                                                  
NTR      DS    CL2                 RECORD TYPE - 'NT'                           
         DS    XL1                                                              
NTYORN   DS    CL1                 Y/N                                          
NTRLN    EQU   *-NTR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'UNIT POSITION' RECORD                                              
*********************************************                                   
*                                                                               
UPD      DSECT                                                                  
UPR      DS    CL2                 RECORD TYPE - 'UP'                           
         DS    XL1                                                              
UPOSN    DS    CL4                 POSN                                         
UPRLN    EQU   *-UPR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR UNIT 'REVISION' RECORD                                              
*********************************************                                   
*                                                                               
RVD      DSECT                                                                  
RVR      DS    CL2                 RECORD TYPE - 'RV'                           
         DS    XL1                                                              
REVNO    DS    CL4                 REVISION NO.                                 
RVRLN    EQU   *-RVR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'UNIT' COMMERCIAL 'INFO' RECORD                                     
*********************************************                                   
*                                                                               
UID      DSECT                                                                  
UIR      DS    CL2                 RECORD TYPE - 'UI'                           
         DS    XL1                                                              
UICML    DS    CL3                 CHG OR NEW                                   
UIRLN    EQU   *-UIR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'UNIT TYPE' RECORD                                                  
*********************************************                                   
*                                                                               
UTD      DSECT                                                                  
UTR      DS    CL2                 RECORD TYPE - 'UT'                           
         DS    XL1                                                              
UTCML    DS    CL13                BONUS/ADU/OPPORT/SCATT/UPFRONT...            
UTRLN    EQU   *-UTR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'UNIT COST' RECORD                                                  
*********************************************                                   
*                                                                               
UCD      DSECT                                                                  
UCR      DS    CL2                 RECORD TYPE - 'UC'                           
         DS    XL1                                                              
UCCML    DS    CL13                UNIT COST                                    
UCRLN    EQU   *-UCR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR UNIT 'IS BILLBOARD' RECORD                                          
*********************************************                                   
*                                                                               
IBD      DSECT                                                                  
IBR      DS    CL2                 RECORD TYPE - 'IB'                           
         DS    XL1                                                              
IBYORN   DS    CL1                 Y/N                                          
IBRLN    EQU   *-IBR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR UNIT 'BILLBOARD POSITION' RECORD                                    
*********************************************                                   
*                                                                               
BSD      DSECT                                                                  
BSR      DS    CL2                 RECORD TYPE - 'BS'                           
         DS    XL1                                                              
BPOSN    DS    CL4                 BB POSN                                      
BSRLN    EQU   *-BSR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'BILLBOARD COMMERCIAL' RECORD                                       
*********************************************                                   
*                                                                               
BCD      DSECT                                                                  
BCR      DS    CL2                 RECORD TYPE - 'BC'                           
         DS    XL1                                                              
BCML1    DS    CL12                                                             
         DS    XL1                                                              
BCML2    DS    CL12                                                             
BCRLN    EQU   *-BCR                                                            
*                                                                               
*                                                                               
***************************************************                             
* DSECT FOR 'BILLBOARD' COMMERCIAL 'LEN' RCORD                                  
***************************************************                             
*                                                                               
BLD      DSECT                                                                  
BLR      DS    CL2                 RECORD TYPE - 'BL'                           
         DS    XL1                                                              
BLSLN    DS    CL3                                                              
BLRLN    EQU   *-BLR                                                            
*                                                                               
*                                                                               
***************************************************                             
* DSECT FOR UNIT 'ESTIMATE' RECORD                                              
***************************************************                             
*                                                                               
ESD      DSECT                                                                  
ESR      DS    CL2                 RECORD TYPE - 'ES'                           
         DS    XL1                                                              
EST      DS    CL3                                                              
ESRLN    EQU   *-ESR                                                            
*                                                                               
*                                                                               
***************************************************                             
* DSECT FOR UNIT 'PACKAGE' RECORD                                               
***************************************************                             
*                                                                               
PKD      DSECT                                                                  
PKR      DS    CL2                 RECORD TYPE - 'PK'                           
         DS    XL1                                                              
PKGE     DS    CL3                                                              
PKRLN    EQU   *-PKR                                                            
*                                                                               
*                                                                               
***********************************************************                     
* DSECT FOR 'DAYPART' DEFINITION RECORD                                         
***********************************************************                     
*                                                                               
DPD      DSECT                                                                  
DPR      DS    CL2                 RECORD TYPE - 'DP'                           
         DS    XL1                                                              
DPID     DS    CL6                 ID (DPT001)                                  
         DS    XL1                                                              
DPNME    DS    CL14                NAME                                         
         DS    XL1                                                              
DPCDE    DS    CL2                 CODE                                         
DPRLN    EQU   *-DPR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'COMMERCIAL' DEFINITION RECORD                                      
*********************************************                                   
*                                                                               
*CMD      DSECT                                                                 
*CMR      DS    CL2                 RECORD TYPE - 'CM' << REPLACED CP           
*         DS    XL1                                                             
*CMID     DS    CL6                 ID (COM001)                                 
*CMRLN    EQU   *-CMR                                                           
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'COMMERCIAL DESCRIPTION' RECORD                                     
*********************************************                                   
*                                                                               
CDD      DSECT                                                                  
CDR      DS    CL2                 RECORD TYPE - 'CD'                           
         DS    XL1                                                              
CDLNUM   DS    CL2                 LINE NUMBER                                  
         DS    XL1                                                              
CMDSC    DS    CL24                DESCRIPTION                                  
CDRLN    EQU   *-CDR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'COMMERCIAL STANDARD' CODE RECORD                                   
*********************************************                                   
*                                                                               
CSD      DSECT                                                                  
CSR      DS    CL2                 RECORD TYPE - 'CS'                           
         DS    XL1                                                              
CSCDE    DS    CL12                STANDARD CODE                                
         DS    XL1                                                              
CSTYPE   DS    CL4                 TYPE                                         
CSRLN    EQU   *-CSR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'COMMERCIAL HIDEF' CODE RECORD                                      
*********************************************                                   
*                                                                               
CHD      DSECT                                                                  
CHR      DS    CL2                 RECORD TYPE - 'CH'                           
         DS    XL1                                                              
CHCDE    DS    CL12                HIDEF CODE                                   
         DS    XL1                                                              
CHTYPE   DS    CL4                 TYPE                                         
CHRLN    EQU   *-CHR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'COMMERCIAL CNTRCUT' CODE RECORD                                    
*********************************************                                   
*                                                                               
CCD      DSECT                                                                  
CCR      DS    CL2                 RECORD TYPE - 'CC'                           
         DS    XL1                                                              
CCCDE    DS    CL12                CNTRCUT CODE                                 
         DS    XL1                                                              
CCTYPE   DS    CL4                 TYPE                                         
CCRLN    EQU   *-CCR                                                            
*                                                                               
*                                                                               
****************************************************                            
* DSECT FOR COMMERCIAL 'TYPE' CODE RECORD                                       
****************************************************                            
*                                                                               
TPD      DSECT                                                                  
TPR      DS    CL2                 RECORD TYPE - 'TP'                           
         DS    XL1                                                              
TYPE     DS    CL4                 TYPE                                         
TPRLN    EQU   *-TPR                                                            
         DS    XL1                                                              
*                                                                               
*                                                                               
****************************************************                            
* DSECT FOR 'COMMERCIAL ALTERNATE' CODE RECORD                                  
****************************************************                            
*                                                                               
CAD      DSECT                                                                  
CAR      DS    CL2                 RECORD TYPE - 'CA'                           
         DS    XL1                                                              
CACDE    DS    CL20                ALTERNATE CODE                               
CARLN    EQU   *-CAR                                                            
         DS    XL1                                                              
*                                                                               
*                                                                               
****************************************************                            
* DSECT FOR DESTROY 'DATE AND TIME' CODE RECORD                                 
****************************************************                            
*                                                                               
DTD      DSECT                                                                  
DTR      DS    CL2                 RECORD TYPE - 'DT'                           
         DS    XL1                                                              
DTDTE    DS    CL10                DESTROY DATE YYYY-MM-DD                      
         DS    XL1                                                              
DTTME    DS    CL8                 DESTROY TIME HH:MM:SS                        
DTRLN    EQU   *-DTR                                                            
*                                                                               
*                                                                               
****************************************************                            
* DSECT FOR 'DESTROY DATE' CODE RECORD                                          
****************************************************                            
*                                                                               
DDD      DSECT                                                                  
DDR      DS    CL2                 RECORD TYPE - 'DD'                           
         DS    XL1                                                              
DDDTE    DS    CL10                DESTROY DATE YYYY-MM-DD                      
DDRLN    EQU   *-DDR                                                            
*                                                                               
*                                                                               
********************************************************                        
* DSECT FOR 'COMTEXT' FOR COMMERCIAL DEFINITION RECORD                          
********************************************************                        
*                                                                               
CTD      DSECT                                                                  
CTR      DS    CL2                 RECORD TYPE - 'CT' (COMTEXT)                 
*        DS    XL1                                                              
*TLNUM   DS    CL2                 LINE NUMBER                                  
         DS    XL1                                                              
CTTXT    DS    CL60                TEXT DATA                                    
CTRLN    EQU   *-FCR                                                            
*                                                                               
*                                                                               
************************************************************                    
* DSECT FOR 'COMMERCIAL LENGTH' FOR CML DEFINITION RECORD                       
************************************************************                    
*                                                                               
CLD      DSECT                                                                  
CLR      DS    CL2                 RECORD TYPE - 'CL'                           
         DS    XL1                                                              
CLLEN    DS    CL3                 LEN IN SECONDS (SLN)                         
CLRLN    EQU   *-CLR                                                            
*                                                                               
*                                                                               
************************************************************                    
* DSECT FOR COMMERCIAL 'LENGTH OVERRIDE' RECORD                                 
************************************************************                    
*                                                                               
LOD      DSECT                                                                  
LOR      DS    CL2                 RECORD TYPE - 'LO'                           
         DS    XL1                                                              
LOSEG1   DS    CL3                 LEN OVERRIDE SEG1                            
         DS    XL1                                                              
LOSEG2   DS    CL3                 LEN OVERRIDE SEG2                            
LOLN     EQU   *-LOD                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'PROGRAM' DEFINITION RECORD                                         
*********************************************                                   
*                                                                               
PGD      DSECT                                                                  
PGR      DS    CL2                 RECORD TYPE - 'PG'                           
         DS    XL1                                                              
PGCDE    DS    CL6                 CODE                                         
         DS    XL1                                                              
PGNME    DS    CL20                NAME                                         
PGRLN    EQU   *-PGR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'PROGRAM INFORMATION' RECORD                                        
*********************************************                                   
*                                                                               
PID      DSECT                                                                  
PIR      DS    CL2                 RECORD TYPE - 'PI'                           
         DS    XL1                                                              
PICODE   DS    CL6                 PROGRAM CODE                                 
         DS    XL1                                                              
PINAME   DS    CL16                PROGRAM NAME                                 
         DS    XL1                                                              
PIDAY    DS    CL7                 DAY (YYYYYNN)                                
         DS    XL1                                                              
PISTME   DS    CL5                 TIME START (21:00)                           
         DS    XL1                                                              
PIETME   DS    CL5                 TIME END (22:00)                             
         DS    XL1                                                              
PIDPT    DS    CL2                 DAYPART                                      
PIRLN    EQU   *-PIR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR HEADER 'COMMENT' RECORD                                             
*********************************************                                   
*                                                                               
COD      DSECT                                                                  
COR      DS    CL2                 RECORD TYPE - 'CO'                           
*        DS    XL1                                                              
*OLNUM   DS    CL2                 LINE NUMBER                                  
         DS    XL1                                                              
COTXT    DS    CL60                TEXT DATA                                    
CORLN    EQU   *-COR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'REVISION COMMENT' RECORD                                           
*********************************************                                   
*                                                                               
RCD      DSECT                                                                  
RCR      DS    CL2                 RECORD TYPE - 'RC'                           
*        DS    XL1                                                              
*CLNUM   DS    CL2                 LINE NUMBER                                  
         DS    XL1                                                              
RCTXT    DS    CL60                TEXT DATA                                    
RCRLN    EQU   *-RCR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'PRODUCT LEVEL COMMENT' RECORD                                      
*********************************************                                   
*                                                                               
DCD      DSECT                                                                  
DCR      DS    CL2                 RECORD TYPE - 'DC'                           
*        DS    XL1                                                              
*CLNUM   DS    CL2                 LINE NUMBER                                  
         DS    XL1                                                              
DCTXT    DS    CL60                TEXT DATA                                    
DCRLN    EQU   *-DCR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR STEXT 'FOOTER COMMENT' RECORD                                       
*********************************************                                   
*                                                                               
FCD      DSECT                                                                  
FCR      DS    CL2                 RECORD TYPE - 'FC' (STEXT)                   
*        DS    XL1                                                              
*CLNUM   DS    CL2                 LINE NUMBER                                  
         DS    XL1                                                              
FCTXT    DS    CL60                TEXT DATA                                    
FCRLN    EQU   *-FCR                                                            
*                                                                               
*                                                                               
**************************************************                              
* DSECT FOR COPIES TO 'DISTRIBUTION' LIST RECORD                                
**************************************************                              
*                                                                               
DLD      DSECT                                                                  
DLR      DS    CL2                 RECORD TYPE - 'DL'                           
*        DS    XL1                                                              
*LLNUM   DS    CL2                 LINE NUMBER                                  
         DS    XL1                                                              
DLNAME   DS    CL30                NAME                                         
DLRLN    EQU   *-DLR                                                            
*                                                                               
*                                                                               
*                                                                               
**************************************************                              
* DSECT RUN TIMES DAILY                                                         
**************************************************                              
*                                                                               
DYD      DSECT                                                                  
DYR      DS    CL2                 RECORD TYPE - 'DY'                           
         DS    XL1                                                              
DYSTIME  DS    CL5                 TIME START (21:00)                           
         DS    XL1                                                              
DYETIME  DS    CL5                 TIME END (22:00)                             
         DS    XL1                                                              
DYTORF   DS    CL1                 DAILY 'Y','N'  (WAS 'TRUE' 'FALSE')          
DYRLN    EQU   *-DYR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'TAG' COMMENT'                                                      
*********************************************                                   
*                                                                               
TGD      DSECT                                                                  
TGR      DS    CL2                 RECORD TYPE - 'TG'                           
         DS    XL1                                                              
TGTXT    DS    CL20                TEXT DATA                                    
TGRLN    EQU   *-TGR                                                            
*                                                                               
*                                                                               
*********************************************************                       
* DSECT FOR 'TBA' INSTRUCTION LINE INFO RECORD                                  
*        OR 'TC' CUTIN (NINS GEN)                                               
*********************************************************                       
*                                                                               
TBD      DSECT                                                                  
TBR      DS    CL2                 RECORD TYPE:'TB','TN','TC' CUTIN             
         DS    XL1                                                              
TBPSTR   DS    CL10                PERIOD START YYYY-MM-DD                      
         DS    XL1                                                              
TBPEND   DS    CL10                PERIOD END YYYY-MM-DD                        
         DS    XL1                                                              
TBFDID   DS    CL4                 FEED ID (FEE001)                             
         DS    XL1                                                              
TBPRD1   DS    CL6                 PROD1 ID (PRD001)                            
         DS    XL1                                                              
TBPRD2   DS    CL6                 PROD2 ID (PRD002)                            
         DS    XL1                                                              
TBSLN1   DS    CL8                 LEN 1 HH:MM:SS                               
         DS    XL1                                                              
TBSLN2   DS    CL8                 LEN 2 HH:MM:SS                               
TBRLN    EQU   *-TBR                                                            
*                                                                               
         ORG   TBPSTR              'TC' (NINS GEN)                              
TCNMSID  DS    CL6                 CUTIN MKT/STA ID (CMS001)                    
TCNADT   DS    CL10                AIR DATE                                     
TCNRLN   EQU   *-TBR                                                            
*                                                                               
         ORG   TBPSTR              'TN' (NINS GEN)                              
TNNADT   DS    CL10                AIR DATE                                     
TNNRLN   EQU   *-TBR                                                            
*                                                                               
*                                                                               
*********************************************************                       
* DSECT FOR 'TBA FEED' RESTRICTION P/B INSTRUCTION LINE                         
*********************************************************                       
*                                                                               
TFD      DSECT                                                                  
TFR      DS    CL2                 RECORD TYPE - 'TF'                           
         DS    XL1                                                              
TFPSTR   DS    CL10                PERIOD START YYYY-MM-DD                      
         DS    XL1                                                              
TFPEND   DS    CL10                PERIOD END YYYY-MM-DD                        
         DS    XL1                                                              
TFFDID   DS    CL4      <<<<       FEED ID (FEE001)                             
         DS    XL1                                                              
TFPRD1   DS    CL6      <<<<       PROD1 ID (PRD001)                            
         DS    XL1                                                              
TFPRD2   DS    CL6      <<<<<      PROD2 ID (PRD002)                            
         DS    XL1                                                              
TFSLN1   DS    CL8                 LEN 1 HH:MM:SS                               
         DS    XL1                                                              
TFSLN2   DS    CL8                 LEN 2 HH:MM:SS                               
TFRLN    EQU   *-TFR                                                            
*                                                                               
*                                                                               
******************************************************                          
* DSECT FOR 'INSTRUCTION LINE' OR 'CUTIN' INFO RECORD                           
******************************************************                          
*                                                                               
ILD      DSECT                                                                  
ILR      DS   0CL2                 RECORD TYPE - 'IC' (INSTR CUTIN)             
         DS    CL2                 RECORD TYPE - 'IL' OR 'IN'                   
         DS    XL1                                                              
ILSTME   DS    CL5                 START TIME HH:MM                             
         DS    XL1                                                              
ILPSTR   DS    CL10                PERIOD START YYYY-MM-DD                      
         DS    XL1                                                              
ILETME   DS    CL5                 END TIME HH:MM                               
         DS    XL1                                                              
ILPEND   DS    CL10                PERIOD END YYYY-MM-DD                        
ILRLN    EQU   *-ILR                                                            
*                                                                               
         ORG   ILSTME              (NINS GEN) 'IN'                              
INNADT   DS    CL10                AIR DATE                                     
INNRLN   EQU   *-ILR                                                            
*                                                                               
         ORG   ILSTME              (NINS GEN)  'IC'                             
ILNMSID  DS    CL6                 CUTIN MKT/STA ID (CMS001)                    
ILNADT   DS    CL10                AIR DATE                                     
ILNRLN   EQU   *-ILR                                                            
*                                                                               
*                                                                               
******************************************************                          
* DSECT FOR 'DIFFERENT PROGRAM' INFORMATION RECORD                              
******************************************************                          
*                                                                               
DGD      DSECT                                                                  
DGR      DS    CL2                 RECORD TYPE - 'DG'                           
         DS    XL1                                                              
DGPGM    DS    CL16                PROGRAM NAME                                 
         DS    XL1                                                              
DGSTME   DS    CL5                 START TIME (900)                             
         DS    XL1                                                              
DGETME   DS    CL5                 END TIME (1230)                              
         DS    XL1                                                              
DGDAY    DS    CL7                 DAYS (YYYYYNN)                               
DGRLN    EQU   *-DGR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'ALL PROGRAM' RECORD                                                
*********************************************                                   
*                                                                               
APD      DSECT                                                                  
APR      DS    CL2                 RECORD TYPE - 'AP'                           
         DS    XL1                                                              
APPRG    DS    CL1                 Y/N                                          
APRLN    EQU   *-APR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'RESTRICTION BY PROGRAM' RECORD                                     
*********************************************                                   
*                                                                               
RGD      DSECT                                                                  
RGR      DS    CL2                 RECORD TYPE - 'RG'                           
         DS    XL1                                                              
RGPRG    DS    CL6                 PROGRAM ID (PRG001)                          
RGRLN    EQU   *-RGR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'RESTRICTION BY DAYPART' RECORD                                     
*********************************************                                   
*                                                                               
RDD      DSECT                                                                  
RDR      DS    CL2                 RECORD TYPE - 'RD'                           
         DS    XL1                                                              
RDDPID   DS    CL6                 DAYPART ID (DPT001)                          
RDRLN    EQU   *-RDR                                                            
*                                                                               
*                                                                               
*********************************************                                   
* DSECT FOR 'RESTRICTION BY FEED' RECORD                                        
*********************************************                                   
*                                                                               
RFD      DSECT                                                                  
RFR      DS    CL2                 RECORD TYPE - 'RF'                           
         DS    XL1                                                              
RFFEED   DS    CL4                 FEED CODE                                    
RFFEEDN  DS    CL60                FEED NAME                                    
RFRLN    EQU   *-RFR                                                            
*                                                                               
*                                                                               
*****************************************************                           
* DSECT FOR 'SINGLE PRODUCT' INSTRUCTION  RECORD                                
*****************************************************                           
*                                                                               
P1D      DSECT                                                                  
P1R      DS    CL2                 RECORD TYPE - 'P1'                           
         DS    XL1                                                              
P1PRD1   DS    CL3                 PRD CODE                                     
         DS    XL1                                                              
P1PRNME  DS    CL20                PRD NAME                                     
P1RLN    EQU   *-P1R                                                            
*                                                                               
*                                                                               
*****************************************************                           
* DSECT FOR 'P/B PRODUCT' INSTRUCTION  RECORD                                   
*****************************************************                           
*                                                                               
P2D      DSECT                                                                  
P2R      DS    CL2                 RECORD TYPE - 'P2'                           
         DS    XL1                                                              
P2NUM    DS    CL1                 PROD START TAG 1 OR 2                        
         DS    XL1                                                              
P2PRD    DS    CL3                 PRD CODE                                     
         DS    XL1                                                              
         DS    CL1                 PROD END TAG 1 OR 2                          
P2PRNAME DS    CL20                PRD NAME                                     
P2RLN    EQU   *-P2R                                                            
*                                                                               
*                                                                               
*****************************************************                           
* DSECT FOR 'SINGLE LENGTH' INSTRUCTION  RECORD                                 
*****************************************************                           
*                                                                               
L1D      DSECT                                                                  
L1R      DS    CL2                 RECORD TYPE - 'L1'                           
         DS    XL1                                                              
L1SLN1   DS    XL3                 LEN 1                                        
L1RLN    EQU   *-L1R                                                            
*                                                                               
*                                                                               
*****************************************************                           
* DSECT FOR 'P/B LENGTH' INSTRUCTION  RECORD                                    
*****************************************************                           
*                                                                               
L2D      DSECT                                                                  
L2R      DS    CL2                 RECORD TYPE - 'L2'                           
         DS    XL1                                                              
L2NUM    DS    CL1                 LEN START TAG 1 OR 2                         
         DS    XL1                                                              
L2SLN    DS    XL3                 LEN                                          
         DS    XL1                                                              
         DS    CL1                 LEN END TAG 1 OR 2                           
L2RLN    EQU   *-L2R                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'COMMERCIAL TBA' RECORD                                 
********************************************************************            
*                                                                               
CBD      DSECT                                                                  
CBR      DS    CL2                 RECORD TYPE - 'CB'                           
         DS    XL1                                                              
CBTBA    DS    CL3                 'TBA'                                        
CBRLN    EQU   *-CBR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'COMMERCIAL' RECORD   WAS 'CP' NOW 'CM'                 
********************************************************************            
*                                                                               
CPD      DSECT                                                                  
CPR      DS    CL2                 RECORD TYPE:'CM' OR 'CN' (NINS GEN)          
         DS    XL1                                                              
CPCML    DS    CL12                COMMERCIAL CODE                              
CPRLN    EQU   *-CPR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION COMMERCIAL 'PERCENTAGE ALLOCATION' RECORD               
********************************************************************            
*                                                                               
PAD      DSECT                                                                  
PAR      DS    CL2                 RECORD TYPE - 'PA'                           
         DS    XL1                                                              
PAPCT    DS    CL3                 PERCENTAGE ALLOCATION                        
PARLN    EQU   *-PAR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION COMMERCIAL 'ROTATION' LETTER RECORD                     
********************************************************************            
*                                                                               
RRD      DSECT                                                                  
RRR      DS    CL2                 RECORD TYPE - 'RR'                           
         DS    XL1                                                              
ROTATN   DS    CL1                ROTATION LETTER                               
RRRLN    EQU   *-RRR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'COMMERCIAL EQUAL' ALLOCATION  RECORD                   
********************************************************************            
*                                                                               
CED      DSECT                                                                  
CER      DS    CL2                 RECORD TYPE - 'CE'                           
         DS    XL1                                                              
CECMLID  DS    CL6                 COMMERCIAL ID (CML001)                       
CERLN    EQU   *-CER                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'EQ'UAL COMMERCIALS FOR BOTH PRODS RECORD               
********************************************************************            
*                                                                               
EQD      DSECT                                                                  
EQR      DS    CL2                 RECORD TYPE - 'EQ'   CML1=CML2               
         DS    XL1                                                              
EQCMLID  DS    CL6                 COMMERCIAL ID (CML001)                       
EQRLN    EQU   *-EQR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION SINGLE 'COMMERCIAL 1' RECORD                            
********************************************************************            
*                                                                               
C1D      DSECT                                                                  
C1R      DS    CL2                 RECORD TYPE - 'C1'                           
         DS    XL1                                                              
C1CMLID  DS    CL6                 COMMERCIAL ID (CML001)                       
C1RLN    EQU   *-C1R                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION PIGGYBACK 'COMMERCIALS 2' RECORD                        
********************************************************************            
*                                                                               
C2D      DSECT                                                                  
C2R      DS    CL2                 RECORD TYPE - 'C2'                           
         DS    XL1                                                              
C2CMLID  DS    CL6                 COMMERCIAL ID (CML001)                       
C2RLN    EQU   *-C2R                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'P/B EQUAL' ALLOCATION  RECORD                          
********************************************************************            
*                                                                               
BED      DSECT                                                                  
BER      DS    CL2                 RECORD TYPE - 'BE'                           
         DS    XL1                                                              
BECM1ID  DS    CL6                 COMMERCIAL1 ID                               
         DS    XL1                                                              
BECM2ID  DS    CL6                 COMMERCIAL2 ID                               
BERLN    EQU   *-BER                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'P/B PERCENTAGE' ALLOCATION  RECORD                     
********************************************************************            
*                                                                               
BPD      DSECT                                                                  
BPR      DS    CL2                 RECORD TYPE - 'BP' OR 'MP'                   
         DS    XL1                                                              
BPPCT    DS    CL3                 PERCENTAGE ALLOCATION                        
         DS    XL1                                                              
BPCM1ID  DS    CL6                 COMMERCIAL1 ID                               
         DS    XL1                                                              
BPCM2ID  DS    CL6                 COMMERCIAL2 ID                               
BPRLN    EQU   *-BPR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'UNIT ROTATION' RECORD  (NINS GEN)                      
********************************************************************            
*                                                                               
URD      DSECT                                                                  
URR      DS    CL2                 RECORD TYPE - 'UR'                           
         DS    XL1                                                              
URROT    DS    CL7                 UNIT ROTATION                                
URRLN    EQU   *-URR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'COMMERCIAL ROTATION' RECORD                            
********************************************************************            
*                                                                               
CRD      DSECT                                                                  
CRR      DS    CL2                 RECORD TYPE - 'CR'                           
         DS    XL1                                                              
CRPOS    DS    CL2                 COMML ROTATION POSITION                      
CRRLN    EQU   *-CRR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'P/B ROTATION' RECORD                                   
********************************************************************            
*                                                                               
BRD      DSECT                                                                  
BRR      DS    CL2                 RECORD TYPE - 'BR'                           
         DS    XL1                                                              
BRPOS    DS    CL2                 P/B ROTATION POSITION                        
         DS    XL1                                                              
BRCM1ID  DS    CL6                 COMMERCIAL1 ID                               
         DS    XL1                                                              
BRCM2ID  DS    CL6                 COMMERCIAL2 ID                               
BRRLN    EQU   *-BRR                                                            
*                                                                               
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION 'MAIN COMMERCIAL' RECORD                                
********************************************************************            
*                                                                               
MCD      DSECT                                                                  
MCR      DS    CL2                 RECORD TYPE - 'MC'                           
         DS    XL1                                                              
MCCML    DS    CL12                COMMERCIAL                                   
         DS    XL1                                                              
MCPB     DS    CL1                 P/B=Y/N                                      
         DS    XL1                                                              
MCSEQ    DS    CL1                 CML SEQ 1 OR 2                               
MCRLN    EQU   *-MCR                                                            
*                                                                               
*                                                                               
********************************************************************            
* DSECT FOR INSTRUCTION LINE 'ROTATION' LIST  RECORD                            
********************************************************************            
*                                                                               
RTD      DSECT                                                                  
RTR      DS    CL2                 RECORD TYPE - 'RT'                           
         DS    XL1                                                              
ROT      DS    CL100               ROTATION LIST                                
RTRLN    EQU   *-RTR                                                            
*                                                                               
*                                                                               
************************************************************                    
* DSECT FOR INSTRUCTION 'PATTERN COMMENT' RECORD                                
************************************************************                    
*                                                                               
PCD      DSECT                                                                  
PCR      DS    CL2                 RECORD TYPE - 'PC'                           
*        DS    XL1                                                              
*CNUM    DS    CL2                 LINE NUMBER                                  
         DS    XL1                                                              
PCMNT    DS    CL60                PATTERN COMMENT                              
PCRLN    EQU   *-PCR                                                            
*                                                                               
*                                                                               
******************************************************************              
* DSECT FOR 'SCHEDULE SUMMARY' OR 'SCHED SUMMARY FOR TBA' RECORD                
******************************************************************              
*                                                                               
SSD      DSECT                                                                  
SSR      DS    CL2                 RECORD TYPE - 'SS' OR 'ST'                   
         DS    XL1                                                              
SSPRG    DS    CL6                 PROGRAM CODE                                 
         DS    XL1                                                              
SSPRGN   DS    CL16                PROGRAM NAME                                 
         DS    XL1                                                              
SSPRD    DS    CL3                 PRODUCT CODE                                 
         DS    XL1                                                              
SSADTE   DS    CL10                AIR DATE YYYY-MM-DD                          
         DS    XL1                                                              
SSROT    DS    XL7                 ROTATION                                     
         DS    XL1                                                              
SSCOST   DS    CL14                COST                                         
         DS    XL1                                                              
SSUCNT   DS    CL3                 UNIT COUNT                                   
SSRLN    EQU   *-SSR                                                            
*                                                                               
*                                                                               
*********************************************************************           
* DSECT FOR 'SCHEDULE TBA' SUMMARY' OR 'SCHED SUMMARY FOR TBA' RECORD           
*********************************************************************           
*                                                                               
STD      DSECT                                                                  
STR      DS    CL2                 RECORD TYPE - 'ST'                           
         DS    XL1                                                              
STPRG    DS    CL6                 PROGRAM CODE                                 
         DS    XL1                                                              
STROT    DS    XL7                 ROTATION                                     
         DS    XL1                                                              
STCOST   DS    CL14                COST                                         
         DS    XL1                                                              
STUCNT   DS    CL3                 UNIT COUNT                                   
STRLN    EQU   *-STR                                                            
*                                                                               
*                                                                               
*********************************************************************           
* DSECT TO COVER MAP TABLE ENTRY                                    *           
*********************************************************************           
                                                                                
MAPD     DSECT                                                                  
MAPTYP   DS    AL1                 TYPE OF ENTRY TO FOLLOW                      
FLDQ     EQU   1                   FLAT FILE DATA                               
FVDQ     EQU   2                   FLAT FILE DATA VARIABLE LEN                  
CONQ     EQU   3                   CONSTANT                                     
VENQ     EQU   4                   VAR LEN VARIOUS END MESSAGES                 
VECQ     EQU   5                   VAR LEN CML END MESSAGES                     
ENDQ     EQU   6                   END LOOP                                     
SHDQ     EQU   7                   SKIP HEADER MESSAGE                          
SENQ     EQU   8                   SAVE END MESSASGE                            
SUHQ     EQU   9                   SUB-HEADER                                   
SUFQ     EQU   10                  SUB-FOOTER                                   
SMFQ     EQU   11                  SKIP/SAVE FOOTER FOR MULTI-ENTRY             
SOPQ     EQU   12                  START OF OPTIONAL DATA                       
EOPQ     EQU   13                  END OF OPTIONAL DATA                         
EMSQ     EQU   14                  END MESSSAGE CONSTANT                        
SSKQ     EQU   15                  START OF DATA TO SKIP                        
ESKQ     EQU   16                  END OF DATA TO SKIP                          
ASKQ     EQU   17                  ALL DATA SKIP                                
VSFQ     EQU   18                  SUB-FOOTER                                   
VMFQ     EQU   19                  FOOTER FOR MULTI-ENTRY                       
SECQ     EQU   20                  SAVE END COMMERCIAL MESSAGE                  
SESQ     EQU   22                  SAVE END SCHEDULE MESSAGE                    
PESQ     EQU   23                  PRINT END SCHEDULE MESSAGE IF ANY            
PSSQ     EQU   24                  PRINT SUB-FOOTER MESSAGE IF ANY              
PSOQ     EQU   25                  PRINT SUB-OUTER-FOOTER MSG IF ANY            
DSSQ     EQU   27                  DELETE SUB-FOOTER MESSAGE                    
MAPROUT  DS    XL2                 DISPLACEMENT TO ROUTINE                      
MAPRLNQ  EQU   *-MAPD                                                           
         ORG   MAPROUT                                                          
MAPFLD   DS    AL2                 DISPLACEMENT TO OUTPUT FIELD                 
MAPLEN   DS    AL2                 LENGTH OF OUTPUT FIELD (OR ZERO)             
MAPDATA  DS    XL2                 DISPLACEMENT TO DATA                         
MAPLNQ   EQU   *-MAPD                                                           
         ORG   MAPDATA                                                          
MAPCON   DS    0C                  CONSTANT                                     
         ORG                                                                    
*                                                                               
EORQ     EQU   X'00'               END OF RECORD                                
EOTQ     EQU   X'FF'               END OF TABLE                                 
*                                                                               
*                  TSAR RECORD CODE TYPE EQUATES                                
EBHUQ    EQU   10                  HEADER USER NAME/ADDRESS                     
EBHCOQ   EQU   15                  HEADER CONTACT                               
EBHCIQ   EQU   20                  HEADER CUTIN (MKT/STA)                       
EBHNEQ   EQU   22                  HEADER NETWORK                               
EBADVQ   EQU   30                  ADVERTISER                                   
*EBHOUQ   EQU   33   *NOP           HEADER OUTLET                               
EBHDTQ   EQU   38                  HEADER SEND DATE/TIME                        
EBPERQ   EQU   39                  HEADER PERIOD                                
EBPRDQ   EQU   40                  PRODUCT DEFINITION                           
EBHPDQ   EQU   42                  HEADER PRODUCT DEFINITION                    
EBVARQ   EQU   47                  VARIOUS PRODUCTS                             
EBPGRQ   EQU   48                  PGROUP DEFINITION                            
EBPGIQ   EQU   49                  PROGRAM INFO RECORD DETAILS                  
EBFEEQ   EQU   51                  FEED DEFINITION                              
EBDAYQ   EQU   52                  DAYPART DEFINITION                           
*BCMLQ   EQU   53   **NOP**        COMMERCIAL DEFINITION                        
EBPRGQ   EQU   55                  PROGRAM DEFINITION                           
EBHCMQ   EQU   60                  HEADER COMMENT                               
EBRCMQ   EQU   65                  REVISION COMMENT                             
EBDCMQ   EQU   67                  PRODUCT LEVEL COMMENT                        
EBFCMQ   EQU   70                  FOOTER COMMENT                               
EBDLMQ   EQU   71                  DISTRIBUTION LIST                            
EBTBAQ   EQU   72                  TBA INSTRUCTION LINE INFO                    
EBILIQ   EQU   75                  INSTRUCTION LINE INFO                        
EBIBBQ   EQU   76                  BILLBOARD INSTRUCTION LINE INFO              
EBIEPQ   EQU   77                  ESTIMATE/PACKAGE                             
EBILIDQ  EQU   78                  INSTRUCTION LINE DIFF PROG INFO              
EBILCRQ  EQU   79                  INSTRUCTION LINE COMML ROTATION              
EBILCPQ  EQU   80                  INSTRUCTION LINE COMML PERCENTAGE            
EBILBRQ  EQU   81                  INSTRUCTION LINE PIGGYBACK ROTATION          
EBILMRQ  EQU   82                  INSTRUCTION LINE P/B ROT 1CML=2PRDS          
EBILBPQ  EQU   83                  INSTRUCTION LINE P/B PERCENTAGE              
EBILMPQ  EQU   84                  INSTRUCTION LINE P/B % 1 CML=2PRDS           
EBILCTQ  EQU   85                  INSTRUCTION LINE COMTEXT                     
EBILTGQ  EQU   86                  INSTRUCTION LINE TAG EXISTS RECORD           
EBILPCQ  EQU   87                  INSTRUCTION LINE PATTERN COMMENT             
EBILRTQ  EQU   88                  INSTRUCTION LINE ROTATION LIST               
EBILCIQ  EQU   89                  INSTRUCTION LINE CUTIN (MKT/STA)             
EBILTIQ  EQU   90                  INSTRUCTION LINE CUTIN (MKT/STA)             
EBSCHDQ  EQU   91                  INSTRUCTION SCHEDULE SUMMARY                 
EBTSCHQ  EQU   94                  TBA INSTR SCHEDULE SUMMARY                   
*                                                                               
*                                                                               
* ORDER IN WHICH DATA APPEARS IS CONTROLLED BY THIS TABLE                       
*                                                                               
*                          SORT SEQUENCE GROUPS                                 
EBHSENDQ EQU   05                  HEADER SEND DATE/TIME                        
EBHSUSMQ EQU   07                  HEADER SENDING USER NAME                     
EBHCONTQ EQU   08                  HEADER CONTACT INFO                          
EBHNETQ  EQU   10                  HEADER NETWORK (RECEIVING COMPANY)           
EBHADVQ  EQU   11                  HEADER ADVERTISER                            
EBHPRDQ  EQU   12                  HEADER PRODUCT(OR PGROUP) DEFINITION         
EBPRODQ  EQU   13    ??? WHERE ??? PRODUCT DEFINITION                           
EBHPERQ  EQU   15                  HEADER PERIOD                                
EBPRGIQ  EQU   24                  PROGRAM INFORMATION REC DETAIL.              
                                                                                
                                                                                
EBILINQ  EQU   30                  INSTRUCTION LINE INFO                        
EBILBBQ  EQU   30                  BILLBOARD INSTRUCTION LINE INFO              
EBILINDQ EQU   30                  INSTRUCTION LINE DIFF PROG INFO              
EBCMROTQ EQU   30                  COMMERCIAL ROTATION                          
EBILTAGQ EQU   30                  INSTRUCTION LINE TAG                         
EBILROTQ EQU   30                  ROTATION LIST                                
EBSCHEDQ EQU   30                  SCHEDULE SUMMARY                             
EBTBANQ  EQU   33                  TBA INSTRUCTION LINE INFO                    
EBTBAPGQ EQU   33                  TBA INSTRUCTION LINE DIFF PROG INFO          
EBTSCHDQ EQU   33                  SCHEDULE SUMMARY FOR TBA                     
EBHCITQ  EQU   34                  HEADER CUTIN (MKT/STA)                       
EBILCINQ EQU   34                  INSTRUCTION LINE FOR CUTIN                   
EBILTCNQ EQU   34                  INSTRUCTION LINE FOR CUTIN TBA               
                                                                                
EBHCOMNQ EQU   35                  HEADER COMMENT                               
EBDCOMNQ EQU   40                  PRODUCT LEVEL COMMENT                        
EBFCOMNQ EQU   41                  FOOTER COMMENT                               
EBRCOMNQ EQU   42                  REVISION COMMENT                             
EBDLSTQ  EQU   43                  DISTRIBUTION LIST                            
                                                                                
                                                                                
*                                                                               
* MOVED TO THE END (AS REQUIRMENTS CHANGED AND IS NO LONGER NEEDED)             
EBFEEDQ  EQU   81                  FEED DEFINITION                              
EBDAYPQ  EQU   82                  DAYPART DEFINITION                           
EBHCMMLQ EQU   83                  COMMERCIAL DEFINITION                        
EBPROGQ  EQU   84                  PROGRAM DEFINITION                           
EBHOUTQ  EQU   85                  HEADER OUTLET (NETWORK)                      
*                                                                               
*                                                                               
FDELIM   EQU   X'4F'               FIELD DELIMITER  (PIPE |)                    
*                                                                               
