*          DATA SET SPTRAE7D   AT LEVEL 001 AS OF 08/11/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216E7D      DATE 08/11/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   28    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A   P    N         T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL8      5   46    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A   P    N         T        Y              
TRAPTRH  DS    CL8                                                              
TRAPTR   DS    CL8      5   64    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
TRAEDTH  DS    CL8                                                              
TRAEDT   DS    CL8      6   10    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    N         T        Y              
TRAFLTRH DS    CL8                                                              
TRAFLTR  DS    CL60     7   10   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    N         T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1      9    2    1  A   P    N         T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 245  BYTES                            
