*          DATA SET SPTRA8AD   AT LEVEL 001 AS OF 05/24/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2168AD      DATE 05/24/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL3      5   10    3  A  U N             T        Y    1         
TRACLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
TRAPRODH DS    XL8                                                              
TRAPROD  DS    CL3      5   28    3  A  U N             T        Y    3         
TRAPRODX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL58     7    2   58  A  P N             T        Y              
TRACLT1H DS    XL8                                                              
TRACLT1  DS    CL3      8    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLT2H DS    XL8                                                              
TRACLT2  DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLT3H DS    XL8                                                              
TRACLT3  DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLT4H DS    XL8                                                              
TRACLT4  DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLT5H DS    XL8                                                              
TRACLT5  DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLT6H DS    XL8                                                              
TRACLT6  DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLT7H DS    XL8                                                              
TRACLT7  DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLT8H DS    XL8                                                              
TRACLT8  DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLT9H DS    XL8                                                              
TRACLT9  DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLTAH DS    XL8                                                              
TRACLTA  DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLTBH DS    XL8                                                              
TRACLTB  DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLTCH DS    XL8                                                              
TRACLTC  DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLTDH DS    XL8                                                              
TRACLTD  DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLTEH DS    XL8                                                              
TRACLTE  DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRACLTFH DS    XL8                                                              
TRACLTF  DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   14    6  A  U N             T        Y  120         
         DS    XL8                                                              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     23    2    1  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 816  BYTES                            
