*          DATA SET SPTRNPRG   AT LEVEL 007 AS OF 02/20/86                      
PRGNRECD DSECT      **** NETWORK PROGRAM DISTRIBUTION LIST ****                 
*                                                                               
PRGKEY   DS    0XL13                                                            
PRGKID   DS    X'0A43'             RECORD ID                                    
PRGKAM   DS    XL1                 AGENCY/MEDIA                                 
PRGKNET  DS    CL4                 NETWORK                                      
PRGKPRG  DS    CL6                 PROGRAM                                      
*                                                                               
         DS    XL2                 RECORD LENGTH                                
         DS    XL4                 CONTROL                                      
         DS    XL1                                                              
PRGAGYA  DS    CL2                 AGENCY ALPHA                                 
         DS    XL2                                                              
         SPACE 2                                                                
PRGADREL DS    X'10'               NETWORK ADDRESS ELEMENT                      
PRGADRLN DS    AL1(32)             ELEMENT LENGTH                               
PRGADRAD DS    CL30                NETWORK ADDRESS                              
         SPACE 2                                                                
PRGLSTEL DS    X'20'               NAME LIST ELEMENT                            
PRGLSTLN DS    AL1(33)             ELEMENT LENGTH                               
PRGLSTSQ DS    XL1                 SEQUENCE NUMBER                              
PRGLSTNM DS    CL30                NAME                                         
