*          DATA SET SPTRABDD   AT LEVEL 001 AS OF 03/21/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216BDD      DATE 03/21/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL3      5   10    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
TRANETH  DS    CL8                                                              
TRANET   DS    CL4      5   28    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPROGH DS    CL8                                                              
TRAPROG  DS    CL6      5   46    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   56    6  A  P H             T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL8      5   64    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
TRARNUMH DS    CL8                                                              
TRARNUM  DS    CL4      6   10    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
TRAOPTH  DS    CL8                                                              
TRAOPT   DS    CL20     6   28   20  A  U N             T        Y              
TRALSTRH DS    CL8                                                              
TRALSTR  DS    CL13     6   64   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TRANNUMH DS    CL8                                                              
TRANNUM  DS    CL4      7   10    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   16    1  A  P N             T        Y              
TRARDTEH DS    CL8                                                              
TRARDTE  DS    CL24     8    2   24  A  P N             T        Y              
TRAIDTEH DS    CL8                                                              
TRAIDTE  DS    CL28     8   28   28  A  P N             T        Y              
TRAREVTH DS    CL8                                                              
TRAREVT  DS    CL14     8   57   14  A  P N             T        Y              
TRAREVH  DS    CL8                                                              
TRAREV   DS    CL4      8   73    4  A  U N             T        Y              
TRASEEDH DS    CL8                                                              
TRASEED  DS    CL4      9   58    4  A  P N             T        Y              
TRACABLH DS    CL8                                                              
TRACABL  DS    CL5      9   64    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
TRARCOMH DS    CL8                                                              
TRARCOM  DS    CL60    10   18   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    11   18   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    12   18   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    13   18   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    14   18   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    15   18   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    16   18   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   18   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    18   18   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   14    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    19   18   60  A  U N             T        Y              
TRALCOMH DS    CL8                                                              
TRALCOM  DS    CL1     19   79    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    20    2   14  A  P N             T        Y              
TRAASEDH DS    CL8                                                              
TRAASED  DS    CL60    20   18   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    21    2   14  A  P N             T        Y              
TRASCOMH DS    CL8                                                              
TRASCOM  DS    CL60    21   18   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    22   18   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    23   18   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   15    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    24   18   60  A  P N             T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     24   79    1  A  P N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=1X                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1584 BYTES                            
