*          DATA SET SPTRABBD   AT LEVEL 005 AS OF 01/31/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216BBD      DATE 01/31/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
TRANETH  DS    XL8                                                              
TRANET   DS    CL4      5   10    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL3      5   28    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   38    4  A  P H             T        Y              
TRAFEEDH DS    XL8                                                              
TRAFEED  DS    CL4      5   46    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
TRAFLTRH DS    XL8                                                              
TRAFLTR  DS    CL13     6   10   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   51    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   15   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
TRADSC1H DS    XL8                                                              
TRADSC1  DS    CL60     8   15   60  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P H             T        Y              
TRADSC2H DS    XL8                                                              
TRADSC2  DS    CL60     9   15   60  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL60    10   15   60  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P H             T        Y              
TRADSCLH DS    XL8                                                              
TRADSCL  DS    CL60    11   15   60  A  U H             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     12    2    1  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
