*          DATA SET SPTRA70D   AT LEVEL 004 AS OF 01/24/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21670D      DATE 01/24/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    H         T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   28    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A   P    N         T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   46    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A   P    H         T        Y              
TRACONH  DS    CL8                                                              
TRACON   DS    CL16     5   64   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL18     6   10   18  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
TRAOPTH  DS    CL8                                                              
TRAOPT   DS    CL60     7   10   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    N         T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1      9    2    1  A   P    N         T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=1X                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 264  BYTES                            
