*          DATA SET SPTRAF7D   AT LEVEL 004 AS OF 01/20/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216F7D      DATE 01/20/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   29    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPRDH  DS    XL8                                                              
TRAPRD   DS    CL4      5   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TRAPTRH  DS    XL8                                                              
TRAPTR   DS    CL11     5   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   20    8  A  P N             T        Y              
TRAESTH  DS    XL8                                                              
TRAEST   DS    CL4      6   29    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
TRAPERH  DS    XL8                                                              
TRAPER   DS    CL17     6   47   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
TRASHIPH DS    XL8                                                              
TRASHIP  DS    CL3      7   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P N             T        Y              
TRAFMTH  DS    XL8                                                              
TRAFMT   DS    CL4      7   29    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
TRACONTH DS    XL8                                                              
TRACONT  DS    CL16     7   47   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      7   65    3  A  P N             T        Y              
TRAFAXH  DS    XL8                                                              
TRAFAX   DS    CL1      7   71    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
TRAOPTH  DS    XL8                                                              
TRAOPT   DS    CL69     8   10   69  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   80    1  A  P N             T        Y              
TRACOPYH DS    XL8                                                              
TRACOPY  DS    CL61     9   18   61  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    10    2   75  A  P N             T        Y              
TRASEL1H DS    XL8                                                              
TRASEL1  DS    CL2     12    2    2  A  U N             T        Y              
TRADSP1H DS    XL8                                                              
TRADSP1  DS    CL72    12    7   72  A  P N             T        Y              
TRASEL2H DS    XL8                                                              
TRASEL2  DS    CL2     13    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    13    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    14    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    15    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    16    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    17    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    18    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    19    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    20    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    21    7   72  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL72    22    7   72  A  P N             T        Y              
TRATABH  DS    XL8                                                              
TRATAB   DS    CL1     23    2    1  A  U N             T        Y              
TRAWRKRH DS    XL8                                                              
TRAWRKR  DS    CL16    23    4   16  A  U Z             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1568 BYTES                            
