*          DATA SET SPTRA8ED   AT LEVEL 002 AS OF 06/17/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2168ED      DATE 06/17/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
TRAHSEH  DS    CL8                                                              
TRAHSE   DS    CL6      6   15    6  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL9      7    2    9  A  P N             T        Y              
TRASIDH  DS    CL8                                                              
TRASID   DS    CL3      7   15    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   77    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
TRANAMEH DS    CL8                                                              
TRANAME  DS    CL25     8   15   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
TRAADDRH DS    CL8                                                              
TRAADDR  DS    CL30     9   15   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
TRAADD2H DS    CL8                                                              
TRAADD2  DS    CL30    10   15   30  A  U N             T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     11    2    1  A  P N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 240  BYTES                            
