*          DATA SET SPTRAD2D   AT LEVEL 004 AS OF 07/22/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216D2D      DATE 07/22/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   38    5  A  P H             T        Y              
TRACIDH  DS    XL8                                                              
TRACID   DS    CL13     5   46   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TRAFLTRH DS    XL8                                                              
TRAFLTR  DS    CL64     6   10   64  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   76    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     7    4   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   34    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7   39   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   53    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   63    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7   75    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  U N             T        Y              
TRALN1H  DS    XL8                                                              
TRALN1   DS    CL75     8    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75     9    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    10    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    11    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    12    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    13    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    14    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    15    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    16    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    17    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    18    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    19    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    20    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    21    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    22    4   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    23    4   75  A  P N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     24    2    1  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
