*          DATA SET SPTRAB7D   AT LEVEL 002 AS OF 03/12/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216B7D      DATE 03/12/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   28    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRAPRDH  DS    XL8                                                              
TRAPRD   DS    CL4      5   46    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   56    6  A  P H             T        Y              
TRAMKTH  DS    XL8                                                              
TRAMKT   DS    CL5      5   64    5  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TRAFLTRH DS    XL8                                                              
TRAFLTR  DS    CL62     6   10   62  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   76    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
TRASTA1H DS    XL8                                                              
TRASTA1  DS    CL9      8    2    9  A  U N             T        Y              
TRASTA2H DS    XL8                                                              
TRASTA2  DS    CL9      8   12    9  A  U N             T        Y              
TRASTA3H DS    XL8                                                              
TRASTA3  DS    CL9      8   22    9  A  U N             T        Y              
TRASTA4H DS    XL8                                                              
TRASTA4  DS    CL9      8   32    9  A  U N             T        Y              
TRASTA5H DS    XL8                                                              
TRASTA5  DS    CL9      8   42    9  A  U N             T        Y              
TRASTA6H DS    XL8                                                              
TRASTA6  DS    CL9      8   52    9  A  U N             T        Y              
TRASTA7H DS    XL8                                                              
TRASTA7  DS    CL9      8   62    9  A  U N             T        Y              
TRASTA8H DS    XL8                                                              
TRASTA8  DS    CL9      8   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   62    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   72    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24   12    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24   22    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24   42    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24   52    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24   62    9  A  U N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     24   72    1  A  U N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2528 BYTES                            
