*          DATA SET SPTRA89D   AT LEVEL 003 AS OF 04/06/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21689D      DATE 04/06/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL3      5   10    3  A  U N             T        Y    1         
TRACLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
TRAPRODH DS    CL8                                                              
TRAPROD  DS    CL3      5   28    3  A  U N             T        Y    3         
TRAPRODX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A  P N             T        Y              
TRATALH  DS    CL8                                                              
TRATAL   DS    CL6      7   17    6  A  U N             T        Y    5         
TRATALX  DS    CL8                                                              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1      8   78    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 136  BYTES                            
