*          DATA SET SPTRA78D   AT LEVEL 003 AS OF 09/08/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21678D      DATE 09/08/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   29    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL7      5   46    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TRAPTRH  DS    CL8                                                              
TRAPTR   DS    CL7      5   64    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
TRAMKTH  DS    CL8                                                              
TRAMKT   DS    CL5      6   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   20    8  A  P N             T        Y              
TRAESTH  DS    CL8                                                              
TRAEST   DS    CL4      6   29    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   38    6  A  P H             T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL18     6   46   18  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TRAOPTH  DS    CL8                                                              
TRAOPT   DS    CL53     7   10   53  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  A  P N             T        Y              
TRAREFH  DS    CL8                                                              
TRAREF   DS    CL59     9   21   59  A  U N             T        Y              
TRATABH  DS    CL8                                                              
TRATAB   DS    CL1     10    2    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
