*          DATA SET SPTRABFOD  AT LEVEL 001 AS OF 01/19/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216BFD      DATE 01/19/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   10    4  A  U N             T        Y  200         
TRACLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
TRANETH  DS    CL8                                                              
TRANET   DS    CL5      5   28    5  A  U N             T        Y  201         
TRANETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPRGH  DS    CL8                                                              
TRAPRG   DS    CL7      5   46    7  A  U N             T        Y  202         
TRAPRGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   56    6  A  P H             T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL8      5   64    8  A  U N             T        Y  203         
TRAPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      6   20    3  A  P N             T        Y              
TRAFAXH  DS    CL8                                                              
TRAFAX   DS    CL2      6   28    2  A  U N             T        Y              
TRACPYH  DS    CL8                                                              
TRACPY   DS    CL48     6   32   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TRAOPTH  DS    CL8                                                              
TRAOPT   DS    CL60     7   14   60  A  U N             T        Y  253         
TRAOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   76    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38     8    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     8   41   24  A  P N             T        Y              
TRASEL1H DS    CL8                                                              
TRASEL1  DS    CL3      9    2    3  A  U N             T        Y              
TRADSP1H DS    CL8                                                              
TRADSP1  DS    CL75     9    6   75  A  P N             T        Y              
TRASEL2H DS    CL8                                                              
TRASEL2  DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     24    2    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=1X                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
