*          DATA SET SPTRAE9D   AT LEVEL 011 AS OF 07/10/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216E9D      DATE 07/10/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      5    2    8   A    P    N         T         Y           
REPFILTH DS    CL8                                                              
REPFILT  DS    CL40     5   12   40   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL8      6    2    8   A    P    N         T         Y           
REPFLDH  DS    CL8                                                              
REPFLD   DS    CL40     6   12   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      6   72    1   A    P    N         T         Y           
REPHEDH  DS    CL8                                                              
REPHED   DS    CL25     7   12   25   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      8   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50     8   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      9   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50     9   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     10   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    10   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     11   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    11   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     12   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    12   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     13   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    13   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    14   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     15   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    15   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     16   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    16   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     17   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    17   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     18   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    18   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     19   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    19   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     20   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    20   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     21   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    21   18   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     22   12    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL50    22   18   50   A    P    N         T         Y           
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1208 BYTES                            
