*          DATA SET SPTRAA2D   AT LEVEL 011 AS OF 04/19/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216A2D      DATE 04/19/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL3      5   10    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10     5   20   10  A  P N             T        Y              
TRAPRD1H DS    XL8                                                              
TRAPRD1  DS    CL3      5   32    3  A  U N             T        Y              
TRAPRD2H DS    XL8                                                              
TRAPRD2  DS    CL3      5   38    3  A  U N             T        Y              
TRAPRD3H DS    XL8                                                              
TRAPRD3  DS    CL3      5   44    3  A  U N             T        Y              
TRAPRD4H DS    XL8                                                              
TRAPRD4  DS    CL3      5   50    3  A  U N             T        Y              
TRAPRD5H DS    XL8                                                              
TRAPRD5  DS    CL3      5   56    3  A  U N             T        Y              
TRAPRD6H DS    XL8                                                              
TRAPRD6  DS    CL3      5   62    3  A  U N             T        Y              
TRAPRD7H DS    XL8                                                              
TRAPRD7  DS    CL3      5   68    3  A  U N             T        Y              
TRAPRD8H DS    XL8                                                              
TRAPRD8  DS    CL3      5   74    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25     7    2   25  A  P N             T        Y              
TRAPTG1H DS    XL8                                                              
TRAPTG1  DS    CL4      7   30    4  A  P N             T        Y              
TRAPTG2H DS    XL8                                                              
TRAPTG2  DS    CL4      7   36    4  A  P N             T        Y              
TRAPTG3H DS    XL8                                                              
TRAPTG3  DS    CL4      7   42    4  A  P N             T        Y              
TRAPTG4H DS    XL8                                                              
TRAPTG4  DS    CL4      7   48    4  A  P N             T        Y              
TRAPTG5H DS    XL8                                                              
TRAPTG5  DS    CL4      7   54    4  A  P N             T        Y              
TRAPTG6H DS    XL8                                                              
TRAPTG6  DS    CL4      7   60    4  A  P N             T        Y              
TRAPTG7H DS    XL8                                                              
TRAPTG7  DS    CL4      7   66    4  A  P N             T        Y              
TRAPTG8H DS    XL8                                                              
TRAPTG8  DS    CL4      7   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25     8    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   30    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   36    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   42    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   48    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   54    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   60    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   66    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   72    4  A  P N             T        Y              
TRABL01H DS    XL8                                                              
TRABL01  DS    CL10     9    2   10  A  P N             T        Y              
TRACTA1H DS    XL8                                                              
TRACTA1  DS    CL4      9   30    4  A  P N             T        Y              
TRACTA2H DS    XL8                                                              
TRACTA2  DS    CL4      9   36    4  A  P N             T        Y              
TRACTA3H DS    XL8                                                              
TRACTA3  DS    CL4      9   42    4  A  P N             T        Y              
TRACTA4H DS    XL8                                                              
TRACTA4  DS    CL4      9   48    4  A  P N             T        Y              
TRACTA5H DS    XL8                                                              
TRACTA5  DS    CL4      9   54    4  A  P N             T        Y              
TRACTA6H DS    XL8                                                              
TRACTA6  DS    CL4      9   60    4  A  P N             T        Y              
TRACTA7H DS    XL8                                                              
TRACTA7  DS    CL4      9   66    4  A  P N             T        Y              
TRACTA8H DS    XL8                                                              
TRACTA8  DS    CL4      9   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
TRABL02H DS    XL8                                                              
TRABL02  DS    CL7     11    2    7  A  P N             T        Y              
TRACTB1H DS    XL8                                                              
TRACTB1  DS    CL4     11   30    4  A  P N             T        Y              
TRACTB2H DS    XL8                                                              
TRACTB2  DS    CL4     11   36    4  A  P N             T        Y              
TRACTB3H DS    XL8                                                              
TRACTB3  DS    CL4     11   42    4  A  P N             T        Y              
TRACTB4H DS    XL8                                                              
TRACTB4  DS    CL4     11   48    4  A  P N             T        Y              
TRACTB5H DS    XL8                                                              
TRACTB5  DS    CL4     11   54    4  A  P N             T        Y              
TRACTB6H DS    XL8                                                              
TRACTB6  DS    CL4     11   60    4  A  P N             T        Y              
TRACTB7H DS    XL8                                                              
TRACTB7  DS    CL4     11   66    4  A  P N             T        Y              
TRACTB8H DS    XL8                                                              
TRACTB8  DS    CL4     11   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
TRABL03H DS    XL8                                                              
TRABL03  DS    CL8     13    2    8  A  P N             T        Y              
TRACTC1H DS    XL8                                                              
TRACTC1  DS    CL4     13   30    4  A  P N             T        Y              
TRACTC2H DS    XL8                                                              
TRACTC2  DS    CL4     13   36    4  A  P N             T        Y              
TRACTC3H DS    XL8                                                              
TRACTC3  DS    CL4     13   42    4  A  P N             T        Y              
TRACTC4H DS    XL8                                                              
TRACTC4  DS    CL4     13   48    4  A  P N             T        Y              
TRACTC5H DS    XL8                                                              
TRACTC5  DS    CL4     13   54    4  A  P N             T        Y              
TRACTC6H DS    XL8                                                              
TRACTC6  DS    CL4     13   60    4  A  P N             T        Y              
TRACTC7H DS    XL8                                                              
TRACTC7  DS    CL4     13   66    4  A  P N             T        Y              
TRACTC8H DS    XL8                                                              
TRACTC8  DS    CL4     13   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
TRABL04H DS    XL8                                                              
TRABL04  DS    CL7     15    2    7  A  P N             T        Y              
TRACTD1H DS    XL8                                                              
TRACTD1  DS    CL4     15   30    4  A  P N             T        Y              
TRACTD2H DS    XL8                                                              
TRACTD2  DS    CL4     15   36    4  A  P N             T        Y              
TRACTD3H DS    XL8                                                              
TRACTD3  DS    CL4     15   42    4  A  P N             T        Y              
TRACTD4H DS    XL8                                                              
TRACTD4  DS    CL4     15   48    4  A  P N             T        Y              
TRACTD5H DS    XL8                                                              
TRACTD5  DS    CL4     15   54    4  A  P N             T        Y              
TRACTD6H DS    XL8                                                              
TRACTD6  DS    CL4     15   60    4  A  P N             T        Y              
TRACTD7H DS    XL8                                                              
TRACTD7  DS    CL4     15   66    4  A  P N             T        Y              
TRACTD8H DS    XL8                                                              
TRACTD8  DS    CL4     15   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
TRABL05H DS    XL8                                                              
TRABL05  DS    CL18    17    2   18  A  P N             T        Y              
TRACTE1H DS    XL8                                                              
TRACTE1  DS    CL4     17   30    4  A  P N             T        Y              
TRACTE2H DS    XL8                                                              
TRACTE2  DS    CL4     17   36    4  A  P N             T        Y              
TRACTE3H DS    XL8                                                              
TRACTE3  DS    CL4     17   42    4  A  P N             T        Y              
TRACTE4H DS    XL8                                                              
TRACTE4  DS    CL4     17   48    4  A  P N             T        Y              
TRACTE5H DS    XL8                                                              
TRACTE5  DS    CL4     17   54    4  A  P N             T        Y              
TRACTE6H DS    XL8                                                              
TRACTE6  DS    CL4     17   60    4  A  P N             T        Y              
TRACTE7H DS    XL8                                                              
TRACTE7  DS    CL4     17   66    4  A  P N             T        Y              
TRACTE8H DS    XL8                                                              
TRACTE8  DS    CL4     17   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
TRABL06H DS    XL8                                                              
TRABL06  DS    CL20    19    2   20  A  P N             T        Y              
TRACTF1H DS    XL8                                                              
TRACTF1  DS    CL4     19   30    4  A  P N             T        Y              
TRACTF2H DS    XL8                                                              
TRACTF2  DS    CL4     19   36    4  A  P N             T        Y              
TRACTF3H DS    XL8                                                              
TRACTF3  DS    CL4     19   42    4  A  P N             T        Y              
TRACTF4H DS    XL8                                                              
TRACTF4  DS    CL4     19   48    4  A  P N             T        Y              
TRACTF5H DS    XL8                                                              
TRACTF5  DS    CL4     19   54    4  A  P N             T        Y              
TRACTF6H DS    XL8                                                              
TRACTF6  DS    CL4     19   60    4  A  P N             T        Y              
TRACTF7H DS    XL8                                                              
TRACTF7  DS    CL4     19   66    4  A  P N             T        Y              
TRACTF8H DS    XL8                                                              
TRACTF8  DS    CL4     19   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
TRABL07H DS    XL8                                                              
TRABL07  DS    CL20    21    2   20  A  P N             T        Y              
TRACTG1H DS    XL8                                                              
TRACTG1  DS    CL4     21   30    4  A  P N             T        Y              
TRACTG2H DS    XL8                                                              
TRACTG2  DS    CL4     21   36    4  A  P N             T        Y              
TRACTG3H DS    XL8                                                              
TRACTG3  DS    CL4     21   42    4  A  P N             T        Y              
TRACTG4H DS    XL8                                                              
TRACTG4  DS    CL4     21   48    4  A  P N             T        Y              
TRACTG5H DS    XL8                                                              
TRACTG5  DS    CL4     21   54    4  A  P N             T        Y              
TRACTG6H DS    XL8                                                              
TRACTG6  DS    CL4     21   60    4  A  P N             T        Y              
TRACTG7H DS    XL8                                                              
TRACTG7  DS    CL4     21   66    4  A  P N             T        Y              
TRACTG8H DS    XL8                                                              
TRACTG8  DS    CL4     21   72    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
TRABL08H DS    XL8                                                              
TRABL08  DS    CL20    23    2   20  A  P N             T        Y              
TRACTH1H DS    XL8                                                              
TRACTH1  DS    CL4     23   30    4  A  P N             T        Y              
TRACTH2H DS    XL8                                                              
TRACTH2  DS    CL4     23   36    4  A  P N             T        Y              
TRACTH3H DS    XL8                                                              
TRACTH3  DS    CL4     23   42    4  A  P N             T        Y              
TRACTH4H DS    XL8                                                              
TRACTH4  DS    CL4     23   48    4  A  P N             T        Y              
TRACTH5H DS    XL8                                                              
TRACTH5  DS    CL4     23   54    4  A  P N             T        Y              
TRACTH6H DS    XL8                                                              
TRACTH6  DS    CL4     23   60    4  A  P N             T        Y              
TRACTH7H DS    XL8                                                              
TRACTH7  DS    CL4     23   66    4  A  P N             T        Y              
TRACTH8H DS    XL8                                                              
TRACTH8  DS    CL4     23   72    4  A  P N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     23   78    1  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1968 BYTES                            
