*          DATA SET SPTRAB6D   AT LEVEL 026 AS OF 03/03/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216B6D      DATE 03/03/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL8      5   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TRAPTRH  DS    CL8                                                              
TRAPTR   DS    CL7      5   64    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      5   72    4  A  P N             T        Y              
TRACODEH DS    CL8                                                              
TRACODE  DS    CL3      5   77    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL18     6   10   18  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL26     6   38   26  A  P N             T        Y              
TRASMKTH DS    CL8                                                              
TRASMKT  DS    CL8      6   66    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TRAFLTRH DS    CL8                                                              
TRAFLTR  DS    CL62     7   10   62  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
TRADSPH  DS    CL8                                                              
TRADSP   DS    CL38     8   30   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   15   12  A  P N             T        Y              
TRAMS1H  DS    CL8                                                              
TRAMS1   DS    CL10    10    2   10  A  P N             T        Y              
TRAMS2H  DS    CL8                                                              
TRAMS2   DS    CL10    10   15   10  A  P N             T        Y              
TRAMS3H  DS    CL8                                                              
TRAMS3   DS    CL10    10   28   10  A  P N             T        Y              
TRAMS4H  DS    CL8                                                              
TRAMS4   DS    CL10    10   42   10  A  P N             T        Y              
TRAMS5H  DS    CL8                                                              
TRAMS5   DS    CL10    10   54   10  A  P N             T        Y              
TRAMS6H  DS    CL8                                                              
TRAMS6   DS    CL10    10   67   10  A  P N             T        Y              
TRAMSAH  DS    CL8                                                              
TRAMSA   DS    CL10    11    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   67   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23    2   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   15   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   28   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   42   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   54   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   67   10  A  P N             T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     24    2    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1928 BYTES                            
