*          DATA SET SPTRA73D   AT LEVEL 003 AS OF 06/13/17                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21673D      DATE 06/13/17                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   10    4  A  U N             T        Y    1         
TRACLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
TRANETH  DS    XL8                                                              
TRANET   DS    CL5      5   28    5  A  U N             T        Y    2         
TRANETX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
TRAPERH  DS    XL8                                                              
TRAPER   DS    CL8      5   46    8  A  U N             T        Y    3         
TRAPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   56    3  A  P H             T        Y              
TRAFAXH  DS    XL8                                                              
TRAFAX   DS    CL2      5   64    2  A  U N             T        Y    4         
TRAFAXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   20    4  A  P N             T        Y              
TRASEEDH DS    XL8                                                              
TRASEED  DS    CL2      6   28    2  A  P N             T        Y    5         
TRASEEDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TRAOPTH  DS    XL8                                                              
TRAOPT   DS    CL60     7   10   60  A  U N             T        Y    6         
TRAOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   76    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
TRACMT1H DS    XL8                                                              
TRACMT1  DS    CL60     8   13   60  A  P N             T        Y    9         
TRACMT1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   11    1  A  P N             T        Y              
TRACMT2H DS    XL8                                                              
TRACMT2  DS    CL60     9   13   60  A  P N             T        Y    9         
TRACMT2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   11    1  A  P N             T        Y              
TRACMT3H DS    XL8                                                              
TRACMT3  DS    CL60    10   13   60  A  P N             T        Y    9         
TRACMT3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   11    1  A  P N             T        Y              
TRACMT4H DS    XL8                                                              
TRACMT4  DS    CL60    11   13   60  A  P N             T        Y    9         
TRACMT4X DS    XL8                                                              
TRAPIDH  DS    XL8                                                              
TRAPID   DS    CL8     12    7    8  A  U Z             T        Y    7         
TRAPIDX  DS    XL8                                                              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     13    2    1  A  U N             T        Y    8         
TRATAGX  DS    XL8                                                              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=1X                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 664  BYTES                            
