*          DATA SET SPTRA5FD   AT LEVEL 004 AS OF 05/09/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2165FD      DATE 05/09/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
TRASTAH  DS    XL8                                                              
TRASTA   DS    CL4      5   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
TRAADTH  DS    XL8                                                              
TRAADT   DS    CL8      7   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
TRAIDTH  DS    XL8                                                              
TRAIDT   DS    CL8      8   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
TRAMDTH  DS    XL8                                                              
TRAMDT   DS    CL8      9   20    8  A  P N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1      9   79    1  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 160  BYTES                            
