*          DATA SET SPTRAF6D   AT LEVEL 006 AS OF 09/13/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216F6D      DATE 09/13/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TPRKEYH  DS    XL8                                                              
TPRKEY   DS    CL5      5    2    5  A  P H             T        Y              
TPRMEDH  DS    XL8                                                              
TPRMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TPRCLTH  DS    XL8                                                              
TPRCLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   38    5  A  P H             T        Y              
TPRCMLH  DS    XL8                                                              
TPRCML   DS    CL13     5   46   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TPRFLTRH DS    XL8                                                              
TPRFLTR  DS    CL30     6   10   30  A  U N             T        Y              
TPRXXXH  DS    XL8                                                              
TPRXXX   DS    CL1      6   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     7    2   78  A  P N             T        Y              
TPRPRD1H DS    XL8                                                              
TPRPRD1  DS    CL3      8    2    3  A  U N             T        Y              
TPRPNM1H DS    XL8                                                              
TPRPNM1  DS    CL20     8    8   20  A  P N             T        Y              
TPRSDT1H DS    XL8                                                              
TPRSDT1  DS    CL10     8   32   10  A  U N             T        Y              
TPREDT1H DS    XL8                                                              
TPREDT1  DS    CL10     8   44   10  A  U N             T        Y              
TPRPRD2H DS    XL8                                                              
TPRPRD2  DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     9    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    10    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    11    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   44   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    21    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   44   10  A  U N             T        Y              
TPRPRDXH DS    XL8                                                              
TPRPRDX  DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    22    8   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   32   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   44   10  A  U N             T        Y              
TPRPFKH  DS    XL8                                                              
TPRPFK   DS    CL75    23    2   75  A  P N             T        Y              
TPRLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1448 BYTES                            
