*          DATA SET SPTRLBLS   AT LEVEL 004 AS OF 05/07/85                      
*                                                                               
LSTRECD  DSECT         **** TRAFFIC LIST OF STATIONS FOR LABELS ****            
*                                                                               
LSTKEY   DS    0XL13                                                            
LSTKID   DS    X'0A2F'             RECORD ID                                    
LSTKAM   DS    XL1                 AGENCY/MEDIA                                 
LSTKCLT  DS    XL2                 CLIENT                                       
LSTKPRD  DS    XL1                 PRODUCT                                      
LSTKDESC DS    CL7                 DESCRIPTION                                  
*                                                                               
         DS    XL2                 RECORD LENGTH                                
         DS    XL4                 CONTROL                                      
         DS    XL1                                                              
LSTAGYA  DS    CL2                 AGENCY ALPHA                                 
         DS    XL2                                                              
*                                                                               
LSTDTAEL DS    X'10'               TRAFFIC LIST DATA ELEMENT                    
LSTDTALN DS    AL1(5)              ELEMENT LENGTH                               
LSTSTA   DS    XL3                 STATION                                      
