*          DATA SET SPTRAD9D   AT LEVEL 001 AS OF 11/05/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216D9D      DATE 11/05/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   29    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   47    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TRAPTRH  DS    CL8                                                              
TRAPTR   DS    CL4      5   64    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   20    8  A  P N             T        Y              
TRAESTH  DS    CL8                                                              
TRAEST   DS    CL4      6   29    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P H             T        Y              
TRAPERH  DS    CL8                                                              
TRAPER   DS    CL17     6   47   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P N             T        Y              
TRAFMTH  DS    CL8                                                              
TRAFMT   DS    CL4      7   29    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
TRACONTH DS    CL8                                                              
TRACONT  DS    CL16     7   47   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      7   65    3  A  P N             T        Y              
TRAFAXH  DS    CL8                                                              
TRAFAX   DS    CL2      7   71    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
TRAOPTH  DS    CL8                                                              
TRAOPT   DS    CL53     8   10   53  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   65    5  A  P N             T        Y              
TRAHSEH  DS    CL8                                                              
TRAHSE   DS    CL8      8   71    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   70    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
TRAMKTSH DS    CL8                                                              
TRAMKTS  DS    CL49    10   10   49  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
TRACMT1H DS    CL8                                                              
TRACMT1  DS    CL58    12   20   58  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
TRACMT2H DS    CL8                                                              
TRACMT2  DS    CL58    13   20   58  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
TRACMT3H DS    CL8                                                              
TRACMT3  DS    CL58    14   20   58  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
TRACMT4H DS    CL8                                                              
TRACMT4  DS    CL58    15   20   58  A  U N             T        Y              
TRATABH  DS    CL8                                                              
TRATAB   DS    CL1     16    2    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 808  BYTES                            
