*          DATA SET SPTRACCD   AT LEVEL 002 AS OF 08/01/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216CCD      DATE 08/01/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL50     6    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     7    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     8    2   50   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL50     9    2   50   A    P    N         T         Y           
HLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 235  BYTES                            
