*          DATA SET SPTRAFCD   AT LEVEL 003 AS OF 05/26/17                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216FCD      DATE 05/26/17                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
TRAPRHH  DS    XL8                                                              
TRAPRH   DS    CL6      5   28    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     8    2   14  A  P H             T        Y              
TRAAL1H  DS    XL8                                                              
TRAAL1   DS    CL24     8   18   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14     9    2   14  A  P H             T        Y              
TRAAL2H  DS    XL8                                                              
TRAAL2   DS    CL24     9   18   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    10    2   14  A  P H             T        Y              
TRAAL3H  DS    XL8                                                              
TRAAL3   DS    CL24    10   18   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
TRAAL4H  DS    XL8                                                              
TRAAL4   DS    CL24    11   18   24  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   10    1  A  P N             T        Y              
TRAFAX1H DS    XL8                                                              
TRAFAX1  DS    CL1     13   12    1  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   14    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   16    1  A  P N             T        Y              
TRAFAXAH DS    XL8                                                              
TRAFAXA  DS    CL3     13   18    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   22    1  A  P N             T        Y              
TRAFAXEH DS    XL8                                                              
TRAFAXE  DS    CL3     13   24    3  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   28    1  A  P N             T        Y              
TRAFAXNH DS    XL8                                                              
TRAFAXN  DS    CL4     13   30    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   35    1  A  P N             T        Y              
TRAFAXXH DS    XL8                                                              
TRAFAXX  DS    CL5     13   37    5  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14    2    6  A  P Z             T        Y              
TRAMBXH  DS    XL8                                                              
TRAMBX   DS    CL6     14    9    6  N  P Z             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
TRAOPCH  DS    XL8                                                              
TRAOPC   DS    CL3     15   10    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   18   11  A  P N             T        Y              
TRADLYH  DS    XL8                                                              
TRADLY   DS    CL4     15   31    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   36    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    17    2   14  A  P N             T        Y              
TRACMT1H DS    XL8                                                              
TRACMT1  DS    CL51    17   18   51  A  U N             T        Y              
TRACMT2H DS    XL8                                                              
TRACMT2  DS    CL51    18   18   51  A  U N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     19    2    1  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 648  BYTES                            
