*          DATA SET SPTRSTAL   AT LEVEL 003 AS OF 02/09/87                      
*                                                                               
STLRECD  DSECT             ******* TRAFFIC STATION LIST RECORD *******          
*                                                                               
STLKEY   DS    0XL13                                                            
STLKID   DS    X'0A31'             RECORD ID                                    
STLKAM   DS    XL1                 AGENCY/MEDIA                                 
STLKCLT  DS    XL2                 CLIENT                                       
STLKPRD  DS    XL3                 PRODUCT                                      
STLKMKT  DS    XL2                 MARKET                                       
         ORG   STLKEY                                                           
STLPID   DS    X'0AB1'             PASSIVE POINTER                              
STLPAM   DS    XL1                 AGENCY/MEDIA                                 
STLPMKT  DS    XL2                 MARKET                                       
STLPCLT  DS    XL2                 CLIENT                                       
STLPPRD  DS    XL3                 PRODUCT                                      
         DS    XL3                                                              
*                                                                               
         DS    XL2                 RECORD LENGTH                                
         DS    XL4                 CONTROL                                      
         DS    XL1                                                              
STLAGYA  DS    CL2                 AGENCY ALPHA                                 
         DS    XL2                                                              
*                                                                               
STLDTAEL DS    X'10'               TRAFFIC BUY DATA ELEMENT                     
STLDTALN DS    AL1(STLDTAX-STLDTAEL) ELEMENT LENGTH                             
STLSTA   DS    XL3                 STATION                                      
STLDTAX  EQU   *                                                                
