*          DATA SET SPTRAF5D   AT LEVEL 003 AS OF 08/06/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216F5D      DATE 08/06/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRASTAH  DS    XL8                                                              
TRASTA   DS    CL8      5   46    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P H             T        Y              
TRACMLH  DS    XL8                                                              
TRACML   DS    CL16     5   64   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL29     8   10   29  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     8   47   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL33     9   10   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL31     9   47   31  A  P N             T        Y              
TRAACTNH DS    XL8                                                              
TRAACTN  DS    CL2     10    3    2  A  U N             T        Y              
TRACML2H DS    XL8                                                              
TRACML2  DS    CL12    10   10   12  A  U N             T        Y              
TRAFTCDH DS    XL8                                                              
TRAFTCD  DS    CL9     10   24    9  A  U N             T        Y              
TRALTCDH DS    XL8                                                              
TRALTCD  DS    CL9     10   35    9  A  U N             T        Y              
TRAINDTH DS    XL8                                                              
TRAINDT  DS    CL9     10   47    9  A  U N             T        Y              
TRASHDTH DS    XL8                                                              
TRASHDT  DS    CL9     10   59    9  A  U N             T        Y              
TRAMSHPH DS    XL8                                                              
TRAMSHP  DS    CL5     10   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   72    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    3    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   10   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   24    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   35    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   47    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   59    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   72    5  A  P N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     22    2    1  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1640 BYTES                            
