*          DATA SET SPTRA9CD   AT LEVEL 008 AS OF 02/26/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2169CD      DATE 02/26/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
GRDCLTNH DS    XL8                                                              
GRDCLTN  DS    CL6      5    2    6  A  P H             T        Y              
GRDCLTH  DS    XL8                                                              
GRDCLT   DS    CL4      5   10    4  A  U N             T        Y  200         
GRDCLTX  DS    XL8                                                              
GRDNETNH DS    XL8                                                              
GRDNETN  DS    CL7      5   20    7  A  P N             T        Y              
GRDNETH  DS    XL8                                                              
GRDNET   DS    CL5      5   28    5  A  U N             T        Y  201         
GRDNETX  DS    XL8                                                              
GRDPRGNH DS    XL8                                                              
GRDPRGN  DS    CL7      5   38    7  A  P N             T        Y              
GRDPROGH DS    XL8                                                              
GRDPROG  DS    CL7      5   46    7  A  U N             T        Y  202         
GRDPROGX DS    XL8                                                              
GRDPERNH DS    XL8                                                              
GRDPERN  DS    CL6      6    2    6  A  P H             T        Y              
GRDPERH  DS    XL8                                                              
GRDPER   DS    CL17     6   10   17  A  U N             T        Y              
GRDTSUPH DS    XL8                                                              
GRDTSUP  DS    CL6      6   35    6  A  P Z             T        Y              
GRDTSPH  DS    XL8                                                              
GRDTSP   DS    CL30     6   42   30  A  P Z             T        Y              
GRDOPTNH DS    XL8                                                              
GRDOPTN  DS    CL7      7    2    7  A  P N             T        Y              
GRDOPTH  DS    XL8                                                              
GRDOPT   DS    CL60     7   10   60  A  U N             T        Y  255         
GRDOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   72    1  A  P N             T        Y              
GRDLIN1H DS    XL8                                                              
GRDLIN1  DS    CL78     8    2   78  A  P N             T        Y              
GRDLIN2H DS    XL8                                                              
GRDLIN2  DS    CL78     9    2   78  A  P N             T        Y              
GRDLIN3H DS    XL8                                                              
GRDLIN3  DS    CL78    10    2   78  A  P N             T        Y              
GRDLIN4H DS    XL8                                                              
GRDLIN4  DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
GRDLIN5H DS    XL8                                                              
GRDLIN5  DS    CL78    22    2   78  A  P N             T        Y              
GRDLINLH DS    XL8                                                              
GRDLINL  DS    CL78    23    2   78  A  P N             T        Y              
GRDFOOTH DS    XL8                                                              
GRDFOOT  DS    CL78    24    2   78  A  P H             T        Y              
GRDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
GRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1768 BYTES                            
