*          DATA SET SPTRAF9D   AT LEVEL 013 AS OF 07/10/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216F9D      DATE 07/10/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
TESPCODH DS    CL8                                                              
TESPCOD  DS    CL11     5    2   11   A    P    N         T         Y           
TESCODEH DS    CL8                                                              
TESCODE  DS    CL8      5   15    8   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL1      5   25    1   A    P    N         T         Y           
TESALPHH DS    CL8                                                              
TESALPH  DS    CL8      7    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      7   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      7   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      7   32    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      7   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      7   52    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8   32    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8   52    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9   32    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9   52    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10   32    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10   52    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11   32    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11   52    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12   32    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12   52    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13   32    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13   52    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14   22    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14   32    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    15   12   18   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    15   52   18   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    16   12   18   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    16   52   18   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     17    2    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    17   12   18   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     17   42    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    17   52   10   A    U    N         T         Y           
TESDONEH DS    CL8                                                              
TESDONE  DS    CL1     18    2    1   A    U    N         T         Y           
TESLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TESWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1036 BYTES                            
