*          DATA SET SPTRA4FD   AT LEVEL 001 AS OF 09/22/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T2164FD      DATE 09/22/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P Z             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL3      5   10    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P Z             T        Y              
TRANETH  DS    CL8                                                              
TRANET   DS    CL4      5   29    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P Z             T        Y              
TRAPRGH  DS    CL8                                                              
TRAPRG   DS    CL6      5   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     6    2   16  A  P N             T        Y              
TRATSUPH DS    CL8                                                              
TRATSUP  DS    CL5      6   20    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
TRADESCH DS    CL8                                                              
TRADESC  DS    CL30     8   18   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
TRANAMEH DS    CL8                                                              
TRANAME  DS    CL30     9   18   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   10    1  A  P N             T        Y              
TRAFAXH  DS    CL8                                                              
TRAFAX   DS    CL1     11   12    1  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   14    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   16    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   18    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   24    3  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   28    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   30    4  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    13    2   17  A  P N             T        Y              
TRAIFAXH DS    CL8                                                              
TRAIFAX  DS    CL24    13   20   24  N  U N             T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1     14    2    1  A  U N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 416  BYTES                            
