*          DATA SET SPTRAF3D   AT LEVEL 003 AS OF 03/28/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216F3D      DATE 03/28/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TRAKEYH  DS    XL8                                                              
TRAKEY   DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
TRAPRLNH DS    XL8                                                              
TRAPRLN  DS    CL8      5   46    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TRAPTLNH DS    XL8                                                              
TRAPTLN  DS    CL7      5   64    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   72    4  A  P N             T        Y              
TRACODEH DS    XL8                                                              
TRACODE  DS    CL3      5   77    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
TRAREFH  DS    XL8                                                              
TRAREF   DS    CL5      6   10    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
TRAFLTRH DS    XL8                                                              
TRAFLTR  DS    CL40     6   28   40  A  U N             T        Y              
TRAXXXXH DS    XL8                                                              
TRAXXXX  DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P H             T        Y              
TRADESCH DS    XL8                                                              
TRADESC  DS    CL17     8   14   17  A  U N             T        Y              
TRADELH  DS    XL8                                                              
TRADEL   DS    CL9      8   39    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P H             T        Y              
TRAPERH  DS    XL8                                                              
TRAPER   DS    CL20     9   14   20  A  U N             T        Y              
TRAESTH  DS    XL8                                                              
TRAEST   DS    CL30     9   40   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
TRASTIMH DS    XL8                                                              
TRASTIM  DS    CL5     10   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    10   25   14  A  P N             T        Y              
TRAETIMH DS    XL8                                                              
TRAETIM  DS    CL5     10   40    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    10   48   17  A  P N             T        Y              
TRADLYH  DS    XL8                                                              
TRADLY   DS    CL1     10   67    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
TRADPTH  DS    XL8                                                              
TRADPT   DS    CL1     11   17    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    11   25   14  A  P N             T        Y              
TRATXTH  DS    XL8                                                              
TRATXT   DS    CL7     11   40    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   48   17  A  P N             T        Y              
TRAINVPH DS    XL8                                                              
TRAINVP  DS    CL1     11   67    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  P H             T        Y              
TRALTYH  DS    XL8                                                              
TRALTY   DS    CL2     13    5    2  A  U H             T        Y              
TRAMS1H  DS    XL8                                                              
TRAMS1   DS    CL72    13    8   72  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
TRAMS2H  DS    XL8                                                              
TRAMS2   DS    CL72    14    8   72  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
TRAMS3H  DS    XL8                                                              
TRAMS3   DS    CL72    15    8   72  A  U N             T        Y              
TRADCMLH DS    XL8                                                              
TRADCML  DS    CL75    16    2   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    18    2   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
TRACMLAH DS    XL8                                                              
TRACMLA  DS    CL25    19    5   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   40    1  A  P N             T        Y              
TRACMLBH DS    XL8                                                              
TRACMLB  DS    CL25    19   44   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P N             T        Y              
TRACMLCH DS    XL8                                                              
TRACMLC  DS    CL25    20    5   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   40    1  A  P N             T        Y              
TRACMLDH DS    XL8                                                              
TRACMLD  DS    CL25    20   44   25  A  P N             T        Y              
TRACMORH DS    XL8                                                              
TRACMOR  DS    CL10    20   70   10  A  P N             T        Y              
TRAPTYPH DS    XL8                                                              
TRAPTYP  DS    CL78    22    2   78  A  P N             T        Y              
TRAPFKH  DS    XL8                                                              
TRAPFK   DS    CL78    24    2   78  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=1X                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1336 BYTES                            
