*          DATA SET SPTRCMLCLS AT LEVEL 002 AS OF 06/30/93                      
CLSRECD  DSECT             ******* COMMERCIAL CLASS RECORD *******              
*                                                                               
CLSKEY   DS    0XL13                                                            
CLSKID   DS    X'0A44'             RECORD ID                                    
CLSKAM   DS    XL1                 AGENCY/MEDIA                                 
CLSKCLAS DS    CL4                 CLASS CODE                                   
CLSKCLT  DS    XL2                 CLIENT                                       
CLSKPROD DS    CL3                 PRODUCT (REPLACES CLT LEVEL COMMENT)         
         DS    XL1                                                              
*                                                                               
         DS    XL2                 RECORD LENGTH                                
         DS    XL4                 CONTROL                                      
         DS    XL1                                                              
CLSAGYA  DS    CL2                 AGENCY ALPHA                                 
         DS    XL2                                                              
         SPACE 2                                                                
CLSDSCEL DS    XL1'10'             CLASS DESCRIPTION ELEMENT                    
CLSDSCLN DS    XL1                 ELEMENT LENGTH                               
CLSDESC  DS    CL24                CLASS DESCRIPTION                            
CLSDSLEN EQU   *-CLSDSCEL          CLASS DESCRIPTION                            
