*          DATA SET SPTRADBD   AT LEVEL 013 AS OF 03/22/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216DBD      DATE 03/22/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    CL8                                                              
TRAMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    CL8                                                              
TRACLT   DS    CL4      5   28    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRAPRDH  DS    CL8                                                              
TRAPRD   DS    CL4      5   46    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   56    8  A  P N             T        Y              
TRAESTH  DS    CL8                                                              
TRAEST   DS    CL4      5   65    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
TRAMKTH  DS    CL8                                                              
TRAMKT   DS    CL5      6   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
TRASTAH  DS    CL8                                                              
TRASTA   DS    CL8      6   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
TRADATEH DS    CL8                                                              
TRADATE  DS    CL17     6   46   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TRAFTRH  DS    CL8                                                              
TRAFTR   DS    CL53     7   10   53  A  U N             T        Y              
TRAMESSH DS    CL8                                                              
TRAMESS  DS    CL65     8   10   65  A  P N             T        Y              
TRATAGH  DS    CL8                                                              
TRATAG   DS    CL1      9    2    1  A  P N             T        Y              
TRALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 360  BYTES                            
