*          DATA SET SPTRSAT    AT LEVEL 004 AS OF 05/30/84                      
SATRECD  DSECT             ******* SATELLITE RECORD *******                     
*                                                                               
SATKEY   DS    0XL13                                                            
SATKID   DS    X'0A26'             RECORD ID                                    
SATKAM   DS    XL1                 AGENCY/MEDIA                                 
SATKPRNT DS    CL5                 PARENT STATION                               
SATKSAT  DS    CL5                 SATELLITE STATION                            
*                                                                               
         DS    XL2                 RECORD LENGTH                                
         DS    XL4                 CONTROL                                      
         DS    XL1                                                              
SATAGYA  DS    CL2                 AGENCY ALPHA                                 
         DS    XL2                                                              
*                                                                               
SATDTAEL DS    X'10'               SATELLITE DATA ELEMENT                       
SATDTALN DS    AL1(7)                                                           
SATSAT   DS    CL5                 SATELLITE STATION                            
