*          DATA SET SPTRAD6D   AT LEVEL 002 AS OF 09/13/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216D6D      DATE 09/13/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   29    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRAPRDH  DS    XL8                                                              
TRAPRD   DS    CL4      5   47    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TRAPTRH  DS    XL8                                                              
TRAPTR   DS    CL4      5   64    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P H             T        Y              
TRACONH  DS    XL8                                                              
TRACON   DS    CL16     6   29   16  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      6   56    3  A  P N             T        Y              
TRAFAXH  DS    XL8                                                              
TRAFAX   DS    CL1      6   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
TRAOPTH  DS    XL8                                                              
TRAOPT   DS    CL53     7   10   53  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     9    2   14  A  P N             T        Y              
TRAPOH   DS    XL8                                                              
TRAPO    DS    CL24     9   20   24  A  U N             T        Y              
TRAPDH   DS    XL8                                                              
TRAPD    DS    CL20     9   50   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
TRACMT1H DS    XL8                                                              
TRACMT1  DS    CL58    11   20   58  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
TRACMT2H DS    XL8                                                              
TRACMT2  DS    CL58    12   20   58  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
TRACMT3H DS    XL8                                                              
TRACMT3  DS    CL58    13   20   58  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
TRACMT4H DS    XL8                                                              
TRACMT4  DS    CL58    14   20   58  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P N             T        Y              
TRAHSEH  DS    XL8                                                              
TRAHSE   DS    CL8     16   20    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18    2    6  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL17    19    2   17  A  P Z             T        Y              
TRAPRIH  DS    XL8                                                              
TRAPRI   DS    CL1     19   21    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    19   24   36  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL28    20    2   28  A  P Z             T        Y              
TRAPSRH  DS    XL8                                                              
TRAPSR   DS    CL1     20   32    1  A  P N             T        Y              
TRATBL1H DS    XL8                                                              
TRATBL1  DS    CL50    21    2   50  A  P N             T        Y              
TRATBL2H DS    XL8                                                              
TRATBL2  DS    CL50    22    2   50  A  P N             T        Y              
TRATBL3H DS    XL8                                                              
TRATBL3  DS    CL50    23    2   50  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24    2    1  A  U N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1040 BYTES                            
