*          DATA SET SPTRAF2D   AT LEVEL 001 AS OF 01/19/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216F2D      DATE 01/19/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TRAKEYH  DS    XL8                                                              
TRAKEY   DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   28    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   38    5  A  P H             T        Y              
TRACMLH  DS    XL8                                                              
TRACML   DS    CL13     5   46   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TRAFLTRH DS    XL8                                                              
TRAFLTR  DS    CL30     6   10   30  A  U N             T        Y              
TRAXXXH  DS    XL8                                                              
TRAXXX   DS    CL1      6   45    1  A  P N             T        Y              
TRADELH  DS    XL8                                                              
TRADEL   DS    CL9      6   55    9  A  P H             T        Y              
TRAPTTLH DS    XL8                                                              
TRAPTTL  DS    CL12     7    2   12  A  P H             T        Y              
TRAPLSTH DS    XL8                                                              
TRAPLST  DS    CL37     7   17   37  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     8    2   13  A  P H             T        Y              
TRADSC1H DS    XL8                                                              
TRADSC1  DS    CL15     8   17   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   33    1  A  P N             T        Y              
TRADSC2H DS    XL8                                                              
TRADSC2  DS    CL20     8   35   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   56    1  A  P N             T        Y              
TRADSC3H DS    XL8                                                              
TRADSC3  DS    CL20     8   58   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P H             T        Y              
TRASLNH  DS    XL8                                                              
TRASLN   DS    CL5      9   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   33   11  A  P N             T        Y              
TRAOVRDH DS    XL8                                                              
TRAOVRD  DS    CL6      9   46    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P H             T        Y              
TRARLSEH DS    XL8                                                              
TRARLSE  DS    CL11    10   17   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   33   11  A  P H             T        Y              
TRARCLH  DS    XL8                                                              
TRARCL   DS    CL11    10   46   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P H             T        Y              
TRASTIMH DS    XL8                                                              
TRASTIM  DS    CL6     11   17    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   33   11  A  P H             T        Y              
TRAETIMH DS    XL8                                                              
TRAETIM  DS    CL6     11   46    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   55   17  A  P H             T        Y              
TRADLYH  DS    XL8                                                              
TRADLY   DS    CL1     11   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P H             T        Y              
TRADT1H  DS    XL8                                                              
TRADT1   DS    CL17    12   17   17  A  U N             T        Y              
TRADT2H  DS    XL8                                                              
TRADT2   DS    CL17    12   35   17  A  U N             T        Y              
TRADT3H  DS    XL8                                                              
TRADT3   DS    CL17    12   53   17  A  U N             T        Y              
TRADT4H  DS    XL8                                                              
TRADT4   DS    CL17    13   17   17  A  U N             T        Y              
TRADT5H  DS    XL8                                                              
TRADT5   DS    CL17    13   35   17  A  U N             T        Y              
TRADT6H  DS    XL8                                                              
TRADT6   DS    CL17    13   53   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14    2    4  A  P H             T        Y              
TRATYPEH DS    XL8                                                              
TRATYPE  DS    CL5     14   17    5  A  U N             T        Y              
TRACTXTH DS    XL8                                                              
TRACTXT  DS    CL29    14   45   29  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
TRACLTNH DS    XL8                                                              
TRACLTN  DS    CL20    15   17   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   45   13  A  P N             T        Y              
TRAADIDH DS    XL8                                                              
TRAADID  DS    CL20    15   59   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
TRASOLOH DS    XL8                                                              
TRASOLO  DS    CL9     16   17    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   31   12  A  P N             T        Y              
TRAHDEFH DS    XL8                                                              
TRAHDEF  DS    CL12    16   45   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   59   12  A  P N             T        Y              
TRATTEXH DS    XL8                                                              
TRATTEX  DS    CL2     16   73    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  A  P N             T        Y              
TRAPRNTH DS    XL8                                                              
TRAPRNT  DS    CL12    17   17   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   31   12  A  P N             T        Y              
TRACNTRH DS    XL8                                                              
TRACNTR  DS    CL12    17   45   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   59   10  A  P N             T        Y              
TRATELH  DS    XL8                                                              
TRATEL   DS    CL8     17   71    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  P N             T        Y              
TRACLSH  DS    XL8                                                              
TRACLS   DS    CL50    18   17   50  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
TRAPRHSH DS    XL8                                                              
TRAPRHS  DS    CL6     19   17    6  A  U N             T        Y              
TRAPHNMH DS    XL8                                                              
TRAPHNM  DS    CL24    19   31   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
TRADSDTH DS    XL8                                                              
TRADSDT  DS    CL8     20   17    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   31   12  A  P N             T        Y              
TRADSTMH DS    XL8                                                              
TRADSTM  DS    CL5     20   45    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20   55    7  A  P N             T        Y              
TRASWAPH DS    XL8                                                              
TRASWAP  DS    CL1     20   64    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21    2   10  A  P N             T        Y              
TRAACT1H DS    XL8                                                              
TRAACT1  DS    CL12    21   13   12  A  U N             T        Y              
TRAACT2H DS    XL8                                                              
TRAACT2  DS    CL12    21   26   12  A  U N             T        Y              
TRAACT3H DS    XL8                                                              
TRAACT3  DS    CL12    21   39   12  A  U N             T        Y              
TRAACT4H DS    XL8                                                              
TRAACT4  DS    CL12    21   52   12  A  U N             T        Y              
TRATYPLH DS    XL8                                                              
TRATYPL  DS    CL75    22    2   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    23    2   75  A  P N             T        Y              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     23   79    1  A  P N             T        Y              
TRAPFKH  DS    XL8                                                              
TRAPFK   DS    CL75    24    2   75  A  P N             T        Y              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
