*          DATA SET SPTRDPEQV  AT LEVEL 005 AS OF 01/14/86                      
DPERECD  DSECT             ******* DAYPART EQUIVALENCY RECORD *******           
*                                                                               
DPEKEY   DS    0XL13                                                            
DPEKID   DS    XL2'0A34'           RECORD ID                                    
DPEKAM   DS    XL1                 AGENCY/MEDIA                                 
DPEKCLT  DS    XL2                 CLIENT                                       
         DS    CL3     RESERVED (POSSIBLE PRODUCT)                              
DPEKEST  DS    XL1                 ESTIMATE                                     
         DS    XL4                                                              
*                                                                               
         DS    XL2                 RECORD LENGTH                                
         DS    XL4                 CONTROL                                      
         DS    XL1                                                              
DPEAGYA  DS    CL2                 AGENCY ALPHA                                 
         DS    XL2                                                              
         SPACE 2                                                                
DPEDTAEL DS    X'10'               ADDRESS DATA ELEMENT                         
DPEDTALN DS    AL1(DPEDTLEN)       ELEMENT LENGTH                               
DPEDPCDE DS    CL1                 DAYPART CODE                                 
DPEQVCDE DS    CL1                 EQUIVALENCY CODE                             
         DS    CL4                 SPARE                                        
DPEDTLEN EQU   *-DPEDTAEL          ELEMENT LENGTH                               
