*          DATA SET SPTRAB3D   AT LEVEL 006 AS OF 06/16/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T216B3D      DATE 06/16/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
TRAMEDH  DS    XL8                                                              
TRAMED   DS    CL2      5   10    2  A  U H             T        Y    1         
TRAMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
TRACLTH  DS    XL8                                                              
TRACLT   DS    CL4      5   28    4  A  U H             T        Y    2         
TRACLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
TRAIDH   DS    XL8                                                              
TRAID    DS    CL11     5   46   11  A  U H             T        Y    3         
TRAIDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   59    4  A  P N             T        Y              
TRAPGH   DS    XL8                                                              
TRAPG    DS    CL2      5   67    2  A  U N             T        Y    4         
TRAPGX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   68    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
TRATLEH  DS    XL8                                                              
TRATLE   DS    CL24     7   11   24  A  U N             T        Y    5         
TRATLEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
TRAL01H  DS    XL8                                                              
TRAL01   DS    CL58     8   11   58  A  U N             T        N    6         
TRAL01X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      9    7    2  A  P N             T        Y              
TRAL02H  DS    XL8                                                              
TRAL02   DS    CL58     9   11   58  A  U N             T        N    7         
TRAL02X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     10    7    2  A  P N             T        Y              
TRAL03H  DS    XL8                                                              
TRAL03   DS    CL58    10   11   58  A  U N             T        N    8         
TRAL03X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     11    7    2  A  P N             T        Y              
TRAL04H  DS    XL8                                                              
TRAL04   DS    CL58    11   11   58  A  U N             T        N    9         
TRAL04X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     12    7    2  A  P N             T        Y              
TRAL05H  DS    XL8                                                              
TRAL05   DS    CL58    12   11   58  A  U N             T        N   10         
TRAL05X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     13    7    2  A  P N             T        Y              
TRAL06H  DS    XL8                                                              
TRAL06   DS    CL58    13   11   58  A  U N             T        N   11         
TRAL06X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14    7    2  A  P N             T        Y              
TRAL07H  DS    XL8                                                              
TRAL07   DS    CL58    14   11   58  A  U N             T        N   12         
TRAL07X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15    7    2  A  P N             T        Y              
TRAL08H  DS    XL8                                                              
TRAL08   DS    CL58    15   11   58  A  U N             T        N   13         
TRAL08X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    7    2  A  P N             T        Y              
TRAL09H  DS    XL8                                                              
TRAL09   DS    CL58    16   11   58  A  U N             T        N   14         
TRAL09X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17    7    2  A  P N             T        Y              
TRAL10H  DS    XL8                                                              
TRAL10   DS    CL58    17   11   58  A  U N             T        N   15         
TRAL10X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    7    2  A  P N             T        Y              
TRAL11H  DS    XL8                                                              
TRAL11   DS    CL58    18   11   58  A  U N             T        N   16         
TRAL11X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19    7    2  A  P N             T        Y              
TRAL12H  DS    XL8                                                              
TRAL12   DS    CL58    19   11   58  A  U N             T        N   17         
TRAL12X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    7    2  A  P N             T        Y              
TRAL13H  DS    XL8                                                              
TRAL13   DS    CL58    20   11   58  A  U N             T        N   18         
TRAL13X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21    7    2  A  P N             T        Y              
TRAL14H  DS    XL8                                                              
TRAL14   DS    CL58    21   11   58  A  U N             T        N   19         
TRAL14X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22    7    2  A  P N             T        Y              
TRAL15H  DS    XL8                                                              
TRAL15   DS    CL58    22   11   58  A  U N             T        N   20         
TRAL15X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     23    7    2  A  P N             T        Y              
TRAL16H  DS    XL8                                                              
TRAL16   DS    CL58    23   11   58  A  U N             T        N   21         
TRAL16X  DS    XL8                                                              
TRATAGH  DS    XL8                                                              
TRATAG   DS    CL1     23   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    24    4   26  A  P N             T        Y              
TRACKSH  DS    XL8                                                              
TRACKS   DS    CL8     24   35    8  A  U N             T        Y   22         
TRACKSX  DS    XL8                                                              
TRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
