*          DATA SET SPTSTFFDS  AT LEVEL 002 AS OF 12/13/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T21FFFD      DATE 12/13/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DEMMSGH  DS    CL8                                                              
DEMMSG   DS    CL60     1    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     2    2   12  A  P N             T        Y              
DEMREPTH DS    CL8                                                              
DEMREPT  DS    CL8      2   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     3    2   12  A  P N             T        Y              
DEMFUNCH DS    CL8                                                              
DEMFUNC  DS    CL8      3   15    8  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL12     4    2   12  A  P N             T        Y              
DEMFILEH DS    CL8                                                              
DEMFILE  DS    CL8      4   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     4   25   12  A  P N             T        Y              
DEMMEDH  DS    CL8                                                              
DEMMED   DS    CL8      4   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     4   48   12  A  P N             T        Y              
DEMSRCH  DS    CL8                                                              
DEMSRC   DS    CL8      4   61    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     5    2   12  A  P N             T        Y              
DEMSTAH  DS    CL8                                                              
DEMSTA   DS    CL5      5   15    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     5   25   12  A  P N             T        Y              
DEMSTYPH DS    CL8                                                              
DEMSTYP  DS    CL1      5   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     5   48   12  A  P N             T        Y              
DEMAMKTH DS    CL8                                                              
DEMAMKT  DS    CL4      5   61    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6    2   12  A  P N             T        Y              
DEMRMKTH DS    CL8                                                              
DEMRMKT  DS    CL4      6   15    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6   25   12  A  P N             T        Y              
DEMKMKTH DS    CL8                                                              
DEMKMKT  DS    CL5      6   38    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6   48   12  A  P N             T        Y              
DEMUMKTH DS    CL8                                                              
DEMUMKT  DS    CL4      6   61    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
DEMPROGH DS    CL8                                                              
DEMPROG  DS    CL5      7   15    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   25   12  A  P N             T        Y              
DEMINVH  DS    CL8                                                              
DEMINV   DS    CL4      7   40    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
DEMPUREH DS    CL8                                                              
DEMPURE  DS    CL4      8   15    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
DEMBOOKH DS    CL8                                                              
DEMBOOK  DS    CL6      9   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   25   12  A  P N             T        Y              
DEMBTYPH DS    CL8                                                              
DEMBTYP  DS    CL1      9   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
DEMB1WKH DS    CL8                                                              
DEMB1WK  DS    CL8     10   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   25   12  A  P N             T        Y              
DEMBWKNH DS    CL8                                                              
DEMBWKN  DS    CL3     10   38    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
DEMBLIMH DS    CL8                                                              
DEMBLIM  DS    CL6     11   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
DEMAGYH  DS    CL8                                                              
DEMAGY   DS    CL2     12   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   25   12  A  P N             T        Y              
DEMCLIH  DS    CL8                                                              
DEMCLI   DS    CL3     12   38    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
DEMDAYSH DS    CL8                                                              
DEMDAYS  DS    CL16    13   15   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
DEMTIMSH DS    CL8                                                              
DEMTIMS  DS    CL16    14   15   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
DEMBESTH DS    CL8                                                              
DEMBEST  DS    CL1     15   15    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
DEMTPTTH DS    CL8                                                              
DEMTPTT  DS    CL1     16   15    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17    2   12  A  P N             T        Y              
DEMDEMOH DS    CL8                                                              
DEMDEMO  DS    CL50    17   15   50  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
DEMPRNTH DS    CL8                                                              
DEMPRNT  DS    CL1     18   15    1  A  U N             T        Y   25         
DEMPRNTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    18   25   11  A  P N             T        Y              
DEMEFLTH DS    CL8                                                              
DEMEFLT  DS    CL20    18   38   20  A  U N             T        Y   26         
DEMEFLTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19    2   11  A  P N             T        Y              
DEMTAPEH DS    CL8                                                              
DEMTAPE  DS    CL1     19   15    1  A  U N             T        Y   25         
DEMTAPEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19   25    9  A  P N             T        Y              
DEMPTTH  DS    CL8                                                              
DEMPTT   DS    CL1     19   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   25   11  A  P N             T        Y              
DEMIUNFH DS    CL8                                                              
DEMIUNF  DS    CL20    20   38   20  A  U N             T        Y   27         
DEMIUNFX DS    CL8                                                              
DEMTABH  DS    CL8                                                              
DEMTAB   DS    CL1     20   78    1  A  U N             T        Y              
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1232 BYTES                            
