*          DATA SET SPTSAFFD   AT LEVEL 002 AS OF 12/09/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T20FFFD      DATE 12/09/83                 
         SPACE 1                                                                
T20FFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
TSAMSGH  DS    CL8                                                              
TSAMSG   DS    CL60     1    2   60   A    P    N         T         Y           
TSAIDH   DS    CL8                                                              
TSAID    DS    CL17     1   63   17   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL6      3    2    6   A    P    N         T         Y           
TSAACTH  DS    CL8                                                              
TSAACT   DS    CL3      3   10    3   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL5      4    2    5   A    P    N         T         Y           
TSAMEDH  DS    CL8                                                              
TSAMED   DS    CL1      4   10    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5    2    7   A    P    N         T         Y           
TSASTAH  DS    CL8                                                              
TSASTA   DS    CL4      5   10    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      6    2    4   A    P    N         T         Y           
TSABANDH DS    CL8                                                              
TSABAND  DS    CL1      6   10    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12     8    2   12   A    P    N         T         Y           
TSASNMEH DS    CL8                                                              
TSASNME  DS    CL20     8   17   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14     9    2   14   A    P    N         T         Y           
TSASTH   DS    CL8                                                              
TSAST    DS    CL24     9   17   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4     10    2    4   A    P    N         T         Y           
TSACITYH DS    CL8                                                              
TSACITY  DS    CL24    10   17   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     11    2    5   A    P    N         T         Y           
TSASTATH DS    CL8                                                              
TSASTAT  DS    CL2     11   17    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12    2    8   A    P    N         T         Y           
TSAZIPH  DS    CL8                                                              
TSAZIP   DS    CL5     12   17    5   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13    2    1   A    U    N         T         Y           
TSALAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
TSAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 398  BYTES                            
