*          DATA SET SPWRIF2D   AT LEVEL 005 AS OF 10/24/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204F2D      DATE 10/24/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
ESTRFLH  DS    XL8                                                              
ESTRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
ESTRFLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
ESTMEDH  DS    XL8                                                              
ESTMED   DS    CL1      7   10    1  A  U N             T        Y   10         
ESTMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
ESTCLTH  DS    XL8                                                              
ESTCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
ESTCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
ESTPRDH  DS    XL8                                                              
ESTPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
ESTPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
ESTESTH  DS    XL8                                                              
ESTEST   DS    CL9      7   64    9  A  U N             T        Y   16         
ESTESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P H             T        Y              
ESTDATH  DS    XL8                                                              
ESTDAT   DS    CL9      9   20    9  A  U N             T        Y   18         
ESTDATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    10    2   17  A  P H             T        Y              
ESTIG1H  DS    XL8                                                              
ESTIG1   DS    CL1     10   20    1  A  U N             T        Y   22         
ESTIG1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    11    2   17  A  P H             T        Y              
ESTIG2H  DS    XL8                                                              
ESTIG2   DS    CL1     11   20    1  A  U N             T        Y   24         
ESTIG2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P H             T        Y              
ESTALLH  DS    XL8                                                              
ESTALL   DS    CL1     12   20    1  A  U N             T        Y   26         
ESTALLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P H             T        Y              
ESTOPTH  DS    XL8                                                              
ESTOPT   DS    CL60    13   20   60  A  U N             T        Y   28         
ESTOPTX  DS    XL8                                                              
ESTDOKLH DS    XL8                                                              
ESTDOKL  DS    CL15    14    2   15  A  P Z             T        Y              
ESTDOKH  DS    XL8                                                              
ESTDOK   DS    CL1     14   20    1  A  P Z             T        Y   30         
ESTDOKX  DS    XL8                                                              
ESTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 568  BYTES                            
