*          DATA SET SPWRIF4D   AT LEVEL 001 AS OF 06/19/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204F4D      DATE 06/19/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A   P    N         T        Y              
FTPRFLH  DS    CL8                                                              
FTPRFL   DS    CL4      5   64    4  A   U    N         T        Y    8         
FTPRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A   P    H         T        Y              
FTPMEDH  DS    CL8                                                              
FTPMED   DS    CL1      7   10    1  A   U    N         T        Y   10         
FTPMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A   P    H         T        Y              
FTPCLTH  DS    CL8                                                              
FTPCLT   DS    CL8      7   28    8  A   U    N         T        Y   12         
FTPCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A   P    H         T        Y              
FTPPRDH  DS    CL8                                                              
FTPPRD   DS    CL8      7   46    8  A   U    N         T        Y   14         
FTPPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A   P    H         T        Y              
FTPESTH  DS    CL8                                                              
FTPEST   DS    CL9      7   64    9  A   U    N         T        Y   16         
FTPESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    H         T        Y              
FTPOPTH  DS    CL8                                                              
FTPOPT   DS    CL60     8   20   60  A   U    N         T        Y   28         
FTPOPTX  DS    CL8                                                              
FTPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
FTPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 360  BYTES                            
