*          DATA SET SPWRIE7D   AT LEVEL 001 AS OF 09/25/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204E7D      DATE 09/25/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
PNGRFLH  DS    XL8                                                              
PNGRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
PNGRFLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
PNGMEDH  DS    XL8                                                              
PNGMED   DS    CL1      7   10    1  A  U N             T        Y   10         
PNGMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
PNGCLTH  DS    XL8                                                              
PNGCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
PNGCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
PNGPRDH  DS    XL8                                                              
PNGPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
PNGPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
PNGESTH  DS    XL8                                                              
PNGEST   DS    CL9      7   64    9  A  U N             T        Y   16         
PNGESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
PNGMKTH  DS    XL8                                                              
PNGMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
PNGMKTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
PNGSTAH  DS    XL8                                                              
PNGSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
PNGSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
PNGPERH  DS    XL8                                                              
PNGPER   DS    CL17     8   46   17  A  U N             T        Y   22         
PNGPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
PNGFLTH  DS    XL8                                                              
PNGFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
PNGFLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PNGOPTH  DS    XL8                                                              
PNGOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
PNGOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
PNGOTHH  DS    XL8                                                              
PNGOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
PNGOTHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
PNGPCTH  DS    XL8                                                              
PNGPCT   DS    CL1     13   20    1  A  U N             T        Y   36         
PNGPCTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
PNGCOMH  DS    XL8                                                              
PNGCOM   DS    CL1     14   20    1  A  U N             T        Y   38         
PNGCOMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
PNGTITH  DS    XL8                                                              
PNGTIT   DS    CL60    16   20   60  A  U N             T        Y   60         
PNGTITX  DS    XL8                                                              
PNGLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PNGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
