*          DATA SET SPWRIF5D   AT LEVEL 005 AS OF 12/07/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204F5D      DATE 12/07/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
SCJRFLH  DS    XL8                                                              
SCJRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
SCJRFLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SCJMEDH  DS    XL8                                                              
SCJMED   DS    CL1      7   10    1  A  U N             T        Y   10         
SCJMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
SCJCLTH  DS    XL8                                                              
SCJCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
SCJCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
SCJPRDH  DS    XL8                                                              
SCJPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
SCJPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
SCJESTH  DS    XL8                                                              
SCJEST   DS    CL9      7   64    9  A  U N             T        Y   16         
SCJESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SCJMKTH  DS    XL8                                                              
SCJMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
SCJMKTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
SCJSTAH  DS    XL8                                                              
SCJSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
SCJSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
SCJPERH  DS    XL8                                                              
SCJPER   DS    CL17     8   46   17  A  U N             T        Y   22         
SCJPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
SCJFLTH  DS    XL8                                                              
SCJFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
SCJFLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SCJOPTH  DS    XL8                                                              
SCJOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
SCJOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
SCJOTHH  DS    XL8                                                              
SCJOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
SCJOTHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     24    2    5  A  P N             T        Y              
SCJTITH  DS    XL8                                                              
SCJTIT   DS    CL27    24   10   27  A  P N             T        Y   60         
SCJTITX  DS    XL8                                                              
SCJLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SCJWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 752  BYTES                            
