*          DATA SET SPWRIB6D   AT LEVEL 005 AS OF 03/20/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204B6D      DATE 03/20/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
REXRFLH  DS    XL8                                                              
REXRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
REXRFLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
REXMEDH  DS    XL8                                                              
REXMED   DS    CL1      7   10    1  A  U N             T        Y   10         
REXMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
REXCLTH  DS    XL8                                                              
REXCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
REXCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
REXPRDH  DS    XL8                                                              
REXPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
REXPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
REXESTH  DS    XL8                                                              
REXEST   DS    CL9      7   64    9  A  U N             T        Y   16         
REXESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
REXMKTH  DS    XL8                                                              
REXMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
REXMKTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
REXSTAH  DS    XL8                                                              
REXSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
REXSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
REXPERH  DS    XL8                                                              
REXPER   DS    CL17     8   46   17  A  U N             T        Y   22         
REXPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
REXFLTH  DS    XL8                                                              
REXFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
REXFLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
REXOPTH  DS    XL8                                                              
REXOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
REXOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
REXOTHH  DS    XL8                                                              
REXOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
REXOTHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL25    13    2   25  A  P N             T        Y              
REXDSBH  DS    XL8                                                              
REXDSB   DS    CL1     13   29    1  A  U N             T        Y   36         
REXDSBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
REXBFH   DS    XL8                                                              
REXBF    DS    CL1     14   29    1  A  U N             T        Y   38         
REXBFX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     24    2    5  A  P N             T        Y              
REXTITH  DS    XL8                                                              
REXTIT   DS    CL63    24   10   63  A  U N             T        Y   60         
REXTITX  DS    XL8                                                              
REXLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
REXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 880  BYTES                            
