*          DATA SET SPWRIF1D   AT LEVEL 003 AS OF 11/28/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204F1D      DATE 11/28/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
WRINAMH  DS    XL8                                                              
WRINAM   DS    CL8      5   10    8  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
WRIDESCH DS    XL8                                                              
WRIDESC  DS    CL27     5   28   27  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
WRIRFLH  DS    XL8                                                              
WRIRFL   DS    CL4      5   64    4  A  U Z             T        Y    8         
WRIRFLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
WRIMEDH  DS    XL8                                                              
WRIMED   DS    CL1      7   10    1  A  U N             T        Y   10         
WRIMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
WRICLTH  DS    XL8                                                              
WRICLT   DS    CL8      7   28    8  A  U N             T        Y   12         
WRICLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
WRIPRDH  DS    XL8                                                              
WRIPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
WRIPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
WRIESTH  DS    XL8                                                              
WRIEST   DS    CL9      7   64    9  A  U N             T        Y   16         
WRIESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
WRIMKTH  DS    XL8                                                              
WRIMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
WRIMKTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
WRISTAH  DS    XL8                                                              
WRISTA   DS    CL8      8   28    8  A  U N             T        Y   20         
WRISTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
WRIPERH  DS    XL8                                                              
WRIPER   DS    CL17     8   46   17  A  U N             T        Y   22         
WRIPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
WRIFLTH  DS    XL8                                                              
WRIFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
WRIFLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
WRIOPTH  DS    XL8                                                              
WRIOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
WRIOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
WRIOTHH  DS    XL8                                                              
WRIOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
WRIOTHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
WRIHEADH DS    XL8                                                              
WRIHEAD  DS    CL20    12   10   20  A  U N             T        Y   40         
WRIHEADX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    12   34   20  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    12   59   20  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    13   10   20  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    13   34   20  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    13   59   20  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
WRIMIDH  DS    XL8                                                              
WRIMID   DS    CL20    14   10   20  A  U N             T        Y   43         
WRIMIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P H             T        Y              
WRIROWSH DS    XL8                                                              
WRIROWS  DS    CL20    15   10   20  A  U N             T        Y   44         
WRIROWSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    15   34   20  A  U N             T        Y   44         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    15   59   20  A  U N             T        Y   44         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    16   10   20  A  U N             T        Y   44         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    16   34   20  A  U N             T        Y   44         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    16   59   20  A  U N             T        Y   44         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     17    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     17   10    1  A  P N             T        Y              
WRICOLSH DS    XL8                                                              
WRICOLS  DS    CL32    17   12   32  A  U N             T        Y   50         
WRICOLSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    17   47   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   10    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    18   12   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    18   47   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   10    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    19   12   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    19   47   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   10    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    20   12   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    20   47   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   10    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    21   12   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    21   47   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   10    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    22   12   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    22   47   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     23   10    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    23   12   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     23   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    23   47   32  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     24    2    7  A  P N             T        Y              
WRITITH  DS    XL8                                                              
WRITIT   DS    CL63    24   10   63  A  U N             T        Y   60         
WRITITX  DS    XL8                                                              
WRILAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
WRIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2120 BYTES                            
