*          DATA SET SPWRID9D   AT LEVEL 010 AS OF 01/26/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204D9D      DATE 01/26/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
HDBRFLH  DS    CL8                                                              
HDBRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
HDBRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
HDBMEDH  DS    CL8                                                              
HDBMED   DS    CL1      7   10    1  A  U N             T        Y   10         
HDBMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
HDBCLTH  DS    CL8                                                              
HDBCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
HDBCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
HDBPRDH  DS    CL8                                                              
HDBPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
HDBPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
HDBESTH  DS    CL8                                                              
HDBEST   DS    CL9      7   64    9  A  U N             T        Y   16         
HDBESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
HDBMKTH  DS    CL8                                                              
HDBMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
HDBMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
HDBSTAH  DS    CL8                                                              
HDBSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
HDBSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
HDBPERH  DS    CL8                                                              
HDBPER   DS    CL17     8   46   17  A  U N             T        Y   22         
HDBPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
HDBFLTH  DS    CL8                                                              
HDBFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
HDBFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
HDBOPTH  DS    CL8                                                              
HDBOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
HDBOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
HDBOTHH  DS    CL8                                                              
HDBOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
HDBOTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL23    13    2   23  A  P N             T        Y              
HDBCPSH  DS    CL8                                                              
HDBCPS   DS    CL1     13   28    1  A  U N             T        Y   36         
HDBCPSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    14    2   20  A  P N             T        Y              
HDBDUBH  DS    CL8                                                              
HDBDUB   DS    CL1     14   28    1  A  U N             T        Y   38         
HDBDUBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    15    2   21  A  P N             T        Y              
HDBSDCH  DS    CL8                                                              
HDBSDC   DS    CL1     15   28    1  A  U N             T        Y   40         
HDBSDCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    16    2   18  A  P N             T        Y              
HDBPMRH  DS    CL8                                                              
HDBPMR   DS    CL1     16   28    1  A  U N             T        Y   42         
HDBPMRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    17    2   20  A  P N             T        Y              
HDBPDVH  DS    CL8                                                              
HDBPDV   DS    CL1     17   28    1  A  U N             T        Y   43         
HDBPDVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    18    2   20  A  P N             T        Y              
HDBPIRH  DS    CL8                                                              
HDBPIR   DS    CL1     18   28    1  A  U N             T        Y   44         
HDBPIRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
HDBPBLH  DS    CL8                                                              
HDBPBL   DS    CL1     19   28    1  A  U N             T        Y   45         
HDBPBLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    20    2   25  A  P N             T        Y              
HDBDPDH  DS    CL8                                                              
HDBDPD   DS    CL8     20   28    8  A  U N             T        Y   46         
HDBDPDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    21    2   12  A  P N             T        Y              
HDBINDH  DS    CL8                                                              
HDBIND   DS    CL8     21   28    8  A  U N             T        Y   48         
HDBINDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    22    2   25  A  P N             T        Y              
HDBGSTH  DS    CL8                                                              
HDBGST   DS    CL2     22   28    2  A  U N             T        Y   49         
HDBGSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    22   40   10  A  P N             T        Y              
HDBLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HDBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1168 BYTES                            
