*          DATA SET SPWRIE8D   AT LEVEL 002 AS OF 03/25/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204E8D      DATE 03/25/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A   P    N         T        Y              
ATTRFLH  DS    CL8                                                              
ATTRFL   DS    CL4      5   64    4  A   U    N         T        Y    8         
ATTRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A   P    H         T        Y              
ATTMEDH  DS    CL8                                                              
ATTMED   DS    CL1      7   10    1  A   U    N         T        Y   10         
ATTMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A   P    H         T        Y              
ATTCLTH  DS    CL8                                                              
ATTCLT   DS    CL8      7   28    8  A   U    N         T        Y   12         
ATTCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A   P    H         T        Y              
ATTPRDH  DS    CL8                                                              
ATTPRD   DS    CL8      7   46    8  A   U    N         T        Y   14         
ATTPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A   P    H         T        Y              
ATTESTH  DS    CL8                                                              
ATTEST   DS    CL9      7   64    9  A   U    N         T        Y   16         
ATTESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    H         T        Y              
ATTMKTH  DS    CL8                                                              
ATTMKT   DS    CL9      8   10    9  A   U    N         T        Y   18         
ATTMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A   P    H         T        Y              
ATTSTAH  DS    CL8                                                              
ATTSTA   DS    CL7      8   28    7  A   U    N         T        Y   20         
ATTSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A   P    H         T        Y              
ATTPERH  DS    CL8                                                              
ATTPER   DS    CL17     8   46   17  A   U    N         T        Y   22         
ATTPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A   P    N         T        Y              
ATTFLTH  DS    CL8                                                              
ATTFLT   DS    CL70     9   10   70  A   U    N         T        Y   30         
ATTFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
ATTOPTH  DS    CL8                                                              
ATTOPT   DS    CL70    10   10   70  A   U    N         T        Y   32         
ATTOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A   P    N         T        Y              
ATTOTHH  DS    CL8                                                              
ATTOTH   DS    CL70    11   10   70  A   U    N         T        Y   34         
ATTOTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
ATTTITH  DS    CL8                                                              
ATTTIT   DS    CL60    13   20   60  A   U    N         T        Y   60         
ATTTITX  DS    CL8                                                              
ATTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ATTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 784  BYTES                            
