*          DATA SET SPWRID1D   AT LEVEL 005 AS OF 01/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204D1D      DATE 01/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
DORRFLH  DS    CL8                                                              
DORRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
DORRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
DORMEDH  DS    CL8                                                              
DORMED   DS    CL1      7   10    1  A  U N             T        Y   10         
DORMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
DORCLTH  DS    CL8                                                              
DORCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
DORCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
DORPRDH  DS    CL8                                                              
DORPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
DORPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
DORESTH  DS    CL8                                                              
DOREST   DS    CL9      7   64    9  A  U N             T        Y   16         
DORESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
DORMKTH  DS    CL8                                                              
DORMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
DORMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
DORSTAH  DS    CL8                                                              
DORSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
DORSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
DORPERH  DS    CL8                                                              
DORPER   DS    CL17     8   46   17  A  U N             T        Y   22         
DORPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
DORFLTH  DS    CL8                                                              
DORFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
DORFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
DOROPTH  DS    CL8                                                              
DOROPT   DS    CL70    10   10   70  A  U N             T        Y   32         
DOROPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
DOROTHH  DS    CL8                                                              
DOROTH   DS    CL70    11   10   70  A  U N             T        Y   34         
DOROTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
DORBYCH  DS    CL8                                                              
DORBYC   DS    CL3     13   20    3  A  U N             T        Y   36         
DORBYCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
DORBYNH  DS    CL8                                                              
DORBYN   DS    CL12    14   20   12  A  U N             T        Y   38         
DORBYNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
DORCAMH  DS    CL8                                                              
DORCAM   DS    CL5     15   20    5  A  U N             T        Y   40         
DORCAMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    16    2   15  A  P N             T        Y              
DORCVEH  DS    CL8                                                              
DORCVE   DS    CL3     16   20    3  A  U N             T        Y   42         
DORCVEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    17    2   16  A  P N             T        Y              
DORPVEH  DS    CL8                                                              
DORPVE   DS    CL3     17   20    3  A  U N             T        Y   44         
DORPVEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    18    2   13  A  P N             T        Y              
DORPDTH  DS    CL8                                                              
DORPDT   DS    CL8     18   20    8  A  U N             T        Y   46         
DORPDTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    19    2   14  A  P N             T        Y              
DORLPPH  DS    CL8                                                              
DORLPP   DS    CL2     19   20    2  A  U N             T        Y   48         
DORLPPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    20    2   14  A  P N             T        Y              
DORDLYH  DS    CL8                                                              
DORDLY   DS    CL1     20   20    1  A  U N             T        Y   49         
DORDLYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     22    2    5  A  P N             T        Y              
DORTITH  DS    CL8                                                              
DORTIT   DS    CL60    22   20   60  A  U N             T        Y   50         
DORTITX  DS    CL8                                                              
DORLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DORWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1112 BYTES                            
