*          DATA SET SPWRIEAD   AT LEVEL 007 AS OF 01/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204EAD      DATE 01/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
SBSRFLH  DS    CL8                                                              
SBSRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
SBSRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SBSMEDH  DS    CL8                                                              
SBSMED   DS    CL1      7   10    1  A  U N             T        Y   10         
SBSMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
SBSCLTH  DS    CL8                                                              
SBSCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
SBSCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
SBSPRDH  DS    CL8                                                              
SBSPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
SBSPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
SBSESTH  DS    CL8                                                              
SBSEST   DS    CL9      7   64    9  A  U N             T        Y   16         
SBSESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SBSMKTH  DS    CL8                                                              
SBSMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
SBSMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
SBSSTAH  DS    CL8                                                              
SBSSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
SBSSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
SBSPERH  DS    CL8                                                              
SBSPER   DS    CL17     8   46   17  A  U N             T        Y   22         
SBSPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
SBSFLTH  DS    CL8                                                              
SBSFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
SBSFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SBSOPTH  DS    CL8                                                              
SBSOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
SBSOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
SBSOTHH  DS    CL8                                                              
SBSOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
SBSOTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
SBSRPTH  DS    CL8                                                              
SBSRPT   DS    CL1     13   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    13   20   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    14   20   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15    2    4  A  P N             T        Y              
SBSDATH  DS    CL8                                                              
SBSDAT   DS    CL1     15   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    15   20   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    16   20   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
SBSPACH  DS    CL8                                                              
SBSPAC   DS    CL1     17   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   20   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    18   20   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    2    7  A  P N             T        Y              
SBSTITH  DS    CL8                                                              
SBSTIT   DS    CL60    20   20   60  A  U N             T        Y   60         
SBSTITX  DS    CL8                                                              
SBSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SBSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1264 BYTES                            
