*          DATA SET SPWRIDAD   AT LEVEL 001 AS OF 09/21/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204DAD      DATE 09/21/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
SCIRFLH  DS    CL8                                                              
SCIRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
SCIRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SCIMEDH  DS    CL8                                                              
SCIMED   DS    CL1      7   10    1  A  U N             T        Y   10         
SCIMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
SCICLTH  DS    CL8                                                              
SCICLT   DS    CL8      7   28    8  A  U N             T        Y   12         
SCICLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
SCIPRDH  DS    CL8                                                              
SCIPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
SCIPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
SCIESTH  DS    CL8                                                              
SCIEST   DS    CL9      7   64    9  A  U N             T        Y   16         
SCIESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SCIMKTH  DS    CL8                                                              
SCIMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
SCIMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
SCISTAH  DS    CL8                                                              
SCISTA   DS    CL8      8   28    8  A  U N             T        Y   20         
SCISTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
SCIPERH  DS    CL8                                                              
SCIPER   DS    CL17     8   46   17  A  U N             T        Y   22         
SCIPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
SCIFLTH  DS    CL8                                                              
SCIFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
SCIFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SCIOPTH  DS    CL8                                                              
SCIOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
SCIOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
SCIOTHH  DS    CL8                                                              
SCIOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
SCIOTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    13    2   13  A  P N             T        Y              
SCITAPH  DS    CL8                                                              
SCITAP   DS    CL1     13   20    1  A  U N             T        Y   36         
SCITAPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
SCITITH  DS    CL8                                                              
SCITIT   DS    CL29    15   20   29  A  U N             T        Y   50         
SCITITX  DS    CL8                                                              
SCILAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SCIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 792  BYTES                            
