*          DATA SET SPWRIEDD   AT LEVEL 002 AS OF 01/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204EDD      DATE 01/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
PCDRFLH  DS    CL8                                                              
PCDRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
PCDRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
PCDMEDH  DS    CL8                                                              
PCDMED   DS    CL1      7   10    1  A  U N             T        Y   10         
PCDMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
PCDCLTH  DS    CL8                                                              
PCDCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
PCDCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
PCDPRDH  DS    CL8                                                              
PCDPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
PCDPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
PCDESTH  DS    CL8                                                              
PCDEST   DS    CL9      7   64    9  A  U N             T        Y   16         
PCDESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
PCDMKTH  DS    CL8                                                              
PCDMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
PCDMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
PCDSTAH  DS    CL8                                                              
PCDSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
PCDSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
PCDPERH  DS    CL8                                                              
PCDPER   DS    CL17     8   46   17  A  U N             T        Y   22         
PCDPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
PCDFLTH  DS    CL8                                                              
PCDFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
PCDFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PCDOPTH  DS    CL8                                                              
PCDOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
PCDOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
PCDOTHH  DS    CL8                                                              
PCDOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
PCDOTHX  DS    CL8                                                              
PCDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PCDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 696  BYTES                            
