*          DATA SET SPWRIEFD   AT LEVEL 004 AS OF 11/01/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204EFD      DATE 11/01/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  L   P    N         T        Y              
DROCLTH  DS    CL8                                                              
DROCLT   DS    CL3      5   10    3  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL3      5   20    3  L   P    N         T        Y              
DROESTH  DS    CL8                                                              
DROEST   DS    CL3      5   28    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      5   38    6  L   P    N         T        Y              
DROMKTH  DS    CL8                                                              
DROMKT   DS    CL4      5   46    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  L   P    N         T        Y              
DROPRDH  DS    CL8                                                              
DROPRD   DS    CL6      5   64    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
DROTXTH  DS    CL8                                                              
DROTXT   DS    CL80     7    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80     8    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80     9    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    10    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    11    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    12    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    13    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    14    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    15    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    16    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    17    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    18    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    19    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    20    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    21    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    22    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    23    1   80  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL80    24    1   80  A   P    N         T        Y              
DROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1704 BYTES                            
