*          DATA SET SPWRIF3D   AT LEVEL 002 AS OF 12/02/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204F3D      DATE 12/02/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A   P    N         T        Y              
SUMRFLH  DS    CL8                                                              
SUMRFL   DS    CL4      5   64    4  A   U    N         T        Y    8         
SUMRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
SUMHEADH DS    CL8                                                              
SUMHEAD  DS    CL20     7   10   20  A   U    N         T        Y   40         
SUMHEADX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     7   34   20  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     7   59   20  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     8   10   20  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     8   34   20  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     8   59   20  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SUMMIDH  DS    CL8                                                              
SUMMID   DS    CL20     9   10   20  A   U    N         T        Y   43         
SUMMIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    H         T        Y              
SUMROWSH DS    CL8                                                              
SUMROWS  DS    CL20    10   10   20  A   U    N         T        Y   44         
SUMROWSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    10   34   20  A   U    N         T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    10   59   20  A   U    N         T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    11   10   20  A   U    N         T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    11   34   20  A   U    N         T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    11   59   20  A   U    N         T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     12   10    1  A   P    N         T        Y              
SUMCOLSH DS    CL8                                                              
SUMCOLS  DS    CL32    12   12   32  A   U    N         T        Y   50         
SUMCOLSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    12   47   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    13   12   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    13   47   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    14   12   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    14   47   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    15   12   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    15   47   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    16   12   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    16   47   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    17   12   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    17   47   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   10    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    18   12   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   45    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32    18   47   32  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     20    2    5  A   P    N         T        Y              
SUMTITH  DS    CL8                                                              
SUMTIT   DS    CL63    20   10   63  A   U    N         T        Y   60         
SUMTITX  DS    CL8                                                              
SUMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SUMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1544 BYTES                            
