*          DATA SET SPWRIE4D   AT LEVEL 005 AS OF 01/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204E4D      DATE 01/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
CS1RFLH  DS    CL8                                                              
CS1RFL   DS    CL4      5   64    4  A  U N             T        Y    8         
CS1RFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
CS1MEDH  DS    CL8                                                              
CS1MED   DS    CL1      7   10    1  A  U N             T        Y   10         
CS1MEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
CS1CLTH  DS    CL8                                                              
CS1CLT   DS    CL8      7   28    8  A  U N             T        Y   12         
CS1CLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
CS1PRDH  DS    CL8                                                              
CS1PRD   DS    CL8      7   46    8  A  U N             T        Y   14         
CS1PRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
CS1ESTH  DS    CL8                                                              
CS1EST   DS    CL9      7   64    9  A  U N             T        Y   16         
CS1ESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
CS1MKTH  DS    CL8                                                              
CS1MKT   DS    CL9      8   10    9  A  U N             T        Y   18         
CS1MKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
CS1STAH  DS    CL8                                                              
CS1STA   DS    CL8      8   28    8  A  U N             T        Y   20         
CS1STAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
CS1PERH  DS    CL8                                                              
CS1PER   DS    CL17     8   46   17  A  U N             T        Y   22         
CS1PERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
CS1FLTH  DS    CL8                                                              
CS1FLT   DS    CL70     9   10   70  A  U N             T        Y   30         
CS1FLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
CS1OPTH  DS    CL8                                                              
CS1OPT   DS    CL70    10   10   70  A  U N             T        Y   32         
CS1OPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
CS1OTHH  DS    CL8                                                              
CS1OTH   DS    CL70    11   10   70  A  U N             T        Y   34         
CS1OTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
CS1PTLH  DS    CL8                                                              
CS1PTL   DS    CL4     13   20    4  A  U N             T        Y   70         
CS1PTLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
CS1CTLH  DS    CL8                                                              
CS1CTL   DS    CL4     14   20    4  A  U N             T        Y   72         
CS1CTLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
CS1COMH  DS    CL8                                                              
CS1COM   DS    CL1     15   20    1  A  U N             T        Y   74         
CS1COMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
CS1TITH  DS    CL8                                                              
CS1TIT   DS    CL60    17   20   60  A  U N             T        Y   60         
CS1TITX  DS    CL8                                                              
CS1LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CS1WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 912  BYTES                            
