*          DATA SET SPWRIE5D   AT LEVEL 003 AS OF 01/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204E5D      DATE 01/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
CS2RFLH  DS    CL8                                                              
CS2RFL   DS    CL4      5   64    4  A  U N             T        Y    8         
CS2RFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
CS2MEDH  DS    CL8                                                              
CS2MED   DS    CL1      7   10    1  A  U N             T        Y   10         
CS2MEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
CS2CLTH  DS    CL8                                                              
CS2CLT   DS    CL8      7   28    8  A  U N             T        Y   12         
CS2CLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
CS2PRDH  DS    CL8                                                              
CS2PRD   DS    CL8      7   46    8  A  U N             T        Y   14         
CS2PRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
CS2ESTH  DS    CL8                                                              
CS2EST   DS    CL9      7   64    9  A  U N             T        Y   16         
CS2ESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
CS2MKTH  DS    CL8                                                              
CS2MKT   DS    CL9      8   10    9  A  U N             T        Y   18         
CS2MKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
CS2STAH  DS    CL8                                                              
CS2STA   DS    CL8      8   28    8  A  U N             T        Y   20         
CS2STAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
CS2PERH  DS    CL8                                                              
CS2PER   DS    CL17     8   46   17  A  U N             T        Y   22         
CS2PERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
CS2FLTH  DS    CL8                                                              
CS2FLT   DS    CL70     9   10   70  A  U N             T        Y   30         
CS2FLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
CS2OPTH  DS    CL8                                                              
CS2OPT   DS    CL70    10   10   70  A  U N             T        Y   32         
CS2OPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
CS2OTHH  DS    CL8                                                              
CS2OTH   DS    CL70    11   10   70  A  U N             T        Y   34         
CS2OTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
CS2RPTH  DS    CL8                                                              
CS2RPT   DS    CL1     13   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    13   28   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   28   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    15   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  A  P N             T        Y              
CS2DETH  DS    CL8                                                              
CS2DET   DS    CL1     16   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    16   28   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    17   28   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    18    2   16  A  P N             T        Y              
CS2PTLH  DS    CL8                                                              
CS2PTL   DS    CL4     18   20    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    19    2   14  A  P N             T        Y              
CS2CTLH  DS    CL8                                                              
CS2CTL   DS    CL4     19   20    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
CS2TITH  DS    CL8                                                              
CS2TIT   DS    CL60    21   20   60  A  U N             T        Y   60         
CS2TITX  DS    CL8                                                              
CS2LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CS2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1056 BYTES                            
