*          DATA SET SPWRIB5D   AT LEVEL 003 AS OF 11/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204B5D      DATE 11/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
S49RFLH  DS    CL8                                                              
S49RFL   DS    CL4      5   64    4  A  U N             T        Y    8         
S49RFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
S49MEDH  DS    CL8                                                              
S49MED   DS    CL1      7   10    1  A  U N             T        Y   10         
S49MEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
S49CLTH  DS    CL8                                                              
S49CLT   DS    CL8      7   28    8  A  U N             T        Y   12         
S49CLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
S49PRDH  DS    CL8                                                              
S49PRD   DS    CL8      7   46    8  A  U N             T        Y   14         
S49PRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
S49ESTH  DS    CL8                                                              
S49EST   DS    CL9      7   64    9  A  U N             T        Y   16         
S49ESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
S49MKTH  DS    CL8                                                              
S49MKT   DS    CL9      8   10    9  A  U N             T        Y   18         
S49MKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
S49STAH  DS    CL8                                                              
S49STA   DS    CL8      8   28    8  A  U N             T        Y   20         
S49STAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
S49PERH  DS    CL8                                                              
S49PER   DS    CL17     8   46   17  A  U N             T        Y   22         
S49PERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
S49FLTH  DS    CL8                                                              
S49FLT   DS    CL70     9   10   70  A  U N             T        Y   30         
S49FLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
S49OPTH  DS    CL8                                                              
S49OPT   DS    CL70    10   10   70  A  U N             T        Y   32         
S49OPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
S49OTHH  DS    CL8                                                              
S49OTH   DS    CL70    11   10   70  A  U N             T        Y   34         
S49OTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     24    2    5  A  P N             T        Y              
S49TITH  DS    CL8                                                              
S49TIT   DS    CL63    24   10   63  A  U N             T        Y   60         
S49TITX  DS    CL8                                                              
S49LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
S49WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 792  BYTES                            
