*          DATA SET SPWRID6D   AT LEVEL 004 AS OF 02/08/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204D6D      DATE 02/08/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
CALRFLH  DS    CL8                                                              
CALRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
CALRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
CALMEDH  DS    CL8                                                              
CALMED   DS    CL1      7   10    1  A  U N             T        Y   10         
CALMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
CALCLTH  DS    CL8                                                              
CALCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
CALCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
CALPRDH  DS    CL8                                                              
CALPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
CALPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
CALESTH  DS    CL8                                                              
CALEST   DS    CL9      7   64    9  A  U N             T        Y   16         
CALESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
CALMKTH  DS    CL8                                                              
CALMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
CALMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
CALSTAH  DS    CL8                                                              
CALSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
CALSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
CALPERH  DS    CL8                                                              
CALPER   DS    CL17     8   46   17  A  U N             T        Y   22         
CALPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
CALFLTH  DS    CL8                                                              
CALFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
CALFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
CALOPTH  DS    CL8                                                              
CALOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
CALOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
CALOTHH  DS    CL8                                                              
CALOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
CALOTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    13    2   15  A  P N             T        Y              
CALNETH  DS    CL8                                                              
CALNET   DS    CL1     13   20    1  A  U N             T        Y   38         
CALNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    14    2   13  A  P N             T        Y              
CALCHAH  DS    CL8                                                              
CALCHA   DS    CL1     14   20    1  A  U N             T        Y   40         
CALCHAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
CALDISH  DS    CL8                                                              
CALDIS   DS    CL1     15   20    1  A  U N             T        Y   42         
CALDISX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    16    2   17  A  P N             T        Y              
CALSUMH  DS    CL8                                                              
CALSUM   DS    CL1     16   20    1  A  U N             T        Y   44         
CALSUMX  DS    CL8                                                              
CALLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CALWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
