*          DATA SET SPWRIECD   AT LEVEL 013 AS OF 05/06/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204ECD      DATE 05/06/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
BRSRFLH  DS    CL8                                                              
BRSRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
BRSRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
BRSMEDH  DS    CL8                                                              
BRSMED   DS    CL1      7   10    1  A  U N             T        Y   10         
BRSMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
BRSCLTH  DS    CL8                                                              
BRSCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
BRSCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
BRSPRDH  DS    CL8                                                              
BRSPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
BRSPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
BRSESTH  DS    CL8                                                              
BRSEST   DS    CL9      7   64    9  A  U N             T        Y   16         
BRSESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
BRSMKTH  DS    CL8                                                              
BRSMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
BRSMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
BRSSTAH  DS    CL8                                                              
BRSSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
BRSSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
BRSPERH  DS    CL8                                                              
BRSPER   DS    CL17     8   46   17  A  U N             T        Y   22         
BRSPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
BRSFLTH  DS    CL8                                                              
BRSFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
BRSFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
BRSOPTH  DS    CL8                                                              
BRSOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
BRSOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
BRSOTHH  DS    CL8                                                              
BRSOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
BRSOTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    12    2   13  A  P N             T        Y              
BRSROPH  DS    CL8                                                              
BRSROP   DS    CL60    12   20   60  A  U N             T        Y   66         
BRSROPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
BRSRRTH  DS    CL8                                                              
BRSRRT   DS    CL1     13   20    1  A  U N             T        Y   68         
BRSRRTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
BRSDETH  DS    CL8                                                              
BRSDET   DS    CL60    14   20   60  A  U N             T        Y   70         
BRSDETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
BRSDOPH  DS    CL8                                                              
BRSDOP   DS    CL60    15   20   60  A  U N             T        Y   71         
BRSDOPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    16    2   15  A  P N             T        Y              
BRSCOMH  DS    CL8                                                              
BRSCOM   DS    CL1     16   20    1  A  U N             T        Y   72         
BRSCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     16   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
BRSRCPH  DS    CL8                                                              
BRSRCP   DS    CL1     17   20    1  A  U N             T        Y   74         
BRSRCPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL23    17   38   23  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18    2   10  A  P N             T        Y              
BRSRCTH  DS    CL8                                                              
BRSRCT   DS    CL1     18   20    1  A  U N             T        Y   78         
BRSRCTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18   38    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    19    2   13  A  P N             T        Y              
BRSRCCH  DS    CL8                                                              
BRSRCC   DS    CL60    19   20   60  A  U N             T        Y   76         
BRSRCCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     20    2    9  A  P N             T        Y              
BRSSUMH  DS    CL8                                                              
BRSSUM   DS    CL1     20   20    1  A  U N             T        Y   75         
BRSSUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20   38    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    21    2   15  A  P N             T        Y              
BRSSUDH  DS    CL8                                                              
BRSSUD   DS    CL1     21   20    1  A  U N             T        Y   77         
BRSSUDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     21   38    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    22    2   15  A  P N             T        Y              
BRSSUCH  DS    CL8                                                              
BRSSUC   DS    CL60    22   20   60  A  U N             T        Y   79         
BRSSUCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     24    2    7  A  P N             T        Y              
BRSTITH  DS    CL8                                                              
BRSTIT   DS    CL60    24   20   60  A  U N             T        Y   80         
BRSTITX  DS    CL8                                                              
BRSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
BRSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1576 BYTES                            
