*          DATA SET SPWRID8D   AT LEVEL 003 AS OF 09/21/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204D8D      DATE 09/21/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
SCJRFLH  DS    CL8                                                              
SCJRFL   DS    CL4      5   64    4  A  U N             T        Y    8         
SCJRFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SCJMEDH  DS    CL8                                                              
SCJMED   DS    CL1      7   10    1  A  U N             T        Y   10         
SCJMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
SCJCLTH  DS    CL8                                                              
SCJCLT   DS    CL8      7   28    8  A  U N             T        Y   12         
SCJCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
SCJPRDH  DS    CL8                                                              
SCJPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
SCJPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
SCJESTH  DS    CL8                                                              
SCJEST   DS    CL9      7   64    9  A  U N             T        Y   16         
SCJESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SCJMKTH  DS    CL8                                                              
SCJMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
SCJMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
SCJSTAH  DS    CL8                                                              
SCJSTA   DS    CL8      8   28    8  A  U N             T        Y   20         
SCJSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
SCJPERH  DS    CL8                                                              
SCJPER   DS    CL17     8   46   17  A  U N             T        Y   22         
SCJPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
SCJFLTH  DS    CL8                                                              
SCJFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
SCJFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SCJOPTH  DS    CL8                                                              
SCJOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
SCJOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
SCJOTHH  DS    CL8                                                              
SCJOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
SCJOTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    13    2   13  A  P N             T        Y              
SCJTAPH  DS    CL8                                                              
SCJTAP   DS    CL1     13   20    1  A  U N             T        Y   36         
SCJTAPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  P N             T        Y              
SCJTITH  DS    CL8                                                              
SCJTIT   DS    CL27    15   20   27  A  U N             T        Y   50         
SCJTITX  DS    CL8                                                              
SCJLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SCJWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 792  BYTES                            
