*          DATA SET SPWRIEED   AT LEVEL 002 AS OF 01/04/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T204EED      DATE 01/04/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     5   28   27  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
TBARFLH  DS    CL8                                                              
TBARFL   DS    CL4      5   64    4  A  U N             T        Y    8         
TBARFLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
TBAMEDH  DS    CL8                                                              
TBAMED   DS    CL1      7   10    1  A  U N             T        Y   10         
TBAMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
TBACLTH  DS    CL8                                                              
TBACLT   DS    CL8      7   28    8  A  U N             T        Y   12         
TBACLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P H             T        Y              
TBAPRDH  DS    CL8                                                              
TBAPRD   DS    CL8      7   46    8  A  U N             T        Y   14         
TBAPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   56    3  A  P H             T        Y              
TBAESTH  DS    CL8                                                              
TBAEST   DS    CL9      7   64    9  A  U N             T        Y   16         
TBAESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
TBAMKTH  DS    CL8                                                              
TBAMKT   DS    CL9      8   10    9  A  U N             T        Y   18         
TBAMKTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P H             T        Y              
TBASTAH  DS    CL8                                                              
TBASTA   DS    CL8      8   28    8  A  U N             T        Y   20         
TBASTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P H             T        Y              
TBAPERH  DS    CL8                                                              
TBAPER   DS    CL17     8   46   17  A  U N             T        Y   22         
TBAPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
TBAFLTH  DS    CL8                                                              
TBAFLT   DS    CL70     9   10   70  A  U N             T        Y   30         
TBAFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
TBAOPTH  DS    CL8                                                              
TBAOPT   DS    CL70    10   10   70  A  U N             T        Y   32         
TBAOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
TBAOTHH  DS    CL8                                                              
TBAOTH   DS    CL70    11   10   70  A  U N             T        Y   34         
TBAOTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
TBATITH  DS    CL8                                                              
TBATIT   DS    CL60    13   10   60  A  U N             T        Y   36         
TBATITX  DS    CL8                                                              
TBALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TBAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 784  BYTES                            
