*          DATA SET SPXBTABD   AT LEVEL 073 AS OF 07/26/11                      
***********************************************************************         
* DSECT TO COVER BREAK TABLE                                                    
***********************************************************************         
*                                                                               
BRKTABD  DSECT                                                                  
*                                                                               
BRKTAM   DS    CL1                 AGENCY/MEDIA                                 
BRKTCLT  DS    XL2                 CLIENT                                       
BRKTGID  DS    CL1                 GROUP ID                                     
*                                                                               
BRKTKLQ  EQU   *-BRKTABD           L'(KEY PORTION)                              
*                                                                               
BRKTBK1  DS    XL1                 BREAK 1 LENGTH                               
BRKTBK2  DS    XL1                 BREAK 1 LENGTH                               
BRKTBK3  DS    XL1                 BREAK 1 LENGTH                               
*                                                                               
BRKTABLQ EQU   *-BRKTABD                                                        
*                                                                               
BRKTABNQ EQU   1000                NUMBER OF TABLE ENTRIES                      
*                                                                               
*                                                                               
*                                                                               
NETTABD  DSECT                     DSECT FOR CANADIAN NETWORK TABLE             
NTBCALL  DS    CL4                                                              
NETTABL  EQU   *-NETTABD                                                        
*                                                                               
MAXNETS  EQU   128                                                              
