*          DATA SET SPXRECD    AT LEVEL 084 AS OF 02/24/21                      
       ++INCLUDE DXHDRD                                                         
         EJECT                                                                  
       ++INCLUDE DXTRLD            TRAILER                                      
         EJECT                                                                  
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - GENERIC RECORD                                *         
***********************************************************************         
         SPACE 1                                                                
SPTGRD   DSECT                     GENERIC RECORD                               
SPTGRLEN DS    CL4                 RECORD LENGTH                                
SPTGRTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
SPTGRACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTGRDAT DS    CL8                 RECORD DATE                                  
SPTGRDTS DS    C                   DATE-TIME SEPARATOR CHARACTER                
SPTGRTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTGRAGY DS    CL2                 AGENCY                                       
         EJECT                                                                  
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - MEDIA RECORD                                  *         
***********************************************************************         
         SPACE 1                                                                
SPTMDD   DSECT                     MEDIA RECORD                                 
SPTMDLEN DS    CL4                 RECORD LENGTH                                
SPTMDTYP DS    CL5                 RECORD TYPE     '06100'                      
         DS    C                                                                
SPTMDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTMDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTMDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTMDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTMDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTMDAGN DS    CL33                AGENCY NAME                                  
         DS    C                                                                
SPTMDMDN DS    CL10                MEDIA NAME                                   
         DS    C                                                                
SPTMDCTR DS    CL1                 COUNTRY                                      
*                                                                               
SPTMDDX  DS    CL2                 RECORD END                                   
SPTMDDL  EQU   *-SPTMDD            RECORD LENGTH                                
         EJECT                                                                  
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - CLIENT RECORD                                           
***********************************************************************         
         SPACE 1                                                                
SPTCND   DSECT                     CLIENT RECORD                                
SPTCNLEN DS    CL4                 RECORD LENGTH                                
SPTCNTYP DS    CL5                 RECORD TYPE     '06101'                      
         DS    C                                                                
SPTCNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTCNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTCNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTCNAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTCNMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTCNCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTCNNME DS    CL20                NAME                                         
         DS    C                                                                
SPTCNOFF DS    CL1                 OFFICE                                       
         DS    C                                                                
SPTCNPU1 DS    CL20                PRODUCT USER 1                               
         DS    C                                                                
SPTCNPU2 DS    CL20                PRODUCT USER 2                               
         DS    C                                                                
SPTCNEU1 DS    CL20                ESTIMATE USER 1                              
         DS    C                                                                
SPTCNEU2 DS    CL20                ESTIMATE USER 2                              
         DS    C                                                                
SPTCNTAX DS    CL1                 TAX CODE                                     
         DS    C                                                                
SPTCNMN  DS    CL10                MEDIA NAME                                   
         DS    C                                                                
SPTCNINT DS    CL8                 CLIENT INTERFACE                             
         DS    C                                                                
SPTCN2OF DS    CL2                 2-CHARACTER OFFICE                           
         DS    C                                                                
SPTCNTBE DS    C                   TIMEBANK EXCLUSION                           
         DS    C                                                                
SPTCNRAT DS    C                   CLIENT RATE CONTROL                          
         DS    C                                                                
SPTCNAOF DS    CL2                 ACC OFFICE                                   
         DS    C                                                                
SPTCNAAG DS    CL2                 ACC AGENCY                                   
         DS    C                                                                
SPTCNPOL DS    CL1                 T=TRUE POL, B=BRAND POL                      
         DS    C                                                                
SPTCNBAG DS    CL3                 BUYING AGENCY IDENTIFIER                     
         DS    C                                                                
SPTCNDAR DS    CL3                 DARE SPECIAL REP                             
         DS    C                                                                
SPTCNEXN DS    CL50                EXT CLIENT NAME                              
         DS    C                                                                
SPTCNLBX DS    C                   LOCKBOX NUMBER                               
         DS    C                                                                
SPTCNBEC DS    C                   BILL ESTIMATE CONTROL                        
         DS    C                                                                
SPTCN2CS DS    C                   SECOND COST REQUIRED?                        
         DS    C                                                                
SPTCNMGR DS    C                   MARKET GROUPS?                               
         DS    C                                                                
SPTCNFRZ DS    C                   FREEZE CLIENT                                
         DS    C                                                                
SPTCNUBC DS    C                   UCOM BILL CONTROL                            
         DS    C                                                                
SPTCNMMM DS    C                   MKGDS IN MISSED MONTH                        
*                                                                               
SPTCNDX  DS    CL2                 RECORD END                                   
SPTCNDL  EQU   *-SPTCND            RECORD LENGTH                                
         EJECT                                                                  
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - PRODUCT                                                 
***********************************************************************         
         SPACE 1                                                                
SPTPDD   DSECT                     PRODUCT RECORD                               
SPTPDLEN DS    CL4                 RECORD LENGTH                                
SPTPDTYP DS    CL5                 RECORD TYPE   '06103'                        
         DS    C                                                                
SPTPDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTPDCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTPDPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTPDNME DS    CL20                NAME                                         
         DS    C                                                                
SPTPDBBG DS    CL1                 IS BILL BASE GROSS                           
         DS    C                                                                
SPTPDCBG DS    CL1                 IS COMM BASE GROSS                           
         DS    C                                                                
SPTPDBCM DS    CL7                 BILLING COMMISSION                           
         DS    C                                                                
SPTPDOFF DS    CL1                 OFFICE CODE                                  
         DS    C                                                                
SPTPDUV1 DS    CL32                USER1 VALUE                                  
         DS    C                                                                
SPTPDUV2 DS    CL16                USER2 VALUE                                  
         DS    C                                                                
SPTPDTAX DS    CL1                 TAXCODE                                      
         DS    C                                                                
SPTPDINT DS    CL4                 PRODUCT INTERFACE                            
         DS    C                                                                
SPTPDBFM DS    CL18                BILL FORMULA                                 
         DS    C                                                                
SPTPDAD1 DS    CL30                BILL TO NAME (ADDRESS 1)                     
         DS    C                                                                
SPTPDAD2 DS    CL30                ADDRESS LINE 2                               
         DS    C                                                                
SPTPDAD3 DS    CL30                ADDRESS LINE 3                               
         DS    C                                                                
SPTPDAD4 DS    CL30                ADDRESS LINE 4                               
*                                                                               
SPTPDDX  DS    CL2                 RECORD END                                   
SPTPDDL  EQU   *-SPTPDD            RECORD LENGTH                                
         EJECT                                                                  
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - CLIENT PRODUCT LIST                                     
***********************************************************************         
         SPACE 1                                                                
SPTPLD   DSECT                     PRODUCT RECORD                               
SPTPLLEN DS    CL4                 RECORD LENGTH                                
SPTPLTYP DS    CL5                 RECORD TYPE   '06103'                        
         DS    C                                                                
SPTPLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPLAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPLMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTPLCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTPLPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTPLNUM DS    CL3                 PRODUCT NUMBER                               
*                                                                               
SPTPLDX  DS    CL2                 RECORD END                                   
SPTPLDL  EQU   *-SPTPLD            RECORD LENGTH                                
         EJECT                                                                  
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - ESTIMATE RECORD                                         
***********************************************************************         
         SPACE 1                                                                
SPTESD   DSECT                     ESTIMATE RECORD                              
SPTESLEN DS    CL4                 RECORD LENGTH                                
SPTESTYP DS    CL5                 RECORD TYPE  '06104'                         
         DS    C                                                                
SPTESACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTESDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTESTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTESAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTESMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTESCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTESPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTESEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
SPTESNAM DS    CL20                NAME                                         
         DS    C                                                                
SPTESSRT DS    CL8                 START DATE                                   
         DS    C                                                                
SPTESEND DS    CL8                 END DATE                                     
         DS    C                                                                
SPTESREP DS    CL3                 SPECIAL REP                                  
         DS    C                                                                
SPTESBBG DS    CL1                 IS BILL BASE GROSS?                          
         DS    C                                                                
SPTESCBG DS    CL1                 IS COMM BASE GROSS?                          
         DS    C                                                                
SPTESBCM DS    CL7                 BILLING COMMISSION                           
         DS    C                                                                
SPTESUV1 DS    CL32                USER1 VALUE                                  
         DS    C                                                                
SPTESUV2 DS    CL16                USER2 VALUE                                  
         DS    C                                                                
SPTESTPE DS    CL1                 TYPE                                         
         DS    C                                                                
SPTESBTY DS    CL1                 BOOK TYPE                                    
         DS    C                                                                
SPTESFIL DS    CL3                 FILTER                                       
         DS    C                                                                
SPTESRTP DS    CL1                 RATE TYPE                                    
         DS    C                                                                
SPTESDPT DS    CL1                 DAYPART MENU                                 
         DS    C                                                                
SPTESOOW DS    CL1                 START DAY NUMBER FOR OOW EST                 
         DS    C                                                                
SPTESDLY DS    CL1                 DAILY ESTIMATE FLAG                          
         DS    C                                                                
SPTESBFM DS    CL18                BILL FORMULA                                 
*                                                                               
SPTESDX  DS    CL2                 RECORD END                                   
SPTESDL  EQU   *-SPTESD            RECORD LENGTH                                
         EJECT                                                                  
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM MARKET RECORD                                                     
***********************************************************************         
         SPACE 1                                                                
SPTMKD   DSECT                     MARKET RECORD                                
SPTMKLEN DS    CL4                 RECORD LENGTH                                
SPTMKTYP DS    CL5                 RECORD TYPE  '06104'                         
         DS    C                                                                
SPTMKACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTMKDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTMKTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTMKAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTMKMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTMKMKT DS    CL4                 MARKET                                       
         DS    C                                                                
SPTMKNAM DS    CL24                NAME                                         
         DS    C                                                                
SPTMKRNK DS    CL3                 RANK                                         
         DS    C                                                                
SPTMKWGH DS    CL4                 WEIGHT                                       
         DS    C                                                                
SPTMKMK1 DS    CL4                 RATING SERVICE MARKET 1                      
         DS    C                                                                
SPTMKMK2 DS    CL4                 RATING SERVICE MARKET 2                      
         DS    C                                                                
SPTMKTZO DS    CL1                 TIME ZONE                                    
*                                                                               
SPTMKDX  DS    CL2                 RECORD END                                   
SPTMKDL  EQU   *-SPTMKD            RECORD LENGTH                                
         EJECT                                                                  
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM STATION RECORD                                                    
***********************************************************************         
         SPACE 1                                                                
SPTSTD   DSECT                     MARKET RECORD                                
SPTSTLEN DS    CL4                 RECORD LENGTH                                
SPTSTTYP DS    CL5                 RECORD TYPE  '06104'                         
         DS    C                                                                
SPTSTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSTAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTSTMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTSTSTA DS    CL5                 STATION                                      
         DS    C                                                                
SPTSTCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTSTNAM DS    CL20                STATION NAME                                 
         DS    C                                                                
SPTSTMKT DS    CL4                 MARKET                                       
         DS    C                                                                
SPTSTSIZ DS    CL1                 SIZE                                         
         DS    C                                                                
SPTSTCAN DS    CL4                 CANADIAN NETWORK                             
         DS    C                                                                
SPTSTFAX DS    CL12                FAX NUMBER                                   
         DS    C                                                                
SPTSTDEA DS    C                   DEACTIVATED?                                 
         DS    C                                                                
SPTSTNTP DS    C                   NETWORK TYPE                                 
         DS    C                                                                
SPTSTPRP DS    CL3                 PAYING REP                                   
*                                                                               
SPTSTDX  DS    CL2                 RECORD END                                   
SPTSTDL  EQU   *-SPTSTD            RECORD LENGTH                                
         EJECT                                                                  
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - ESTIMATE DEMO LIST                                      
***********************************************************************         
         SPACE 1                                                                
SPTEDD   DSECT                     ESTIMATE RECORD                              
SPTEDLEN DS    CL4                 RECORD LENGTH                                
SPTEDTYP DS    CL5                 RECORD TYPE  '07108'                         
         DS    C                                                                
SPTEDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTEDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTEDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTEDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTEDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTEDCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTEDPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTEDEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
SPTEDMOD DS    CL1                 MODIFIER                                     
         DS    C                                                                
SPTEDASC DS    CL5                 AGE SEX CATEGORY                             
         DS    C                                                                
SPTEDPOS DS    CL3                 POSITION                                     
*                                                                               
SPTEDDX  DS    CL2                 RECORD END                                   
SPTEDDL  EQU   *-SPTEDD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - STATION ADDRESS RECORD                                  
***********************************************************************         
         SPACE 1                                                                
SPTSAD   DSECT                     STATION ADDRESS RECORD                       
SPTSALEN DS    CL4                 RECORD LENGTH                                
SPTSATYP DS    CL5                 RECORD TYPE  '07109'                         
         DS    C                                                                
SPTSAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSAAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTSAMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTSASTA DS    CL5                 STATION                                      
         DS    C                                                                
SPTSANAM DS    CL20                STATION NAME                                 
         DS    C                                                                
SPTSAAD1 DS    CL24                ADDRESS LINE 1                               
         DS    C                                                                
SPTSAAD2 DS    CL24                ADDRESS LINE 2                               
         DS    C                                                                
SPTSACIT DS    CL24                CITY                                         
         DS    C                                                                
SPTSASTT DS    CL3                 STATE                                        
         DS    C                                                                
SPTSAZIP DS    CL5                 ZIP                                          
         DS    C                                                                
SPTSAPOS DS    CL10                POSTAL CODE                                  
         DS    C                                                                
SPTSAEML DS    CL40                E-MAIL ADDRESS                               
         DS    C                                                                
SPTSACOM DS    CL35                COMMENTS                                     
*                                                                               
SPTSADX  DS    CL2                 RECORD END                                   
SPTSADL  EQU   *-SPTSAD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - EQUIVALENCE FACTORS                                     
***********************************************************************         
         SPACE 1                                                                
SPTEFD   DSECT                     STATION ADDRESS RECORD                       
SPTEFLEN DS    CL4                 RECORD LENGTH                                
SPTEFTYP DS    CL5                 RECORD TYPE  '07110'                         
         DS    C                                                                
SPTEFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTEFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTEFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTEFAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTEFMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTEFCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTEFSEC DS    CL3                 SECONDS                                      
         DS    C                                                                
SPTEFEQF DS    CL5                 EQUIVALENCE FACTOR                           
*                                                                               
SPTEFDX  DS    CL2                 RECORD END                                   
SPTEFDL  EQU   *-SPTEFD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - COMMERCIAL RECORD                                       
***********************************************************************         
*                                                                               
SPTCMD   DSECT                     COMMERCIAL RECORD                            
SPTCMLEN DS    CL4                 RECORD LENGTH                                
SPTCMTYP DS    CL5                 RECORD TYPE  '07110'                         
         DS    C                                                                
SPTCMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTCMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTCMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTCMAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTCMMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTCMCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTCMCOM DS    CL8                 COMMERCIAL                                   
         DS    C                                                                
SPTCMDS1 DS    CL15                DESCTIPTION 1                                
         DS    C                                                                
SPTCMDS2 DS    CL20                DESCTIPTION 2                                
         DS    C                                                                
SPTCMDS3 DS    CL20                DESCTIPTION 3                                
         DS    C                                                                
SPTCMCCN DS    CL20                CLIENT COMMERCIAL NUMBER                     
         DS    C                                                                
SPTCMAID DS    CL12                AD-ID                                        
         DS    C                                                                
SPTCMCL1 DS    CL4                 CLASS 1                                      
         DS    C                                                                
SPTCMCP1 DS    CL6                 CLASS 1'S % SHARE (NNN.NN)                   
         DS    C                                                                
SPTCMCL2 DS    CL4                 CLASS 2                                      
         DS    C                                                                
SPTCMCP2 DS    CL6                 CLASS 2'S % SHARE (NNN.NN)                   
         DS    C                                                                
SPTCMCL3 DS    CL4                 CLASS 3                                      
         DS    C                                                                
SPTCMCP3 DS    CL6                 CLASS 3'S % SHARE (NNN.NN)                   
         DS    C                                                                
SPTCMCL4 DS    CL4                 CLASS 4                                      
         DS    C                                                                
SPTCMCP4 DS    CL6                 CLASS 4'S % SHARE (NNN.NN)                   
         DS    C                                                                
SPTCMP01 DS    CL3                 PRODUCT 1                                    
         DS    C                                                                
SPTCMP02 DS    CL3                 PRODUCT 2                                    
         DS    C                                                                
SPTCMP03 DS    CL3                 PRODUCT 3                                    
         DS    C                                                                
SPTCMP04 DS    CL3                 PRODUCT 4                                    
         DS    C                                                                
SPTCMP05 DS    CL3                 PRODUCT 5                                    
         DS    C                                                                
SPTCMP06 DS    CL3                 PRODUCT 6                                    
         DS    C                                                                
SPTCMP07 DS    CL3                 PRODUCT 7                                    
         DS    C                                                                
SPTCMP08 DS    CL3                 PRODUCT 8                                    
         DS    C                                                                
SPTCMP09 DS    CL3                 PRODUCT 9                                    
         DS    C                                                                
SPTCMP10 DS    CL3                 PRODUCT 10                                   
         DS    C                                                                
SPTCMP11 DS    CL3                 PRODUCT 11                                   
         DS    C                                                                
SPTCMP12 DS    CL3                 PRODUCT 12                                   
         DS    C                                                                
SPTCMAP  DS    C                   ALL PRODUCTS (Y/N)                           
         DS    C                                                                
SPTCMSEC DS    CL3                 SECONDS LENGTH                               
*                                                                               
SPTCMDX  DS    CL2                 RECORD END                                   
SPTCMDL  EQU   *-SPTCMD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - STATION OWNERSHIP                                       
***********************************************************************         
*                                                                               
SPTSOD   DSECT                     STATION OWNERSHIP RECORD                     
SPTSOLEN DS    CL4                 RECORD LENGTH                                
SPTSOTYP DS    CL5                 RECORD TYPE  '07110'                         
         DS    C                                                                
SPTSOACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSODAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSOTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSOSTA DS    CL5                 STATION                                      
         DS    C                                                                
SPTSOPAR DS    CL5                 PARENT                                       
         DS    C                                                                
SPTSOOWN DS    CL5                 OWNER                                        
         DS    C                                                                
SPTSOFOR DS    CL3                 FORMAT                                       
         DS    C                                                                
SPTSOFRQ DS    CL5                 FREQUENCY                                    
         DS    C                                                                
SPTSOCIT DS    CL24                CITY                                         
         DS    C                                                                
SPTSOST  DS    CL2                 STATE                                        
         DS    C                                                                
SPTSOTA1 DS    CL55                TRAFFIC ADDRESS STREET 1                     
         DS    C                                                                
SPTSOTA2 DS    CL50                                STREET 2                     
         DS    C                                                                
SPTSOTCI DS    CL30                                CITY                         
         DS    C                                                                
SPTSOTST DS    CL2                                 STATE                        
         DS    C                                                                
SPTSOTZI DS    CL10                                ZIP                          
         DS    C                                                                
SPTSOTCT DS    CL3                                 COUNTRY                      
         DS    C                                                                
SPTSOMA1 DS    CL55                MAILING ADDRESS STREET 1                     
         DS    C                                                                
SPTSOMA2 DS    CL50                                STREET 2                     
         DS    C                                                                
SPTSOMCI DS    CL30                                CITY                         
         DS    C                                                                
SPTSOMST DS    CL2                                 STATE                        
         DS    C                                                                
SPTSOMZI DS    CL10                                ZIP                          
         DS    C                                                                
SPTSOMCT DS    CL3                                 COUNTRY                      
         DS    C                                                                
SPTSOMIN DS    CL1                 IS MINORITY                                  
*                                                                               
SPTSODX  DS    CL2                 RECORD END                                   
SPTSODL  EQU   *-SPTSOD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - OWNER INFO                                              
***********************************************************************         
*                                                                               
SPTOID   DSECT                     OWNER INFO                                   
SPTOILEN DS    CL4                 RECORD LENGTH                                
SPTOITYP DS    CL5                 RECORD TYPE  '07110'                         
         DS    C                                                                
SPTOIACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTOIDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTOITME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTOIMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTOIOWN DS    CL5                 OWNER                                        
         DS    C                                                                
SPTOINAM DS    CL36                NAME                                         
*                                                                               
SPTOIDX  DS    CL2                 RECORD END                                   
SPTOIDL  EQU   *-SPTOID            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - STATION FORMAT                                          
***********************************************************************         
*                                                                               
SPTSFD   DSECT                     STATION FORMAT                               
SPTSFLEN DS    CL4                 RECORD LENGTH                                
SPTSFTYP DS    CL5                 RECORD TYPE  '07110'                         
         DS    C                                                                
SPTSFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSFMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTSFFOR DS    CL3                 FORMAT                                       
         DS    C                                                                
SPTSFNAM DS    CL35                NAME                                         
*                                                                               
SPTSFDX  DS    CL2                 RECORD END                                   
SPTSFDL  EQU   *-SPTSFD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - MARKET GROUP DEF                                        
***********************************************************************         
*                                                                               
SPTGDD   DSECT                     MARKET GROUP DEF                             
SPTGDLEN DS    CL4                 RECORD LENGTH                                
SPTGDTYP DS    CL5                 RECORD TYPE  '07124'                         
         DS    C                                                                
SPTGDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTGDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTGDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTGDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTGDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTGDCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTGDPRG DS    CL6                 PRODUCT GROUP                                
         DS    C                                                                
SPTGDID  DS    CL2                 ID                                           
         DS    C                                                                
SPTGDB1D DS    CL12                BREAK 1 DEFINITION                           
         DS    C                                                                
SPTGDB1L DS    CL1                 BREAK 1 LENGTH                               
         DS    C                                                                
SPTGDB2D DS    CL12                BREAK 2 DEFINITION                           
         DS    C                                                                
SPTGDB2L DS    CL1                 BREAK 2 LENGTH                               
         DS    C                                                                
SPTGDB3D DS    CL12                BREAK 3 DEFINITION                           
         DS    C                                                                
SPTGDB3L DS    CL1                 BREAK 3 LENGTH                               
*                                                                               
SPTGDDX  DS    CL2                 RECORD END                                   
SPTGDDL  EQU   *-SPTGDD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - MARKET GROUPS                                           
***********************************************************************         
*                                                                               
SPTMGD   DSECT                     MARKET GROUP                                 
SPTMGLEN DS    CL4                 RECORD LENGTH                                
SPTMGTYP DS    CL5                 RECORD TYPE  '07125'                         
         DS    C                                                                
SPTMGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTMGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTMGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTMGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTMGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTMGCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTMGPRG DS    CL6                 PRODUCT GROUP                                
         DS    C                                                                
SPTMGID  DS    CL2                 ID                                           
         DS    C                                                                
SPTMGGRP DS    CL4                 GROUP                                        
         DS    C                                                                
SPTMGMGR DS    CL6                 MARKET GROUP                                 
         DS    C                                                                
SPTMGB1C DS    CL4                 BREAK 1 CODE                                 
         DS    C                                                                
SPTMGB1N DS    CL24                BREAK 1 NAME                                 
         DS    C                                                                
SPTMGB2C DS    CL4                 BREAK 2 CODE                                 
         DS    C                                                                
SPTMGB2N DS    CL24                BREAK 2 NAME                                 
         DS    C                                                                
SPTMGB3C DS    CL4                 BREAK 3 CODE                                 
         DS    C                                                                
SPTMGB3N DS    CL24                BREAK 3 NAME                                 
         DS    C                                                                
SPTMGBTR DS    CL1                 FOR BUYTRACKER (Y/N)                         
*                                                                               
SPTMGDX  DS    CL2                 RECORD END                                   
SPTMGDL  EQU   *-SPTMGD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - MARKET GROUP MARKETS                                    
***********************************************************************         
*                                                                               
SPTMAD   DSECT                     MARKET GROUP                                 
SPTMALEN DS    CL4                 RECORD LENGTH                                
SPTMATYP DS    CL5                 RECORD TYPE  '07126'                         
         DS    C                                                                
SPTMAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTMADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTMATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTMAAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTMAMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTMACLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTMAMKT DS    CL6                 MARKET                                       
         DS    C                                                                
SPTMAPRG DS    CL6                 PRODUCT GROUP                                
         DS    C                                                                
SPTMAMGP DS    CL6                 MARKET GROUP                                 
*                                                                               
SPTMADX  DS    CL2                 RECORD END                                   
SPTMADL  EQU   *-SPTMAD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - CLIENT GROUP DEF                                        
***********************************************************************         
*                                                                               
SPTCDD   DSECT                     CLIENT GROUP DEF                             
SPTCDLEN DS    CL4                 RECORD LENGTH                                
SPTCDTYP DS    CL5                 RECORD TYPE  '07115'                         
         DS    C                                                                
SPTCDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTCDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTCDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTCDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTCDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTCDID  DS    CL2                 ID                                           
         DS    C                                                                
SPTCDB1D DS    CL12                BREAK 1 DEFINITION                           
         DS    C                                                                
SPTCDB1L DS    CL1                 BREAK 1 LENGTH                               
         DS    C                                                                
SPTCDB2D DS    CL12                BREAK 2 DEFINITION                           
         DS    C                                                                
SPTCDB2L DS    CL1                 BREAK 2 LENGTH                               
*                                                                               
SPTCDDX  DS    CL2                 RECORD END                                   
SPTCDDL  EQU   *-SPTCDD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - CLIENT GROUPS                                           
***********************************************************************         
*                                                                               
SPTCGD   DSECT                     CLIENT GROUP                                 
SPTCGLEN DS    CL4                 RECORD LENGTH                                
SPTCGTYP DS    CL5                 RECORD TYPE  '07116'                         
         DS    C                                                                
SPTCGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTCGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTCGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTCGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTCGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTCGID  DS    CL2                 ID                                           
         DS    C                                                                
SPTCGGRP DS    CL4                 GROUP                                        
         DS    C                                                                
SPTCGCGR DS    CL6                 CLIENT GROUP                                 
         DS    C                                                                
SPTCGB1C DS    CL4                 BREAK 1 CODE                                 
         DS    C                                                                
SPTCGB2C DS    CL4                 BREAK 2 CODE                                 
         DS    C                                                                
SPTCGB1N DS    CL24                BREAK 1 NAME                                 
         DS    C                                                                
SPTCGB2N DS    CL24                BREAK 2 NAME                                 
         DS    C                                                                
SPTCGBTR DS    CL1                 FOR BUYTRACKER (Y/N)                         
*                                                                               
SPTCGDX  DS    CL2                 RECORD END                                   
SPTCGDL  EQU   *-SPTCGD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - CLIENT GROUP CLIENTS                                    
***********************************************************************         
*                                                                               
SPTCCD   DSECT                     CLIENT GROUP                                 
SPTCCLEN DS    CL4                 RECORD LENGTH                                
SPTCCTYP DS    CL5                 RECORD TYPE  '07117'                         
         DS    C                                                                
SPTCCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTCCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTCCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTCCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTCCMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTCCCGP DS    CL6                 CLIENT GROUP                                 
         DS    C                                                                
SPTCCCLT DS    CL3                 CLIENT                                       
*                                                                               
SPTCCDX  DS    CL2                 RECORD END                                   
SPTCCDL  EQU   *-SPTCCD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - STATION GROUP DEF                                       
***********************************************************************         
*                                                                               
SPTSDD   DSECT                     STATION GROUP DEF                            
SPTSDLEN DS    CL4                 RECORD LENGTH                                
SPTSDTYP DS    CL5                 RECORD TYPE  '07118'                         
         DS    C                                                                
SPTSDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSDAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTSDMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTSDID  DS    CL2                 ID                                           
         DS    C                                                                
SPTSDB1D DS    CL12                BREAK 1 DEFINITION                           
         DS    C                                                                
SPTSDB1L DS    CL1                 BREAK 1 LENGTH                               
         DS    C                                                                
SPTSDB2D DS    CL12                BREAK 2 DEFINITION                           
         DS    C                                                                
SPTSDB2L DS    CL1                 BREAK 2 LENGTH                               
*                                                                               
SPTSDDX  DS    CL2                 RECORD END                                   
SPTSDDL  EQU   *-SPTSDD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - STATION GROUPS                                          
***********************************************************************         
*                                                                               
SPTSGD   DSECT                     STATION GROUP                                
SPTSGLEN DS    CL4                 RECORD LENGTH                                
SPTSGTYP DS    CL5                 RECORD TYPE  '07119'                         
         DS    C                                                                
SPTSGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTSGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTSGID  DS    CL2                 ID                                           
         DS    C                                                                
SPTSGGRP DS    CL4                 GROUP                                        
         DS    C                                                                
SPTSGSGR DS    CL6                 STATION GROUP                                
         DS    C                                                                
SPTSGB1C DS    CL4                 BREAK 1 CODE                                 
         DS    C                                                                
SPTSGB2C DS    CL4                 BREAK 2 CODE                                 
         DS    C                                                                
SPTSGB1N DS    CL24                BREAK 1 NAME                                 
         DS    C                                                                
SPTSGB2N DS    CL24                BREAK 2 NAME                                 
*                                                                               
SPTSGDX  DS    CL2                 RECORD END                                   
SPTSGDL  EQU   *-SPTSGD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - STATION GROUP STATIONS                                  
***********************************************************************         
*                                                                               
SPTSSD   DSECT                     STATION GROUP STATION                        
SPTSSLEN DS    CL4                 RECORD LENGTH                                
SPTSSTYP DS    CL5                 RECORD TYPE  '07120'                         
         DS    C                                                                
SPTSSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSSAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTSSMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTSSSGP DS    CL6                 STATION GROUP                                
         DS    C                                                                
SPTSSSTA DS    CL5                 STATION                                      
*                                                                               
SPTSSDX  DS    CL2                 RECORD END                                   
SPTSSDL  EQU   *-SPTSSD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - PRODUCT GROUP DEF                                       
***********************************************************************         
*                                                                               
SPTPFD   DSECT                     PRODUCT GROUP DEF                            
SPTPFLEN DS    CL4                 RECORD LENGTH                                
SPTPFTYP DS    CL5                 RECORD TYPE  '07121'                         
         DS    C                                                                
SPTPFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPFAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPFMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTPFCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTPFID  DS    CL2                 ID                                           
         DS    C                                                                
SPTPFB1D DS    CL12                BREAK 1 DEFINITION                           
         DS    C                                                                
SPTPFB1L DS    CL1                 BREAK 1 LENGTH                               
         DS    C                                                                
SPTPFB2D DS    CL12                BREAK 2 DEFINITION                           
         DS    C                                                                
SPTPFB2L DS    CL1                 BREAK 2 LENGTH                               
         DS    C                                                                
SPTPFB3D DS    CL12                BREAK 3 DEFINITION                           
         DS    C                                                                
SPTPFB3L DS    CL1                 BREAK 3 LENGTH                               
*                                                                               
SPTPFDX  DS    CL2                 RECORD END                                   
SPTPFDL  EQU   *-SPTPFD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - PRODUCT GROUPS                                          
***********************************************************************         
*                                                                               
SPTPGD   DSECT                     PRODUCT GROUP                                
SPTPGLEN DS    CL4                 RECORD LENGTH                                
SPTPGTYP DS    CL5                 RECORD TYPE  '07119'                         
         DS    C                                                                
SPTPGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPGAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPGMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTPGCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTPGID  DS    CL2                 ID                                           
         DS    C                                                                
SPTPGGRP DS    CL4                 GROUP                                        
         DS    C                                                                
SPTPGPGR DS    CL6                 PRODUCT GROUP                                
         DS    C                                                                
SPTPGB1C DS    CL4                 BREAK 1 CODE                                 
         DS    C                                                                
SPTPGB2C DS    CL4                 BREAK 2 CODE                                 
         DS    C                                                                
SPTPGB3C DS    CL4                 BREAK 3 CODE                                 
         DS    C                                                                
SPTPGB1N DS    CL24                BREAK 1 NAME                                 
         DS    C                                                                
SPTPGB2N DS    CL24                BREAK 2 NAME                                 
         DS    C                                                                
SPTPGB3N DS    CL24                BREAK 3 NAME                                 
*                                                                               
SPTPGDX  DS    CL2                 RECORD END                                   
SPTPGDL  EQU   *-SPTPGD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - PRODUCT GROUP PRODUCTS                                  
***********************************************************************         
*                                                                               
SPTPPD   DSECT                     STATION GROUP STATION                        
SPTPPLEN DS    CL4                 RECORD LENGTH                                
SPTPPTYP DS    CL5                 RECORD TYPE  '07120'                         
         DS    C                                                                
SPTPPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPPMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTPPCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTPPPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTPPPGP DS    CL6                 PRODUCT GROUP                                
*                                                                               
SPTPPDX  DS    CL2                 RECORD END                                   
SPTPPDL  EQU   *-SPTPPD            RECORD LENGTH                                
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - PARENT INFORMATION                                      
***********************************************************************         
*                                                                               
SPTPRD   DSECT                     STATION GROUP STATION                        
SPTPRLEN DS    CL4                 RECORD LENGTH                                
SPTPRTYP DS    CL5                 RECORD TYPE  '07127'                         
         DS    C                                                                
SPTPRACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPRDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPRTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPRPCD DS    CL5                 PARENT CODE                                  
         DS    C                                                                
SPTPRPNM DS    CL36                NAME                                         
*                                                                               
SPTPRDX  DS    CL2                 RECORD END                                   
SPTPRDL  EQU   *-SPTPRD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - DEAL RECORDS                                            
***********************************************************************         
*                                                                               
SPTDLD   DSECT                     DEAL RECORD                                  
SPTDLLEN DS    CL4                 RECORD LENGTH                                
SPTDLTYP DS    CL5                 RECORD TYPE  '07128'                         
         DS    C                                                                
SPTDLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTDLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTDLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTDLAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTDLMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTDLNUM DS    CL4                 DEAL NUMBER                                  
         DS    C                                                                
SPTDLNAM DS    CL30                DEAL NAME                                    
         DS    C                                                                
SPTDLSDT DS    CL8                 START DATE                                   
         DS    C                                                                
SPTDLEDT DS    CL8                 END DATE                                     
         DS    C                                                                
SPTDLREP DS    CL3                 REP CODE                                     
         DS    C                                                                
SPTDLCDT DS    CL8                 CREATION DATE                                
         DS    C                                                                
SPTDLCRE DS    CL8                 CREATOR                                      
         DS    C                                                                
SPTDLLUD DS    CL8                 LAST UPDATE DATE                             
         DS    C                                                                
SPTDLUBY DS    CL8                 UPDATED BY                                   
*                                                                               
SPTDLDX  DS    CL2                 RECORD END                                   
SPTDLDL  EQU   *-SPTDLD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - DEAL STATIONS                                           
***********************************************************************         
*                                                                               
SPTDSD   DSECT                     DEAL RECORD                                  
SPTDSLEN DS    CL4                 RECORD LENGTH                                
SPTDSTYP DS    CL5                 RECORD TYPE  '07129'                         
         DS    C                                                                
SPTDSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTDSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTDSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTDSAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTDSMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTDSNUM DS    CL4                 DEAL NUMBER                                  
         DS    C                                                                
SPTDSSTA DS    CL5                 STATION                                      
         DS    C                                                                
SPTDSBYR DS    CL30                BUYER                                        
         DS    C                                                                
SPTDSGBD DS    CL10                GROSS BANK DOLLARS                           
         DS    C                                                                
SPTDSNBD DS    CL10                NET BANK DOLLARS                             
         DS    C                                                                
SPTDSPCS DS    CL3                 PERCENT CASH                                 
*                                                                               
SPTDSDX  DS    CL2                 RECORD END                                   
SPTDSDL  EQU   *-SPTDSD            RECORD LENGTH                                
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - REP STATIONS                                            
***********************************************************************         
*                                                                               
SPTRPD   DSECT                     REP RECORD                                   
SPTRPLEN DS    CL4                 RECORD LENGTH                                
SPTRPTYP DS    CL5                 RECORD TYPE  '07130'                         
         DS    C                                                                
SPTRPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTRPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTRPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTRPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTRPMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTRPREP DS    CL3                 REP CODE                                     
         DS    C                                                                
SPTRPNAM DS    CL22                REP NAME                                     
         DS    C                                                                
SPTRPADR DS    CL24                STREET ADDRESS                               
         DS    C                                                                
SPTRPCIT DS    CL24                CITY                                         
         DS    C                                                                
SPTRPSTT DS    CL3                 STATE                                        
         DS    C                                                                
SPTRPZIP DS    CL10                ZIP CODE                                     
         DS    C                                                                
SPTRPCTR DS    C                   COUNTRY CODE                                 
         DS    C                                                                
SPTRPUNW DS    C                   UNWIRED NETWORK (Y/N)                        
*                                                                               
SPTRPDX  DS    CL2                 RECORD END                                   
SPTRPDL  EQU   *-SPTRPD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - SYSCODE/NETWORK LIST                                    
***********************************************************************         
*                                                                               
SPTNLD   DSECT                     SYSCODE/NETWORK LIST RECORD                  
SPTNLLEN DS    CL4                 RECORD LENGTH                                
SPTNLTYP DS    CL5                 RECORD TYPE  '07131'                         
         DS    C                                                                
SPTNLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTNLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTNLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTNLAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTNLMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTNLSYS DS    CL4                 SYSCODE                                      
         DS    C                                                                
SPTNLNET DS    CL3                 NETWORK CODE                                 
*                                                                               
SPTNLDX  DS    CL2                 RECORD END                                   
SPTNLDL  EQU   *-SPTNLD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - SPOT UCOM RECORDS                                       
***********************************************************************         
*                                                                               
SPTUCMD  DSECT                     SPOT UCOM RECORD                             
SPTUCLEN DS    CL4                 RECORD LENGTH                                
SPTUCTYP DS    CL5                 RECORD TYPE  '07132'                         
         DS    C                                                                
SPTUCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTUCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTUCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTUCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTUCMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTUCCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTUCPRD DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
SPTUCEST DS    CL3                 ESTIMATE NUMBER                              
         DS    C                                                                
SPTUCMKT DS    CL4                 MARKET                                       
         DS    C                                                                
SPTUCSEQ DS    CL3                 SEQUENCE NUMBER                              
         DS    C                                                                
SPTUCNAM DS    CL20                FIELD NAME                                   
         DS    C                                                                
SPTUCTXT DS    CL32                FIELD DATA                                   
         DS    C                                                                
SPTUCLN  DS    CL2                 MAX ALLOWED DATA LENGTH                      
         DS    C                                                                
SPTUCEDT DS    CL1                 EDIT TYPE (CHAR, DATA, NUM)                  
         DS    C                                                                
SPTUCMBI DS    CL1                 MBI (Y/N)                                    
*                                                                               
SPTUCMDX DS    CL2                 RECORD END                                   
SPTUCMDL EQU   *-SPTUCMD           RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - STATION LOCKIN RECORDS                                  
***********************************************************************         
*                                                                               
SPTSLD   DSECT                     SPOT UCOM RECORD                             
SPTSLLEN DS    CL4                 RECORD LENGTH                                
SPTSLTYP DS    CL5                 RECORD TYPE  '07133'                         
         DS    C                                                                
SPTSLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSLAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTSLMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTSLCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTSLP1  DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTSLP2  DS    CL3                 PARTNER PRODUCT                              
         DS    C                                                                
SPTSLEST DS    CL3                 ESTIMATE NUMBER                              
         DS    C                                                                
SPTSLMKT DS    CL4                 MARKET                                       
         DS    C                                                                
SPTSLSTA DS    CL8                 STATION                                      
         DS    C                                                                
SPTSLDP3 DS    CL3                 DAYPART - 3 CHAR                             
         DS    C                                                                
SPTSLDP1 DS    C                   DAYPART - 1 CHAR                             
         DS    C                                                                
SPTSLSEC DS    CL3                 SECONDS                                      
         DS    C                                                                
SPTSLWK  DS    CL8                 WEEK DATE                                    
         DS    C                                                                
SPTSLSPT DS    CL10                NUMBER OF SPOTS                              
         DS    C                                                                
SPTSLDOL DS    CL11                DOLLARS                                      
         DS    C                                                                
SPTSLC2  DS    CL11                COST 2                                       
         DS    C                                                                
SPTSLDM1 DS    CL1                 DEMO1 MODIFIER                               
         DS    C                                                                
SPTSLDA1 DS    CL3                 DEMO1 AGE/SEX CATEGORY                       
         DS    C                                                                
SPTSLDV1 DS    CL6                 DEMO1 VALUE                                  
         DS    C                                                                
SPTSLDM2 DS    CL1                 DEMO2 MODIFIER                               
         DS    C                                                                
SPTSLDA2 DS    CL3                 DEMO2 AGE/SEX CATEGORY                       
         DS    C                                                                
SPTSLDV2 DS    CL6                 DEMO2 VALUE                                  
         DS    C                                                                
SPTSLDM3 DS    CL1                 DEMO3 MODIFIER                               
         DS    C                                                                
SPTSLDA3 DS    CL3                 DEMO3 AGE/SEX CATEGORY                       
         DS    C                                                                
SPTSLDV3 DS    CL6                 DEMO3 VALUE                                  
         DS    C                                                                
SPTSLDM4 DS    CL1                 DEMO4 MODIFIER                               
         DS    C                                                                
SPTSLDA4 DS    CL3                 DEMO4 AGE/SEX CATEGORY                       
         DS    C                                                                
SPTSLDV4 DS    CL6                 DEMO4 VALUE                                  
         DS    C                                                                
SPTSLNET DS    CL4                 CANADIAN NETWORK                             
*                                                                               
SPTSLDX  DS    CL2                 RECORD END                                   
SPTSLDL  EQU   *-SPTSLD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - DAYPART MENU RECORD                           *         
***********************************************************************         
*                                                                               
SPTDMD   DSECT                     DAYPART MENU RECORD                          
SPTDMLEN DS    CL4                 RECORD LENGTH                                
SPTDMTYP DS    CL5                 RECORD TYPE     '07134'                      
         DS    C                                                                
SPTDMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTDMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTDMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTDMAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTDMMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTDMMEN DS    CL1                 MENU                                         
         DS    C                                                                
SPTDMCOD DS    CL1                 DAYPART CODE                                 
         DS    C                                                                
SPTDMGCD DS    CL2                 DAYPART GROUP CODE                           
         DS    C                                                                
SPTDMDPT DS    CL3                 DAYPART                                      
*                                                                               
SPTDMDX  DS    CL2                 RECORD END                                   
SPTDMDL  EQU   *-SPTDMD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - DEMO CODES AND NAMES                          *         
***********************************************************************         
*                                                                               
SPTDED   DSECT                     DEMO CODES AND NAMES                         
SPTDELEN DS    CL4                 RECORD LENGTH                                
SPTDETYP DS    CL5                 RECORD TYPE     '07135'                      
         DS    C                                                                
SPTDEACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTDEDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTDETME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTDEAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTDECOD DS    CL5                 INTERNAL DEMO CODE                           
         DS    C                                                                
SPTDENAM DS    CL7                 DEMO NAME                                    
*                                                                               
SPTDEDX  DS    CL2                 RECORD END                                   
SPTDEDL  EQU   *-SPTDED            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - ADBUYER                                                 
***********************************************************************         
*                                                                               
SPTABD   DSECT                                                                  
SPTABLEN DS    CL4                 RECORD LENGTH                                
SPTABTYP DS    CL5                 RECORD TYPE     '07136'                      
         DS    C                                                                
SPTABACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTABDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTABTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTABAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTABMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTABCOD DS    CL3                 BUYER CODE                                   
         DS    C                                                                
SPTABNAM DS    CL24                BUYER FULL NAME                              
*                                                                               
SPTABDX  DS    CL2                 RECORD END                                   
SPTABDL  EQU   *-SPTABD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - ESTIMATE AUTHORIZED DOLLARS                             
***********************************************************************         
*                                                                               
SPTELD   DSECT                     ESTIMATE AUTHORIZED DOLLARS                  
SPTELLEN DS    CL4                 RECORD LENGTH                                
SPTELTYP DS    CL5                 RECORD TYPE     '07137'                      
         DS    C                                                                
SPTELACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTELDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTELTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTELAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTELMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTELCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTELPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTELEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
SPTELMY  DS    CL6                 MONTH/YEAR                                   
         DS    C                                                                
SPTELAUD DS    CL11                AUTHORIZED DOLLARS                           
*                                                                               
SPTELDX  DS    CL2                 RECORD END                                   
SPTELDL  EQU   *-SPTELD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - DARE ORDER                                              
***********************************************************************         
*                                                                               
SPTDOD   DSECT                     DARE ORDER                                   
SPTDOLEN DS    CL4                 RECORD LENGTH                                
SPTDOTYP DS    CL5                 RECORD TYPE     '07138'/'07139'              
         DS    C                                                                
SPTDOACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTDODAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTDOTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTDOAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTDOXKY DS    CL28                HEXADECIMAL KEY                              
         DS    C                                                                
SPTDOMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTDOORD DS    CL8                 ORDER NUMBER                                 
         DS    C                                                                
SPTDOSTA DS    CL5                 STATION                                      
         DS    C                                                                
SPTDOSTT DS    C                   STATUS                                       
         DS    C                                                                
SPTDOUDT DS    CL17                LAST CHANGE DATE                             
         DS    C                                                                
SPTDOUTM DS    CL17                LAST CHANGE TIME                             
         DS    C                                                                
SPTDOREP DS    CL10                REP (USER ID, REALLY)                        
         DS    C                                                                
SPTDORTE DS    CL5                 ROUTING CODE                                 
         DS    C                                                                
SPTDOCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTDOPR1 DS    CL3                 PRODUCT 1                                    
         DS    C                                                                
SPTDOPB1 DS    CL3                 PRODUCT 1 BINARY                             
         DS    C                                                                
SPTDOPR2 DS    CL3                 PRODUCT 2                                    
         DS    C                                                                
SPTDOPB2 DS    CL3                 PRODUCT 2 BINARY                             
         DS    C                                                                
SPTDOEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
SPTDOCON DS    CL8                 CONTRACT NUMBER                              
         DS    C                                                                
SPTDOCAT DS    C                   CASH OR TRADE                                
         DS    C                                                                
SPTDOREV DS    CL3                 REVISION NUMBER                              
         DS    C                                                                
SPTDOPRE DS    CL5                 PREVIOUS STATION CALL LETTERS                
         DS    C                                                                
SPTDOMTH DS    CL1                 METHOD OF TRADE BEING USED                   
         DS    C                                                                
SPTDOMTD DS    CL8                 SO WE KNOW HOW TRADE PULLLS BUYS             
         DS    C                                                                
SPTDOAGI DS    CL8                 AGENCY ID                                    
         DS    C                                                                
SPTDOSPT DS    CL10                TOTAL SPOTS                                  
         DS    C                                                                
SPTDODOL DS    CL10                TOTAL DOLLARS                                
         DS    C                                                                
SPTDOMKT DS    CL4                 MARKET                                       
         DS    C                                                                
SPTDOMKN DS    CL24                MARKET NAME                                  
*                                                                               
SPTDODX  DS    CL2                 RECORD END                                   
SPTDODL  EQU   *-SPTDOD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - BUY EXTRACT REQUEST                                     
***********************************************************************         
*                                                                               
SPTXQD   DSECT                     BUY EXTRACT REQUEST                          
SPTXQLEN DS    CL4                 RECORD LENGTH                                
SPTXQTYP DS    CL5                 RECORD TYPE     '07140'                      
         DS    C                                                                
SPTXQACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTXQDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTXQTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTXQREQ DS    CL80                REQUEST CARD                                 
*                                                                               
SPTXQDX  DS    CL2                 RECORD END                                   
SPTXQDL  EQU   *-SPTXQD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - FLIGHT RECORD                                 *         
***********************************************************************         
         SPACE 1                                                                
SPTFLD   DSECT                     FLIGHT RECORD                                
SPTFLLEN DS    CL4                 RECORD LENGTH                                
SPTFLTYP DS    CL5                 RECORD TYPE     '07142'                      
         DS    C                                                                
SPTFLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTFLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTFLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTFLAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTFLMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTFLCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTFLPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTFLEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
SPTFLNFD DS    CL8                 FIRST NON-FLIGHT END DATE                    
*                                                                               
SPTFLDX  DS    CL2                 RECORD END                                   
SPTFLDL  EQU   *-SPTFLD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM EXTRACT - FLIGHT RECORD FLIGHT                          *         
***********************************************************************         
         SPACE 1                                                                
SPTFFD   DSECT                     FLIGHT RECORD FLIGHT                         
SPTFFLEN DS    CL4                 RECORD LENGTH                                
SPTFFTYP DS    CL5                 RECORD TYPE     '07143'                      
         DS    C                                                                
SPTFFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTFFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTFFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTFFAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTFFMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTFFCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTFFPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTFFEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
SPTFFNUM DS    CL3                 FLIGHT NUMBER                                
         DS    C                                                                
SPTFFLOK DS    C                   LOCKED BY DARE                               
         DS    C                                                                
SPTFFSDT DS    CL8                 FLIGHT START DATE                            
         DS    C                                                                
SPTFFEDT DS    CL8                 FLIGHT END DATE                              
*                                                                               
SPTFFDX  DS    CL2                 RECORD END                                   
SPTFFDL  EQU   *-SPTFFD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM COMSCORE MARKET RECORD                                            
***********************************************************************         
         SPACE 1                                                                
SPTMCD   DSECT                     COMSCORE MARKET RECORD                       
SPTMCLEN DS    CL4                 RECORD LENGTH                                
SPTMCTYP DS    CL5                 RECORD TYPE  '07144'                         
         DS    C                                                                
SPTMCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTMCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTMCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTMCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTMCMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTMCMKT DS    CL4                 MARKET                                       
         DS    C                                                                
SPTMCNAM DS    CL24                NAME                                         
         DS    C                                                                
SPTMCRS1 DS    CL3                 RATING SERVICE 1                             
         DS    C                                                                
SPTMCRM1 DS    CL4                 RATING SERVICE MARKET 1                      
         DS    C                                                                
SPTMCRS2 DS    CL3                 RATING SERVICE 1                             
         DS    C                                                                
SPTMCRM2 DS    CL4                 RATING SERVICE MARKET 2                      
         DS    C                                                                
SPTMCCOM DS    CL5                 COMSCORE MARKET                              
         DS    C                                                                
SPTMCBKT DS    CL1                 COMSCORE BOOKTYPE                            
         DS    C                                                                
SPTMCTOK DS    CL32                TOKEN                                        
*                                                                               
SPTMCDX  DS    CL2                 RECORD END                                   
SPTMCDL  EQU   *-SPTMCD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM SPILLDEF RECORD                                                   
***********************************************************************         
         SPACE 1                                                                
SPTSPD   DSECT                     SPILLDEF RECORD                              
SPTSPLEN DS    CL4                 RECORD LENGTH                                
SPTSPTYP DS    CL5                 RECORD TYPE  '07146'                         
         DS    C                                                                
SPTSPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTSPMED DS    C                   MEDIA                                        
         DS    C                                                                
SPTSPRTG DS    CL3                 RATING SERVICE                               
         DS    C                                                                
SPTSPSTA DS    CL5                 STATION                                      
         DS    C                                                                
SPTSPCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTSPSEQ DS    CL3                 SEQUENCE                                     
         DS    C                                                                
SPTSPMKT DS    CL4                 MARKET                                       
         DS    C                                                                
SPTSPMKN DS    CL24                MARKET NAME                                  
         DS    C                                                                
SPTSPALP DS    CL3                 NSI ALPHA                                    
         DS    C                                                                
SPTSPNMK DS    CL4                 NSI MARKET                                   
*                                                                               
SPTSPDX  DS    CL2                 RECORD END                                   
SPTSPDL  EQU   *-SPTSPD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT SYSTEM SQAD DAYPART MENU                                                 
***********************************************************************         
         SPACE 1                                                                
SPTSQD   DSECT                     SQAD DAYPART MENU                            
SPTSQLEN DS    CL4                 RECORD LENGTH                                
SPTSQTYP DS    CL5                 RECORD TYPE  '07147'                         
         DS    C                                                                
SPTSQACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTSQDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTSQTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTSQAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTSQMED DS    C                   MEDIA                                        
         DS    C                                                                
SPTSQDPM DS    C                   DAYPART MENU                                 
         DS    C                                                                
SPTSQDDS DS    C                   DDS DAYPART                                  
         DS    C                                                                
SPTSQSQD DS    CL5                 SQAD DAYPART                                 
         DS    C                                                                
SPTSQSQN DS    CL12                SQAD DAYPART NAME                            
*                                                                               
SPTSQDX  DS    CL2                 RECORD END                                   
SPTSQDL  EQU   *-SPTSQD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT DEMO MENUS                                                               
***********************************************************************         
         SPACE 1                                                                
SPTMUD   DSECT                     DEMO MENUS                                   
SPTMULEN DS    CL4                 RECORD LENGTH                                
SPTMUTYP DS    CL5                 RECORD TYPE  '07148'                         
         DS    C                                                                
SPTMUACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTMUDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTMUTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTMUAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTMUMED DS    C                   MEDIA                                        
         DS    C                                                                
SPTMUMNU DS    CL4                 MENU                                         
         DS    C                                                                
SPTMUD01 DS    CL7                 DEMO 01                                      
         DS    C                                                                
SPTMUD02 DS    CL7                 DEMO 02                                      
         DS    C                                                                
SPTMUD03 DS    CL7                 DEMO 03                                      
         DS    C                                                                
SPTMUD04 DS    CL7                 DEMO 04                                      
         DS    C                                                                
SPTMUD05 DS    CL7                 DEMO 05                                      
         DS    C                                                                
SPTMUD06 DS    CL7                 DEMO 06                                      
         DS    C                                                                
SPTMUD07 DS    CL7                 DEMO 07                                      
         DS    C                                                                
SPTMUD08 DS    CL7                 DEMO 08                                      
         DS    C                                                                
SPTMUD09 DS    CL7                 DEMO 09                                      
         DS    C                                                                
SPTMUD10 DS    CL7                 DEMO 10                                      
         DS    C                                                                
SPTMUD11 DS    CL7                 DEMO 11                                      
         DS    C                                                                
SPTMUD12 DS    CL7                 DEMO 12                                      
         DS    C                                                                
SPTMUD13 DS    CL7                 DEMO 13                                      
         DS    C                                                                
SPTMUD14 DS    CL7                 DEMO 14                                      
         DS    C                                                                
SPTMUD15 DS    CL7                 DEMO 15                                      
         DS    C                                                                
SPTMUD16 DS    CL7                 DEMO 16                                      
         DS    C                                                                
SPTMUD17 DS    CL7                 DEMO 17                                      
         DS    C                                                                
SPTMUD18 DS    CL7                 DEMO 18                                      
         DS    C                                                                
SPTMUD19 DS    CL7                 DEMO 19                                      
         DS    C                                                                
SPTMUD20 DS    CL7                 DEMO 20                                      
*                                                                               
SPTMUDX  DS    CL2                 RECORD END                                   
SPTMUDL  EQU   *-SPTMUD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT BILL FORMULA DEFINITION                                                  
***********************************************************************         
         SPACE 1                                                                
SPTBFD   DSECT                     BILL FORMULA DEFINITION                      
SPTBFLEN DS    CL4                 RECORD LENGTH                                
SPTBFTYP DS    CL5                 RECORD TYPE  '07149'                         
         DS    C                                                                
SPTBFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTBFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTBFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTBFAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTBFMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTBFCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTBFPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
SPTBFEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
SPTBFMKT DS    CL4                 MARKET                                       
         DS    C                                                                
SPTBFMOS DS    CL8                 MOS MMM/YYYY                                 
         DS    C                                                                
SPTBFBFM DS    CL18                BILL FORMULA                                 
*                                                                               
SPTBFDX  DS    CL2                 RECORD END                                   
SPTBFDL  EQU   *-SPTBFD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT PATTERN HEADER                                                           
***********************************************************************         
         SPACE 1                                                                
SPTPHD   DSECT                     PATTERN HEADER                               
SPTPHLEN DS    CL4                 RECORD LENGTH                                
SPTPHTYP DS    CL5                 RECORD TYPE  '07150'                         
         DS    C                                                                
SPTPHACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPHDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPHTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPHAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPHID  DS    CL28                PATTERN KEY                                  
         DS    C                                                                
SPTPHMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTPHCLT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTPHP1C DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
SPTPHP1L DS    CL3                 COMML LENGTH                                 
         DS    C                                                                
SPTPHP2C DS    CL3                 PARTNER PRODUCT CODE                         
         DS    C                                                                
SPTPHP2L DS    CL3                 PARTNER COMMERCIAL LENGTH                    
         DS    C                                                                
SPTPHEST DS    CL3                 ESTIMATE                                     
         DS    C                                                                
SPTPHDPT DS    CL1                 DAYPART                                      
         DS    C                                                                
SPTPHPDP DS    CL1                 PROGRAM DAYPART                              
         DS    C                                                                
SPTPHADJ DS    CL1                 ADJACENCY CODE                               
         DS    C                                                                
SPTPHREF DS    CL5                 REF                                          
         DS    C                                                                
SPTPHDSC DS    CL16                DESCRIPTION                                  
         DS    C                                                                
SPTPHSDT DS    CL8                 PATTERN START DATE                           
         DS    C                                                                
SPTPHEDT DS    CL8                 PATTERN END DATE                             
         DS    C                                                                
SPTPHSTM DS    CL8                 PATTERN START TIME                           
         DS    C                                                                
SPTPHETM DS    CL8                 PATTERN END TIME                             
         DS    C                                                                
SPTPHTDL DS    CL1                 TIMES DAILY (Y/N)                            
         DS    C                                                                
SPTPHTXT DS    CL7                 TEXT                                         
         DS    C                                                                
SPTPHTPE DS    CL1                 TYPE                                         
         DS    C                                                                
SPTPHROT DS    CL69                ROTATION                                     
         DS    C                                                                
SPTPHDEL DS    CL1                 SOFT DELETED?                                
         DS    C                                                                
SPTPHINV DS    CL1                 INVERTED PRODUCTS?                           
         DS    C                                                                
SPTPHHIA DS    CL1                 HIATUS? Y/N                                  
*                                                                               
SPTPHDX  DS    CL2                 RECORD END                                   
SPTPHDL  EQU   *-SPTPHD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT PATTERN COMMERCIAL                                                       
***********************************************************************         
         SPACE 1                                                                
SPTPCD   DSECT                     PATTERN COMMERCIALS                          
SPTPCLEN DS    CL4                 RECORD LENGTH                                
SPTPCTYP DS    CL5                 RECORD TYPE  '07151'                         
         DS    C                                                                
SPTPCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPCAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPCID  DS    CL28                PATTERN KEY                                  
         DS    C                                                                
SPTPCLTR DS    CL1                 LETTER                                       
         DS    C                                                                
SPTPCCM1 DS    CL12                COMMERCIAL 1                                 
         DS    C                                                                
SPTPCCM2 DS    CL12                COMMERCIAL 2                                 
         DS    C                                                                
SPTPCPCT DS    CL3                 PERCENTAGE                                   
*                                                                               
SPTPCDX  DS    CL2                 RECORD END                                   
SPTPCDL  EQU   *-SPTPCD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT PATTERN MARKETS                                                          
***********************************************************************         
SPTPMD   DSECT                     PATTERN MARKETS                              
SPTPMLEN DS    CL4                 RECORD LENGTH                                
SPTPMTYP DS    CL5                 RECORD TYPE  '07152'                         
         DS    C                                                                
SPTPMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPMAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPMID  DS    CL28                PATTERN KEY                                  
         DS    C                                                                
SPTPMSEQ DS    CL3                 SEQUENCE NUMBER                              
         DS    C                                                                
SPTPMMKT DS    CL4                 MARKET                                       
*                                                                               
SPTPMDX  DS    CL2                 RECORD END                                   
SPTPMDL  EQU   *-SPTPMD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT PATTERN STATIONS                                                         
***********************************************************************         
SPTPSD   DSECT                     PATTERN STATIONS                             
SPTPSLEN DS    CL4                 RECORD LENGTH                                
SPTPSTYP DS    CL5                 RECORD TYPE  '07153'                         
         DS    C                                                                
SPTPSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPSAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPSID  DS    CL28                PATTERN KEY                                  
         DS    C                                                                
SPTPSSEQ DS    CL3                 SEQUENCE NUMBER                              
         DS    C                                                                
SPTPSSTA DS    CL10                STATION                                      
*                                                                               
SPTPSDX  DS    CL2                 RECORD END                                   
SPTPSDL  EQU   *-SPTPSD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT PATTERN MARKET GROUPS                                                    
***********************************************************************         
SPTPKD   DSECT                     PATTERN MARKET GROUPS                        
SPTPKLEN DS    CL4                 RECORD LENGTH                                
SPTPKTYP DS    CL5                 RECORD TYPE  '07154'                         
         DS    C                                                                
SPTPKACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPKDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPKTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPKAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPKID  DS    CL28                PATTERN KEY                                  
         DS    C                                                                
SPTPKSEQ DS    CL3                 SEQUENCE NUMBER                              
         DS    C                                                                
SPTPKMKG DS    CL6                 MARKET GROUP                                 
*                                                                               
SPTPKDX  DS    CL2                 RECORD END                                   
SPTPKDL  EQU   *-SPTPKD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT PATTERN AFFILIATES                                                       
***********************************************************************         
SPTPAD   DSECT                     PATTERN AFFILIATES                           
SPTPALEN DS    CL4                 RECORD LENGTH                                
SPTPATYP DS    CL5                 RECORD TYPE  '07155'                         
         DS    C                                                                
SPTPAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPAAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPAID  DS    CL28                PATTERN KEY                                  
         DS    C                                                                
SPTPASEQ DS    CL3                 SEQUENCE NUMBER                              
         DS    C                                                                
SPTPAAFF DS    CL5                 AFFILIATE                                    
*                                                                               
SPTPADX  DS    CL2                 RECORD END                                   
SPTPADL  EQU   *-SPTPAD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT PATTERN STATION TYPES                                                    
***********************************************************************         
SPTPTD   DSECT                     PATTERN STATION TYPES                        
SPTPTLEN DS    CL4                 RECORD LENGTH                                
SPTPTTYP DS    CL5                 RECORD TYPE  '07156'                         
         DS    C                                                                
SPTPTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPTAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPTID  DS    CL28                PATTERN KEY                                  
         DS    C                                                                
SPTPTSTP DS    CL1                 STATION TYPE                                 
*                                                                               
SPTPTDX  DS    CL2                 RECORD END                                   
SPTPTDL  EQU   *-SPTPTD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT PATTERN COMMENTS                                                         
***********************************************************************         
SPTPND   DSECT                     PATTERN COMMENTS                             
SPTPNLEN DS    CL4                 RECORD LENGTH                                
SPTPNTYP DS    CL5                 RECORD TYPE  '07157'                         
         DS    C                                                                
SPTPNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTPNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTPNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTPNAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTPNID  DS    CL28                PATTERN KEY                                  
         DS    C                                                                
SPTPNNUM DS    CL3                 COMMENT NUMBER                               
         DS    C                                                                
SPTPNCOM DS    CL60                COMMENT                                      
*                                                                               
SPTPNDX  DS    CL2                 RECORD END                                   
SPTPNDL  EQU   *-SPTPND            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT TRAFFIC STEXT PAGE DEFINITION                                            
***********************************************************************         
SPTDPD   DSECT                     TEXT PAGE DEFINITION                         
SPTDPLEN DS    CL4                 RECORD LENGTH                                
SPTDPTYP DS    CL5                 RECORD TYPE  '07158'                         
         DS    C                                                                
SPTDPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTDPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTDPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTDPAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTDPMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTDPCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTDPDSC DS    CL7                 DESCRIPTION                                  
         DS    C                                                                
SPTDPPAG DS    CL3                 PAGE NUMBER                                  
         DS    C                                                                
SPTDPTTL DS    CL24                TITLE                                        
*                                                                               
SPTDPDX  DS    CL2                 RECORD END                                   
SPTDPDL  EQU   *-SPTDPD            RECORD LENGTH                                
*                                                                               
*                                                                               
*                                                                               
***********************************************************************         
* SPOT TRAFFIC STEXT TEXT LINE                                                  
***********************************************************************         
SPTLND   DSECT                     STEXT TEXT LINE                              
SPTLNLEN DS    CL4                 RECORD LENGTH                                
SPTLNTYP DS    CL5                 RECORD TYPE  '07159'                         
         DS    C                                                                
SPTLNACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
SPTLNDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
SPTLNTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
SPTLNAGY DS    CL2                 AGENCY                                       
         DS    C                                                                
SPTLNMED DS    CL1                 MEDIA                                        
         DS    C                                                                
SPTLNCNT DS    CL3                 CLIENT                                       
         DS    C                                                                
SPTLNDSC DS    CL7                 DESCRIPTION                                  
         DS    C                                                                
SPTLNPAG DS    CL3                 PAGE NUMBER                                  
         DS    C                                                                
SPTLNLNN DS    CL3                 LINE NUMBER                                  
         DS    C                                                                
SPTLNLTX DS    CL60                LINE TEXT                                    
*                                                                               
SPTLNDX  DS    CL2                 RECORD END                                   
SPTLNDL  EQU   *-SPTLND            RECORD LENGTH                                
