*          DATA SET SRABNFFD   AT LEVEL 001 AS OF 05/17/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T1FFFFD      DATE 05/17/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ABNMSGH  DS    XL8                                                              
ABNMSG   DS    CL60     1    2   60  L  P N             T        Y              
ABNSRVH  DS    XL8                                                              
ABNSRV   DS    CL17     1   63   17  A  U N        M    T    I   Y              
         DS    XL8                                                              
         DS    CL16     3    2   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     3   22   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     3   42   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     3   62   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     4    2   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     4   22   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     4   42   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     4   62   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL35     6    2   35  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     7   16   24  L  P N             T        Y              
ABNWHOH  DS    XL8                                                              
ABNWHO   DS    CL70     9    2   70  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    11    2   23  L  P N             T        Y              
ABNNUMH  DS    XL8                                                              
ABNNUM   DS    CL2     11   26    2  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    2    7  L  P N             T        Y              
ABNRGS1H DS    XL8                                                              
ABNRGS1  DS    CL71    13    9   71  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  L  P N             T        Y              
ABNRGS2H DS    XL8                                                              
ABNRGS2  DS    CL71    14    9   71  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    2    7  L  P N             T        Y              
ABNPSWH  DS    XL8                                                              
ABNPSW   DS    CL17    16    9   17  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    2    5  L  P N             T        Y              
ABNSYSH  DS    XL8                                                              
ABNSYS   DS    CL7     18    8    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   16    6  L  P N             T        Y              
ABNPRGH  DS    XL8                                                              
ABNPRG   DS    CL7     18   23    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   31    6  L  P N             T        Y              
ABNTRMH  DS    XL8                                                              
ABNTRM   DS    CL8     18   38    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    18   48   16  L  P N             T        Y              
ABNSINH  DS    XL8                                                              
ABNSIN   DS    CL7     18   65    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   73    6  A  P L             T        Y              
ABNLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
ABNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
