*          DATA SET SRADDFFD   AT LEVEL 007 AS OF 11/19/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T129FFD      DATE 11/19/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     3    2   16  A  U N        M    T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     3   22   16  A  U N        M    T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   42   16  A  U N        M    T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL16     4    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     4   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     4   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     4   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     6    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     7    2   78  A  P N             T        Y              
SRVL1H   DS    CL8                                                              
SRVL1    DS    CL24     8    2   24  A  P N             T        Y              
SRVL2H   DS    CL8                                                              
SRVL2    DS    CL24     8   28   24  A  P N             T        Y              
SRVL3H   DS    CL8                                                              
SRVL3    DS    CL24     8   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     9    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     9   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     9   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    10    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    10   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    10   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    11    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    11   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    11   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    12    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    12   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    12   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    13    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    13   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    13   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    14    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    14   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    14   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    15    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    15   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    15   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    16    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    16   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    16   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    17    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    17   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    17   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    18    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    18   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    18   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    19    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    19   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    19   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    20    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    20   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    20   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    21    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    21   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    21   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    22    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    22   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    22   54   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    23    2   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    23   28   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    23   54   24  A  P N             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2000 BYTES                            
