*          DATA SET SRALOFFD   AT LEVEL 002 AS OF 09/15/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T127FFD      DATE 09/15/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60   A    P    N         T         Y           
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17   A    U    N    M    T    I    Y           
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     3    2   16   A    U    N    M    T         Y           
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     3   22   16   A    U    N    M    T         Y           
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   42   16   A    U    N    M    T         Y           
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL16     4    2   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     4   22   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     4   42   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     4   62   16   A    P    N         T         Y           
SRVL1H   DS    CL8                                                              
SRVL1    DS    CL9      6    2    9   A    U    N    M    T         Y           
SRVL2H   DS    CL8                                                              
SRVL2    DS    CL9      6   14    9   A    U    N    M    T         Y           
SRVL3H   DS    CL8                                                              
SRVL3    DS    CL9      6   26    9   A    U    N    M    T         Y           
SRVL4H   DS    CL8                                                              
SRVL4    DS    CL9      6   38    9   A    U    N    M    T         Y           
SRVL5H   DS    CL8                                                              
SRVL5    DS    CL9      6   50    9   A    U    N    M    T         Y           
SRVL6H   DS    CL8                                                              
SRVL6    DS    CL9      6   62    9   A    U    N    M    T         Y           
SRVL7H   DS    CL8                                                              
SRVL7    DS    CL9      7    2    9   A    U    N    M    T         Y           
SRVL8H   DS    CL8                                                              
SRVL8    DS    CL9      7   14    9   A    U    N    M    T         Y           
SRVL9H   DS    CL8                                                              
SRVL9    DS    CL9      7   26    9   A    U    N    M    T         Y           
SRVL10H  DS    CL8                                                              
SRVL10   DS    CL9      7   38    9   A    U    N    M    T         Y           
SRVL11H  DS    CL8                                                              
SRVL11   DS    CL9      7   50    9   A    U    N    M    T         Y           
SRVL12H  DS    CL8                                                              
SRVL12   DS    CL9      7   62    9   A    U    N    M    T         Y           
SRVL13H  DS    CL8                                                              
SRVL13   DS    CL9      8    2    9   A    U    N    M    T         Y           
SRVL14H  DS    CL8                                                              
SRVL14   DS    CL9      8   14    9   A    U    N    M    T         Y           
SRVL15H  DS    CL8                                                              
SRVL15   DS    CL9      8   26    9   A    U    N    M    T         Y           
SRVL16H  DS    CL8                                                              
SRVL16   DS    CL9      8   38    9   A    U    N    M    T         Y           
SRVL17H  DS    CL8                                                              
SRVL17   DS    CL9      8   50    9   A    U    N    M    T         Y           
SRVL18H  DS    CL8                                                              
SRVL18   DS    CL9      8   62    9   A    U    N    M    T         Y           
SRVL19H  DS    CL8                                                              
SRVL19   DS    CL9      9    2    9   A    U    N    M    T         Y           
SRVL20H  DS    CL8                                                              
SRVL20   DS    CL9      9   14    9   A    U    N    M    T         Y           
SRVL21H  DS    CL8                                                              
SRVL21   DS    CL9      9   26    9   A    U    N    M    T         Y           
SRVL22H  DS    CL8                                                              
SRVL22   DS    CL9      9   38    9   A    U    N    M    T         Y           
SRVL23H  DS    CL8                                                              
SRVL23   DS    CL9      9   50    9   A    U    N    M    T         Y           
SRVL24H  DS    CL8                                                              
SRVL24   DS    CL9      9   62    9   A    U    N    M    T         Y           
SRVL25H  DS    CL8                                                              
SRVL25   DS    CL9     10    2    9   A    U    N    M    T         Y           
SRVL26H  DS    CL8                                                              
SRVL26   DS    CL9     10   14    9   A    U    N    M    T         Y           
SRVL27H  DS    CL8                                                              
SRVL27   DS    CL9     10   26    9   A    U    N    M    T         Y           
SRVL28H  DS    CL8                                                              
SRVL28   DS    CL9     10   38    9   A    U    N    M    T         Y           
SRVL29H  DS    CL8                                                              
SRVL29   DS    CL9     10   50    9   A    U    N    M    T         Y           
SRVL30H  DS    CL8                                                              
SRVL30   DS    CL9     10   62    9   A    U    N    M    T         Y           
SRVL31H  DS    CL8                                                              
SRVL31   DS    CL9     11    2    9   A    U    N    M    T         Y           
SRVL32H  DS    CL8                                                              
SRVL32   DS    CL9     11   14    9   A    U    N    M    T         Y           
SRVL33H  DS    CL8                                                              
SRVL33   DS    CL9     11   26    9   A    U    N    M    T         Y           
SRVL34H  DS    CL8                                                              
SRVL34   DS    CL9     11   38    9   A    U    N    M    T         Y           
SRVL35H  DS    CL8                                                              
SRVL35   DS    CL9     11   50    9   A    U    N    M    T         Y           
SRVL36H  DS    CL8                                                              
SRVL36   DS    CL9     11   62    9   A    U    N    M    T         Y           
SRVL37H  DS    CL8                                                              
SRVL37   DS    CL9     12    2    9   A    U    N    M    T         Y           
SRVL38H  DS    CL8                                                              
SRVL38   DS    CL9     12   14    9   A    U    N    M    T         Y           
SRVL39H  DS    CL8                                                              
SRVL39   DS    CL9     12   26    9   A    U    N    M    T         Y           
SRVL40H  DS    CL8                                                              
SRVL40   DS    CL9     12   38    9   A    U    N    M    T         Y           
SRVL41H  DS    CL8                                                              
SRVL41   DS    CL9     12   50    9   A    U    N    M    T         Y           
SRVL42H  DS    CL8                                                              
SRVL42   DS    CL9     12   62    9   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL1     13    2    1   A    U    N         T         Y           
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1011 BYTES                            
