*          DATA SET SRASSFFD   AT LEVEL 014 AS OF 09/20/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T16CFFD      DATE 09/20/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVSRVH  DS    CL8                                                              
SRVSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
SRVSAVH  DS    CL8                                                              
SRVSAV   DS    CL2      2    2    2  A  U Z        M    T        Y              
         DS    CL8                                                              
         DS    CL8      3    2    8  A  P N             T        Y              
SRVKYWDH DS    CL8                                                              
SRVKYWD  DS    CL8      3   13    8  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL2      5    2    2  A  P N             T        Y              
SRVI1H   DS    CL8                                                              
SRVI1    DS    CL3      5    5    3  A  U N        M    T    I   N              
         DS    CL8                                                              
         DS    CL2      5   13    2  A  P N             T        Y              
SRVI2H   DS    CL8                                                              
SRVI2    DS    CL3      5   16    3  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL2      5   24    2  A  P N             T        Y              
SRVI3H   DS    CL8                                                              
SRVI3    DS    CL3      5   27    3  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL2      5   35    2  A  P N             T        Y              
SRVI4H   DS    CL8                                                              
SRVI4    DS    CL3      5   38    3  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL2      5   46    2  A  P N             T        Y              
SRVI5H   DS    CL8                                                              
SRVI5    DS    CL3      5   49    3  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL2      6    2    2  A  P N             T        Y              
SRVI6H   DS    CL8                                                              
SRVI6    DS    CL3      6    5    3  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL2      6   13    2  A  P N             T        Y              
SRVI7H   DS    CL8                                                              
SRVI7    DS    CL3      6   16    3  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL2      6   24    2  A  P N             T        Y              
SRVI8H   DS    CL8                                                              
SRVI8    DS    CL3      6   27    3  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL2      6   35    2  A  P N             T        Y              
SRVI9H   DS    CL8                                                              
SRVI9    DS    CL3      6   38    3  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL2      6   46    2  A  P N             T        Y              
SRVI0H   DS    CL8                                                              
SRVI0    DS    CL3      6   49    3  A  U N        M    T        N              
         DS    CL8                                                              
         DS    CL8     24    2    8  A  P N             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 368  BYTES                            
