*          DATA SET SRBIGFFD   AT LEVEL 001 AS OF 08/15/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T132FFD      DATE 08/15/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BIGHEADH DS    XL8                                                              
BIGHEAD  DS    CL60     1    2   60  A  P N             T        Y              
BIGSRVH  DS    XL8                                                              
BIGSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
BIGFRSTH DS    XL8                                                              
BIGFRST  DS    CL16     3    2   16  A  U N        M    T    I   Y              
BIGSCNDH DS    XL8                                                              
BIGSCND  DS    CL16     3   22   16  A  U N        M    T        Y              
BIGREVH  DS    XL8                                                              
BIGREV   DS    CL16     3   42   16  L  U N        M    T        Y              
BIGRSLTH DS    XL8                                                              
BIGRSLT  DS    CL16     3   62   16  L  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     4    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     4   22   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     4   42   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     4   62   16  A  P N             T        Y              
BIGBIGH  DS    XL8                                                              
BIGBIG   DS    CL73     6    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73     7    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73     8    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73     9    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    10    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    11    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    12    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    13    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    14    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    15    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    16    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    17    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    18    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    19    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    20    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    21    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    22    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    23    2   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73    24    2   73  A  P N             T        Y              
BIGLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
BIGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1832 BYTES                            
