*          DATA SET SRCALFFD   AT LEVEL 004 AS OF 08/08/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T139FFD      DATE 08/08/18                 
         SPACE 1                                                                
T139FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CALMSGH  DS    XL8                                                              
CALMSG   DS    CL60     1    2   60  A  P N             T        Y              
CALSRVH  DS    XL8                                                              
CALSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
CALAH    DS    XL8                                                              
CALA     DS    CL16     3    2   16  A  U N        M    T        Y              
CALBH    DS    XL8                                                              
CALB     DS    CL16     3   22   16  A  U N        M    T        Y              
CALCH    DS    XL8                                                              
CALC     DS    CL16     3   42   16  A  U N        M    T        Y              
CALDH    DS    XL8                                                              
CALD     DS    CL16     3   62   16  A  U N        M    T        Y              
CALCOMH  DS    XL8                                                              
CALCOM   DS    CL60     5    2   60  A  P N             T        Y              
CALCM2H  DS    XL8                                                              
CALCM2   DS    CL60     7    2   60  A  P N             T        Y              
CALCM3H  DS    XL8                                                              
CALCM3   DS    CL60     9    2   60  A  P N             T        Y              
CALCM4H  DS    XL8                                                              
CALCM4   DS    CL60    11    2   60  A  P N             T        Y              
CALCM5H  DS    XL8                                                              
CALCM5   DS    CL60    13    2   60  A  P N             T        Y              
CALCM6H  DS    XL8                                                              
CALCM6   DS    CL60    15    2   60  A  P N             T        Y              
CALCM7H  DS    XL8                                                              
CALCM7   DS    CL60    17    2   60  A  P N             T        Y              
CALLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
CALWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 736  BYTES                            
