*          DATA SET SRCCRFFD   AT LEVEL 001 AS OF 05/28/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T156FFD      DATE 05/28/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
CCRINPH  DS    CL8                                                              
CCRINP   DS    CL60     1    2   60   A    P    H    M    T    I    Y           
CCRSRVH  DS    CL8                                                              
CCRSRV   DS    CL17     1   63   17   A    U    H    M    T         Y           
CCRLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
CCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 96   BYTES                            
