*          DATA SET SRCOLFFD   AT LEVEL 004 AS OF 11/09/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T11BFFD      DATE 11/09/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N R R         T        Y              
SRVSRVH  DS    CL8                                                              
SRVSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     3    2   16  A  U H U W    M    T        Y    0         
SRVP1X   DS    CL8                                                              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     3   22   16  A  U H U W    M    T        Y    0         
SRVP2X   DS    CL8                                                              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   42   16  A  U H U W    M    T        Y    0         
SRVP3X   DS    CL8                                                              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16  A  U H U W    M    T        Y    0         
SRVP4X   DS    CL8                                                              
SRVU1H   DS    CL8                                                              
SRVU1    DS    CL16     4    2   16  A  P N   B         T        Y              
SRVU2H   DS    CL8                                                              
SRVU2    DS    CL16     4   22   16  A  P N   B         T        Y              
SRVU3H   DS    CL8                                                              
SRVU3    DS    CL16     4   42   16  A  P N   B         T        Y              
SRVU4H   DS    CL8                                                              
SRVU4    DS    CL16     4   62   16  A  P N   B         T        Y              
SRVIC1H  DS    CL8                                                              
SRVIC1   DS    CL16     6    2   16  L  U N U B    M    T        Y    0         
SRVIC1X  DS    CL8                                                              
SRVNC1H  DS    CL8                                                              
SRVNC1   DS    CL16     6   22   16  A  P N   B         T        Y              
SRVRC1H  DS    CL8                                                              
SRVRC1   DS    CL16     6   42   16  A  P H R B         T        Y              
SRVMC1H  DS    CL8                                                              
SRVMC1   DS    CL16     6   62   16  A  P N             T        Y              
SRVIC2H  DS    CL8                                                              
SRVIC2   DS    CL16     8    2   16  L  U N U R    M    T        Y    0         
SRVIC2X  DS    CL8                                                              
SRVNC2H  DS    CL8                                                              
SRVNC2   DS    CL16     8   22   16  A  P N   R         T        Y              
SRVRC2H  DS    CL8                                                              
SRVRC2   DS    CL16     8   42   16  A  P H R R         T        Y              
SRVMC2H  DS    CL8                                                              
SRVMC2   DS    CL16     8   62   16  A  P N             T        Y              
SRVIC3H  DS    CL8                                                              
SRVIC3   DS    CL16    10    2   16  L  U N U P    M    T        Y    0         
SRVIC3X  DS    CL8                                                              
SRVNC3H  DS    CL8                                                              
SRVNC3   DS    CL16    10   22   16  A  P N   P         T        Y              
SRVRC3H  DS    CL8                                                              
SRVRC3   DS    CL16    10   42   16  A  P H R P         T        Y              
SRVMC3H  DS    CL8                                                              
SRVMC3   DS    CL16    10   62   16  A  P N             T        Y              
SRVIC4H  DS    CL8                                                              
SRVIC4   DS    CL16    12    2   16  L  U N U G    M    T        Y    0         
SRVIC4X  DS    CL8                                                              
SRVNC4H  DS    CL8                                                              
SRVNC4   DS    CL16    12   22   16  A  P N   G         T        Y              
SRVRC4H  DS    CL8                                                              
SRVRC4   DS    CL16    12   42   16  A  P H R G         T        Y              
SRVMC4H  DS    CL8                                                              
SRVMC4   DS    CL16    12   62   16  A  P N             T        Y              
SRVIC5H  DS    CL8                                                              
SRVIC5   DS    CL16    14    2   16  L  U N U T    M    T        Y    0         
SRVIC5X  DS    CL8                                                              
SRVNC5H  DS    CL8                                                              
SRVNC5   DS    CL16    14   22   16  A  P N   T         T        Y              
SRVRC5H  DS    CL8                                                              
SRVRC5   DS    CL16    14   42   16  A  P H R T         T        Y              
SRVMC5H  DS    CL8                                                              
SRVMC5   DS    CL16    14   62   16  A  P N             T        Y              
SRVIC6H  DS    CL8                                                              
SRVIC6   DS    CL16    16    2   16  L  U N U Y    M    T        Y    0         
SRVIC6X  DS    CL8                                                              
SRVNC6H  DS    CL8                                                              
SRVNC6   DS    CL16    16   22   16  A  P N   Y         T        Y              
SRVRC6H  DS    CL8                                                              
SRVRC6   DS    CL16    16   42   16  A  P H R Y         T        Y              
SRVMC6H  DS    CL8                                                              
SRVMC6   DS    CL16    16   62   16  A  P N             T        Y              
SRVIC7H  DS    CL8                                                              
SRVIC7   DS    CL16    18    2   16  L  U N U W    M    T        Y    0         
SRVIC7X  DS    CL8                                                              
SRVNC7H  DS    CL8                                                              
SRVNC7   DS    CL16    18   22   16  A  P N   W         T        Y              
SRVRC7H  DS    CL8                                                              
SRVRC7   DS    CL16    18   42   16  A  P H R W         T        Y              
SRVMC7H  DS    CL8                                                              
SRVMC7   DS    CL16    18   62   16  A  P N             T        Y              
SRVUNH   DS    CL8                                                              
SRVUN    DS    CL16    21    2   16  L  U N             T        Y              
SRVPNH   DS    CL8                                                              
SRVPN    DS    CL16    21   22   16  A  P N             T        Y              
SRVPHH   DS    CL8                                                              
SRVPH    DS    CL16    21   42   16  A  P H             T        Y              
SRVUHH   DS    CL8                                                              
SRVUH    DS    CL16    21   62   16  L  U H             T        Y              
SRVBLKH  DS    CL8                                                              
SRVBLK   DS    CL16    22   62   16  L  U H B R         T        Y    0         
SRVBLKX  DS    CL8                                                              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1176 BYTES                            
