*          DATA SET SRCOND0D   AT LEVEL 005 AS OF 11/01/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T110D0D      DATE 11/01/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL60     2    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     2   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL8      3    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      3   11    8  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL8      4    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      4   11    8  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL8      5    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   11    8  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   11    8  A  U N             T        Y              
CNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
