*          DATA SET SRCONFED   AT LEVEL 008 AS OF 03/15/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T110FED      DATE 03/15/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL60     1    2   60  A  P N             T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     3    2   16  A  U N        M    T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     3   22   16  A  U N        M    T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   42   16  A  U N        M    T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL16     4    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     4   22   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     4   42   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     4   62   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     6    2   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55     6   16   55  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55     7   16   55  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55     8   16   55  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL55     9   16   55  A  P N             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 568  BYTES                            
