*          DATA SET SRCON00MUS AT LEVEL 025 AS OF 01/02/20                      
***********************************************************************         
* LIST OF SPECIAL USERIDS AND THEIR VALID PIDS                        *         
* 01 ENTRY IS A USERID AND 41 ENTRIES ARE PIDS VALID FOR THAT USERID  *         
***********************************************************************         
MISCLIST DS    0C                                                               
*                                                                               
         DC    X'01',C'DDSNA   '                                                
         DC    X'41',C'AWILDDNY'   ANTHONY WILLIAMS                             
         DC    X'41',C'KCAPDDNY'   KAREN CAPRANZANO                             
         DC    X'41',C'CLUSHA  '   CINDY LUSHA                                  
*                                                                               
         DC    X'01',C'ZIP     '                                                
         DC    X'41',C'AFREDDNY'   AL FREZZI                                    
         DC    X'41',C'PHEADDNY'   PATRICK HEADLEY                              
         DC    X'41',C'ERDRDDNY'   ELENA RODRIGUEZ                              
         DC    X'41',C'GCOLMONY'   GABRIELA COLOMA                              
         DC    X'41',C'CHERDDNY'   CRAIG HERON                                  
         DC    X'41',C'JWERBOWE'   JOHN WERBOWECKY                              
         DC    X'41',C'COSGOODE'   CHRISTOPHER OSGOODE                          
         DC    X'41',C'DTIRDDNY'   DOMINGO TIRADO                               
         DC    X'41',C'SPARINA '   SILVINO PARINA                               
         DC    X'41',C'SSAGUN  '   SARAH SAGUN                                  
         DC    X'41',C'MFORNILO'   MARY FORNILOSA                               
*                                                                               
         DC    X'01',C'GMREAD  '   ALPHA GZ                                     
         DC    X'41',C'READGM  '   GENERIC                                      
*                                                                               
         DC    X'01',C'MVREAD  '   ALPHA H9                                     
         DC    X'41',C'READMV  '   GENERIC                                      
         DC    X'41',C'SSHAREAD'   SUKETU SHAH                                  
         DC    X'41',C'DALIREAD'   DOREEN ALICEA                                
         DC    X'41',C'JMORREAD'   JEANNETTE MORALES                            
         DC    X'41',C'MDAVREAD'   MARGARET DAVIS                               
         DC    X'41',C'KKAYREAD'   KAREN KAY                                    
         DC    X'41',C'AGHRREAD'   AHMED GH'RAEL                                
         DC    X'41',C'JGRUREAD'   JEFFREY GRUBSTEIN                            
         DC    X'41',C'DDALREAD'   DONNA D'ALESIO                               
         DC    X'41',C'DFONREAD'   DAVID FONTANEZ                               
         DC    X'41',C'YGACREAD'   YOLIE GACHELIN                               
         DC    X'41',C'EAVIREAD'   ERIKA AVILES                                 
         DC    X'41',C'KORDREAD'   KATHERINE ORDINOLA                           
         DC    X'41',C'RSIOREAD'   RISE SION                                    
         DC    X'41',C'AMAZREAD'   ATOOSA MAZAHERI                              
         DC    X'41',C'DCAFREAD'   DANIELLE CAFFARONE                           
         DC    X'41',C'MPAPREAD'   MARYBETH PAPUGA                              
         DC    X'41',C'SPOUREAD'                                                
         DC    X'41',C'SWOLREAD'   STEVE WOLF                                   
*                                                                               
         DC    X'01',C'STAREAD '   ALPHA H9                                     
         DC    X'41',C'READST  '   GENERIC                                      
         DC    X'41',C'SSHAREAD'                                                
         DC    X'41',C'DALIREAD'                                                
         DC    X'41',C'JMORREAD'                                                
         DC    X'41',C'MDAVREAD'                                                
         DC    X'41',C'KKAYREAD'                                                
         DC    X'41',C'AGHRREAD'                                                
         DC    X'41',C'JGRUREAD'                                                
         DC    X'41',C'DDALREAD'                                                
         DC    X'41',C'DFONREAD'                                                
         DC    X'41',C'YGACREAD'                                                
         DC    X'41',C'JGLOREAD'   JIM GLONKE                                   
         DC    X'41',C'MRHIREAD'   MARSHALL RHINES                              
         DC    X'41',C'SWOLREAD'   STEVE WOLF                                   
*                                                                               
         DC    X'01',C'SPAREAD '   ALPHA H9                                     
         DC    X'41',C'READST  '   GENERIC                                      
         DC    X'41',C'SSHAREAD'                                                
         DC    X'41',C'DALIREAD'                                                
         DC    X'41',C'JMORREAD'                                                
         DC    X'41',C'MDAVREAD'                                                
         DC    X'41',C'KKAYREAD'                                                
         DC    X'41',C'AGHRREAD'                                                
         DC    X'41',C'JGRUREAD'                                                
         DC    X'41',C'DDALREAD'                                                
         DC    X'41',C'DFONREAD'                                                
         DC    X'41',C'YGACREAD'                                                
         DC    X'41',C'JGLOREAD'                                                
         DC    X'41',C'MRHIREAD'                                                
         DC    X'41',C'SWOLREAD'   STEVE WOLF                                   
*                                                                               
         DC    X'01',C'CDSOON  '                                                
         DC    X'41',C'AFREDDNY'   AL FREZZI                                    
         DC    X'41',C'AENGDDNY'   ANDREW ENG                                   
         DC    X'41',C'PHEADDNY'   PATRICK HEADLEY                              
*        DC    X'41',C'AOTHDDNY'   A N OTHER                                    
*                                                                               
         DC    X'01',C'BCAST   '                                                
