*          DATA SET SRCPYFFD   AT LEVEL 003 AS OF 11/03/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T143FFD      DATE 11/03/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A   P    N         T        Y              
SRVSREQH DS    CL8                                                              
SRVSREQ  DS    CL17     1   63   17  A   U    N    M    T    I   Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     3    2   16  A   U    N    M    T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     3   22   16  A   U    N    M    T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   42   16  A   U    N    M    T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL16     4    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4   22   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4   62   16  A   P    N         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 288  BYTES                            
