*          DATA SET SRCRPFBD   AT LEVEL 002 AS OF 06/14/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T16EFBD      DATE 06/14/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL20     6    2   20  A  P N             T        Y              
CRPSETH  DS    CL8                                                              
CRPSET   DS    CL4      6   23    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     7    2   20  A  P N             T        Y              
CRPINIH  DS    CL8                                                              
CRPINI   DS    CL4      7   23    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     7   40   20  A  P N             T        Y              
CRPHITH  DS    CL8                                                              
CRPHIT   DS    CL4      7   61    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     8    2   20  A  P N             T        Y              
CRPSTOPH DS    CL8                                                              
CRPSTOP  DS    CL4      8   23    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20     8   40   20  A  P N             T        Y              
CRPCNTH  DS    CL8                                                              
CRPCNT   DS    CL10     8   61   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    10    2   20  A  P N             T        Y              
CRPCOREH DS    CL8                                                              
CRPCORE  DS    CL8     10   23    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    10   40   20  A  P N             T        Y              
CRPCLENH DS    CL8                                                              
CRPCLEN  DS    CL8     10   61    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    11    2   20  A  P N             T        Y              
CRPISPCH DS    CL8                                                              
CRPISPC  DS    CL4     11   23    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    11   40   20  A  P N             T        Y              
CRPWSPCH DS    CL8                                                              
CRPWSPC  DS    CL4     11   61    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    13    2   20  A  P N             T        Y              
CRPFIXH  DS    CL8                                                              
CRPFIX   DS    CL4     13   23    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    15    2   20  A  P N             T        Y              
CRPDSPH  DS    CL8                                                              
CRPDSP   DS    CL8     15   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  A  P N             T        Y              
CRPBFR1H DS    CL8                                                              
CRPBFR1  DS    CL32    16   23   32  A  P N             T        Y              
CRPBFR2H DS    CL8                                                              
CRPBFR2  DS    CL32    17   23   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    18    2   20  A  P N             T        Y              
CRPAFT1H DS    CL8                                                              
CRPAFT1  DS    CL32    18   23   32  A  P N             T        Y              
CRPAFT2H DS    CL8                                                              
CRPAFT2  DS    CL32    19   23   32  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 680  BYTES                            
