*          DATA SET SRCRPFED   AT LEVEL 004 AS OF 06/14/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T16EFED      DATE 06/14/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TWAL1H   DS    CL8                                                              
TWAL1    DS    CL79     5    2   79  A  P N             T        Y              
TWAL2H   DS    CL8                                                              
TWAL2    DS    CL79     6    2   79  A  P N             T        Y              
TWAL3H   DS    CL8                                                              
TWAL3    DS    CL79     7    2   79  A  P N             T        Y              
TWAL4H   DS    CL8                                                              
TWAL4    DS    CL79     8    2   79  A  P N             T        Y              
TWAL5H   DS    CL8                                                              
TWAL5    DS    CL79     9    2   79  A  P N             T        Y              
TWAL6H   DS    CL8                                                              
TWAL6    DS    CL79    10    2   79  A  P N             T        Y              
TWAL7H   DS    CL8                                                              
TWAL7    DS    CL79    11    2   79  A  P N             T        Y              
TWAL8H   DS    CL8                                                              
TWAL8    DS    CL79    12    2   79  A  P N             T        Y              
TWAL9H   DS    CL8                                                              
TWAL9    DS    CL79    13    2   79  A  P N             T        Y              
TWALAH   DS    CL8                                                              
TWALA    DS    CL79    14    2   79  A  P N             T        Y              
TWALBH   DS    CL8                                                              
TWALB    DS    CL79    15    2   79  A  P N             T        Y              
TWALCH   DS    CL8                                                              
TWALC    DS    CL79    16    2   79  A  P N             T        Y              
TWALDH   DS    CL8                                                              
TWALD    DS    CL79    17    2   79  A  P N             T        Y              
TWALEH   DS    CL8                                                              
TWALE    DS    CL79    18    2   79  A  P N             T        Y              
TWALFH   DS    CL8                                                              
TWALF    DS    CL79    19    2   79  A  P N             T        Y              
TWALGH   DS    CL8                                                              
TWALG    DS    CL79    20    2   79  A  P N             T        Y              
TWALHH   DS    CL8                                                              
TWALH    DS    CL79    21    2   79  A  P N             T        Y              
TWALIH   DS    CL8                                                              
TWALI    DS    CL79    22    2   79  A  P N             T        Y              
TWALJH   DS    CL8                                                              
TWALJ    DS    CL79    23    2   79  A  P N             T        Y              
TWALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TWAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1656 BYTES                            
