*          DATA SET SRCRPFFD   AT LEVEL 013 AS OF 06/14/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T16EFFD      DATE 06/14/00                 
         SPACE 1                                                                
T16EFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CRPMSGH  DS    CL8                                                              
CRPMSG   DS    CL60     1    2   60  A  P N R R         T        Y              
CRPIDH   DS    CL8                                                              
CRPID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
CRPP1H   DS    CL8                                                              
CRPP1    DS    CL16     2    2   16  A  U N        M    T        Y              
CRPP2H   DS    CL8                                                              
CRPP2    DS    CL16     2   22   16  A  U N        M    T        Y              
CRPP3H   DS    CL8                                                              
CRPP3    DS    CL16     2   42   16  A  U N        M    T        Y              
CRPP4H   DS    CL8                                                              
CRPP4    DS    CL16     2   62   16  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL16     3    2   16  A  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL16     3   22   16  A  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL16     3   42   16  A  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL16     3   62   16  A  P N   B         T        Y              
CRPLOADH DS    CL8                                                              
CRPLOAD  DS    CL1      5    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     6    2   20  A  P N             T        Y              
CRPSETH  DS    CL8                                                              
CRPSET   DS    CL4      6   23    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     7    2   20  A  P N             T        Y              
CRPINIH  DS    CL8                                                              
CRPINI   DS    CL4      7   23    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20     7   40   20  A  P N             T        Y              
CRPHITH  DS    CL8                                                              
CRPHIT   DS    CL4      7   61    4  A  P H             T        Y              
CRPVF1H  DS    CL8                                                              
CRPVF1   DS    CL20     9    2   20  A  P N             T        Y              
CRPCOREH DS    CL8                                                              
CRPCORE  DS    CL8      9   23    8  A  U H             T        Y              
CRPCLFH  DS    CL8                                                              
CRPCLF   DS    CL20     9   40   20  A  P N             T        Y              
CRPCLENH DS    CL8                                                              
CRPCLEN  DS    CL8      9   61    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    11    2   20  A  P N             T        Y              
CRPSTOPH DS    CL8                                                              
CRPSTOP  DS    CL4     11   23    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    11   40   20  A  P N             T        Y              
CRPCNTH  DS    CL8                                                              
CRPCNT   DS    CL10    11   61   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    12    2   20  A  P N             T        Y              
CRPISPCH DS    CL8                                                              
CRPISPC  DS    CL4     12   23    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    12   40   20  A  P N             T        Y              
CRPWSPCH DS    CL8                                                              
CRPWSPC  DS    CL4     12   61    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    14    2   20  A  P N             T        Y              
CRPFIXH  DS    CL8                                                              
CRPFIX   DS    CL4     14   23    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  A  P N             T        Y              
CRPDSPH  DS    CL8                                                              
CRPDSP   DS    CL8     16   23    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    17    2   20  A  P N             T        Y              
CRPBFR1H DS    CL8                                                              
CRPBFR1  DS    CL32    17   23   32  A  P N             T        Y              
CRPBFR2H DS    CL8                                                              
CRPBFR2  DS    CL32    18   23   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    19    2   20  A  P N             T        Y              
CRPAFT1H DS    CL8                                                              
CRPAFT1  DS    CL32    19   23   32  A  P N             T        Y              
CRPAFT2H DS    CL8                                                              
CRPAFT2  DS    CL32    20   23   32  A  P N             T        Y              
CRPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CRPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1040 BYTES                            
