*          DATA SET SRDARFED   AT LEVEL 003 AS OF 01/18/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T161FED      DATE 01/18/02                 
         SPACE 1                                                                
T161FED  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DMGMSGH  DS    XL8                                                              
DMGMSG   DS    CL60     1    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     1   63   17  A  U N        M    T        Y              
DMGRD1H  DS    XL8                                                              
DMGRD1   DS    CL78     2    2   78  A  U N        M    T        Y              
DMGRD2H  DS    XL8                                                              
DMGRD2   DS    CL78     3    2   78  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL78     4    2   78  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL78     5    2   78  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL78     6    2   78  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL78     7    2   78  A  U N        M    T        Y              
DMGLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DMGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 680  BYTES                            
