*          DATA SET SRDISFFD   AT LEVEL 001 AS OF 09/19/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T118FFD      DATE 09/19/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N R R         T        Y              
SRVIDH   DS    XL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVP1H   DS    XL8                                                              
SRVP1    DS    CL16     2    2   16  A  U N        M    T        Y              
SRVP2H   DS    XL8                                                              
SRVP2    DS    CL16     2   22   16  A  U N        M    T        Y              
SRVP3H   DS    XL8                                                              
SRVP3    DS    CL16     2   42   16  A  U N        M    T        Y              
SRVP4H   DS    XL8                                                              
SRVP4    DS    CL16     2   62   16  A  U N        M    T        Y              
SRVU1H   DS    XL8                                                              
SRVU1    DS    CL17     3    2   17  A  P N   B         T        Y              
SRVU2H   DS    XL8                                                              
SRVU2    DS    CL17     3   22   17  A  P N   B         T        Y              
SRVU3H   DS    XL8                                                              
SRVU3    DS    CL17     3   42   17  A  P N   B         T        Y              
SRVU4H   DS    XL8                                                              
SRVU4    DS    CL17     3   62   17  A  P N   B         T        Y              
SRVH1OH  DS    XL8                                                              
SRVH1O   DS    CL17     5    2   17  A  P H R Y         T        Y              
SRVH1HH  DS    XL8                                                              
SRVH1H   DS    CL32     5   22   32  A  P H R G         T        Y              
SRVH1AH  DS    XL8                                                              
SRVH1A   DS    CL16     5   57   16  A  P H R R         T        Y              
SRVL1OH  DS    XL8                                                              
SRVL1O   DS    CL17     6    2   17  A  P N   Y         T        Y              
SRVL1HH  DS    XL8                                                              
SRVL1H   DS    CL32     6   22   32  A  U N        M    T        Y              
SRVL1AH  DS    XL8                                                              
SRVL1A   DS    CL16     6   57   16  A  P N   R         T        Y              
SRVL2OH  DS    XL8                                                              
SRVL2O   DS    CL17     7    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32     7   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     7   57   16  A  P N   R         T        Y              
SRVL3OH  DS    XL8                                                              
SRVL3O   DS    CL17     8    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32     8   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     8   57   16  A  P N   R         T        Y              
SRVL4OH  DS    XL8                                                              
SRVL4O   DS    CL17     9    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32     9   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     9   57   16  A  P N   R         T        Y              
SRVL5OH  DS    XL8                                                              
SRVL5O   DS    CL17    10    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    10   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    10   57   16  A  P N   R         T        Y              
SRVL60H  DS    XL8                                                              
SRVL60   DS    CL17    11    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    11   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    11   57   16  A  P N   R         T        Y              
SRVL7OH  DS    XL8                                                              
SRVL7O   DS    CL17    12    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    12   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    12   57   16  A  P N   R         T        Y              
SRVL8OH  DS    XL8                                                              
SRVL8O   DS    CL17    13    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    13   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    13   57   16  A  P N   R         T        Y              
SRVL9OH  DS    XL8                                                              
SRVL9O   DS    CL17    14    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    14   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    14   57   16  A  P N   R         T        Y              
SRVL10OH DS    XL8                                                              
SRVL10O  DS    CL17    15    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    15   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    15   57   16  A  P N   R         T        Y              
SRVL11OH DS    XL8                                                              
SRVL11O  DS    CL17    16    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    16   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    16   57   16  A  P N   R         T        Y              
SRVL12OH DS    XL8                                                              
SRVL12O  DS    CL17    17    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    17   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    17   57   16  A  P N   R         T        Y              
SRVL13OH DS    XL8                                                              
SRVL13O  DS    CL17    18    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    18   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    18   57   16  A  P N   R         T        Y              
SRVL14OH DS    XL8                                                              
SRVL14O  DS    CL17    19    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    19   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    19   57   16  A  P N   R         T        Y              
SRVL15OH DS    XL8                                                              
SRVL15O  DS    CL17    20    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    20   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    20   57   16  A  P N   R         T        Y              
SRVL16OH DS    XL8                                                              
SRVL16O  DS    CL17    21    2   17  A  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL32    21   22   32  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    21   57   16  A  P N   R         T        Y              
SRVDUMH  DS    XL8                                                              
SRVDUM   DS    CL1     22   22    1  A  U N        M    T        Y              
SRVSAVH  DS    XL8                                                              
SRVSAV   DS    CL78    23    2   78  A  U Z        M    T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H R R         T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1992 BYTES                            
