*          DATA SET SRDIPFFD   AT LEVEL 007 AS OF 08/10/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T146FFD      DATE 08/10/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A   P    N         T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL8      2    2    8  A   P    N         T        Y              
SRVSPIDH DS    CL8                                                              
SRVSPID  DS    CL9      2   11    9  A   U    N    M    T    I   Y              
         DS    CL8                                                              
         DS    CL4      2   21    4  A   P    N         T        Y              
SRVPAGEH DS    CL8                                                              
SRVPAGE  DS    CL4      2   26    4  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL4      2   32    4  A   P    N         T        Y              
SRVLINEH DS    CL8                                                              
SRVLINE  DS    CL5      2   37    5  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL6      2   44    6  A   P    N         T        Y              
SRVFORMH DS    CL8                                                              
SRVFORM  DS    CL2      2   51    2  A   U    N    M    T        Y              
SRVTABH  DS    CL8                                                              
SRVTAB   DS    CL1      2   79    1  A   U    N    M    T        Y              
SRVL1H   DS    CL8                                                              
SRVL1    DS    CL79     4    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     5    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     6    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     7    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     8    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    10    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    11    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    12    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    13    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    14    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    15    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    16    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    17    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    18    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    19    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    20    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    21    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    22    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  A   P    N         T        Y              
SRVFLAGH DS    CL8                                                              
SRVFLAG  DS    CL1     24   79    1  A   U    Z    M    T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1960 BYTES                            
