*          DATA SET SRDMPFBD   AT LEVEL 001 AS OF 05/16/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T15DFBD      DATE 05/16/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL1      3   79    1  A  P L             T        Y              
         DS    XL8                                                              
         DS    CL24     5    2   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     5   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     5   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     6    2   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     6   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     6   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  L  P N             T        Y              
SRVCIDH  DS    XL8                                                              
SRVCID   DS    CL10     7   14   10  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   29   11  L  P N             T        Y              
SRVLUIDH DS    XL8                                                              
SRVLUID  DS    CL8      7   41    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7   56   11  L  P N             T        Y              
SRVNODEH DS    XL8                                                              
SRVNODE  DS    CL12     7   68   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  L  P N             T        Y              
SRVCPIDH DS    XL8                                                              
SRVCPID  DS    CL10     8   14   10  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8   29   11  L  P N             T        Y              
SRVTNOH  DS    XL8                                                              
SRVTNO   DS    CL8      8   41    8  L  P N             T        Y              
SRVLIDH  DS    XL8                                                              
SRVLID   DS    CL24     8   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  L  P N             T        Y              
SRVCSSH  DS    XL8                                                              
SRVCSS   DS    CL7      9   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   29   11  L  P N             T        Y              
SRVTTYH  DS    XL8                                                              
SRVTTY   DS    CL10     9   41   10  L  P N             T        Y              
SRVCUH   DS    XL8                                                              
SRVCU    DS    CL24     9   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  L  P N             T        Y              
SRVCPGH  DS    XL8                                                              
SRVCPG   DS    CL12    10   14   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   29   12  L  P N             T        Y              
SRVCTYH  DS    XL8                                                              
SRVCTY   DS    CL11    10   41   11  L  P N             T        Y              
SRVDVH   DS    XL8                                                              
SRVDV    DS    CL24    10   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    2   11  L  P N             T        Y              
SRVLNGH  DS    XL8                                                              
SRVLNG   DS    CL12    11   14   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   29   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   41   11  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    11   56   24  L  P N             T        Y              
SRVFACNH DS    XL8                                                              
SRVFACN  DS    CL11    13    2   11  L  P N             T        Y              
SRVFACH  DS    XL8                                                              
SRVFAC   DS    CL8     13   14    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   29   11  L  P N             T        Y              
SRVOFFCH DS    XL8                                                              
SRVOFFC  DS    CL1     13   41    1  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   56   11  L  P N             T        Y              
SRVPVERH DS    XL8                                                              
SRVPVER  DS    CL10    13   68   10  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    2   11  L  P N             T        Y              
SRVIDNH  DS    XL8                                                              
SRVIDN   DS    CL14    14   14   14  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   29   11  L  P N             T        Y              
SRVAUTLH DS    XL8                                                              
SRVAUTL  DS    CL12    14   41   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   56   11  L  P N             T        Y              
SRVSIN#H DS    XL8                                                              
SRVSIN#  DS    CL8     14   68    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  L  P N             T        Y              
SRVSENH  DS    XL8                                                              
SRVSEN   DS    CL11    15   14   11  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   29   11  L  P N             T        Y              
SRVATBUH DS    XL8                                                              
SRVATBU  DS    CL12    15   41   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    15   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    16    2   11  L  P N             T        Y              
SRVTSTLH DS    XL8                                                              
SRVTSTL  DS    CL10    16   14   10  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    16   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    16   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    2   11  L  P N             T        Y              
SRVAUTHH DS    XL8                                                              
SRVAUTH  DS    CL8     17   14    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    17   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    17   56   24  L  P N             T        Y              
SRVAACTH DS    XL8                                                              
SRVAACT  DS    CL11    18    2   11  L  P N             T        Y              
SRVAACCH DS    XL8                                                              
SRVAACC  DS    CL8     18   14    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    18   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    18   56   24  L  P N             T        Y              
SRVTSTTH DS    XL8                                                              
SRVTSTT  DS    CL11    19    2   11  L  P N             T        Y              
SRVTSTIH DS    XL8                                                              
SRVTSTI  DS    CL4     19   14    4  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    19   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    19   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    20    2   11  L  P N             T        Y              
SRVUPDTH DS    XL8                                                              
SRVUPDT  DS    CL7     20   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    20   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    20   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    2   11  L  P N             T        Y              
SRVPNMEH DS    XL8                                                              
SRVPNME  DS    CL10    21   14   10  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    21   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    21   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    22    2   11  L  P N             T        Y              
SRVSESNH DS    XL8                                                              
SRVSESN  DS    CL14    22   14   14  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    22   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    22   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    23    2   11  L  P N             T        Y              
SRVASWPH DS    XL8                                                              
SRVASWP  DS    CL1     23   14    1  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    23   56   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    24    2   11  L  P N             T        Y              
SRVTMPSH DS    XL8                                                              
SRVTMPS  DS    CL12    24   14   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    24   29   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    24   56   24  L  P N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1928 BYTES                            
