*          DATA SET SRDMPKEY   AT LEVEL 005 AS OF 10/09/97                      
KEYTAB   DS    0F'0'                                                            
KEYWORD  DS    CL8                                                              
KEYSRCE  DS    X   X'0X' = USE DUMPED REGISTER                                  
*                  X'10'= USE DMPFACS AS BASE POINTER                           
*                  X'11' = USE DMPTCBE AS BASE POINTER                          
*                  X'12' = USE DMPUTL AS BASE POINTER                           
KEYOFFS  DS    AL3 OFFSET FROM KEYSRCE                                          
KEYTABL  EQU   *-KEYTAB                                                         
         ORG   KEYTAB                                                           
         DC    CL8'TCB     ',X'F1',AL3(0) USE 0(DMPFACS)                        
*                                                                               
         DC    CL8'TBUFF   ',X'12',AL3(TBUFF-UTLD)                              
         DC    CL8'STEREO  ',X'12',AL3(TBUFF-UTLD)                              
*                                                                               
         DC    CL8'CCBLAST ',X'11',AL3(TCBSVECB-TCBD)                           
         DC    CL8'FILEBUFF',X'11',AL3(TCBFILES-TCBD)                           
         DC    CL8'OWNERTSK',X'11',AL3(TCBLOCK-TCBD)                            
         DC    CL8'PHASEMAP',X'11',AL3(TCBMAP-TCBD)                             
         DC    CL8'PGMSTRT ',X'11',AL3(TCBPGMA-TCBD)                            
         DC    CL8'TCBPROG ',X'11',AL3(TCBPGMA-TCBD)                            
         DC    CL8'TCBPGMA ',X'11',AL3(TCBPGMA-TCBD)                            
         DC    CL8'TCBPGM  ',X'11',AL3(TCBPGMA-TCBD)                            
         DC    CL8'SELIST  ',X'11',AL3(TCBSE-TCBD)                              
         DC    CL8'SVRD    ',X'11',AL3(TCBSVRD-TCBD)                            
         DC    CL8'TCBCOMF ',X'11',AL3(TCBCOMF-TCBD)                            
         DC    CL8'TCBWRKA ',X'11',AL3(TCBWRKA-TCBD)                            
         DC    CL8'TCBWORK ',X'11',AL3(TCBWRKA-TCBD)                            
         DC    CL8'TCBWRK  ',X'11',AL3(TCBWRKA-TCBD)                            
         DC    CL8'TCBTWA  ',X'11',AL3(TCBTWA-TCBD)                             
         DC    CL8'TIA     ',X'11',AL3(TCBTIA-TCBD)                             
         DC    CL8'TCBTIA  ',X'11',AL3(TCBTIA-TCBD)                             
         DC    CL8'UTL     ',X'11',AL3(TCBUTL-TCBD)                             
         DC    CL8'TSAR    ',X'11',AL3(TCBTSAR-TCBD)                            
*                                                                               
         DC    CL8'ADRBUFF ',X'10',AL3(VADRBUFF-SYSFACD)                        
         DC    CL8'DECBLST ',X'10',AL3(VDECBLST-SYSFACD)                        
         DC    CL8'LOCKTAB ',X'10',AL3(VLOCKTAB-SYSFACD)                        
         DC    CL8'PRQ     ',X'10',AL3(VPRQ-SYSFACD)                            
         DC    CL8'PHLIST  ',X'10',AL3(VPHLIST-SYSFACD)                         
         DC    CL8'SSB     ',X'10',AL3(VSSB-SYSFACD)                            
         DC    CL8'VSELIST ',X'10',AL3(VSELIST-SYSFACD)                         
         DC    CL8'VTCB    ',X'10',AL3(VTCB-SYSFACD)                            
         DC    CL8'VTSTTAB ',X'10',AL3(VTSTTAB-SYSFACD)                         
         DC    CL8'VUTL    ',X'10',AL3(VUTL-SYSFACD)                            
*                                                                               
         DC    CL8'ACCFACS ',X'10',AL3(VSYSFAC3-SYSFACD)                        
         DC    CL8'COMFACS ',X'10',AL3(VSYSFAC0-SYSFACD)                        
         DC    CL8'MEDFACS ',X'10',AL3(VSYSFAC4-SYSFACD)                        
         DC    CL8'PRTFACS ',X'10',AL3(VSYSFAC2-SYSFACD)                        
         DC    CL8'REPFACS ',X'10',AL3(VSYSFAC3-SYSFACD)                        
         DC    CL8'SPTFACS ',X'10',AL3(VSYSFAC2-SYSFACD)                        
         DC    CL8'SYSFACS ',X'F0',AL3(0) USE 0(DMPFACS)                        
*                                                                               
         DC    CL8'DTFS    ',X'11',AL3(TCBDTFS-TCBD)                            
         DC    CL8'DADTF   ',X'11',AL3(TCBDTFLK-TCBD)                           
         DC    CL8'DACPUID ',X'10',AL3(VDACPUID-SYSFACD)                        
         DC    CL8'ISCPUID ',X'10',AL3(VISCPUID-SYSFACD)                        
         DC    CL8'DARPT   ',X'10',AL3(VDARPT-SYSFACD)                          
         DC    CL8'DTFIOA  ',X'10',AL3(VDTFIOA-SYSFACD)                         
         DC    CL8'DMGRFLES',X'10',AL3(VDMGRFLS-SYSFACD)                        
         DC    CL8'PRGMS   ',X'10',AL3(VPRGMS-SYSFACD)                          
         DC    CL8'TEMPSTR ',X'10',AL3(VTEMPSTR-SYSFACD)                        
         DC    CL8'PRTQUE  ',X'10',AL3(VPRTQUE-SYSFACD)                         
         DC    CL8'ADRFILE ',X'10',AL3(VADRFILE-SYSFACD)                        
         DC    CL8'DMPFILE ',X'10',AL3(VDMPFILE-SYSFACD)                        
         DC    CL8'TSTRCVR ',X'10',AL3(VTSTRCVR-SYSFACD)                        
         DC    CL8'WKFILE  ',X'10',AL3(VWKFILE-SYSFACD)                         
*                                                                               
         DC    CL8'CHKPT1  ',X'10',AL3(VCHKPT1-SYSFACD)                         
         DC    CL8'CHKPT1X ',X'10',AL3(VCHKPT1X-SYSFACD)                        
         DC    CL8'CHKPT2  ',X'10',AL3(VCHKPT2-SYSFACD)                         
         DC    CL8'CHKPT2X ',X'10',AL3(VCHKPT2X-SYSFACD)                        
         DC    CL8'LCBUFFS ',X'10',AL3(VLCBUFFS-SYSFACD)                        
         DC    CL8'LCBUFFX ',X'10',AL3(VLCBUFFX-SYSFACD)                        
*                                                                               
         DC    CL8'DATAMGR ',X'10',AL3(VDATAMGR-SYSFACD)                        
         DC    CL8'CALLOV  ',X'10',AL3(VCALLOV-SYSFACD)                         
         DC    CL8'DMOD000 ',X'10',AL3(VDMOD000-SYSFACD)                        
         DC    CL8'DADDS   ',X'10',AL3(VDADDS-SYSFACD)                          
         DC    CL8'RKEY    ',X'10',AL3(VRKEY-SYSFACD)                           
         DC    CL8'WKEY    ',X'10',AL3(VWKEY-SYSFACD)                           
         DC    CL8'EKEY    ',X'10',AL3(VEKEY-SYSFACD)                           
         DC    CL8'READ    ',X'10',AL3(VREAD-SYSFACD)                           
         DC    CL8'WRITE   ',X'10',AL3(VWRITE-SYSFACD)                          
         DC    CL8'WRTAFT  ',X'10',AL3(VWRTAFT-SYSFACD)                         
         DC    CL8'OPEN    ',X'10',AL3(VOPEN-SYSFACD)                           
         DC    CL8'OPENIS  ',X'10',AL3(VOPENIS-SYSFACD)                         
         DC    CL8'FINDSYS ',X'10',AL3(VFINDSYS-SYSFACD)                        
         DC    CL8'OPENSYS ',X'10',AL3(VOPENSYS-SYSFACD)                        
         DC    CL8'CLSESYS ',X'10',AL3(VCLSESYS-SYSFACD)                        
         DC    CL8'RDID    ',X'10',AL3(VRDID-SYSFACD)                           
         DC    CL8'WTID    ',X'10',AL3(VWTID-SYSFACD)                           
         DC    CL8'WTCKD   ',X'10',AL3(VWTCKD-SYSFACD)                          
         DC    CL8'DABACK  ',X'10',AL3(VDABACK-SYSFACD)                         
         DC    CL8'DATRNS  ',X'10',AL3(VDATRNS-SYSFACD)                         
         DC    CL8'ADDAFT  ',X'10',AL3(VADDAFT-SYSFACD)                         
         DC    CL8'FNDEOF  ',X'10',AL3(VFNDEOF-SYSFACD)                         
         DC    CL8'LCWRITE ',X'10',AL3(VLCWRITE-SYSFACD)                        
         DC    CL8'ENQDEQ  ',X'10',AL3(VENQDEQ-SYSFACD)                         
         DC    CL8'POWWOW  ',X'10',AL3(VPOWWOW-SYSFACD)                         
         DC    CL8'SKIPA   ',X'10',AL3(VSKIPA-SYSFACD)                          
         DC    CL8'TICTOC  ',X'10',AL3(VTICTOC-SYSFACD)                         
         DC    CL8'TICTOCT ',X'10',AL3(VTICTOCT-SYSFACD)                        
         DC    CL8'TICTRACE',X'10',AL3(VTICTOCT-SYSFACD)                        
         DC    CL8'TICPOPS ',X'10',AL3(VTICTOCT-SYSFACD)                        
         DC    X'FF'                                                            
