*          DATA SET SRDMPFED   AT LEVEL 008 AS OF 06/06/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T15DFED      DATE 06/06/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL1      3   79    1  A  P L             T        Y              
SRVCLRH  DS    XL8                                                              
SRVCLR   DS    CL6      4    2    6  A  P H   W         T        Y              
SRVRGS1H DS    XL8                                                              
SRVRGS1  DS    CL71     4   10   71  A  P H   W         T        Y              
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H   W         T        Y              
SRVRGS2H DS    XL8                                                              
SRVRGS2  DS    CL71     5   10   71  A  P H   W         T        Y              
SRVHPSWH DS    XL8                                                              
SRVHPSW  DS    CL7      6    2    7  A  P N R Y         T        Y              
SRVPSWH  DS    XL8                                                              
SRVPSW   DS    CL17     6   10   17  A  P N R Y         T        Y              
SRVDATH  DS    XL8                                                              
SRVDAT   DS    CL8      6   28    8  A  P N R Y         T        Y              
SRVTIMH  DS    XL8                                                              
SRVTIM   DS    CL8      6   37    8  A  P N R Y         T        Y              
SRVDSPDH DS    XL8                                                              
SRVDSPD  DS    CL8      6   46    8  A  P N R Y         T        Y              
SRVDSPH  DS    XL8                                                              
SRVDSP   DS    CL8      6   55    8  A  P N R Y         T        Y              
SRVLOOPH DS    XL8                                                              
SRVLOOP  DS    CL8      6   64    8  A  P N R Y         T        Y              
         DS    XL8                                                              
         DS    CL1      6   78    1  A  P N   R         T        Y              
SRVL1H   DS    XL8                                                              
SRVL1    DS    CL8      7    2    8  A  P N   Y         T        Y              
SRVL1S1H DS    XL8                                                              
SRVL1S1  DS    CL1      7   11    1  A  U N        M    T        Y              
SRVL1H1H DS    XL8                                                              
SRVL1H1  DS    CL8      7   13    8  A  P N             T        Y              
SRVL1S2H DS    XL8                                                              
SRVL1S2  DS    CL1      7   22    1  A  U N        M    T        Y              
SRVL1H2H DS    XL8                                                              
SRVL1H2  DS    CL8      7   24    8  A  P N             T        Y              
SRVL1S3H DS    XL8                                                              
SRVL1S3  DS    CL1      7   33    1  A  U N        M    T        Y              
SRVL1H3H DS    XL8                                                              
SRVL1H3  DS    CL8      7   35    8  A  P N             T        Y              
SRVL1S4H DS    XL8                                                              
SRVL1S4  DS    CL1      7   44    1  A  U N        M    T        Y              
SRVL1H4H DS    XL8                                                              
SRVL1H4  DS    CL35     7   46   35  A  P N             T        Y              
SRVL2H   DS    XL8                                                              
SRVL2    DS    CL8      8    2    8  A  P N   Y         T        Y              
SRVL2S1H DS    XL8                                                              
SRVL2S1  DS    CL1      8   11    1  A  U N        M    T        Y              
SRVL2H1H DS    XL8                                                              
SRVL2H1  DS    CL8      8   13    8  A  P N             T        Y              
SRVL2S2H DS    XL8                                                              
SRVL2S2  DS    CL1      8   22    1  A  U N        M    T        Y              
SRVL2H2H DS    XL8                                                              
SRVL2H2  DS    CL8      8   24    8  A  P N             T        Y              
SRVL2S3H DS    XL8                                                              
SRVL2S3  DS    CL1      8   33    1  A  U N        M    T        Y              
SRVL2H3H DS    XL8                                                              
SRVL2H3  DS    CL8      8   35    8  A  P N             T        Y              
SRVL2S4H DS    XL8                                                              
SRVL2S4  DS    CL1      8   44    1  A  U N        M    T        Y              
SRVL2H4H DS    XL8                                                              
SRVL2H4  DS    CL35     8   46   35  A  P N             T        Y              
SRVL3H   DS    XL8                                                              
SRVL3    DS    CL8      9    2    8  A  P N   Y         T        Y              
SRVL3S1H DS    XL8                                                              
SRVL3S1  DS    CL1      9   11    1  A  U N        M    T        Y              
SRVL3H1H DS    XL8                                                              
SRVL3H1  DS    CL8      9   13    8  A  P N             T        Y              
SRVL3S2H DS    XL8                                                              
SRVL3S2  DS    CL1      9   22    1  A  U N        M    T        Y              
SRVL3H2H DS    XL8                                                              
SRVL3H2  DS    CL8      9   24    8  A  P N             T        Y              
SRVL3S3H DS    XL8                                                              
SRVL3S3  DS    CL1      9   33    1  A  U N        M    T        Y              
SRVL3H3H DS    XL8                                                              
SRVL3H3  DS    CL8      9   35    8  A  P N             T        Y              
SRVL3S4H DS    XL8                                                              
SRVL3S4  DS    CL1      9   44    1  A  U N        M    T        Y              
SRVL3H4H DS    XL8                                                              
SRVL3H4  DS    CL35     9   46   35  A  P N             T        Y              
SRVL4H   DS    XL8                                                              
SRVL4    DS    CL8     10    2    8  A  P N   Y         T        Y              
SRVL4S1H DS    XL8                                                              
SRVL4S1  DS    CL1     10   11    1  A  U N        M    T        Y              
SRVL4H1H DS    XL8                                                              
SRVL4H1  DS    CL8     10   13    8  A  P N             T        Y              
SRVL4S2H DS    XL8                                                              
SRVL4S2  DS    CL1     10   22    1  A  U N        M    T        Y              
SRVL4H2H DS    XL8                                                              
SRVL4H2  DS    CL8     10   24    8  A  P N             T        Y              
SRVL4S3H DS    XL8                                                              
SRVL4S3  DS    CL1     10   33    1  A  U N        M    T        Y              
SRVL4H3H DS    XL8                                                              
SRVL4H3  DS    CL8     10   35    8  A  P N             T        Y              
SRVL4S4H DS    XL8                                                              
SRVL4S4  DS    CL1     10   44    1  A  U N        M    T        Y              
SRVL4H4H DS    XL8                                                              
SRVL4H4  DS    CL35    10   46   35  A  P N             T        Y              
SRVL5H   DS    XL8                                                              
SRVL5    DS    CL8     11    2    8  A  P N   Y         T        Y              
SRVL5S1H DS    XL8                                                              
SRVL5S1  DS    CL1     11   11    1  A  U N        M    T        Y              
SRVL5H1H DS    XL8                                                              
SRVL5H1  DS    CL8     11   13    8  A  P N             T        Y              
SRVL5S2H DS    XL8                                                              
SRVL5S2  DS    CL1     11   22    1  A  U N        M    T        Y              
SRVL5H2H DS    XL8                                                              
SRVL5H2  DS    CL8     11   24    8  A  P N             T        Y              
SRVL5S3H DS    XL8                                                              
SRVL5S3  DS    CL1     11   33    1  A  U N        M    T        Y              
SRVL5H3H DS    XL8                                                              
SRVL5H3  DS    CL8     11   35    8  A  P N             T        Y              
SRVL5S4H DS    XL8                                                              
SRVL5S4  DS    CL1     11   44    1  A  U N        M    T        Y              
SRVL5H4H DS    XL8                                                              
SRVL5H4  DS    CL35    11   46   35  A  P N             T        Y              
SRVL6H   DS    XL8                                                              
SRVL6    DS    CL8     12    2    8  A  P N   Y         T        Y              
SRVL6S1H DS    XL8                                                              
SRVL6S1  DS    CL1     12   11    1  A  U N        M    T        Y              
SRVL6H1H DS    XL8                                                              
SRVL6H1  DS    CL8     12   13    8  A  P N             T        Y              
SRVL6S2H DS    XL8                                                              
SRVL6S2  DS    CL1     12   22    1  A  U N        M    T        Y              
SRVL6H2H DS    XL8                                                              
SRVL6H2  DS    CL8     12   24    8  A  P N             T        Y              
SRVL6S3H DS    XL8                                                              
SRVL6S3  DS    CL1     12   33    1  A  U N        M    T        Y              
SRVL6H3H DS    XL8                                                              
SRVL6H3  DS    CL8     12   35    8  A  P N             T        Y              
SRVL6S4H DS    XL8                                                              
SRVL6S4  DS    CL1     12   44    1  A  U N        M    T        Y              
SRVL6H4H DS    XL8                                                              
SRVL6H4  DS    CL35    12   46   35  A  P N             T        Y              
SRVL7H   DS    XL8                                                              
SRVL7    DS    CL8     13    2    8  A  P N   Y         T        Y              
SRVL7S1H DS    XL8                                                              
SRVL7S1  DS    CL1     13   11    1  A  U N        M    T        Y              
SRVL7H1H DS    XL8                                                              
SRVL7H1  DS    CL8     13   13    8  A  P N             T        Y              
SRVL7S2H DS    XL8                                                              
SRVL7S2  DS    CL1     13   22    1  A  U N        M    T        Y              
SRVL7H2H DS    XL8                                                              
SRVL7H2  DS    CL8     13   24    8  A  P N             T        Y              
SRVL7S3H DS    XL8                                                              
SRVL7S3  DS    CL1     13   33    1  A  U N        M    T        Y              
SRVL7H3H DS    XL8                                                              
SRVL7H3  DS    CL8     13   35    8  A  P N             T        Y              
SRVL7S4H DS    XL8                                                              
SRVL7S4  DS    CL1     13   44    1  A  U N        M    T        Y              
SRVL7H4H DS    XL8                                                              
SRVL7H4  DS    CL35    13   46   35  A  P N             T        Y              
SRVL8H   DS    XL8                                                              
SRVL8    DS    CL8     14    2    8  A  P N   Y         T        Y              
SRVL8S1H DS    XL8                                                              
SRVL8S1  DS    CL1     14   11    1  A  U N        M    T        Y              
SRVL8H1H DS    XL8                                                              
SRVL8H1  DS    CL8     14   13    8  A  P N             T        Y              
SRVL8S2H DS    XL8                                                              
SRVL8S2  DS    CL1     14   22    1  A  U N        M    T        Y              
SRVL8H2H DS    XL8                                                              
SRVL8H2  DS    CL8     14   24    8  A  P N             T        Y              
SRVL8S3H DS    XL8                                                              
SRVL8S3  DS    CL1     14   33    1  A  U N        M    T        Y              
SRVL8H3H DS    XL8                                                              
SRVL8H3  DS    CL8     14   35    8  A  P N             T        Y              
SRVL8S4H DS    XL8                                                              
SRVL8S4  DS    CL1     14   44    1  A  U N        M    T        Y              
SRVL8H4H DS    XL8                                                              
SRVL8H4  DS    CL35    14   46   35  A  P N             T        Y              
SRVL9H   DS    XL8                                                              
SRVL9    DS    CL8     15    2    8  A  P N   Y         T        Y              
SRVL9S1H DS    XL8                                                              
SRVL9S1  DS    CL1     15   11    1  A  U N        M    T        Y              
SRVL9H1H DS    XL8                                                              
SRVL9H1  DS    CL8     15   13    8  A  P N             T        Y              
SRVL9S2H DS    XL8                                                              
SRVL9S2  DS    CL1     15   22    1  A  U N        M    T        Y              
SRVL9H2H DS    XL8                                                              
SRVL9H2  DS    CL8     15   24    8  A  P N             T        Y              
SRVL9S3H DS    XL8                                                              
SRVL9S3  DS    CL1     15   33    1  A  U N        M    T        Y              
SRVL9H3H DS    XL8                                                              
SRVL9H3  DS    CL8     15   35    8  A  P N             T        Y              
SRVL9S4H DS    XL8                                                              
SRVL9S4  DS    CL1     15   44    1  A  U N        M    T        Y              
SRVL9H4H DS    XL8                                                              
SRVL9H4  DS    CL35    15   46   35  A  P N             T        Y              
SRVLAH   DS    XL8                                                              
SRVLA    DS    CL8     16    2    8  A  P N   Y         T        Y              
SRVLAS1H DS    XL8                                                              
SRVLAS1  DS    CL1     16   11    1  A  U N        M    T        Y              
SRVLAH1H DS    XL8                                                              
SRVLAH1  DS    CL8     16   13    8  A  P N             T        Y              
SRVLAS2H DS    XL8                                                              
SRVLAS2  DS    CL1     16   22    1  A  U N        M    T        Y              
SRVLAH2H DS    XL8                                                              
SRVLAH2  DS    CL8     16   24    8  A  P N             T        Y              
SRVLAS3H DS    XL8                                                              
SRVLAS3  DS    CL1     16   33    1  A  U N        M    T        Y              
SRVLAH3H DS    XL8                                                              
SRVLAH3  DS    CL8     16   35    8  A  P N             T        Y              
SRVLAS4H DS    XL8                                                              
SRVLAS4  DS    CL1     16   44    1  A  U N        M    T        Y              
SRVLAH4H DS    XL8                                                              
SRVLAH4  DS    CL35    16   46   35  A  P N             T        Y              
SRVLBH   DS    XL8                                                              
SRVLB    DS    CL8     17    2    8  A  P N   Y         T        Y              
SRVLBS1H DS    XL8                                                              
SRVLBS1  DS    CL1     17   11    1  A  U N        M    T        Y              
SRVLBH1H DS    XL8                                                              
SRVLBH1  DS    CL8     17   13    8  A  P N             T        Y              
SRVLBS2H DS    XL8                                                              
SRVLBS2  DS    CL1     17   22    1  A  U N        M    T        Y              
SRVLBH2H DS    XL8                                                              
SRVLBH2  DS    CL8     17   24    8  A  P N             T        Y              
SRVLBS3H DS    XL8                                                              
SRVLBS3  DS    CL1     17   33    1  A  U N        M    T        Y              
SRVLBH3H DS    XL8                                                              
SRVLBH3  DS    CL8     17   35    8  A  P N             T        Y              
SRVLBS4H DS    XL8                                                              
SRVLBS4  DS    CL1     17   44    1  A  U N        M    T        Y              
SRVLBH4H DS    XL8                                                              
SRVLBH4  DS    CL35    17   46   35  A  P N             T        Y              
SRVLCH   DS    XL8                                                              
SRVLC    DS    CL8     18    2    8  A  P N   Y         T        Y              
SRVLCS1H DS    XL8                                                              
SRVLCS1  DS    CL1     18   11    1  A  U N        M    T        Y              
SRVLCH1H DS    XL8                                                              
SRVLCH1  DS    CL8     18   13    8  A  P N             T        Y              
SRVLCS2H DS    XL8                                                              
SRVLCS2  DS    CL1     18   22    1  A  U N        M    T        Y              
SRVLCH2H DS    XL8                                                              
SRVLCH2  DS    CL8     18   24    8  A  P N             T        Y              
SRVLCS3H DS    XL8                                                              
SRVLCS3  DS    CL1     18   33    1  A  U N        M    T        Y              
SRVLCH3H DS    XL8                                                              
SRVLCH3  DS    CL8     18   35    8  A  P N             T        Y              
SRVLCS4H DS    XL8                                                              
SRVLCS4  DS    CL1     18   44    1  A  U N        M    T        Y              
SRVLCH4H DS    XL8                                                              
SRVLCH4  DS    CL35    18   46   35  A  P N             T        Y              
SRVLDH   DS    XL8                                                              
SRVLD    DS    CL8     19    2    8  A  P N   Y         T        Y              
SRVLDS1H DS    XL8                                                              
SRVLDS1  DS    CL1     19   11    1  A  U N        M    T        Y              
SRVLDH1H DS    XL8                                                              
SRVLDH1  DS    CL8     19   13    8  A  P N             T        Y              
SRVLDS2H DS    XL8                                                              
SRVLDS2  DS    CL1     19   22    1  A  U N        M    T        Y              
SRVLDH2H DS    XL8                                                              
SRVLDH2  DS    CL8     19   24    8  A  P N             T        Y              
SRVLDS3H DS    XL8                                                              
SRVLDS3  DS    CL1     19   33    1  A  U N        M    T        Y              
SRVLDH3H DS    XL8                                                              
SRVLDH3  DS    CL8     19   35    8  A  P N             T        Y              
SRVLDS4H DS    XL8                                                              
SRVLDS4  DS    CL1     19   44    1  A  U N        M    T        Y              
SRVLDH4H DS    XL8                                                              
SRVLDH4  DS    CL35    19   46   35  A  P N             T        Y              
SRVLEH   DS    XL8                                                              
SRVLE    DS    CL8     20    2    8  A  P N   Y         T        Y              
SRVLES1H DS    XL8                                                              
SRVLES1  DS    CL1     20   11    1  A  U N        M    T        Y              
SRVLEH1H DS    XL8                                                              
SRVLEH1  DS    CL8     20   13    8  A  P N             T        Y              
SRVLES2H DS    XL8                                                              
SRVLES2  DS    CL1     20   22    1  A  U N        M    T        Y              
SRVLEH2H DS    XL8                                                              
SRVLEH2  DS    CL8     20   24    8  A  P N             T        Y              
SRVLES3H DS    XL8                                                              
SRVLES3  DS    CL1     20   33    1  A  U N        M    T        Y              
SRVLEH3H DS    XL8                                                              
SRVLEH3  DS    CL8     20   35    8  A  P N             T        Y              
SRVLES4H DS    XL8                                                              
SRVLES4  DS    CL1     20   44    1  A  U N        M    T        Y              
SRVLEH4H DS    XL8                                                              
SRVLEH4  DS    CL35    20   46   35  A  P N             T        Y              
SRVLFH   DS    XL8                                                              
SRVLF    DS    CL8     21    2    8  A  P N   Y         T        Y              
SRVLFS1H DS    XL8                                                              
SRVLFS1  DS    CL1     21   11    1  A  U N        M    T        Y              
SRVLFH1H DS    XL8                                                              
SRVLFH1  DS    CL8     21   13    8  A  P N             T        Y              
SRVLFS2H DS    XL8                                                              
SRVLFS2  DS    CL1     21   22    1  A  U N        M    T        Y              
SRVLFH2H DS    XL8                                                              
SRVLFH2  DS    CL8     21   24    8  A  P N             T        Y              
SRVLFS3H DS    XL8                                                              
SRVLFS3  DS    CL1     21   33    1  A  U N        M    T        Y              
SRVLFH3H DS    XL8                                                              
SRVLFH3  DS    CL8     21   35    8  A  P N             T        Y              
SRVLFS4H DS    XL8                                                              
SRVLFS4  DS    CL1     21   44    1  A  U N        M    T        Y              
SRVLFH4H DS    XL8                                                              
SRVLFH4  DS    CL35    21   46   35  A  P N             T        Y              
SRVLGH   DS    XL8                                                              
SRVLG    DS    CL8     22    2    8  A  P N   Y         T        Y              
SRVLGS1H DS    XL8                                                              
SRVLGS1  DS    CL1     22   11    1  A  U N        M    T        Y              
SRVLGH1H DS    XL8                                                              
SRVLGH1  DS    CL8     22   13    8  A  P N             T        Y              
SRVLGS2H DS    XL8                                                              
SRVLGS2  DS    CL1     22   22    1  A  U N        M    T        Y              
SRVLGH2H DS    XL8                                                              
SRVLGH2  DS    CL8     22   24    8  A  P N             T        Y              
SRVLGS3H DS    XL8                                                              
SRVLGS3  DS    CL1     22   33    1  A  U N        M    T        Y              
SRVLGH3H DS    XL8                                                              
SRVLGH3  DS    CL8     22   35    8  A  P N             T        Y              
SRVLGS4H DS    XL8                                                              
SRVLGS4  DS    CL1     22   44    1  A  U N        M    T        Y              
SRVLGH4H DS    XL8                                                              
SRVLGH4  DS    CL35    22   46   35  A  P N             T        Y              
SRVLHH   DS    XL8                                                              
SRVLH    DS    CL8     23    2    8  A  P N   Y         T        Y              
SRVLHS1H DS    XL8                                                              
SRVLHS1  DS    CL1     23   11    1  A  U N        M    T        Y              
SRVLHH1H DS    XL8                                                              
SRVLHH1  DS    CL8     23   13    8  A  P N             T        Y              
SRVLHS2H DS    XL8                                                              
SRVLHS2  DS    CL1     23   22    1  A  U N        M    T        Y              
SRVLHH2H DS    XL8                                                              
SRVLHH2  DS    CL8     23   24    8  A  P N             T        Y              
SRVLHS3H DS    XL8                                                              
SRVLHS3  DS    CL1     23   33    1  A  U N        M    T        Y              
SRVLHH3H DS    XL8                                                              
SRVLHH3  DS    CL8     23   35    8  A  P N             T        Y              
SRVLHS4H DS    XL8                                                              
SRVLHS4  DS    CL1     23   44    1  A  U N        M    T        Y              
SRVLHH4H DS    XL8                                                              
SRVLHH4  DS    CL35    23   46   35  A  P N             T        Y              
SRVLIH   DS    XL8                                                              
SRVLI    DS    CL8     24    2    8  A  P N   Y         T        Y              
SRVLIS1H DS    XL8                                                              
SRVLIS1  DS    CL1     24   11    1  A  U N        M    T        Y              
SRVLIH1H DS    XL8                                                              
SRVLIH1  DS    CL8     24   13    8  A  P N             T        Y              
SRVLIS2H DS    XL8                                                              
SRVLIS2  DS    CL1     24   22    1  A  U N        M    T        Y              
SRVLIH2H DS    XL8                                                              
SRVLIH2  DS    CL8     24   24    8  A  P N             T        Y              
SRVLIS3H DS    XL8                                                              
SRVLIS3  DS    CL1     24   33    1  A  U N        M    T        Y              
SRVLIH3H DS    XL8                                                              
SRVLIH3  DS    CL8     24   35    8  A  P N             T        Y              
SRVLIS4H DS    XL8                                                              
SRVLIS4  DS    CL1     24   44    1  A  U N        M    T        Y              
SRVLIH4H DS    XL8                                                              
SRVLIH4  DS    CL35    24   46   35  A  P N             T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2904 BYTES                            
