*          DATA SET SRDQUFFD   AT LEVEL 001 AS OF 04/02/19                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T159FFD      DATE 04/02/19                 
         SPACE 1                                                                
T159FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DQUMSGH  DS    XL8                                                              
DQUMSG   DS    CL60     1    2   60  A  P N R R         T        Y              
DQUSRVH  DS    XL8                                                              
DQUSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL9      2    2    9  L  P H   B         T        Y              
DQUSPIDH DS    XL8                                                              
DQUSPID  DS    CL25     2   12   25  A  U N        M    T    I   Y              
         DS    XL8                                                              
         DS    CL5      2   38    5  L  P H   B         T        Y              
DQUPAGEH DS    XL8                                                              
DQUPAGE  DS    CL5      2   44    5  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL5      2   50    5  L  P H   B         T        Y              
DQULINEH DS    XL8                                                              
DQULINE  DS    CL5      2   56    5  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL7      2   62    7  L  P H   B         T        Y              
DQUCOLH  DS    XL8                                                              
DQUCOL   DS    CL4      2   71    4  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL9      3    2    9  L  P H   B         T        Y              
DQUOPTH  DS    XL8                                                              
DQUOPT   DS    CL48     3   12   48  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL8      3   62    8  L  P H   B         T        Y              
DQUSCRH  DS    XL8                                                              
DQUSCR   DS    CL4      3   71    4  A  U N        M    T        Y              
DQUL1H   DS    XL8                                                              
DQUL1    DS    CL79     5    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79     6    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79     7    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79     8    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79     9    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    23    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    24    2   79  L  P H   R         T        Y              
DQULAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
DQUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2136 BYTES                            
