*          DATA SET SRDSPFFD   AT LEVEL 001 AS OF 07/06/17                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T12EFFD      DATE 07/06/17                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVSRVH  DS    XL8                                                              
SRVSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
SRVP1H   DS    XL8                                                              
SRVP1    DS    CL16     3    2   16  A  U N        M    T    I   Y              
SRVP2H   DS    XL8                                                              
SRVP2    DS    CL16     3   22   16  A  U N        M    T        Y              
SRVP3H   DS    XL8                                                              
SRVP3    DS    CL16     3   42   16  A  U N        M    T        Y              
SRVP4H   DS    XL8                                                              
SRVP4    DS    CL16     3   62   16  A  U N        M    T        Y              
SRVL1H   DS    XL8                                                              
SRVL1    DS    CL16     4    2   16  A  P N             T        Y              
SRVL2H   DS    XL8                                                              
SRVL2    DS    CL16     4   22   16  A  P N             T        Y              
SRVL3H   DS    XL8                                                              
SRVL3    DS    CL16     4   42   16  A  P N             T        Y              
SRVL4H   DS    XL8                                                              
SRVL4    DS    CL16     4   62   16  A  P N             T        Y              
SRVHDR0H DS    XL8                                                              
SRVHDR0  DS    CL78     5    2   78  L  P H             T        Y              
SRVHDRH  DS    XL8                                                              
SRVHDR   DS    CL78     6    2   78  L  P H             T        Y              
SRVHDR1H DS    XL8                                                              
SRVHDR1  DS    CL78     7    2   78  L  P H             T        Y              
SRVSELH  DS    XL8                                                              
SRVSEL   DS    CL3      8    2    3  A  U N        M    T        Y              
SRVLINEH DS    XL8                                                              
SRVLINE  DS    CL75     8    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75     9    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    10    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    11    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    12    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    13    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    14    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    15    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    16    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    17    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    18    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    19    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    20    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    21    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    22    6   75  L  P N             T        Y              
SRVXSELH DS    XL8                                                              
SRVXSEL  DS    CL3     23    2    3  A  U N        M    T        Y              
SRVXLINH DS    XL8                                                              
SRVXLIN  DS    CL75    23    6   75  L  P N             T        Y              
SRVFTRH  DS    XL8                                                              
SRVFTR   DS    CL78    24    2   78  L  P N             T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2136 BYTES                            
