*          DATA SET SRDTXFFD   AT LEVEL 001 AS OF 07/30/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T116FFD      DATE 07/30/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A   P    N         T        Y              
SRVSRVH  DS    CL8                                                              
SRVSRV   DS    CL17     1   63   17  A   U    N    M    T        Y              
SRVL1H   DS    CL8                                                              
SRVL1    DS    CL16     3    2   16  A   P    N         T        Y              
SRVL2H   DS    CL8                                                              
SRVL2    DS    CL16     3   22   16  A   P    N         T        Y              
SRVL3H   DS    CL8                                                              
SRVL3    DS    CL16     3   42   16  A   P    N         T        Y              
SRVL4H   DS    CL8                                                              
SRVL4    DS    CL16     3   62   16  A   P    N         T        Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     4    2   16  A   U    N    M    T    I   Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     4   22   16  A   U    N    M    T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     4   42   16  A   U    N    M    T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     4   62   16  A   U    N    M    T        Y              
SRVP5H   DS    CL8                                                              
SRVP5    DS    CL78     5    2   78  L   P    N         T        Y              
SRVSELH  DS    CL8                                                              
SRVSEL   DS    CL1      6    2    1  A   U    N    M    T        Y              
SRVLINEH DS    CL8                                                              
SRVLINE  DS    CL76     6    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76     7    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76     8    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76     9    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    10    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    11    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    12    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    13    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    14    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    15    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    16    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    17    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    18    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    19    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    20    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    21    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    22    4   76  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL76    23    4   76  L   P    N         T        Y              
SRVXSELH DS    CL8                                                              
SRVXSEL  DS    CL1     24    2    1  A   U    N    M    T        Y              
SRVXLINH DS    CL8                                                              
SRVXLIN  DS    CL76    24    4   76  L   P    N         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2144 BYTES                            
