*          DATA SET SREDI00D   AT LEVEL 001 AS OF 01/03/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN QU  R$D      DATE 01/03/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL1                                                              
         DS    CL2    INDICS=EQ                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 8    BYTES                            
