*          DATA SET SRERRFFD   AT LEVEL 002 AS OF 09/15/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T1FEFFD      DATE 09/15/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL60     1    2   60   A    P    N         T         Y           
ERRIDH   DS    CL8                                                              
ERRID    DS    CL17     1   63   17   A    U    N         T    I    Y           
ERRP1H   DS    CL8                                                              
ERRP1    DS    CL16     3    2   16   A    U    N    M    T         Y           
ERRP2H   DS    CL8                                                              
ERRP2    DS    CL16     3   22   16   A    U    N    M    T         Y           
ERRP3H   DS    CL8                                                              
ERRP3    DS    CL16     3   42   16   A    U    N    M    T         Y           
ERRP4H   DS    CL8                                                              
ERRP4    DS    CL16     3   62   16   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL16     4    2   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     4   22   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     4   42   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     4   62   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13     6    2   13   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL55     6   16   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL55     7   16   55   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL55     8   16   55   A    P    N         T         Y           
ERRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
ERRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 498  BYTES                            
