*          DATA SET SRETIFFD   AT LEVEL 028 AS OF 04/03/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T11AFFD      DATE 04/03/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
EDSMSGH  DS    CL8                                                              
EDSMSG   DS    CL60     1    2   60  A  P N R B         T        Y              
EDSIDH   DS    CL8                                                              
EDSID    DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  A  P N   B         T        Y              
EDSP1H   DS    CL8                                                              
EDSP1    DS    CL5      3    9    5  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL7      3   15    7  A  P N   B         T        Y              
EDSP2H   DS    CL8                                                              
EDSP2    DS    CL54     3   23   54  A  U N        M    T        Y              
EDSCURSH DS    CL8                                                              
EDSCURS  DS    CL1      3   78    1  A  U N             T        Y              
EDSLN1H  DS    CL8                                                              
EDSLN1   DS    CL79     4    2   79  A  P N R B         T        Y              
         DS    CL8                                                              
         DS    CL79     5    2   79  A  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL79     6    2   79  A  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL79     7    2   79  A  P N   Y         T        Y              
EDSLN5H  DS    CL8                                                              
EDSLN5   DS    CL79     8    2   79  A  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  A  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL79    10    2   79  A  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL79    11    2   79  A  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL79    12    2   79  A  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL79    13    2   79  A  P N   Y         T        Y              
EDSLN11H DS    CL8                                                              
EDSLN11  DS    CL79    14    2   79  A  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL79    15    2   79  A  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL79    16    2   79  A  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL79    17    2   79  A  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL79    18    2   79  A  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL79    19    2   79  A  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL79    20    2   79  A  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL79    21    2   79  A  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL79    22    2   79  A  P N   G         T        Y              
EDSLLSTH DS    CL8                                                              
EDSLLST  DS    CL79    23    2   79  A  P N   Y         T        Y              
EDSMENUH DS    CL8                                                              
EDSMENU  DS    CL78    24    2   78  A  P H R B         T        Y              
EDSLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
EDSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2040 BYTES                            
