*          DATA SET SRFADFFD   AT LEVEL 001 AS OF 09/28/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T15EFFD      DATE 09/28/90                 
         SPACE 1                                                                
T15EFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A   P    N         T        Y              
SRVREQH  DS    CL8                                                              
SRVREQ   DS    CL17     1   63   17  A   U    N         T        Y              
SRVFD1H  DS    CL8                                                              
SRVFD1   DS    CL16     3    2   16  A   U    N         T    I   Y              
SRVFD2H  DS    CL8                                                              
SRVFD2   DS    CL16     3   22   16  A   U    N         T        Y              
SRVFD3H  DS    CL8                                                              
SRVFD3   DS    CL16     3   42   16  A   U    N         T        Y              
SRVFD4H  DS    CL8                                                              
SRVFD4   DS    CL16     3   62   16  A   U    N         T        Y              
SRVFD5H  DS    CL8                                                              
SRVFD5   DS    CL1      3   79    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4   22   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4   42   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     4   62   16  A   P    N         T        Y              
SRVTAGH  DS    CL8                                                              
SRVTAG   DS    CL1      4   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      6    7    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      6   16    3  A   P    N         T        Y              
SRVTL1H  DS    CL8                                                              
SRVTL1   DS    CL59     6   20   59  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    7    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7   16    3  A   P    N         T        Y              
SRVTL2H  DS    CL8                                                              
SRVTL2   DS    CL59     7   20   59  A   P    N         T        Y              
SRVL01H  DS    CL8                                                              
SRVL01   DS    CL79     8    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    10    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    11    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    12    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    13    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    14    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    15    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    16    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    17    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    18    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    19    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    20    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    21    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    22    2   79  A   P    N         T        Y              
SRVL16H  DS    CL8                                                              
SRVL16   DS    CL79    23    2   79  A   P    N         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1976 BYTES                            
