*          DATA SET SRGAPFFD   AT LEVEL 002 AS OF 02/25/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T16FFFD      DATE 02/25/08                 
         SPACE 1                                                                
T16FFFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
GFFMSGH  DS    XL8                                                              
GFFMSG   DS    CL60     1    2   60  A  P N             T        Y              
GFFSERVH DS    XL8                                                              
GFFSERV  DS    CL17     1   63   17  A  U N        M    T    I   Y              
GFFFLD1H DS    XL8                                                              
GFFFLD1  DS    CL16     2    2   16  A  U N        M    T        Y              
GFFFLD2H DS    XL8                                                              
GFFFLD2  DS    CL16     2   22   16  A  U N        M    T        Y              
GFFFLD3H DS    XL8                                                              
GFFFLD3  DS    CL16     2   42   16  A  U N        M    T        Y              
GFFFLD4H DS    XL8                                                              
GFFFLD4  DS    CL16     2   62   16  A  U N        M    T        Y              
GFFLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
GFFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 256  BYTES                            
