*          DATA SET SRGLOFFD   AT LEVEL 001 AS OF 02/21/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T115FFD      DATE 02/21/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  L   P    N         T        Y              
SRVSRVH  DS    CL8                                                              
SRVSRV   DS    CL17     1   63   17  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L   P    H         T        Y              
SRVACTH  DS    CL8                                                              
SRVACT   DS    CL8      2    9    8  A   U    N    M    T    I   Y              
         DS    CL8                                                              
         DS    CL7      2   19    7  L   P    H         T        Y              
SRVOPTH  DS    CL8                                                              
SRVOPT   DS    CL53     2   27   53  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  L   P    H         T        Y              
SRVDATH  DS    CL8                                                              
SRVDAT   DS    CL8      3    9    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      3   19    6  L   P    H         T        Y              
SRVTIMH  DS    CL8                                                              
SRVTIM   DS    CL20     3   27   20  A   P    N         T        Y              
SRVTABH  DS    CL8                                                              
SRVTAB   DS    CL1      4    9    1  A   U    N    M    T        Y              
SRVHD1H  DS    CL8                                                              
SRVHD1   DS    CL78     5    2   78  L   P    H         T        Y              
SRVHD2H  DS    CL8                                                              
SRVHD2   DS    CL78     6    2   78  L   P    H         T        Y              
SRVSACTH DS    CL8                                                              
SRVSACT  DS    CL3      7    2    3  A   U    N    M    T        Y              
SRVLIN1H DS    CL8                                                              
SRVLIN1  DS    CL17     7    6   17  L   P    N         T        Y              
SRVVALUH DS    CL8                                                              
SRVVALU  DS    CL56     7   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   U    N    M    T        Y              
SRVLIN2H DS    CL8                                                              
SRVLIN2  DS    CL17     8    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56     8   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17     9    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56     9   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    10    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    10   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    11    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    11   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    12    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    12   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    13    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    13   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    14    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    14   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    15    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    15   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    16    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    16   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    17    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    17   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    18    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    18   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    19    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    19   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    20    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    20   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    21    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    21   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    22    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    22   24   56  A   U    H    M    T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL17    23    6   17  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56    23   24   56  A   U    H    M    T        Y              
SRVXXXH  DS    CL8                                                              
SRVXXX   DS    CL1     24    2    1  A   U    N         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2168 BYTES                            
