*          DATA SET SRHV1FFD   AT LEVEL 027 AS OF 08/03/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T109FFD      DATE 08/03/88                 
         SPACE 1                                                                
T109FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
HV1MSGH  DS    CL8                                                              
HV1MSG   DS    CL60     1    2   60  A   P    N         T        Y              
HV1SRVH  DS    CL8                                                              
HV1SRV   DS    CL17     1   63   17  A   U    N    M    T    I   Y              
HV1REQH  DS    CL8                                                              
HV1REQ   DS    CL78     2    2   78  A   U    N    M    T        Y              
HV1TOPH  DS    CL8                                                              
HV1TOP   DS    CL79     3    2   79  A   P    H         T        Y              
HV1ASTLH DS    CL8                                                              
HV1ASTL  DS    CL1      4    2    1  A   P    H         T        Y              
HV1TXTH  DS    CL8                                                              
HV1TXT   DS    CL75     4    4   75  A   P    N         T        Y              
HV1ASTRH DS    CL8                                                              
HV1ASTR  DS    CL1      4   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75     5    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      6    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75     6    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75     7    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75     8    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75     9    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    10    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    11    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    12    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    13    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    14    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    15    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    16    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    17    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    18    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    19    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    20    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    21    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   80    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    22    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   80    1  A   P    H         T        Y              
HV1LASTH DS    CL8                                                              
HV1LAST  DS    CL1     23    2    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL75    23    4   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   80    1  A   P    H         T        Y              
HV1UTAGH DS    CL8                                                              
HV1UTAG  DS    CL1     24    2    1  A   U    Z    M    T        Y              
HV1TAGH  DS    CL8                                                              
HV1TAG   DS    CL1     24   80    1  A   P    N         T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2376 BYTES                            
