*          DATA SET SRIAMFFD   AT LEVEL 003 AS OF 08/16/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T126FFD      DATE 08/16/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     3    2   16  A  U N        M    T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     3   22   16  A  U N        M    T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   42   16  A  U N        M    T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16  A  U N        M    T        Y              
SRVHD0H  DS    CL8                                                              
SRVHD0   DS    CL78     4    2   78  L  P H             T        Y              
SRVHD1H  DS    CL8                                                              
SRVHD1   DS    CL78     5    2   78  L  P H             T        Y              
SRVHD2H  DS    CL8                                                              
SRVHD2   DS    CL78     6    2   78  L  P H             T        Y              
SRVSL1H  DS    CL8                                                              
SRVSL1   DS    CL4      7    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      7    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66     7   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      8    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66     8   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      9    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66     9   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     10    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    10   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     11    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     11    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    11   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     12    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    12   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     13    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    13   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     14    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    14   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     15    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    15   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     16    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     16    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    16   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     17    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     17    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    17   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     18    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    18   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     19    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     19    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    19   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     20    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     20    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    20   14   66  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     21    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     21    7    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL66    21   14   66  L  P N             T        Y              
SRVPFKH  DS    CL8                                                              
SRVPFK   DS    CL78    22    2   78  L  P H             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2040 BYTES                            
