*          DATA SET SRISGFFD   AT LEVEL 001 AS OF 02/27/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T188FFD      DATE 02/27/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVSRVH  DS    XL8                                                              
SRVSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
SRVMAJH  DS    XL8                                                              
SRVMAJ   DS    CL8      3    2    8  A  U N        M    T        Y              
SRVMINH  DS    XL8                                                              
SRVMIN   DS    CL40     3   14   40  A  U N        M    T        Y              
SRVTHSH  DS    XL8                                                              
SRVTHS   DS    CL1      3   55    1  A  U N        M    T        Y              
SRVPSWH  DS    XL8                                                              
SRVPSW   DS    CL17     3   62   17  A  U N        M    T        Y              
SRVL1H   DS    XL8                                                              
SRVL1    DS    CL10     4    2   10  A  P N             T        Y              
SRVL2H   DS    XL8                                                              
SRVL2    DS    CL40     4   14   40  A  P N             T        Y              
SRVL3H   DS    XL8                                                              
SRVL3    DS    CL5      4   55    5  A  P N             T        Y              
SRVHDRH  DS    XL8                                                              
SRVHDR   DS    CL78     6    2   78  L  P N             T        Y              
SRVHDR1H DS    XL8                                                              
SRVHDR1  DS    CL78     7    2   78  L  P N             T        Y              
SRVACTH  DS    XL8                                                              
SRVACT   DS    CL3      8    2    3  A  U N        M    T        Y              
SRVLINEH DS    XL8                                                              
SRVLINE  DS    CL75     8    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75     9    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    10    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    11    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    12    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    13    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    14    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    15    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    16    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    17    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    18    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    19    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    20    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    21    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL75    22    6   75  L  P N             T        Y              
SRVXACTH DS    XL8                                                              
SRVXACT  DS    CL3     23    2    3  A  U N        M    T        Y              
SRVXLINH DS    XL8                                                              
SRVXLIN  DS    CL75    23    6   75  L  P N             T        Y              
SRVFTRH  DS    XL8                                                              
SRVFTR   DS    CL38    24   40   38  L  P N             T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2000 BYTES                            
