*          DATA SET SRJOBFED   AT LEVEL 001 AS OF 06/18/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T157FED      DATE 06/18/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
JOBHED1H DS    CL8                                                              
JOBHED1  DS    CL79     4    2   79   A    P    H         T         Y           
JOBHED2H DS    CL8                                                              
JOBHED2  DS    CL79     5    2   79   A    P    H         T         Y           
JOBLIN1H DS    CL8                                                              
JOBLIN1  DS    CL79     6    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79     7    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79     8    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79     9    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    10    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    11    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    12    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    13    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    14    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    15    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    16    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    17    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    18    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    19    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    20    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    21    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    22    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79    23    2   79   A    P    N         T         Y           
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1743 BYTES                            
