*          DATA SET SRJOBFFD   AT LEVEL 007 AS OF 11/09/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T157FFD      DATE 11/09/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
JOBMSGH  DS    CL8                                                              
JOBMSG   DS    CL60     1    2   60  L  P N R R         T        Y              
JOBSRVH  DS    CL8                                                              
JOBSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  L  P H   W         T        Y              
JOBACTH  DS    CL8                                                              
JOBACT   DS    CL8      3    9    8  A  U N U G    M    T    I   Y    0         
JOBACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      3   19    3  L  P H   W         T        Y              
JOBJOBH  DS    CL8                                                              
JOBJOB   DS    CL17     3   23   17  A  U N U G    M    T        Y    0         
JOBJOBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      3   42    7  L  P N   Y         T        Y              
JOBOPTH  DS    CL8                                                              
JOBOPT   DS    CL30     3   50   30  A  U N U Y    M    T        Y    0         
JOBOPTX  DS    CL8                                                              
JOBTABH  DS    CL8                                                              
JOBTAB   DS    CL1      4    9    1  A  U N        M    T        Y              
JOBHEDH  DS    CL8                                                              
JOBHED   DS    CL78     5    2   78  L  P H R B         T        Y              
JOBLINH  DS    CL8                                                              
JOBLIN   DS    CL3      6    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34     6    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3      6   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34     6   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34     7    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3      7   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34     7   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34     8    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3      8   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34     8   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34     9    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3      9   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34     9   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    10    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     10   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    10   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    11    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     11   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    11   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    12    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     12   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    12   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    13    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     13   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    13   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    14    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     14   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    14   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    15    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     15   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    15   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    16    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     16   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    16   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    17    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     17   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    17   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    18    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     18   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    18   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    19    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     19   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    19   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    20    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     20   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    20   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    21    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     21   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    21   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    22    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     22   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    22   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    23    6   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     23   42    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    23   46   34  L  P N   B         T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL34    24    6   34  L  P N   B         T        Y              
JOBXXXH  DS    CL8                                                              
JOBXXX   DS    CL3     24   42    3  A  U N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2312 BYTES                            
