*          DATA SET SRKWXC3D   AT LEVEL 002 AS OF 09/15/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T147C3D      DATE 09/15/83                 
         SPACE 1                                                                
T147C3D  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
KWXHEADH DS    CL8                                                              
KWXHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
KWXSERVH DS    CL8                                                              
KWXSERV  DS    CL17     1   63   17   A    U    N    M    T         Y           
KWXAUPRH DS    CL8                                                              
KWXAUPR  DS    CL13     2    2   13   A    P    N         T         Y           
KWXAUTHH DS    CL8                                                              
KWXAUTH  DS    CL10     2   16   10   A    U    N    M    T    I    Y           
KWXSEPRH DS    CL8                                                              
KWXSEPR  DS    CL7      2   27    7   A    P    N         T         Y           
KWXSENDH DS    CL8                                                              
KWXSEND  DS    CL45     2   35   45   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78     4    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL4      5    2    4   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL23     5   10   23   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL4      5   35    4   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL17     5   41   17   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL7      5   60    7   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL12     5   68   12   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL7      6    2    7   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL48     6   10   48   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL7      6   60    7   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL12     6   68   12   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL23     7   10   23   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5      7   35    5   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL39     7   41   39   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78     8    2   78   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL4      9    2    4   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL8      9    9    8   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL4      9   25    4   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL4      9   34    4   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL4      9   43    4   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL8      9   50    8   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL4      9   66    4   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL4      9   75    4   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     10    3    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL13    10    8   13   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     10   23    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     10   34    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL2     10   40    2   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     10   43    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    10   48   14   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     10   64    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     10   75    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    11    2   14   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL63    11   17   63   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     12    3    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL13    12    8   13   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     12   23    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     12   34    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL2     12   40    2   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     12   43    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    12   48   14   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     12   64    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     12   75    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    13    2   14   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL63    13   17   63   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     14    3    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL13    14    8   13   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     14   23    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     14   34    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL2     14   40    2   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     14   43    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    14   48   14   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     14   64    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     14   75    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    15    2   14   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL63    15   17   63   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     16    3    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL13    16    8   13   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     16   23    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     16   34    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL2     16   40    2   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     16   43    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    16   48   14   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     16   64    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     16   75    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    17    2   14   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL63    17   17   63   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     18    3    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL13    18    8   13   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     18   23    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     18   34    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL2     18   40    2   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     18   43    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    18   48   14   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     18   64    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     18   75    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    19    2   14   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL63    19   17   63   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     20    3    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL13    20    8   13   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     20   23    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     20   34    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL2     20   40    2   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL3     20   43    3   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    20   48   14   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL9     20   64    9   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL5     20   75    5   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL14    21    2   14   A    P    N    M    T         N           
         DS    CL8                                                              
         DS    CL60    21   17   60   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL1     21   79    1   A    U    N    M    T         N           
KWXLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
KWXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2180 BYTES                            
