*          DATA SET SRKWXC8D   AT LEVEL 002 AS OF 09/15/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T147C8D      DATE 09/15/83                 
         SPACE 1                                                                
T147C8D  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
KWXHEADH DS    CL8                                                              
KWXHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
KWXSERVH DS    CL8                                                              
KWXSERV  DS    CL17     1   63   17   A    U    N    M    T         Y           
KWXAUPRH DS    CL8                                                              
KWXAUPR  DS    CL13     2    2   13   A    P    N         T         Y           
KWXAUTHH DS    CL8                                                              
KWXAUTH  DS    CL10     2   16   10   A    U    N    M    T    I    Y           
KWXSEPRH DS    CL8                                                              
KWXSEPR  DS    CL7      2   27    7   A    P    N         T         Y           
KWXSENDH DS    CL8                                                              
KWXSEND  DS    CL45     2   35   45   A    U    N    M    T         Y           
KWXDATAH DS    CL8                                                              
KWXDATA  DS    CL78     4    2   78   A    U    N    M    T         N           
KWXDAT2H DS    CL8                                                              
KWXDAT2  DS    CL78     5    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78     6    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78     7    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78     8    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78     9    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    10    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    11    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    12    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    13    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    14    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    15    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    16    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    17    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    18    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    19    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    20    2   78   A    U    N    M    T         N           
         DS    CL8                                                              
         DS    CL78    21    2   78   A    U    N    M    T         N           
KWXDATLH DS    CL8                                                              
KWXDATL  DS    CL75    22    2   75   A    U    N    M    T         N           
KWXTABH  DS    CL8                                                              
KWXTAB   DS    CL1     22   79    1   A    U    N    M    T         Y           
KWXLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
KWXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1843 BYTES                            
