*          DATA SET SRLCKFFD   AT LEVEL 006 AS OF 02/08/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T15CFFD      DATE 02/08/90                 
         SPACE 1                                                                
T15CFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRLMSGH  DS    CL8                                                              
SRLMSG   DS    CL60     1    2   60  A   P    N         T        Y              
SRLIDH   DS    CL8                                                              
SRLID    DS    CL17     1   63   17  A   U    N    M    T        Y              
SRLP1H   DS    CL8                                                              
SRLP1    DS    CL16     3    2   16  A   U    N    M    T    I   Y              
SRLP2H   DS    CL8                                                              
SRLP2    DS    CL16     3   22   16  A   U    N    M    T        Y              
SRLP3H   DS    CL8                                                              
SRLP3    DS    CL16     3   42   16  A   U    N    M    T        Y              
SRLP4H   DS    CL8                                                              
SRLP4    DS    CL16     3   62   16  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL48     4    2   48  A   P    H         T        Y              
SRLDAT1H DS    CL8                                                              
SRLDAT1  DS    CL48     5    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     6    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     7    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     8    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     9    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    10    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    11    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    12    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    13    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    14    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    15    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    16    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    17    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    18    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    19    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    20    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    21    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    22    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    23    2   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    24    2   48  A   P    N         T        Y              
SRLLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SRLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1432 BYTES                            
