*          DATA SET SRLODFFD   AT LEVEL 005 AS OF 02/16/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T117FFD      DATE 02/16/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVIDH   DS    XL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     3    2   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     3   22   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     3   42   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     3   62   16  L  P N             T        Y              
SRVL1H   DS    XL8                                                              
SRVL1    DS    CL16     4    2   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     4   22   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     4   42   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     4   62   16  A  U N        M    T        Y              
SRVL2H   DS    XL8                                                              
SRVL2    DS    CL16     5    2   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     5   22   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     5   42   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     5   62   16  A  U N        M    T        Y              
SRVL3H   DS    XL8                                                              
SRVL3    DS    CL16     6    2   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     6   22   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     6   42   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     6   62   16  A  U N        M    T        Y              
SRVL4H   DS    XL8                                                              
SRVL4    DS    CL16     7    2   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     7   22   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     7   42   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     7   62   16  A  U N        M    T        Y              
SRVL5H   DS    XL8                                                              
SRVL5    DS    CL16     8    2   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     8   22   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     8   42   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     8   62   16  A  U N        M    T        Y              
SRVL6H   DS    XL8                                                              
SRVL6    DS    CL16     9    2   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     9   22   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     9   42   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     9   62   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16    11    2   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL26    11   22   26  L  P N             T        Y              
SRVID1H  DS    XL8                                                              
SRVID1   DS    CL16    12    2   16  A  U N        M    T        Y              
SRVID2H  DS    XL8                                                              
SRVID2   DS    CL26    12   22   26  A  U N        M    T        Y              
SRVTABH  DS    XL8                                                              
SRVTAB   DS    CL1     13    2    1  A  U N        M    T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 896  BYTES                            
