*          DATA SET SRLSTFFD   AT LEVEL 008 AS OF 08/15/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T119FFD      DATE 08/15/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     3    2   16  A  U N        M    T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     3   22   16  A  U N        M    T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   42   16  A  U N        M    T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL78     4    2   78  A  P N             T        Y              
SRVTOTH  DS    CL8                                                              
SRVTOT   DS    CL78     6    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38     8    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38     8   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38     9    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38     9   42   38  A  P N             T        Y              
SRVL1AH  DS    CL8                                                              
SRVL1A   DS    CL38    10    2   38  A  P N             T        Y              
SRVL1BH  DS    CL8                                                              
SRVL1B   DS    CL38    10   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    11    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    11   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    12    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    12   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    13    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    13   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    14    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    14   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    15    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    15   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    16    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    16   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    17    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    17   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    18    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    18   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    19    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    19   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    20    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    20   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    21    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    21   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    22    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    22   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    23    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    23   42   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    24    2   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL38    24   42   38  A  P N             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1928 BYTES                            
