*          DATA SET SRMQTFFD   AT LEVEL 004 AS OF 03/24/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T16AFFD      DATE 03/24/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  L  P N             T        Y              
SRVSRVH  DS    CL8                                                              
SRVSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P H             T        Y              
SRVACTH  DS    CL8                                                              
SRVACT   DS    CL8      2    9    8  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL7      2   19    7  L  P H             T        Y              
SRVOPTH  DS    CL8                                                              
SRVOPT   DS    CL53     2   27   53  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  L  P H             T        Y              
SRVDATAH DS    CL8                                                              
SRVDATA  DS    CL56     3    9   56  A  U N        M    T        Y              
SRVTABH  DS    CL8                                                              
SRVTAB   DS    CL1      4    9    1  A  U N        M    T        Y              
SRVHD1H  DS    CL8                                                              
SRVHD1   DS    CL78     5    2   78  L  P H             T        Y              
SRVHD2H  DS    CL8                                                              
SRVHD2   DS    CL78     6    2   78  L  P H             T        Y              
SRVSACTH DS    CL8                                                              
SRVSACT  DS    CL3      7    2    3  A  U N        M    T        Y              
SRVLIN1H DS    CL8                                                              
SRVLIN1  DS    CL74     7    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  U N        M    T        Y              
SRVLIN2H DS    CL8                                                              
SRVLIN2  DS    CL74     8    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74     9    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL74    23    6   74  L  P N             T        Y              
SRVXXXH  DS    CL8                                                              
SRVXXX   DS    CL1     24    2    1  A  U N             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2056 BYTES                            
