*          DATA SET SRMQPFFD   AT LEVEL 002 AS OF 02/22/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T16BFFD      DATE 02/22/98                 
         SPACE 1                                                                
T16BFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  L  P N             T        Y              
SRVSRVH  DS    CL8                                                              
SRVSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P H             T        Y              
SRVACTH  DS    CL8                                                              
SRVACT   DS    CL8      2    9    8  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL7      2   19    7  L  P H             T        Y              
SRVOPTH  DS    CL8                                                              
SRVOPT   DS    CL53     2   27   53  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  L  P H             T        Y              
SRVDATAH DS    CL8                                                              
SRVDATA  DS    CL56     3    9   56  A  U N        M    T        Y              
SRVXXXH  DS    CL8                                                              
SRVXXX   DS    CL1      4    2    1  A  U N             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 360  BYTES                            
