*          DATA SET SRMQIFFD   AT LEVEL 001 AS OF 10/11/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T170FFD      DATE 10/11/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MQIMSGH  DS    CL8                                                              
MQIMSG   DS    CL60     1    2   60  L  P N R R         T        Y              
MQISRVH  DS    CL8                                                              
MQISRV   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 96   BYTES                            
