*          DATA SET SRMSGFFD   AT LEVEL 001 AS OF 09/15/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T130FFD      DATE 09/15/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60   A    P    N         T         Y           
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17   A    U    N    M    T    I    Y           
SRVMSG2H DS    CL8                                                              
SRVMSG2  DS    CL60     2    2   60   A    P    N         T         Y           
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     4    2   16   A    U    N    M    T         Y           
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     4   22   16   A    U    N    M    T         Y           
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     4   42   16   A    U    N    M    T         Y           
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     4   62   16   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL16     5    2   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     5   22   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     5   42   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     5   62   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      7    1    8   A    P    N         T         Y           
SRVLN1H  DS    CL8                                                              
SRVLN1   DS    CL68     7   10   68   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      8    1    8   A    P    N         T         Y           
SRVLN2H  DS    CL8                                                              
SRVLN2   DS    CL68     8   10   68   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9    1    8   A    P    N         T         Y           
SRVLN3H  DS    CL8                                                              
SRVLN3   DS    CL68     9   10   68   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10    1    8   A    P    N         T         Y           
SRVLN4H  DS    CL8                                                              
SRVLN4   DS    CL68    10   10   68   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11    1    8   A    P    N         T         Y           
SRVLN5H  DS    CL8                                                              
SRVLN5   DS    CL68    11   10   68   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12    1    8   A    P    N         T         Y           
SRVLN6H  DS    CL8                                                              
SRVLN6   DS    CL68    12   10   68   A    U    N         T         Y           
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 908  BYTES                            
