*          DATA SET SRNEWFFD   AT LEVEL 004 AS OF 06/06/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T12CFFD      DATE 06/06/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  L  P N R R         T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL10     3    2   10  L  P H   B         T        Y              
SRVSYSH  DS    CL8                                                              
SRVSYS   DS    CL8      3   13    8  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL10     3   25   10  L  P H   B         T        Y              
SRVPRGH  DS    CL8                                                              
SRVPRG   DS    CL8      3   36    8  A  U N        M    T        Y              
SRVTABH  DS    CL8                                                              
SRVTAB   DS    CL2      3   76    2  A  U N        M    T        Y              
SRVHDR1H DS    CL8                                                              
SRVHDR1  DS    CL78     5    2   78  L  P H   B         T        Y              
SRVHDR2H DS    CL8                                                              
SRVHDR2  DS    CL78     6    2   78  L  P H             T        Y              
SRVSEL1H DS    CL8                                                              
SRVSEL1  DS    CL3      7    2    3  A  U H        M    T        Y              
SRVLIN1H DS    CL8                                                              
SRVLIN1  DS    CL75     7    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75     8    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75     9    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    10    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    11    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U H        M    T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  L  P N             T        Y              
SRVSELXH DS    CL8                                                              
SRVSELX  DS    CL3     23    2    3  A  U H        M    T        Y              
SRVLINXH DS    CL8                                                              
SRVLINX  DS    CL75    23    6   75  L  P N             T        Y              
SRVPFKH  DS    CL8                                                              
SRVPFK   DS    CL78    24    2   78  L  P H             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
