*          DATA SET SRNEWFED   AT LEVEL 005 AS OF 06/06/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T12CFED      DATE 06/06/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL60     1    2   60  L  P N R R         T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL10     3    2   10  L  P H   B         T        Y              
         DS    CL8                                                              
         DS    CL8      3   13    8  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL10     3   25   10  L  P H   B         T        Y              
         DS    CL8                                                              
         DS    CL8      3   36    8  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL2      3   76    2  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL78     5    2   78  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL79     6    2   79  L  P H             T        Y              
SRVPERH  DS    CL8                                                              
SRVPER   DS    CL78     7    2   78  L  P H             T        Y              
SRVST1H  DS    CL8                                                              
SRVST1   DS    CL79     8    2   79  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  L  P H             T        Y              
SRVML1H  DS    CL8                                                              
SRVML1   DS    CL70     9    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    10    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    11    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    12    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    13    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    14    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    15    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    16    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    17    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    18    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    19    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   80    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    20    6   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   80    1  L  P H             T        Y              
SRVSTLH  DS    CL8                                                              
SRVSTL   DS    CL79    21    2   79  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    22    2   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    23    2   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL76    24    2   76  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1888 BYTES                            
