*          DATA SET SRNOPFFD   AT LEVEL 010 AS OF 05/30/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T103FFD      DATE 05/30/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  L   P    N         T        Y              
SRVSREQH DS    CL8                                                              
SRVSREQ  DS    CL17     1   63   17  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL12     3    2   12  L   P    H         T        Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL44     3   15   44  A   U    N    M    T    I   Y              
SRVX1H   DS    CL8                                                              
SRVX1    DS    CL16     3   64   16  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     4    2   12  L   P    H         T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL44     4   15   44  A   U    N    M    T        Y              
SRVX2H   DS    CL8                                                              
SRVX2    DS    CL16     4   64   16  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     5    2   12  L   P    H         T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL44     5   15   44  A   U    N    M    T        Y              
SRVX3H   DS    CL8                                                              
SRVX3    DS    CL16     5   64   16  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     6    2   12  L   P    N         T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL44     6   15   44  A   U    Z    M    T        Y              
SRVX4H   DS    CL8                                                              
SRVX4    DS    CL16     6   64   16  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  L   P    N         T        Y              
SRVP5H   DS    CL8                                                              
SRVP5    DS    CL44     7   15   44  A   U    N    M    T        Y              
SRVTABH  DS    CL8                                                              
SRVTAB   DS    CL1      7   64    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  L   P    N         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 736  BYTES                            
