*          DATA SET SRNWKFFD   AT LEVEL 002 AS OF 12/22/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T135FFD      DATE 13/02/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  L  P N R R         T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T        Y              
SRVP1AH  DS    CL8                                                              
SRVP1A   DS    CL13     2    2   13  L  P H   B         T        Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     2   16   16  A  U N        M    T    I   Y              
SRVP2AH  DS    CL8                                                              
SRVP2A   DS    CL12     2   33   12  L  P H   B         T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL34     2   46   34  A  U N        M    T        Y              
SRVP3AH  DS    CL8                                                              
SRVP3A   DS    CL13     3    2   13  L  P H   B         T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   16   16  A  U N        M    T        Y              
SRVP4AH  DS    CL8                                                              
SRVP4A   DS    CL12     3   33   12  L  P H   B         T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL34     3   46   34  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL13     4    2   13  L  P H   B         T        Y              
SRVOPTNH DS    CL8                                                              
SRVOPTN  DS    CL60     4   16   60  L  U N        M    T        Y              
SRVINFH  DS    CL8                                                              
SRVINF   DS    CL79     5    2   79  L  P N   B         T        Y              
SRVEX2H  DS    CL8                                                              
SRVEX2   DS    CL79     6    2   79  L  P N   B         T        Y              
SRVHD1H  DS    CL8                                                              
SRVHD1   DS    CL79     7    2   79  L  P H R B         T        Y              
SRVSA1H  DS    CL8                                                              
SRVSA1   DS    CL4      8    2    4  A  U N        M    T        Y              
SRVRL1H  DS    CL8                                                              
SRVRL1   DS    CL73     8    7   73  L  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73     9    7   73  L  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL4     10    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    10    7   73  L  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL4     11    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    11    7   73  L  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL4     12    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    12    7   73  L  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL4     13    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    13    7   73  L  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    14    7   73  L  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL4     15    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    15    7   73  L  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL4     16    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    16    7   73  L  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL4     17    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    17    7   73  L  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL4     18    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    18    7   73  L  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL4     19    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    19    7   73  L  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL4     20    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    20    7   73  L  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL4     21    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    21    7   73  L  P N   Y         T        Y              
         DS    CL8                                                              
         DS    CL4     22    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    22    7   73  L  P N   G         T        Y              
         DS    CL8                                                              
         DS    CL4     23    2    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL73    23    7   73  L  P N   Y         T        Y              
SRVPFKH  DS    CL8                                                              
SRVPFK   DS    CL78    24    2   78  L  P H R R         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2240 BYTES                            
