*          DATA SET SRNWKFDD   AT LEVEL 001 AS OF 09/12/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T135FDD      DATE 09/12/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     6    2   12  L  P H   Y         T        Y              
SRVFILH  DS    XL8                                                              
SRVFIL   DS    CL16     6   16   16  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12     6   33   12  L  P H   Y         T        Y              
SRVDATDH DS    XL8                                                              
SRVDATD  DS    CL9      6   46    9  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  L  P H   Y         T        Y              
SRVREFH  DS    XL8                                                              
SRVREF   DS    CL6      7   16    6  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12     7   33   12  L  P H   Y         T        Y              
SRVTIMRH DS    XL8                                                              
SRVTIMR  DS    CL5      7   46    5  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  L  P H   Y         T        Y              
SRVNAMEH DS    XL8                                                              
SRVNAME  DS    CL16     8   16   16  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12     8   33   12  L  P H   Y         T        Y              
SRVRMNGH DS    XL8                                                              
SRVRMNG  DS    CL16     8   46   16  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  L  P H   Y         T        Y              
SRVSTATH DS    XL8                                                              
SRVSTAT  DS    CL16    10   16   16  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12    10   33   12  L  P H   Y         T        Y              
SRVDATCH DS    XL8                                                              
SRVDATC  DS    CL9     10   46    9  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  L  P H   Y         T        Y              
SRVTYPEH DS    XL8                                                              
SRVTYPE  DS    CL16    11   16   16  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12    11   33   12  L  P H   Y         T        Y              
SRVTIMCH DS    XL8                                                              
SRVTIMC  DS    CL5     11   46    5  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  L  P H   Y         T        Y              
SRVATTBH DS    XL8                                                              
SRVATTB  DS    CL16    12   16   16  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12    12   33   12  L  P H   Y         T        Y              
SRVRETCH DS    XL8                                                              
SRVRETC  DS    CL10    12   46   10  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  L  P H   Y         T        Y              
SRVUSERH DS    XL8                                                              
SRVUSER  DS    CL16    13   16   16  L  P N   Y         T        Y              
         DS    XL8                                                              
         DS    CL13    14    2   13  L  P H   G         T        Y              
SRVCNTSH DS    XL8                                                              
SRVCNTS  DS    CL15    14   16   15  L  P N   G         T        Y              
         DS    XL8                                                              
         DS    CL12    14   33   12  L  P H   G         T        Y              
SRVDATSH DS    XL8                                                              
SRVDATS  DS    CL9     14   46    9  L  P N   G         T        Y              
         DS    XL8                                                              
         DS    CL13    15    2   13  L  P H   G         T        Y              
SRVLOCSH DS    XL8                                                              
SRVLOCS  DS    CL10    15   16   10  L  P N   G         T        Y              
         DS    XL8                                                              
         DS    CL12    15   33   12  L  P H   G         T        Y              
SRVTIMSH DS    XL8                                                              
SRVTIMS  DS    CL5     15   46    5  L  P N   G         T        Y              
         DS    XL8                                                              
         DS    CL12    16    2   12  L  P H   G         T        Y              
SRVDEVSH DS    XL8                                                              
SRVDEVS  DS    CL8     16   16    8  L  P N   G         T        Y              
         DS    XL8                                                              
         DS    CL12    16   33   12  L  P H   G         T        Y              
SRVRETSH DS    XL8                                                              
SRVRETS  DS    CL10    16   46   10  L  P N   G         T        Y              
SRVGRP4H DS    XL8                                                              
SRVGRP4  DS    CL78    17    2   78  L  P H   P         T        Y              
SRVRECSH DS    XL8                                                              
SRVRECS  DS    CL12    18    2   12  L  P H   P         T        Y              
SRVRECLH DS    XL8                                                              
SRVRECL  DS    CL16    18   16   16  L  P N   P         T        Y              
         DS    XL8                                                              
         DS    CL12    18   33   12  L  P H   P         T        Y              
SRVRECHH DS    XL8                                                              
SRVRECH  DS    CL16    18   46   16  L  P N   P         T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  L  P H   P         T        Y              
SRVAVGLH DS    XL8                                                              
SRVAVGL  DS    CL16    19   16   16  L  P N   P         T        Y              
         DS    XL8                                                              
         DS    CL12    19   33   12  L  P H   P         T        Y              
SRVMAXLH DS    XL8                                                              
SRVMAXL  DS    CL16    19   46   16  L  P N   P         T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  L  P H   P         T        Y              
SRVCISQH DS    XL8                                                              
SRVCISQ  DS    CL16    20   16   16  L  P N   P         T        Y              
         DS    XL8                                                              
         DS    CL12    20   33   12  L  P H   P         T        Y              
SRVWKDAH DS    XL8                                                              
SRVWKDA  DS    CL30    20   46   30  L  P N   P         T        Y              
         DS    XL8                                                              
         DS    CL12    21    2   12  L  P H   P         T        Y              
SRVNEXTH DS    XL8                                                              
SRVNEXT  DS    CL16    21   16   16  L  P N   P         T        Y              
         DS    XL8                                                              
         DS    CL12    21   33   12  L  P H   P         T        Y              
SRVTTBLH DS    XL8                                                              
SRVTTBL  DS    CL16    21   46   16  L  P N   P         T        Y              
         DS    XL8                                                              
         DS    CL12    22    2   12  L  P H   P         T        Y              
SRVSIZEH DS    XL8                                                              
SRVSIZE  DS    CL16    22   16   16  L  P N   P         T        Y              
         DS    XL8                                                              
         DS    CL12    22   33   12  L  P H   P         T        Y              
SRVPSWDH DS    XL8                                                              
SRVPSWD  DS    CL16    22   46   16  L  P N   P         T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1288 BYTES                            
