*          DATA SET SRNWKFED   AT LEVEL 002 AS OF 12/22/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T135FED      DATE 19/05/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVLIN1H DS    CL8                                                              
SRVLIN1  DS    CL79     6    2   79  L  P H R W         T        Y              
         DS    CL8                                                              
         DS    CL79     7    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79     8    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    10    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    11    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    12    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    13    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    14    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    15    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    16    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    17    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    18    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    19    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    20    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    21    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    22    2   79  L  P N R W         T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  L  P N R W         T        Y              
SRVPFK1H DS    CL8                                                              
SRVPFK1  DS    CL79    24    2   79  L  P H R           T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS= 1                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1656 BYTES                            
