*          DATA SET SRNWKFCD   AT LEVEL 003 AS OF 10/02/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T135FCD      DATE 02/10/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVLIN2H DS    XL8                                                              
SRVLIN2  DS    CL79     6    2   79  L  P H R W         T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40     7   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     7   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40     8   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     8   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40     9   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     9   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    10   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    10   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    11    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    11   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    11   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    12   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    13    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    13   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    14    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    14   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    15    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    15   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    16    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    16   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    17    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    17   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    18    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    18   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    19    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    19   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    20    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    20   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    21    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    21   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    21   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    22    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    22   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    22   58   20  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL11    23    2   11  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL40    23   16   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    23   58   20  L  P N R W         T        Y              
SRVPFK2H DS    XL8                                                              
SRVPFK2  DS    CL79    24    2   79  L  P H R           T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS= 1                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
