*          DATA SET SRPFMFFD   AT LEVEL 004 AS OF 10/26/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T137FFD      DATE 10/26/92                 
         SPACE 1                                                                
T137FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PFMHDRH  DS    CL8                                                              
PFMHDR   DS    CL60     1    2   60  A  P N R R         T        Y              
PFMSRH   DS    CL8                                                              
PFMSR    DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL9      3    2    9  A  P N   B         T        Y              
PFMFILEH DS    CL8                                                              
PFMFILE  DS    CL8      3   17    8  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL9      4    2    9  A  P N   B         T        Y              
PFMRIDH  DS    CL8                                                              
PFMRID   DS    CL63     4   17   63  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL13     5    2   13  A  P N   B         T        Y              
PFMRACTH DS    CL8                                                              
PFMRACT  DS    CL24     5   17   24  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL10     6    2   10  A  P N   B         T        Y              
PFMEIDH  DS    CL8                                                              
PFMEID   DS    CL24     6   17   24  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N   B         T        Y              
PFMEACTH DS    CL8                                                              
PFMEACT  DS    CL24     7   17   24  A  U N        M    T        Y              
PFMMSGH  DS    CL8                                                              
PFMMSG   DS    CL20     7   61   20  A  P H R B         T        Y              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P H R Y         T        Y              
         DS    CL8                                                              
         DS    CL40     9   17   40  A  P H R G         T        Y              
         DS    CL8                                                              
         DS    CL20     9   61   20  A  P H R R         T        Y              
PFML1OH  DS    CL8                                                              
PFML1O   DS    CL11    10    2   11  A  P N   Y         T        Y              
PFML1HH  DS    CL8                                                              
PFML1H   DS    CL40    10   17   40  A  P N   G         T        Y              
PFML1AH  DS    CL8                                                              
PFML1A   DS    CL20    10   61   20  A  P N   R         T        Y              
PFML2OH  DS    CL8                                                              
PFML2O   DS    CL11    11    2   11  A  P N   Y         T        Y              
PFML2HH  DS    CL8                                                              
PFML2H   DS    CL40    11   17   40  A  P N   G         T        Y              
PFML2AH  DS    CL8                                                              
PFML2A   DS    CL20    11   61   20  A  P N   R         T        Y              
PFML3OH  DS    CL8                                                              
PFML3O   DS    CL11    12    2   11  A  P N   Y         T        Y              
PFML3HH  DS    CL8                                                              
PFML3H   DS    CL40    12   17   40  A  P N   G         T        Y              
PFML3AH  DS    CL8                                                              
PFML3A   DS    CL20    12   61   20  A  P N   R         T        Y              
PFML4OH  DS    CL8                                                              
PFML4O   DS    CL11    13    2   11  A  P N   Y         T        Y              
PFML4HH  DS    CL8                                                              
PFML4H   DS    CL40    13   17   40  A  P N   G         T        Y              
PFML4AH  DS    CL8                                                              
PFML4A   DS    CL20    13   61   20  A  P N   R         T        Y              
PFML5OH  DS    CL8                                                              
PFML5O   DS    CL11    14    2   11  A  P N   Y         T        Y              
PFML5HH  DS    CL8                                                              
PFML5H   DS    CL40    14   17   40  A  P N   G         T        Y              
PFML5AH  DS    CL8                                                              
PFML5A   DS    CL20    14   61   20  A  P N   R         T        Y              
PFML6OH  DS    CL8                                                              
PFML6O   DS    CL11    15    2   11  A  P N   Y         T        Y              
PFML6HH  DS    CL8                                                              
PFML6H   DS    CL40    15   17   40  A  P N   G         T        Y              
PFML6AH  DS    CL8                                                              
PFML6A   DS    CL20    15   61   20  A  P N   R         T        Y              
PFML7OH  DS    CL8                                                              
PFML7O   DS    CL11    16    2   11  A  P N   Y         T        Y              
PFML7HH  DS    CL8                                                              
PFML7H   DS    CL40    16   17   40  A  P N   G         T        Y              
PFML7AH  DS    CL8                                                              
PFML7A   DS    CL20    16   61   20  A  P N   R         T        Y              
PFML8OH  DS    CL8                                                              
PFML8O   DS    CL11    17    2   11  A  P N   Y         T        Y              
PFML8HH  DS    CL8                                                              
PFML8H   DS    CL40    17   17   40  A  P N   G         T        Y              
PFML8AH  DS    CL8                                                              
PFML8A   DS    CL20    17   61   20  A  P N   R         T        Y              
PFML9OH  DS    CL8                                                              
PFML9O   DS    CL11    18    2   11  A  P N   Y         T        Y              
PFML9HH  DS    CL8                                                              
PFML9H   DS    CL40    18   17   40  A  P N   G         T        Y              
PFML9AH  DS    CL8                                                              
PFML9A   DS    CL20    18   61   20  A  P N   R         T        Y              
PFML10OH DS    CL8                                                              
PFML10O  DS    CL11    19    2   11  A  P N   Y         T        Y              
PFML10HH DS    CL8                                                              
PFML10H  DS    CL40    19   17   40  A  P N   G         T        Y              
PFML10AH DS    CL8                                                              
PFML10A  DS    CL20    19   61   20  A  P N   R         T        Y              
PFML11OH DS    CL8                                                              
PFML11O  DS    CL11    20    2   11  A  P N   Y         T        Y              
PFML11HH DS    CL8                                                              
PFML11H  DS    CL40    20   17   40  A  P N   G         T        Y              
PFML11AH DS    CL8                                                              
PFML11A  DS    CL20    20   61   20  A  P N   R         T        Y              
PFML12OH DS    CL8                                                              
PFML12O  DS    CL11    21    2   11  A  P N   Y         T        Y              
PFML12HH DS    CL8                                                              
PFML12H  DS    CL40    21   17   40  A  P N   G         T        Y              
PFML12AH DS    CL8                                                              
PFML12A  DS    CL20    21   61   20  A  P N   R         T        Y              
PFML13OH DS    CL8                                                              
PFML13O  DS    CL11    22    2   11  A  P N   Y         T        Y              
PFML13HH DS    CL8                                                              
PFML13H  DS    CL40    22   17   40  A  P N   G         T        Y              
PFML13AH DS    CL8                                                              
PFML13A  DS    CL20    22   61   20  A  P N   R         T        Y              
PFML14OH DS    CL8                                                              
PFML14O  DS    CL11    23    2   11  A  P N   Y         T        Y              
PFML14HH DS    CL8                                                              
PFML14H  DS    CL40    23   17   40  A  P N   G         T        Y              
PFML14AH DS    CL8                                                              
PFML14A  DS    CL20    23   61   20  A  P N   R         T        Y              
         DS    CL8                                                              
         DS    CL1     24   17    1  A  U N             T        Y              
PFMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1904 BYTES                            
