*          DATA SET SRPHSFFD   AT LEVEL 004 AS OF 05/31/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T138FFD      DATE 05/31/01                 
         SPACE 1                                                                
T138FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVSRVH  DS    XL8                                                              
SRVSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
SRVP1H   DS    XL8                                                              
SRVP1    DS    CL16     2    2   16  A  U N        M    T    I   Y              
SRVP2H   DS    XL8                                                              
SRVP2    DS    CL16     2   22   16  A  U N        M    T        Y              
SRVP3H   DS    XL8                                                              
SRVP3    DS    CL16     2   42   16  A  U N        M    T        Y              
SRVP4H   DS    XL8                                                              
SRVP4    DS    CL16     2   62   16  A  U N        M    T        Y              
SRVP5H   DS    XL8                                                              
SRVP5    DS    CL1      2   79    1  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     3    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     3   22   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     3   42   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     3   62   16  A  P N             T        Y              
SRVT1H   DS    XL8                                                              
SRVT1    DS    CL79     4    2   79  A  P H             T        Y              
SRVL1H   DS    XL8                                                              
SRVL1    DS    CL79     5    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79     6    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79     7    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79     8    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    23    2   79  A  P N             T        Y              
SRVPFKH  DS    XL8                                                              
SRVPFK   DS    CL79    24    2   79  A  P N             T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2192 BYTES                            
