*          DATA SET SRPQUFDD   AT LEVEL 001 AS OF 12/17/20                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T131FDD      DATE 12/17/20                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     6    2   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL65     6   15   65  L  P N             T        Y              
SRVGRP1H DS    XL8                                                              
SRVGRP1  DS    CL12     8    2   12  L  P H             T        Y              
SRVIDENH DS    XL8                                                              
SRVIDEN  DS    CL16     8   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   33   12  L  P H             T        Y              
SRVDATRH DS    XL8                                                              
SRVDATR  DS    CL9      8   46    9  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  L  P H             T        Y              
SRVCLASH DS    XL8                                                              
SRVCLAS  DS    CL16     9   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   33   12  L  P H             T        Y              
SRVTIMRH DS    XL8                                                              
SRVTIMR  DS    CL5      9   46    5  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  L  P H             T        Y              
SRVNAMEH DS    XL8                                                              
SRVNAME  DS    CL16    10   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   33   12  L  P H             T        Y              
SRVFORMH DS    XL8                                                              
SRVFORM  DS    CL16    10   46   16  L  P N             T        Y              
SRVGRP2H DS    XL8                                                              
SRVGRP2  DS    CL6     12    2    6  L  P H             T        Y              
SRVSTATH DS    XL8                                                              
SRVSTAT  DS    CL16    12   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   33   12  L  P H             T        Y              
SRVDATCH DS    XL8                                                              
SRVDATC  DS    CL9     12   46    9  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  L  P H             T        Y              
SRVNUMPH DS    XL8                                                              
SRVNUMP  DS    CL16    13   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   33   12  L  P H             T        Y              
SRVTIMCH DS    XL8                                                              
SRVTIMC  DS    CL5     13   46    5  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    14    2   12  L  P H             T        Y              
SRVNUMLH DS    XL8                                                              
SRVNUML  DS    CL16    14   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   33   12  L  P H             T        Y              
SRVRETCH DS    XL8                                                              
SRVRETC  DS    CL10    14   46   10  L  P N             T        Y              
SRVGRP3H DS    XL8                                                              
SRVGRP3  DS    CL12    16    2   12  L  P H             T        Y              
SRVLOCPH DS    XL8                                                              
SRVLOCP  DS    CL16    16   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   33   12  L  P H             T        Y              
SRVDATPH DS    XL8                                                              
SRVDATP  DS    CL9     16   46    9  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  L  P H             T        Y              
SRVCNTPH DS    XL8                                                              
SRVCNTP  DS    CL16    17   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   33   12  L  P H             T        Y              
SRVTIMPH DS    XL8                                                              
SRVTIMP  DS    CL5     17   46    5  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18    2   12  L  P H             T        Y              
SRVDEVPH DS    XL8                                                              
SRVDEVP  DS    CL16    18   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   33   12  L  P H             T        Y              
SRVRETPH DS    XL8                                                              
SRVRETP  DS    CL10    18   46   10  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    20    2   11  L  P H             T        Y              
SRVATTBH DS    XL8                                                              
SRVATTB  DS    CL16    20   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   33   11  L  P H             T        Y              
SRVTYPEH DS    XL8                                                              
SRVTYPE  DS    CL30    20   46   30  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    2   11  L  P H             T        Y              
SRVARCH  DS    XL8                                                              
SRVARC   DS    CL16    21   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   33   11  L  P H             T        Y              
SRVSECH  DS    XL8                                                              
SRVSEC   DS    CL24    21   46   24  L  P N             T        Y              
SRVGRP4H DS    XL8                                                              
SRVGRP4  DS    CL10    22    2   10  L  P H             T        Y              
SRVLINTH DS    XL8                                                              
SRVLINT  DS    CL16    22   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   33   12  L  P H             T        Y              
SRVNCISH DS    XL8                                                              
SRVNCIS  DS    CL24    22   46   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23    2   10  L  P H             T        Y              
SRVLPPH  DS    XL8                                                              
SRVLPP   DS    CL16    23   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    23   33   12  L  P H             T        Y              
SRVPSWDH DS    XL8                                                              
SRVPSWD  DS    CL24    23   46   24  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    24    2   11  L  P H             T        Y              
SRVCPLH  DS    XL8                                                              
SRVCPL   DS    CL16    24   16   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    24   33   11  L  P H             T        Y              
SRVCPLMH DS    XL8                                                              
SRVCPLM  DS    CL24    24   46   24  L  P N             T        Y              
SRVUPROH DS    XL8                                                              
SRVUPRO  DS    CL1     24   78    1  L  U N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
