*          DATA SET SRPQTFFD   AT LEVEL 003 AS OF 06/19/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T134FFD      DATE 06/19/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PPPMSGH  DS    XL8                                                              
PPPMSG   DS    CL60     1    2   60  L  P N             T        Y              
PPPSRVH  DS    XL8                                                              
PPPSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL9      3    2    9  L  P N             T        Y              
PPPSUBH  DS    XL8                                                              
PPPSUB   DS    CL16     3   15   16  A  U N        M    T    I   Y              
         DS    XL8                                                              
         DS    CL9      4    2    9  L  P N             T        Y              
PPPPAGH  DS    XL8                                                              
PPPPAG   DS    CL16     4   15   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL9      5    2    9  L  P N             T        Y              
PPPLINH  DS    XL8                                                              
PPPLIN   DS    CL16     5   15   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P N             T        Y              
PPPDAT1H DS    XL8                                                              
PPPDAT1  DS    CL60     6   15   60  L  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  L  P N             T        Y              
PPPDAT2H DS    XL8                                                              
PPPDAT2  DS    CL60     7   15   60  L  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  L  P N             T        Y              
PPPLRETH DS    XL8                                                              
PPPLRET  DS    CL5      9   15    5  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL10     9   42   10  L  P N             T        Y              
PPPDRETH DS    XL8                                                              
PPPDRET  DS    CL5      9   55    5  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  L  P N             T        Y              
PPPSTATH DS    XL8                                                              
PPPSTAT  DS    CL4     10   15    4  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL5     10   42    5  L  P N             T        Y              
PPPCLASH DS    XL8                                                              
PPPCLAS  DS    CL1     10   55    1  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL4     11    2    4  L  P N             T        Y              
PPPTYPEH DS    XL8                                                              
PPPTYPE  DS    CL1     11   15    1  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL10    11   42   10  L  P N             T        Y              
PPPATTRH DS    XL8                                                              
PPPATTR  DS    CL4     11   55    4  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL9     11   62    9  L  P N             T        Y              
PPPARCFH DS    XL8                                                              
PPPARCF  DS    CL4     11   73    4  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  L  P N             T        Y              
PPPDESCH DS    XL8                                                              
PPPDESC  DS    CL11    12   15   11  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL8     12   42    8  L  P N             T        Y              
PPPPSWDH DS    XL8                                                              
PPPPSWD  DS    CL4     12   55    4  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL9     12   62    9  L  P N             T        Y              
PPPSECFH DS    XL8                                                              
PPPSECF  DS    CL4     12   73    4  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  L  P N             T        Y              
PPPFORMH DS    XL8                                                              
PPPFORM  DS    CL4     13   15    4  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL5     13   42    5  L  P N             T        Y              
PPPCHARH DS    XL8                                                              
PPPCHAR  DS    CL4     13   55    4  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL6     14    2    6  L  P N             T        Y              
PPPCOPYH DS    XL8                                                              
PPPCOPY  DS    CL4     14   15    4  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL11    14   42   11  L  P N             T        Y              
PPPMAKEH DS    XL8                                                              
PPPMAKE  DS    CL5     14   55    5  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL10    15    2   10  L  P N             T        Y              
PPPLPPH  DS    XL8                                                              
PPPLPP   DS    CL2     15   15    2  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL9     15   42    9  L  P N             T        Y              
PPPLTYH  DS    XL8                                                              
PPPLTY   DS    CL5     15   55    5  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  L  P N             T        Y              
PPPBAH   DS    XL8                                                              
PPPBA    DS    CL1     17   15    1  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL1     17   55    1  A  U N             T        Y              
PPPLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
PPPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1048 BYTES                            
