*          DATA SET SRPRGFED   AT LEVEL 001 AS OF 11/22/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T141FED      DATE 11/22/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVOV1H  DS    CL8                                                              
SRVOV1   DS    CL78     8    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
SRVOV2H  DS    CL8                                                              
SRVOV2   DS    CL78    23    2   78  A  P N             T        Y              
SRVOV3H  DS    CL8                                                              
SRVOV3   DS    CL78    24    2   78  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS= 1                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1472 BYTES                            
