*          DATA SET SRPWDFFD   AT LEVEL 001 AS OF 12/09/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T1FDFFD      DATE 12/09/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P H             T        Y              
SRVSREQH DS    XL8                                                              
SRVSREQ  DS    CL17     1   63   17  A  U N             T        Y              
SRVP1H   DS    XL8                                                              
SRVP1    DS    CL16     3    2   16  L  U Z             T    I   Y              
SRVP2H   DS    XL8                                                              
SRVP2    DS    CL16     3   22   16  A  U N             T        Y              
SRVP3H   DS    XL8                                                              
SRVP3    DS    CL16     3   42   16  A  U N             T        Y              
SRVP4H   DS    XL8                                                              
SRVP4    DS    CL16     3   62   16  A  U N             T        Y              
SRVP1UH  DS    XL8                                                              
SRVP1U   DS    CL16     4    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     6    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  P N             T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 392  BYTES                            
