*          DATA SET SRRMQFFD   AT LEVEL 001 AS OF 08/04/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T174FFD      DATE 08/04/08                 
         SPACE 1                                                                
T174FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVSERVH DS    XL8                                                              
SRVSERV  DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVFLD1H DS    XL8                                                              
SRVFLD1  DS    CL16     2    2   16  A  U N        M    T        Y              
SRVFLD2H DS    XL8                                                              
SRVFLD2  DS    CL16     2   22   16  A  U N        M    T        Y              
SRVFLD3H DS    XL8                                                              
SRVFLD3  DS    CL16     2   42   16  A  U N        M    T        Y              
SRVFLD4H DS    XL8                                                              
SRVFLD4  DS    CL16     2   62   16  A  U N        M    T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 256  BYTES                            
