*          DATA SET SRRUNFED   AT LEVEL 012 AS OF 07/10/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T158FED      DATE 07/10/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RUNSELH  DS    XL8                                                              
RUNSEL   DS    CL3      5    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74     5    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74     6    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74     7    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74     8    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74     9    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    10    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    11    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    12    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL74    23    6   74  L  P N             T        Y              
RUNXX2H  DS    XL8                                                              
RUNXX2   DS    CL60    24    2   60  L  P H             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
