*          DATA SET SRSESFFD   AT LEVEL 001 AS OF 10/30/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T149FFD      DATE 10/30/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     2    2   16  A  P N             T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     2   22   16  A  P N             T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     2   42   16  A  P N             T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     2   62   16  A  P N             T        Y              
SRVHEADH DS    CL8                                                              
SRVHEAD  DS    CL78     3    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     4    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     5    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     6    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     7    2   78  L  P N             T        Y              
SRVLIN2H DS    CL8                                                              
SRVLIN2  DS    CL78     8    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  L  P N             T        Y              
SRVLIN3H DS    CL8                                                              
SRVLIN3  DS    CL78    13    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  L  P N             T        Y              
SRVLIN4H DS    CL8                                                              
SRVLIN4  DS    CL78    18    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  L  P N             T        Y              
SRVLIN5H DS    CL8                                                              
SRVLIN5  DS    CL78    23    2   78  L  P N             T        Y              
SRVFOOTH DS    CL8                                                              
SRVFOOT  DS    CL78    24    2   78  L  P N             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2088 BYTES                            
