*          DATA SET SRSHMFFD   AT LEVEL 001 AS OF 11/07/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T178FFD      DATE 11/07/11                 
         SPACE 1                                                                
T178FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SHMMSGH  DS    XL8                                                              
SHMMSG   DS    CL60     1    2   60  A  P N             T        Y              
SHMSRVH  DS    XL8                                                              
SHMSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
SHMCM1H  DS    XL8                                                              
SHMCM1   DS    CL16     3    2   16  A  U N        M    T        Y              
SHMCM2H  DS    XL8                                                              
SHMCM2   DS    CL16     3   22   16  A  U N        M    T        Y              
SHMCM3H  DS    XL8                                                              
SHMCM3   DS    CL16     3   42   16  A  U N        M    T        Y              
SHMCM4H  DS    XL8                                                              
SHMCM4   DS    CL16     3   62   16  A  U N        M    T        Y              
SHMHDRH  DS    XL8                                                              
SHMHDR   DS    CL70     5    2   70  A  P H             T        Y              
SHMHDUH  DS    XL8                                                              
SHMHDU   DS    CL70     6    2   70  A  P H             T        Y              
SHMTB1H  DS    XL8                                                              
SHMTB1   DS    CL70     7    2   70  A  P N             T        Y              
SHMTB2H  DS    XL8                                                              
SHMTB2   DS    CL70     8    2   70  A  P N             T        Y              
SHMTB3H  DS    XL8                                                              
SHMTB3   DS    CL70     9    2   70  A  P N             T        Y              
SHMTB4H  DS    XL8                                                              
SHMTB4   DS    CL70    10    2   70  A  P N             T        Y              
SHMTB5H  DS    XL8                                                              
SHMTB5   DS    CL70    11    2   70  A  P N             T        Y              
SHMTB6H  DS    XL8                                                              
SHMTB6   DS    CL70    12    2   70  A  P N             T        Y              
SHMTB7H  DS    XL8                                                              
SHMTB7   DS    CL70    13    2   70  A  P N             T        Y              
SHMTB8H  DS    XL8                                                              
SHMTB8   DS    CL70    14    2   70  A  P N             T        Y              
SHMTB9H  DS    XL8                                                              
SHMTB9   DS    CL70    15    2   70  A  P N             T        Y              
SHMTBAH  DS    XL8                                                              
SHMTBA   DS    CL70    16    2   70  A  P N             T        Y              
SHMLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
SHMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1192 BYTES                            
