*          DATA SET SRSRCFFD   AT LEVEL 017 AS OF 07/10/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T12AFFD      DATE 10/07/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A   P    N         T        Y              
SRVSRVH  DS    CL8                                                              
SRVSRV   DS    CL17     1   63   17  A   U    N    M    T    I   Y              
SRVIDLH  DS    CL8                                                              
SRVIDL   DS    CL9      2    2    9  A   P    H         T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL68     2   12   68  A   U    N    M    T        Y              
SRVFILLH DS    CL8                                                              
SRVFILL  DS    CL9      3    2    9  A   P    H         T        Y              
SRVFILTH DS    CL8                                                              
SRVFILT  DS    CL68     3   12   68  A   U    N    M    T        Y    1         
SRVFILTX DS    CL8                                                              
SRVACT1H DS    CL8                                                              
SRVACT1  DS    CL3      4    2    3  A   U    N    M    T        Y              
SRVTXT1H DS    CL8                                                              
SRVTXT1  DS    CL75     4    6   75  A   P    N         T        Y              
SRVACT2H DS    CL8                                                              
SRVACT2  DS    CL3      5    2    3  A   U    N    M    T        Y              
SRVTXT2H DS    CL8                                                              
SRVTXT2  DS    CL75     5    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75     6    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75     7    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75     8    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75     9    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    10    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    11    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  A   P    N         T        Y              
SRVACTXH DS    CL8                                                              
SRVACTX  DS    CL3     23    2    3  A   U    N    M    T        Y              
SRVTXTXH DS    CL8                                                              
SRVTXTX  DS    CL75    23    6   75  A   P    N         T        Y              
SRVTABH  DS    CL8                                                              
SRVTAB   DS    CL1     24    2    1  A   U    N         T        Y              
SRVPFKSH DS    CL8                                                              
SRVPFKS  DS    CL75    24    6   75  A   P    H         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2262 BYTES                            
