*          DATA SET SRSTXFFD   AT LEVEL 003 AS OF 06/13/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T173FFD      DATE 06/13/06                 
         SPACE 1                                                                
T173FFD  DSECT                                                                  
         DS    XL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVSERVH DS    XL8                                                              
SRVSERV  DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVFLD1H DS    XL8                                                              
SRVFLD1  DS    CL16     2    2   16  A  U N        M    T        Y              
SRVFLD2H DS    XL8                                                              
SRVFLD2  DS    CL16     2   22   16  A  U N        M    T        Y              
SRVFLD3H DS    XL8                                                              
SRVFLD3  DS    CL16     2   42   16  A  U N        M    T        Y              
SRVFLD4H DS    XL8                                                              
SRVFLD4  DS    CL16     2   62   16  A  U N        M    T        Y              
SRVINPH  DS    XL8                                                              
SRVINP   DS    CL79     3    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     4    2   79  A  U N             T        Y              
SRVFLNKH DS    XL8                                                              
SRVFLNK  DS    CL79     5    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     6    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     7    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     8    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    23    2   79  A  U N             T        Y              
SRVTAGH  DS    XL8                                                              
SRVTAG   DS    CL1     24    2    1  A  P N             T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2096 BYTES                            
