*          DATA SET SRSYSFFD   AT LEVEL 002 AS OF 10/01/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T140FFD      DATE 10/01/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N R R         T        Y              
SRVSRVH  DS    XL8                                                              
SRVSRV   DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVP1H   DS    XL8                                                              
SRVP1    DS    CL16     2    2   16  A  U H U W    M    T        Y    0         
SRVP1X   DS    XL8                                                              
SRVP2H   DS    XL8                                                              
SRVP2    DS    CL16     2   22   16  A  U H U W    M    T        Y    0         
SRVP2X   DS    XL8                                                              
SRVP3H   DS    XL8                                                              
SRVP3    DS    CL16     2   42   16  A  U H U W    M    T        Y    0         
SRVP3X   DS    XL8                                                              
SRVP4H   DS    XL8                                                              
SRVP4    DS    CL16     2   62   16  A  U H U W    M    T        Y    0         
SRVP4X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     3    2   16  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL16     3   22   16  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL16     3   42   16  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL16     3   62   16  A  P N   B         T        Y              
SRVL1H   DS    XL8                                                              
SRVL1    DS    CL1      4    2    1  A  U N   G    M    T        Y    0         
SRVL1X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     4    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      4   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     4   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      4   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     4   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      4   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     4   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      4   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     4   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      4   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     4   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      5    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      5   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      5   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      5   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      5   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      5   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      6   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      6   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      6   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      6   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      6   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      7   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      7   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      7   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      7   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      7   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      8   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      8   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      8   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      8   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      8   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      9    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      9   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      9   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      9   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      9   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1      9   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     10    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     10   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     10   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     10   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     10   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     10   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     11   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     11   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     11   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     11   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     11   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     12   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     12   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     12   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     12   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     12   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     13   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     13   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     13   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     13   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     13   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     14   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     14   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     14   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     14   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     14   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     15   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     15   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     15   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     15   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     15   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     16   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     16   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     16   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     16   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     16   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     17   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     17   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     17   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     17   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     17   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     18   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     18   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     18   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     18   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     18   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     19   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     19   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     19   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     19   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     19   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     20   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     20   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     20   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     20   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     20   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     21   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     21   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     21   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     21   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     21   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     22   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     22   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     22   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     22   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     22   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   69   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23    4   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     23   15    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23   17   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     23   28    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23   30   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     23   41    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23   43   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     23   54    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23   56   10  A  P N   B         T        Y              
         DS    XL8                                                              
         DS    CL1     23   67    1  A  U N   G    M    T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23   69   10  A  P N   B         T        Y              
SRVT1H   DS    XL8                                                              
SRVT1    DS    CL39    24    2   39  A  P H   W         T        Y              
SRVT2H   DS    XL8                                                              
SRVT2    DS    CL39    24   42   39  A  P H   W         T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 4616 BYTES                            
