*          DATA SET SRTFMFED   AT LEVEL 007 AS OF 01/10/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T137FED      DATE 01/10/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P H R Y         T        Y              
TFEHHH   DS    XL8                                                              
TFEHH    DS    CL40     7   17   40  A  P H R G         T        Y              
TFEDHH   DS    XL8                                                              
TFEDH    DS    CL20     7   61   20  A  P H R R         T        Y              
TFEL1OH  DS    XL8                                                              
TFEL1O   DS    CL11     8    2   11  A  P N   Y         T        Y              
TFEL1HH  DS    XL8                                                              
TFEL1H   DS    CL40     8   17   40  A  P N   G         T        Y              
TFEL1AH  DS    XL8                                                              
TFEL1A   DS    CL20     8   61   20  A  P N   R         T        Y              
TFEL2OH  DS    XL8                                                              
TFEL2O   DS    CL11     9    2   11  A  P N   Y         T        Y              
TFEL2HH  DS    XL8                                                              
TFEL2H   DS    CL40     9   17   40  A  P N   G         T        Y              
TFEL2AH  DS    XL8                                                              
TFEL2A   DS    CL20     9   61   20  A  P N   R         T        Y              
TFEL3OH  DS    XL8                                                              
TFEL3O   DS    CL11    10    2   11  A  P N   Y         T        Y              
TFEL3HH  DS    XL8                                                              
TFEL3H   DS    CL40    10   17   40  A  P N   G         T        Y              
TFEL3AH  DS    XL8                                                              
TFEL3A   DS    CL20    10   61   20  A  P N   R         T        Y              
TFEL4OH  DS    XL8                                                              
TFEL4O   DS    CL11    11    2   11  A  P N   Y         T        Y              
TFEL4HH  DS    XL8                                                              
TFEL4H   DS    CL40    11   17   40  A  P N   G         T        Y              
TFEL4AH  DS    XL8                                                              
TFEL4A   DS    CL20    11   61   20  A  P N   R         T        Y              
TFEL5OH  DS    XL8                                                              
TFEL5O   DS    CL11    12    2   11  A  P N   Y         T        Y              
TFEL5HH  DS    XL8                                                              
TFEL5H   DS    CL40    12   17   40  A  P N   G         T        Y              
TFEL5AH  DS    XL8                                                              
TFEL5A   DS    CL20    12   61   20  A  P N   R         T        Y              
TFEL6OH  DS    XL8                                                              
TFEL6O   DS    CL11    13    2   11  A  P N   Y         T        Y              
TFEL6HH  DS    XL8                                                              
TFEL6H   DS    CL40    13   17   40  A  P N   G         T        Y              
TFEL6AH  DS    XL8                                                              
TFEL6A   DS    CL20    13   61   20  A  P N   R         T        Y              
TFEL7OH  DS    XL8                                                              
TFEL7O   DS    CL11    14    2   11  A  P N   Y         T        Y              
TFEL7HH  DS    XL8                                                              
TFEL7H   DS    CL40    14   17   40  A  P N   G         T        Y              
TFEL7AH  DS    XL8                                                              
TFEL7A   DS    CL20    14   61   20  A  P N   R         T        Y              
TFEL8OH  DS    XL8                                                              
TFEL8O   DS    CL11    15    2   11  A  P N   Y         T        Y              
TFEL8HH  DS    XL8                                                              
TFEL8H   DS    CL40    15   17   40  A  P N   G         T        Y              
TFEL8AH  DS    XL8                                                              
TFEL8A   DS    CL20    15   61   20  A  P N   R         T        Y              
TFEL9OH  DS    XL8                                                              
TFEL9O   DS    CL11    16    2   11  A  P N   Y         T        Y              
TFEL9HH  DS    XL8                                                              
TFEL9H   DS    CL40    16   17   40  A  P N   G         T        Y              
TFEL9AH  DS    XL8                                                              
TFEL9A   DS    CL20    16   61   20  A  P N   R         T        Y              
TFEL10OH DS    XL8                                                              
TFEL10O  DS    CL11    17    2   11  A  P N   Y         T        Y              
TFEL10HH DS    XL8                                                              
TFEL10H  DS    CL40    17   17   40  A  P N   G         T        Y              
TFEL10AH DS    XL8                                                              
TFEL10A  DS    CL20    17   61   20  A  P N   R         T        Y              
TFEL11OH DS    XL8                                                              
TFEL11O  DS    CL11    18    2   11  A  P N   Y         T        Y              
TFEL11HH DS    XL8                                                              
TFEL11H  DS    CL40    18   17   40  A  P N   G         T        Y              
TFEL11AH DS    XL8                                                              
TFEL11A  DS    CL20    18   61   20  A  P N   R         T        Y              
TFEL12OH DS    XL8                                                              
TFEL12O  DS    CL11    19    2   11  A  P N   Y         T        Y              
TFEL12HH DS    XL8                                                              
TFEL12H  DS    CL40    19   17   40  A  P N   G         T        Y              
TFEL12AH DS    XL8                                                              
TFEL12A  DS    CL20    19   61   20  A  P N   R         T        Y              
TFEL13OH DS    XL8                                                              
TFEL13O  DS    CL11    20    2   11  A  P N   Y         T        Y              
TFEL13HH DS    XL8                                                              
TFEL13H  DS    CL40    20   17   40  A  P N   G         T        Y              
TFEL13AH DS    XL8                                                              
TFEL13A  DS    CL20    20   61   20  A  P N   R         T        Y              
TFEL14OH DS    XL8                                                              
TFEL14O  DS    CL11    21    2   11  A  P N   Y         T        Y              
TFEL14HH DS    XL8                                                              
TFEL14H  DS    CL40    21   17   40  A  P N   G         T        Y              
TFEL14AH DS    XL8                                                              
TFEL14A  DS    CL20    21   61   20  A  P N   R         T        Y              
TFEL15OH DS    XL8                                                              
TFEL15O  DS    CL11    22    2   11  A  P N   Y         T        Y              
TFEL15HH DS    XL8                                                              
TFEL15H  DS    CL40    22   17   40  A  P N   G         T        Y              
TFEL15AH DS    XL8                                                              
TFEL15A  DS    CL20    22   61   20  A  P N   R         T        Y              
TFEL16OH DS    XL8                                                              
TFEL16O  DS    CL11    23    2   11  A  P N   Y         T        Y              
TFEL16HH DS    XL8                                                              
TFEL16H  DS    CL40    23   17   40  A  P N   G         T        Y              
TFEL16AH DS    XL8                                                              
TFEL16A  DS    CL20    23   61   20  A  P N   R         T        Y              
TFEPFKH  DS    XL8                                                              
TFEPFK   DS    CL78    24    2   78  A  P H             T        Y              
TFELAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
TFEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1704 BYTES                            
