*          DATA SET SRTFMFDD   AT LEVEL 009 AS OF 01/10/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T137FDD      DATE 01/10/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL78     7    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  P H             T        Y              
TFDL1H   DS    XL8                                                              
TFDL1    DS    CL78     9    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
TFDPFKH  DS    XL8                                                              
TFDPFK   DS    CL78    24    2   78  A  P N             T        Y              
TFDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TFDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1552 BYTES                            
