*          DATA SET SRTFMFFD   AT LEVEL 005 AS OF 01/10/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T137FFD      DATE 01/10/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TFMHDRH  DS    XL8                                                              
TFMHDR   DS    CL60     1    2   60  A  P N R R         T        Y              
TFMSRH   DS    XL8                                                              
TFMSR    DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL9      3    2    9  A  P N   B         T        Y              
TFMFILEH DS    XL8                                                              
TFMFILE  DS    CL8      3   17    8  A  U N        M    T    I   Y              
         DS    XL8                                                              
         DS    CL9      4    2    9  A  P N   B         T        Y              
TFMRIDH  DS    XL8                                                              
TFMRID   DS    CL63     4   17   63  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL13     5    2   13  A  P N   B         T        Y              
TFMRACTH DS    XL8                                                              
TFMRACT  DS    CL24     5   17   24  A  U N        M    T        Y              
TFMMSGH  DS    XL8                                                              
TFMMSG   DS    CL20     5   61   20  A  P H R B         T        Y              
         DS    XL8                                                              
         DS    CL10     6    2   10  A  P N   B         T        Y              
TFMEIDH  DS    XL8                                                              
TFMEID   DS    CL24     6   17   24  A  U N        M    T        Y              
TFMLOADH DS    XL8                                                              
TFMLOAD  DS    CL1      7    2    1  A  P N             T        Y              
TFMLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
TFMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 360  BYTES                            
