*          DATA SET SRTSTFED   AT LEVEL 002 AS OF 11/27/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T136FED      DATE 11/27/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL60     1    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL8      3    2    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      3   12    8  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL8      3   22    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL10     3   32   10  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL16     3   44   16  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL16     3   62   16  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL14     5    2   14  L  P N             T        Y              
SRVUPDH  DS    CL8                                                              
SRVUPD   DS    CL5      5   17    5  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL14     6    2   14  L  P N             T        Y              
SRVIOSH  DS    CL8                                                              
SRVIOS   DS    CL5      6   17    5  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  L  P N             T        Y              
SRVIOIH  DS    CL8                                                              
SRVIOI   DS    CL5      7   17    5  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  L  P N             T        Y              
SRVSCRH  DS    CL8                                                              
SRVSCR   DS    CL5      8   17    5  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL14     9    2   14  L  P N             T        Y              
SRVLIMH  DS    CL8                                                              
SRVLIM   DS    CL5      9   17    5  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  L  P N             T        Y              
SRVLDAH  DS    CL8                                                              
SRVLDA   DS    CL8     10   17    8  A  U N        M    T        Y              
SRVHDR2H DS    CL8                                                              
SRVHDR2  DS    CL78    12    2   78  L  P H             T        Y              
SRVHDR3H DS    CL8                                                              
SRVHDR3  DS    CL78    13    2   78  L  P H             T        Y              
SRVPAT1H DS    CL8                                                              
SRVPAT1  DS    CL46    14    2   46  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL46    15    2   46  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL46    16    2   46  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL46    17    2   46  A  U N        M    T        Y              
SRVPAT5H DS    CL8                                                              
SRVPAT5  DS    CL46    18    2   46  A  U N        M    T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS= 1                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 872  BYTES                            
