*          DATA SET SRTSTFDD   AT LEVEL 001 AS OF 08/29/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T136FDD      DATE 08/29/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL60     1    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL8      3    2    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      3   12    8  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL8      3   22    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL10     3   32   10  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL16     3   44   16  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL16     3   62   16  A  U N        M    T        Y              
SRVLI1H  DS    CL8                                                              
SRVLI1   DS    CL78     5    2   78  L  P N             T        Y              
SRVLI2H  DS    CL8                                                              
SRVLI2   DS    CL78     6    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     7    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     8    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  L  P N             T        Y              
SRVLIXH  DS    CL8                                                              
SRVLIX   DS    CL78    23    2   78  L  P N             T        Y              
SRVPFKH  DS    CL8                                                              
SRVPFK   DS    CL78    24    2   78  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS= 1                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
