*          DATA SET SRTSKFFDS  AT LEVEL 002 AS OF 12/06/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T152FFD      DATE 12/06/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60   A    P    N         T         Y           
SRVSRVH  DS    CL8                                                              
SRVSRV   DS    CL17     1   63   17   A    U    N    M    T    I    Y           
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     3    2   16   A    U    N    M    T         Y           
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     3   22   16   A    U    N    M    T         Y           
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   42   16   A    U    N    M    T         Y           
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL16     4    2   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL56     4   22   56   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78     6    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78     7    2   78   A    P    N         T         Y           
SRVL1H   DS    CL8                                                              
SRVL1    DS    CL78     8    2   78   A    P    N         T         Y           
SRVL2H   DS    CL8                                                              
SRVL2    DS    CL78     9    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    10    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    11    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    12    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    13    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    14    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    15    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    16    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    17    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    18    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    19    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    20    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    21    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    22    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    23    2   78   A    P    N         T         Y           
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1828 BYTES                            
