*          DATA SET SRTSTFFD   AT LEVEL 001 AS OF 08/29/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T136FFD      DATE 08/29/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL8      3    2    8  L  P N             T        Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL8      3   12    8  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL8      3   22    8  L  P N             T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL10     3   32   10  A  U N        M    T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   44   16  A  U N        M    T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16  A  U N        M    T        Y              
SRVHDR0H DS    CL8                                                              
SRVHDR0  DS    CL78     5    2   78  L  P H             T        Y              
SRVHDRH  DS    CL8                                                              
SRVHDR   DS    CL78     6    2   78  L  P H             T        Y              
SRVHDR1H DS    CL8                                                              
SRVHDR1  DS    CL78     7    2   78  L  P H             T        Y              
SRVSELH  DS    CL8                                                              
SRVSEL   DS    CL3      8    2    3  A  U N        M    T        Y              
SRVLINEH DS    CL8                                                              
SRVLINE  DS    CL75     8    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75     9    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    10    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    11    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  L  P N             T        Y              
SRVXSELH DS    CL8                                                              
SRVXSEL  DS    CL3     23    2    3  A  U N        M    T        Y              
SRVXLINH DS    CL8                                                              
SRVXLIN  DS    CL75    23    6   75  L  P N             T        Y              
SRVFTRH  DS    CL8                                                              
SRVFTR   DS    CL78    24    2   78  L  P H             T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2064 BYTES                            
