*          DATA SET SRTSRFFD   AT LEVEL 002 AS OF 10/03/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T13FFFD      DATE 10/03/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TSRMSGH  DS    XL8                                                              
TSRMSG   DS    CL60     1    2   60  A  P N             T        Y              
TSRIDH   DS    XL8                                                              
TSRID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
         DS    XL8                                                              
         DS    CL16     2    2   16  A  P N             T        Y              
TSRFILH  DS    XL8                                                              
TSRFIL   DS    CL16     2   19   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     3    2   16  A  P N             T        Y              
TSRPGLH  DS    XL8                                                              
TSRPGL   DS    CL16     3   19   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     4    2   16  A  P N             T        Y              
TSRPGNH  DS    XL8                                                              
TSRPGN   DS    CL16     4   19   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     5    2   16  A  P N             T        Y              
TSRRECTH DS    XL8                                                              
TSRRECT  DS    CL16     5   19   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     6    2   16  A  P N             T        Y              
TSRKEYLH DS    XL8                                                              
TSRKEYL  DS    CL16     6   19   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     7    2   16  A  P N             T        Y              
TSRRECLH DS    XL8                                                              
TSRRECL  DS    CL16     7   19   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
TSRACTNH DS    XL8                                                              
TSRACTN  DS    CL16     9   19   16  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
TSRKEYH  DS    XL8                                                              
TSRKEY   DS    CL60    10   19   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    11    2   16  A  P N             T        Y              
TSRDATAH DS    XL8                                                              
TSRDATA  DS    CL60    11   19   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    12    2   16  A  P N             T        Y              
TSRDATLH DS    XL8                                                              
TSRDATL  DS    CL16    12   19   16  A  U N             T        Y              
TSROUT1H DS    XL8                                                              
TSROUT1  DS    CL78    14    2   78  A  P N             T        Y              
TSROUT2H DS    XL8                                                              
TSROUT2  DS    CL78    15    2   78  A  P N             T        Y              
TSROUT3H DS    XL8                                                              
TSROUT3  DS    CL78    16    2   78  A  P N             T        Y              
TSROUT4H DS    XL8                                                              
TSROUT4  DS    CL78    17    2   78  A  P N             T        Y              
TSROUT5H DS    XL8                                                              
TSROUT5  DS    CL78    18    2   78  A  P N             T        Y              
TSROUT6H DS    XL8                                                              
TSROUT6  DS    CL78    19    2   78  A  P N             T        Y              
TSRLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
TSRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1184 BYTES                            
