*          DATA SET SRTWXFFD   AT LEVEL 002 AS OF 09/15/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T147FFD      DATE 09/15/83                 
         SPACE 1                                                                
T147FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
TWXHEADH DS    CL8                                                              
TWXHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
TWXSERVH DS    CL8                                                              
TWXSERV  DS    CL17     1   63   17   A    U    N    M    T         Y           
TWXAUPRH DS    CL8                                                              
TWXAUPR  DS    CL13     2    2   13   A    P    N         T         Y           
TWXAUTHH DS    CL8                                                              
TWXAUTH  DS    CL10     2   16   10   A    U    N    M    T    I    Y           
TWXSEPRH DS    CL8                                                              
TWXSEPR  DS    CL7      2   27    7   A    P    N         T         Y           
TWXSENDH DS    CL8                                                              
TWXSEND  DS    CL45     2   35   45   A    U    N    M    T         Y           
TWXDATAH DS    CL8                                                              
TWXDATA  DS    CL78     4    2   78   A    U    N    M    T         Y           
TWXDAT2H DS    CL8                                                              
TWXDAT2  DS    CL78     5    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78     6    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78     7    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78     8    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78     9    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    10    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    11    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    12    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    13    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    14    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    15    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    16    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    17    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    18    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    19    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    20    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    21    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    22    2   78   A    U    N    M    T         Y           
         DS    CL8                                                              
         DS    CL78    23    2   78   A    U    N    M    T         Y           
TWXDATLH DS    CL8                                                              
TWXDATL  DS    CL75    24    2   75   A    U    N    M    T         Y           
TWXTABH  DS    CL8                                                              
TWXTAB   DS    CL1     24   79    1   A    U    N    M    T         Y           
TWXLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
TWXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2015 BYTES                            
