*          DATA SET SRTXTFED   AT LEVEL 005 AS OF 10/08/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T144FED      DATE 10/08/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BCRMSGH  DS    CL8                                                              
BCRMSG   DS    CL60     1    2   60  L   P    N         T        Y              
BCRSRVH  DS    CL8                                                              
BCRSRV   DS    CL17     1   63   17  A   U    N    M    T    I   Y              
         DS    CL8                                                              
         DS    CL7      2    2    7  A   P    N         T        Y              
BCRP1H   DS    CL8                                                              
BCRP1    DS    CL16     3    2   16  A   U    N    M    T        Y              
BCRP2H   DS    CL8                                                              
BCRP2    DS    CL16     3   22   16  A   U    N    M    T        Y              
BCRP3H   DS    CL8                                                              
BCRP3    DS    CL16     3   42   16  A   U    N    M    T        Y              
BCRP4H   DS    CL8                                                              
BCRP4    DS    CL16     3   62   16  A   U    N    M    T        Y              
BCRA1H   DS    CL8                                                              
BCRA1    DS    CL16     4    2   16  L   P    N         T        Y              
BCRA2H   DS    CL8                                                              
BCRA2    DS    CL16     4   22   16  L   P    N         T        Y              
BCRA3H   DS    CL8                                                              
BCRA3    DS    CL16     4   42   16  L   P    N         T        Y              
BCRA4H   DS    CL8                                                              
BCRA4    DS    CL16     4   62   16  L   P    N         T        Y              
BCRINF1H DS    CL8                                                              
BCRINF1  DS    CL78     5    2   78  L   P    N         T        Y              
BCRINF2H DS    CL8                                                              
BCRINF2  DS    CL78     6    2   78  L   P    N         T        Y              
BCRINF3H DS    CL8                                                              
BCRINF3  DS    CL78     7    2   78  L   P    N         T        Y              
BCRINF4H DS    CL8                                                              
BCRINF4  DS    CL78     8    2   78  L   P    N         T        Y              
BCRTOPH  DS    CL8                                                              
BCRTOP   DS    CL75     9    2   75  L   P    H         T        Y              
BCRL1H   DS    CL8                                                              
BCRL1    DS    CL75    10    2   75  L   P    H         T        Y              
BCRL2H   DS    CL8                                                              
BCRL2    DS    CL75    11    2   75  L   P    H         T        Y              
BCRL3H   DS    CL8                                                              
BCRL3    DS    CL75    12    2   75  L   P    H         T        Y              
BCRL4H   DS    CL8                                                              
BCRL4    DS    CL75    13    2   75  L   P    H         T        Y              
BCRL5H   DS    CL8                                                              
BCRL5    DS    CL75    14    2   75  L   P    H         T        Y              
BCRL6H   DS    CL8                                                              
BCRL6    DS    CL75    15    2   75  L   P    H         T        Y              
BCRL7H   DS    CL8                                                              
BCRL7    DS    CL75    16    2   75  L   P    H         T        Y              
BCRL8H   DS    CL8                                                              
BCRL8    DS    CL75    17    2   75  L   P    H         T        Y              
BCRL9H   DS    CL8                                                              
BCRL9    DS    CL75    18    2   75  L   P    H         T        Y              
BCRL10H  DS    CL8                                                              
BCRL10   DS    CL75    19    2   75  L   P    H         T        Y              
BCRL11H  DS    CL8                                                              
BCRL11   DS    CL75    20    2   75  L   P    H         T        Y              
BCRL12H  DS    CL8                                                              
BCRL12   DS    CL75    21    2   75  L   P    H         T        Y              
BCRL13H  DS    CL8                                                              
BCRL13   DS    CL75    22    2   75  L   P    H         T        Y              
BCRL14H  DS    CL8                                                              
BCRL14   DS    CL75    23    2   75  L   P    H         T        Y              
BCRBOTH  DS    CL8                                                              
BCRBOT   DS    CL75    24    2   75  L   P    H         T        Y              
BCRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1976 BYTES                            
