*          DATA SET SRTXTFFD   AT LEVEL 008 AS OF 10/08/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T144FFD      DATE 10/08/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BCLMSGH  DS    CL8                                                              
BCLMSG   DS    CL60     1    2   60  L   P    N         T        Y              
BCLSRVH  DS    CL8                                                              
BCLSRV   DS    CL17     1   63   17  A   U    N    M    T    I   Y              
         DS    CL8                                                              
         DS    CL7      2    2    7  A   P    N         T        Y              
BCLP1H   DS    CL8                                                              
BCLP1    DS    CL16     3    2   16  A   U    N    M    T        Y              
BCLP2H   DS    CL8                                                              
BCLP2    DS    CL16     3   22   16  A   U    N    M    T        Y              
BCLP3H   DS    CL8                                                              
BCLP3    DS    CL16     3   42   16  A   U    N    M    T        Y              
BCLP4H   DS    CL8                                                              
BCLP4    DS    CL16     3   62   16  A   U    N    M    T        Y              
BCLA1H   DS    CL8                                                              
BCLA1    DS    CL16     4    2   16  L   P    N         T        Y              
BCLA2H   DS    CL8                                                              
BCLA2    DS    CL16     4   22   16  L   P    N         T        Y              
BCLA3H   DS    CL8                                                              
BCLA3    DS    CL16     4   42   16  L   P    N         T        Y              
BCLA4H   DS    CL8                                                              
BCLA4    DS    CL16     4   62   16  L   P    N         T        Y              
BCLH1H   DS    CL8                                                              
BCLH1    DS    CL79     6    2   79  L   P    N         T        Y              
BCLH2H   DS    CL8                                                              
BCLH2    DS    CL79     7    2   79  L   P    N         T        Y              
BCLS1H   DS    CL8                                                              
BCLS1    DS    CL3      8    2    3  A   U    N    M    T        Y              
BCLD1H   DS    CL8                                                              
BCLD1    DS    CL75     8    6   75  L   P    N         T        Y              
BCLS2H   DS    CL8                                                              
BCLS2    DS    CL3      9    2    3  A   U    N    M    T        Y              
BCLD2H   DS    CL8                                                              
BCLD2    DS    CL75     9    6   75  L   P    N         T        Y              
BCLS3H   DS    CL8                                                              
BCLS3    DS    CL3     10    2    3  A   U    N    M    T        Y              
BCLD3H   DS    CL8                                                              
BCLD3    DS    CL75    10    6   75  L   P    N         T        Y              
BCLS4H   DS    CL8                                                              
BCLS4    DS    CL3     11    2    3  A   U    N    M    T        Y              
BCLD4H   DS    CL8                                                              
BCLD4    DS    CL75    11    6   75  L   P    N         T        Y              
BCLS5H   DS    CL8                                                              
BCLS5    DS    CL3     12    2    3  A   U    N    M    T        Y              
BCLD5H   DS    CL8                                                              
BCLD5    DS    CL75    12    6   75  L   P    N         T        Y              
BCLS6H   DS    CL8                                                              
BCLS6    DS    CL3     13    2    3  A   U    N    M    T        Y              
BCLD6H   DS    CL8                                                              
BCLD6    DS    CL75    13    6   75  L   P    N         T        Y              
BCLS7H   DS    CL8                                                              
BCLS7    DS    CL3     14    2    3  A   U    N    M    T        Y              
BCLD7H   DS    CL8                                                              
BCLD7    DS    CL75    14    6   75  L   P    N         T        Y              
BCLS8H   DS    CL8                                                              
BCLS8    DS    CL3     15    2    3  A   U    N    M    T        Y              
BCLD8H   DS    CL8                                                              
BCLD8    DS    CL75    15    6   75  L   P    N         T        Y              
BCLS9H   DS    CL8                                                              
BCLS9    DS    CL3     16    2    3  A   U    N    M    T        Y              
BCLD9H   DS    CL8                                                              
BCLD9    DS    CL75    16    6   75  L   P    N         T        Y              
BCLS10H  DS    CL8                                                              
BCLS10   DS    CL3     17    2    3  A   U    N    M    T        Y              
BCLD10H  DS    CL8                                                              
BCLD10   DS    CL75    17    6   75  L   P    N         T        Y              
BCLS11H  DS    CL8                                                              
BCLS11   DS    CL3     18    2    3  A   U    N    M    T        Y              
BCLD11H  DS    CL8                                                              
BCLD11   DS    CL75    18    6   75  L   P    N         T        Y              
BCLS12H  DS    CL8                                                              
BCLS12   DS    CL3     19    2    3  A   U    N    M    T        Y              
BCLD12H  DS    CL8                                                              
BCLD12   DS    CL75    19    6   75  L   P    N         T        Y              
BCLS13H  DS    CL8                                                              
BCLS13   DS    CL3     20    2    3  A   U    N    M    T        Y              
BCLD13H  DS    CL8                                                              
BCLD13   DS    CL75    20    6   75  L   P    N         T        Y              
BCLS14H  DS    CL8                                                              
BCLS14   DS    CL3     21    2    3  A   U    N    M    T        Y              
BCLD14H  DS    CL8                                                              
BCLD14   DS    CL75    21    6   75  L   P    N         T        Y              
BCLS15H  DS    CL8                                                              
BCLS15   DS    CL3     22    2    3  A   U    N    M    T        Y              
BCLD15H  DS    CL8                                                              
BCLD15   DS    CL75    22    6   75  L   P    N         T        Y              
BCLS16H  DS    CL8                                                              
BCLS16   DS    CL3     23    2    3  A   U    N    M    T        Y              
BCLD16H  DS    CL8                                                              
BCLD16   DS    CL75    23    6   75  L   P    N         T        Y              
BCLTABH  DS    CL8                                                              
BCLTAB   DS    CL78    24    2   78  A   P    H         T        Y              
BCLLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2072 BYTES                            
