*          DATA SET SRUTLFFD   AT LEVEL 005 AS OF 06/28/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T123FFD      DATE 06/28/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  L  P N             T        Y              
SRVIDH   DS    XL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVP1H   DS    XL8                                                              
SRVP1    DS    CL16     3    2   16  A  U N        M    T        Y              
SRVP2H   DS    XL8                                                              
SRVP2    DS    CL16     3   22   16  A  U N        M    T        Y              
SRVP3H   DS    XL8                                                              
SRVP3    DS    CL16     3   42   16  A  U N        M    T        Y              
SRVP4H   DS    XL8                                                              
SRVP4    DS    CL16     3   62   16  A  U N        M    T        Y              
         DS    XL8                                                              
         DS    CL16     4    2   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     4   22   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     4   42   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     4   62   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL39     6    1   39  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL39     6   41   39  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL39     7    1   39  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL39     7   41   39  A  P N             T        Y              
SRVLN1H  DS    XL8                                                              
SRVLN1   DS    CL78     8    2   78  A  P N             T        Y              
SRVLN2H  DS    XL8                                                              
SRVLN2   DS    CL78     9    2   78  A  P N             T        Y              
SRVLN3H  DS    XL8                                                              
SRVLN3   DS    CL78    10    2   78  A  P N             T        Y              
SRVLN4H  DS    XL8                                                              
SRVLN4   DS    CL78    11    2   78  A  P N             T        Y              
SRVLN5H  DS    XL8                                                              
SRVLN5   DS    CL78    12    2   78  A  P N             T        Y              
SRVLN6H  DS    XL8                                                              
SRVLN6   DS    CL78    13    2   78  A  P N             T        Y              
SRVLN7H  DS    XL8                                                              
SRVLN7   DS    CL78    14    2   78  A  P N             T        Y              
SRVLN8H  DS    XL8                                                              
SRVLN8   DS    CL78    15    2   78  A  P N             T        Y              
SRVLN9H  DS    XL8                                                              
SRVLN9   DS    CL78    16    2   78  A  P N             T        Y              
SRVLN10H DS    XL8                                                              
SRVLN10  DS    CL78    17    2   78  A  P N             T        Y              
SRVLN11H DS    XL8                                                              
SRVLN11  DS    CL78    18    2   78  A  P N             T        Y              
SRVLN12H DS    XL8                                                              
SRVLN12  DS    CL78    19    2   78  A  P N             T        Y              
SRVLN13H DS    XL8                                                              
SRVLN13  DS    CL78    20    2   78  A  P N             T        Y              
SRVLN14H DS    XL8                                                              
SRVLN14  DS    CL78    21    2   78  A  P N             T        Y              
SRVLN15H DS    XL8                                                              
SRVLN15  DS    CL78    22    2   78  A  P N             T        Y              
SRVLN16H DS    XL8                                                              
SRVLN16  DS    CL78    23    2   78  A  P N             T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1856 BYTES                            
