*          DATA SET SRVTTFFD   AT LEVEL 006 AS OF 05/25/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T15BFFD      DATE 05/25/89                 
         SPACE 1                                                                
T15BFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A   P    N         T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A   U    N    M    T    I   Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL16     3    2   16  A   U    N    M    T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL16     3   22   16  A   U    N    M    T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL16     3   42   16  A   U    N    M    T        Y              
SRVP4H   DS    CL8                                                              
SRVP4    DS    CL16     3   62   16  A   U    N    M    T        Y              
SRVHLH   DS    CL8                                                              
SRVHL    DS    CL78     5    2   78  L   P    N         T        Y              
SRVULH   DS    CL8                                                              
SRVUL    DS    CL78     6    2   78  L   P    N         T        Y              
SRVS1H   DS    CL8                                                              
SRVS1    DS    CL1      7    2    1  A   U    N    M    T        Y              
SRVL1H   DS    CL8                                                              
SRVL1    DS    CL76     7    4   76  A   P    N         T        Y              
SRVS2H   DS    CL8                                                              
SRVS2    DS    CL1      8    2    1  A   U    N    M    T        Y              
SRVL2H   DS    CL8                                                              
SRVL2    DS    CL76     8    4   76  A   P    N         T        Y              
SRVS3H   DS    CL8                                                              
SRVS3    DS    CL1      9    2    1  A   U    N    M    T        Y              
SRVL3H   DS    CL8                                                              
SRVL3    DS    CL76     9    4   76  A   P    N         T        Y              
SRVS4H   DS    CL8                                                              
SRVS4    DS    CL1     10    2    1  A   U    N    M    T        Y              
SRVL4H   DS    CL8                                                              
SRVL4    DS    CL76    10    4   76  A   P    N         T        Y              
SRVS5H   DS    CL8                                                              
SRVS5    DS    CL1     11    2    1  A   U    N    M    T        Y              
SRVL5H   DS    CL8                                                              
SRVL5    DS    CL76    11    4   76  A   P    N         T        Y              
SRVS6H   DS    CL8                                                              
SRVS6    DS    CL1     12    2    1  A   U    N    M    T        Y              
SRVL6H   DS    CL8                                                              
SRVL6    DS    CL76    12    4   76  A   P    N         T        Y              
SRVS7H   DS    CL8                                                              
SRVS7    DS    CL1     13    2    1  A   U    N    M    T        Y              
SRVL7H   DS    CL8                                                              
SRVL7    DS    CL76    13    4   76  A   P    N         T        Y              
SRVS8H   DS    CL8                                                              
SRVS8    DS    CL1     14    2    1  A   U    N    M    T        Y              
SRVL8H   DS    CL8                                                              
SRVL8    DS    CL76    14    4   76  A   P    N         T        Y              
SRVS9H   DS    CL8                                                              
SRVS9    DS    CL1     15    2    1  A   U    N    M    T        Y              
SRVL9H   DS    CL8                                                              
SRVL9    DS    CL76    15    4   76  A   P    N         T        Y              
SRVS10H  DS    CL8                                                              
SRVS10   DS    CL1     16    2    1  A   U    N    M    T        Y              
SRVL10H  DS    CL8                                                              
SRVL10   DS    CL76    16    4   76  A   P    N         T        Y              
SRVS11H  DS    CL8                                                              
SRVS11   DS    CL1     17    2    1  A   U    N    M    T        Y              
SRVL11H  DS    CL8                                                              
SRVL11   DS    CL76    17    4   76  A   P    N         T        Y              
SRVS12H  DS    CL8                                                              
SRVS12   DS    CL1     18    2    1  A   U    N    M    T        Y              
SRVL12H  DS    CL8                                                              
SRVL12   DS    CL76    18    4   76  A   P    N         T        Y              
SRVS13H  DS    CL8                                                              
SRVS13   DS    CL1     19    2    1  A   U    N    M    T        Y              
SRVL13H  DS    CL8                                                              
SRVL13   DS    CL76    19    4   76  A   P    N         T        Y              
SRVS14H  DS    CL8                                                              
SRVS14   DS    CL1     20    2    1  A   U    N    M    T        Y              
SRVL14H  DS    CL8                                                              
SRVL14   DS    CL76    20    4   76  A   P    N         T        Y              
SRVS15H  DS    CL8                                                              
SRVS15   DS    CL1     21    2    1  A   U    N    M    T        Y              
SRVL15H  DS    CL8                                                              
SRVL15   DS    CL76    21    4   76  A   P    N         T        Y              
SRVS16H  DS    CL8                                                              
SRVS16   DS    CL1     22    2    1  A   U    N    M    T        Y              
SRVL16H  DS    CL8                                                              
SRVL16   DS    CL76    22    4   76  A   P    N         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1920 BYTES                            
