*          DATA SET SRWKZFED   AT LEVEL 001 AS OF 11/08/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T13BFED      DATE 11/08/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVLIN1H DS    XL8                                                              
SRVLIN1  DS    CL79     6    2   79  L  P H R W         T        Y              
         DS    XL8                                                              
         DS    CL79     7    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79     8    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79     9    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  L  P N R W         T        Y              
         DS    XL8                                                              
         DS    CL79    23    2   79  L  P N R W         T        Y              
SRVPFK1H DS    XL8                                                              
SRVPFK1  DS    CL79    24    2   79  L  P H R           T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS= 1                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1656 BYTES                            
