*          DATA SET SRWKTFFD   AT LEVEL 003 AS OF 09/11/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T13AFFD      DATE 09/11/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  L  P N             T        Y              
SRVSRVH  DS    CL8                                                              
SRVSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL9      3    2    9  L  P N             T        Y              
SRVFILH  DS    CL8                                                              
SRVFIL   DS    CL16     3   15   16  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL9      3   33    9  L  P N             T        Y              
SRVTYPEH DS    CL8                                                              
SRVTYPE  DS    CL16     3   43   16  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL78     4    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5    2    6  L  P N             T        Y              
SRVSTATH DS    CL8                                                              
SRVSTAT  DS    CL5      5   15    5  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL10     5   42   10  L  P N             T        Y              
SRVLRETH DS    CL8                                                              
SRVLRET  DS    CL5      5   55    5  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL10     6    2   10  L  P N             T        Y              
SRVATTBH DS    CL8                                                              
SRVATTB  DS    CL8      6   15    8  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL10     6   42   10  L  P N             T        Y              
SRVDRETH DS    CL8                                                              
SRVDRET  DS    CL5      6   55    5  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  L  P N             T        Y              
SRVDESCH DS    CL8                                                              
SRVDESC  DS    CL16     7   15   16  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL9      7   42    9  L  P N             T        Y              
SRVFLENH DS    CL8                                                              
SRVFLEN  DS    CL8      7   55    8  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  L  P N             T        Y              
SRVPSWDH DS    CL8                                                              
SRVPSWD  DS    CL6      8   15    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL10     8   42   10  L  P N             T        Y              
SRVAPPNH DS    CL8                                                              
SRVAPPN  DS    CL5      8   55    5  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL9      9    2    9  L  P N             T        Y              
SRVUDATH DS    CL8                                                              
SRVUDAT  DS    CL6      9   15    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    11    2   12  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
SRVREP1H DS    CL8                                                              
SRVREP1  DS    CL4     13    3    4  A  U N        M    T        Y              
SRVLEN1H DS    CL8                                                              
SRVLEN1  DS    CL6     13    9    6  A  U N        M    T        Y              
SRVDAT1H DS    CL8                                                              
SRVDAT1  DS    CL60    13   17   60  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL4     14    3    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     14    9    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL60    14   17   60  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL4     15    3    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     15    9    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL60    15   17   60  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL4     16    3    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     16    9    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL60    16   17   60  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL4     17    3    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     17    9    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL60    17   17   60  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL4     18    3    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     18    9    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL60    18   17   60  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL4     19    3    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     19    9    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL60    19   17   60  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL4     20    3    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     20    9    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL60    20   17   60  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL4     21    3    4  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     21    9    6  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL60    21   17   60  L  U N        M    T        Y              
SRVREPXH DS    CL8                                                              
SRVREPX  DS    CL4     22    3    4  A  U N        M    T        Y              
SRVLENXH DS    CL8                                                              
SRVLENX  DS    CL6     22    9    6  A  U N        M    T        Y              
SRVDATXH DS    CL8                                                              
SRVDATX  DS    CL60    22   17   60  L  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6     24    3    6  L  P N             T        Y              
SRVREPTH DS    CL8                                                              
SRVREPT  DS    CL6     24   11    6  A  U N        M    T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
