*          DATA SET SRWRKFFD   AT LEVEL 003 AS OF 08/21/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T151FFD      DATE 08/21/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    CL8                                                              
SRVMSG   DS    CL60     1    2   60  A   P    N         T        Y              
SRVIDH   DS    CL8                                                              
SRVID    DS    CL17     1   63   17  A   U    N    M    T        Y              
SRVP1AH  DS    CL8                                                              
SRVP1A   DS    CL6      3    2    6  A   P    N         T        Y              
SRVP1H   DS    CL8                                                              
SRVP1    DS    CL25     3   11   25  A   U    N    M    T    I   Y              
SRVP2AH  DS    CL8                                                              
SRVP2A   DS    CL7      3   39    7  A   P    N         T        Y              
SRVP2H   DS    CL8                                                              
SRVP2    DS    CL32     3   48   32  A   U    N    M    T        Y              
SRVP3AH  DS    CL8                                                              
SRVP3A   DS    CL7      4    2    7  A   P    N         T        Y              
SRVP3H   DS    CL8                                                              
SRVP3    DS    CL69     4   11   69  A   U    N    M    T        Y              
SRVFCAH  DS    CL8                                                              
SRVFCA   DS    CL6      6    2    6  A   P    N         T        Y              
SRVFCH   DS    CL8                                                              
SRVFC    DS    CL69     6   11   69  A   U    N    M    T        Y              
SRVFH1H  DS    CL8                                                              
SRVFH1   DS    CL78     8    2   78  A   P    N         T        Y              
SRVFH2H  DS    CL8                                                              
SRVFH2   DS    CL78     9    2   78  A   P    N         T        Y              
SRVFD1H  DS    CL8                                                              
SRVFD1   DS    CL7     10    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    10   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    10   53   20  A   P    N         T        Y              
SRVFD2H  DS    CL8                                                              
SRVFD2   DS    CL7     11    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    11   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    11   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    12   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    12   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    13   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    13   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    14   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    14   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    15   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    15   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    16   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    16   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    17   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    17   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    18   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    18   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    19   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    19   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    20   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    20   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    21   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    21   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    22   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    22   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    23   11   40  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL20    23   53   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   11    1  A   U    N         T        Y              
SRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
