*          DATA SET SRXNTFFD   AT LEVEL 001 AS OF 07/10/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T122FFD      DATE 07/10/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SRVMSGH  DS    XL8                                                              
SRVMSG   DS    CL60     1    2   60  A  P N             T        Y              
SRVIDH   DS    XL8                                                              
SRVID    DS    CL17     1   63   17  A  U N        M    T    I   Y              
SRVP1H   DS    XL8                                                              
SRVP1    DS    CL16     3    2   16  A  U N        M    T        Y              
SRVP2H   DS    XL8                                                              
SRVP2    DS    CL16     3   22   16  A  U N        M    T        Y              
SRVP3H   DS    XL8                                                              
SRVP3    DS    CL16     3   42   16  A  U N        M    T        Y              
SRVP4H   DS    XL8                                                              
SRVP4    DS    CL16     3   62   16  A  U N        M    T        Y              
SRVP1AH  DS    XL8                                                              
SRVP1A   DS    CL16     4    2   16  A  P N             T        Y              
SRVP2AH  DS    XL8                                                              
SRVP2A   DS    CL16     4   22   16  A  P N             T        Y              
SRVP3AH  DS    XL8                                                              
SRVP3A   DS    CL16     4   42   16  A  P N             T        Y              
SRVP4AH  DS    XL8                                                              
SRVP4A   DS    CL16     4   62   16  A  P N             T        Y              
SRVHL1H  DS    XL8                                                              
SRVHL1   DS    CL79     6    2   79  A  P N             T        Y              
SRVHL2H  DS    XL8                                                              
SRVHL2   DS    CL79     7    2   79  A  P N             T        Y              
SRVDL1H  DS    XL8                                                              
SRVDL1   DS    CL79     8    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    23    2   79  A  P N             T        Y              
SRVDLLH  DS    XL8                                                              
SRVDLL   DS    CL79    24    2   79  A  P N             T        Y              
SRVLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
SRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1944 BYTES                            
