*          DATA SET SVCPARMS   AT LEVEL 001 AS OF 04/08/08                      
PARMS    DSECT                                                                  
TOKEN    DS    XL8         LATCH SET TOKEN                                      
LTCHTKN  DS    XL8         TOKEN OF LATCH ITSELF                                
RTNCDE   DS    F           RETURN CODE VALUE                                    
*                                                                               
PARMLIST DSECT                                                                  
ACTION   DS    CL4                                                              
DDSID    DS    CL4                                                              
DSPNAME  DS    CL8        JOB/ADDRESS SPACE IDENTIFIER FOR D A COMMAND          
DSPBLCKS DS    F          NO OF BLOCKS DESIRED                                  
DSORIGIN DS    A          RETURNED, ORIGIN                                      
DSALET   DS    A          RETURNED, ALET FOR ACCESS TO DATASPACE                
DSTOKEN  DS    CL8        RETURNED, 8-BYTE TOKEN                                
