*          DATA SET SXBUYBLK   AT LEVEL 008 AS OF 08/23/93                      
SXBLKD   DSECT                     SQL CONVERSION BLOCK                         
*                                                                               
SXTREC   DS    A                   A(EXTRACT RECORD)                            
SXBREC   DS    A                   A(BUY RECORD)                                
SXACOM   DS    A                   A(COMFACS)                                   
SXAGENCY DS    CL2                 ALPHA AGENCY                                 
         DS    CL10                SPARE                                        
*                                                                               
SXLNQ    EQU   *-SXBLKD                                                         
