*          DATA SET T406FFD    AT LEVEL 001 AS OF 02/22/78                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T406FFD      DATE 02/22/78                 
         SPACE 3                                                                
T406FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
PBLMSGH  DS    CL8                                                              
PBLMSG   DS    CL60     1    2   60   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11     2    2   11   A    P    N         T         Y           
PBLMEDH  DS    CL8                                                              
PBLMED   DS    CL1      2   16    1   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL11     3    2   11   A    P    N         T         Y           
PBLPUBH  DS    CL8                                                              
PBLPUB   DS    CL20     3   16   20   A    U    N         T         Y           
PBLPUBNH DS    CL8                                                              
PBLPUBN  DS    CL20     3   40   20   A    P    N         T         Y           
PBLPUBCH DS    CL8                                                              
PBLPUBC  DS    CL16     3   62   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL11     4    2   11   A    P    N         T         Y           
PBLACTH  DS    CL8                                                              
PBLACT   DS    CL7      4   16    7   A    U    N         T         Y           
PBLZONH  DS    CL8                                                              
PBLZON   DS    CL20     4   40   20   A    P    N         T         Y           
PBLSRDSH DS    CL8                                                              
PBLSRDS  DS    CL8      4   62    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL11     5    2   11   A    P    N         T         Y           
PBLSCRH  DS    CL8                                                              
PBLSCR   DS    CL40     5   16   40   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      5   63    1   A    U    N         T         Y           
PBLFLD1H DS    CL8                                                              
PBLFLD1  DS    CL22     6   33   22   A    P    N         T         Y           
PBLFLD2H DS    CL8                                                              
PBLFLD2  DS    CL22     6   57   22   A    P    N         T         Y           
PBLLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
PBLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 437  BYTES                            
