*          DATA SET T406F7D    AT LEVEL 001 AS OF 03/25/76                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T406F7D      DATE 03/25/76                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     8    3   14   A    P    N         T         Y           
RATEFFDH DS    CL8                                                              
RATEFFD  DS    CL8      8   23    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9      9    3    9   A    P    N         T         Y           
RATBRATH DS    CL8                                                              
RATBRAT  DS    CL10     9   23   10   A    U    N         T         Y           
RATAGATH DS    CL8                                                              
RATAGAT  DS    CL1      9   36    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL34     9   41   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL19    10    3   19   A    P    N         T         Y           
RATDLTYH DS    CL8                                                              
RATDLTY  DS    CL1     10   23    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL34    10   41   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    11    3   18   A    P    N         T         Y           
RATDRTYH DS    CL8                                                              
RATDRTY  DS    CL2     11   23    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL31    11   41   31   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL41    13    8   41   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16    13   57   16   A    P    N         T         Y           
RATL11H  DS    CL8                                                              
RATL11   DS    CL9     14    4    9   A    U    N         T         Y           
RATR11H  DS    CL8                                                              
RATR11   DS    CL9     14   15    9   A    U    N         T         Y           
RATL12H  DS    CL8                                                              
RATL12   DS    CL9     14   29    9   A    U    N         T         Y           
RATR12H  DS    CL8                                                              
RATR12   DS    CL9     14   40    9   A    U    N         T         Y           
RATL13H  DS    CL8                                                              
RATL13   DS    CL9     14   53    9   A    U    N         T         Y           
RATR13H  DS    CL8                                                              
RATR13   DS    CL9     14   64    9   A    U    N         T         Y           
RATL21H  DS    CL8                                                              
RATL21   DS    CL9     15    4    9   A    U    N         T         Y           
RATR21H  DS    CL8                                                              
RATR21   DS    CL9     15   15    9   A    U    N         T         Y           
RATL22H  DS    CL8                                                              
RATL22   DS    CL9     15   29    9   A    U    N         T         Y           
RATR22H  DS    CL8                                                              
RATR22   DS    CL9     15   40    9   A    U    N         T         Y           
RATL23H  DS    CL8                                                              
RATL23   DS    CL9     15   53    9   A    U    N         T         Y           
RATR23H  DS    CL8                                                              
RATR23   DS    CL9     15   64    9   A    U    N         T         Y           
RATL31H  DS    CL8                                                              
RATL31   DS    CL9     16    4    9   A    U    N         T         Y           
RATR31H  DS    CL8                                                              
RATR31   DS    CL9     16   15    9   A    U    N         T         Y           
RATL32H  DS    CL8                                                              
RATL32   DS    CL9     16   29    9   A    U    N         T         Y           
RATR32H  DS    CL8                                                              
RATR32   DS    CL9     16   40    9   A    U    N         T         Y           
RATL33H  DS    CL8                                                              
RATL33   DS    CL9     16   53    9   A    U    N         T         Y           
RATR33H  DS    CL8                                                              
RATR33   DS    CL9     16   64    9   A    U    N         T         Y           
RATL41H  DS    CL8                                                              
RATL41   DS    CL9     17    4    9   A    U    N         T         Y           
RATR41H  DS    CL8                                                              
RATR41   DS    CL9     17   15    9   A    U    N         T         Y           
RATL42H  DS    CL8                                                              
RATL42   DS    CL9     17   29    9   A    U    N         T         Y           
RATR42H  DS    CL8                                                              
RATR42   DS    CL9     17   40    9   A    U    N         T         Y           
RATL43H  DS    CL8                                                              
RATL43   DS    CL9     17   53    9   A    U    N         T         Y           
RATR43H  DS    CL8                                                              
RATR43   DS    CL9     17   64    9   A    U    N         T         Y           
RATL51H  DS    CL8                                                              
RATL51   DS    CL9     18    4    9   A    U    N         T         Y           
RATR51H  DS    CL8                                                              
RATR51   DS    CL9     18   15    9   A    U    N         T         Y           
RATL52H  DS    CL8                                                              
RATL52   DS    CL9     18   29    9   A    U    N         T         Y           
RATR52H  DS    CL8                                                              
RATR52   DS    CL9     18   40    9   A    U    N         T         Y           
RATL53H  DS    CL8                                                              
RATL53   DS    CL9     18   53    9   A    U    N         T         Y           
RATR53H  DS    CL8                                                              
RATR53   DS    CL9     18   64    9   A    U    N         T         Y           
RATL61H  DS    CL8                                                              
RATL61   DS    CL9     19    4    9   A    U    N         T         Y           
RATR61H  DS    CL8                                                              
RATR61   DS    CL9     19   15    9   A    U    N         T         Y           
RATL62H  DS    CL8                                                              
RATL62   DS    CL9     19   29    9   A    U    N         T         Y           
RATR62H  DS    CL8                                                              
RATR62   DS    CL9     19   40    9   A    U    N         T         Y           
RATL63H  DS    CL8                                                              
RATL63   DS    CL9     19   53    9   A    U    N         T         Y           
RATR63H  DS    CL8                                                              
RATR63   DS    CL9     19   64    9   A    U    N         T         Y           
RATL71H  DS    CL8                                                              
RATL71   DS    CL9     20    4    9   A    U    N         T         Y           
RATR71H  DS    CL8                                                              
RATR71   DS    CL9     20   15    9   A    U    N         T         Y           
RATL72H  DS    CL8                                                              
RATL72   DS    CL9     20   29    9   A    U    N         T         Y           
RATR72H  DS    CL8                                                              
RATR72   DS    CL9     20   40    9   A    U    N         T         Y           
RATL73H  DS    CL8                                                              
RATL73   DS    CL9     20   53    9   A    U    N         T         Y           
RATR73H  DS    CL8                                                              
RATR73   DS    CL9     20   64    9   A    U    N         T         Y           
RATL81H  DS    CL8                                                              
RATL81   DS    CL9     21    4    9   A    U    N         T         Y           
RATR81H  DS    CL8                                                              
RATR81   DS    CL9     21   15    9   A    U    N         T         Y           
RATL82H  DS    CL8                                                              
RATL82   DS    CL9     21   29    9   A    U    N         T         Y           
RATR82H  DS    CL8                                                              
RATR82   DS    CL9     21   40    9   A    U    N         T         Y           
RATL83H  DS    CL8                                                              
RATL83   DS    CL9     21   53    9   A    U    N         T         Y           
RATR83H  DS    CL8                                                              
RATR83   DS    CL9     21   64    9   A    U    N         T         Y           
RATL91H  DS    CL8                                                              
RATL91   DS    CL9     22    4    9   A    U    N         T         Y           
RATR91H  DS    CL8                                                              
RATR91   DS    CL9     22   15    9   A    U    N         T         Y           
RATL92H  DS    CL8                                                              
RATL92   DS    CL9     22   29    9   A    U    N         T         Y           
RATR92H  DS    CL8                                                              
RATR92   DS    CL9     22   40    9   A    U    N         T         Y           
RATL93H  DS    CL8                                                              
RATL93   DS    CL9     22   53    9   A    U    N         T         Y           
RATR93H  DS    CL8                                                              
RATR93   DS    CL9     22   64    9   A    U    N         T         Y           
RATLA1H  DS    CL8                                                              
RATLA1   DS    CL9     23    4    9   A    U    N         T         Y           
RATRA1H  DS    CL8                                                              
RATRA1   DS    CL9     23   15    9   A    U    N         T         Y           
RATLA2H  DS    CL8                                                              
RATLA2   DS    CL9     23   29    9   A    U    N         T         Y           
RATRA2H  DS    CL8                                                              
RATRA2   DS    CL9     23   40    9   A    U    N         T         Y           
RATLA3H  DS    CL8                                                              
RATLA3   DS    CL9     23   53    9   A    U    N         T         Y           
RATRA3H  DS    CL8                                                              
RATRA3   DS    CL9     23   64    9   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     23   77    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL22    24    3   22   A    P    N         T         Y           
RATDTSH  DS    CL8                                                              
RATDTS   DS    CL53    24   26   53   A    P    N         T         Y           
RATLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
RATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1473 BYTES                            
