*          DATA SET T406F3D    AT LEVEL 001 AS OF 06/24/76                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T406F3D      DATE 06/24/76                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     8    3   17   A    P    N         T         Y           
MPDACOMH DS    CL8                                                              
MPDACOM  DS    CL6      8   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13     9    3   13   A    P    N         T         Y           
MPDCDISH DS    CL8                                                              
MPDCDIS  DS    CL4      9   22    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13    10    3   13   A    P    N         T         Y           
MPDCSHDH DS    CL8                                                              
MPDCSHD  DS    CL3     10   22    3   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    10   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9     11    3    9   A    P    N         T         Y           
MPDFREQH DS    CL8                                                              
MPDFREQ  DS    CL2     11   22    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12    12    3   12   A    P    N         T         Y           
MPDCDMOH DS    CL8                                                              
MPDCDMO  DS    CL3     12   22    3   A    U    N         T         Y           
MPDCDDAH DS    CL8                                                              
MPDCDDA  DS    CL3     12   27    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    12   41   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    13    3   12   A    P    N         T         Y           
MPDOSMOH DS    CL8                                                              
MPDOSMO  DS    CL3     13   22    3   A    U    N         T         Y           
MPDOSDAH DS    CL8                                                              
MPDOSDA  DS    CL3     13   27    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    13   41   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16    14    3   16   A    P    N         T         Y           
MPDPAMOH DS    CL8                                                              
MPDPAMO  DS    CL3     14   22    3   A    U    N         T         Y           
MPDPADAH DS    CL8                                                              
MPDPADA  DS    CL3     14   27    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    14   41   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    15    3   18   A    P    N         T         Y           
MPDCLASH DS    CL8                                                              
MPDCLAS  DS    CL3     15   22    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     16   61    1   A    U    N         T         Y           
MPDLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
MPDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 413  BYTES                            
