*          DATA SET T406FAD    AT LEVEL 004 AS OF 10/05/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T406FAD      DATE 10/05/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL21     8    3   21  A   P    N         T        Y              
CLIPREPH DS    CL8                                                              
CLIPREP  DS    CL4      8   27    4  N   U    N         T        Y              
CLIPRNH  DS    CL8                                                              
CLIPRN   DS    CL30     8   33   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9   18    7  A   P    N         T        Y              
CLITREPH DS    CL8                                                              
CLITREP  DS    CL4      9   27    4  N   U    N         T        Y              
CLITRNH  DS    CL8                                                              
CLITRN   DS    CL30     9   33   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10   18    8  A   P    N         T        Y              
CLICREPH DS    CL8                                                              
CLICREP  DS    CL4     10   27    4  N   U    N         T        Y              
CLICRNH  DS    CL8                                                              
CLICRN   DS    CL30    10   33   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    11    3   20  A   P    N         T        Y              
CLIDESH  DS    CL8                                                              
CLIDES   DS    CL15    11   27   15  A   U    N         T        Y              
CLIPUBNH DS    CL8                                                              
CLIPUBN  DS    CL30    11   48   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL22    13    3   22  A   P    N         T        Y              
CLICOM1H DS    CL8                                                              
CLICOM1  DS    CL6     13   27    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   34   10  A   P    N         T        Y              
CLIWHR1H DS    CL8                                                              
CLIWHR1  DS    CL1     13   45    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL22    14    3   22  A   P    N         T        Y              
CLICOM2H DS    CL8                                                              
CLICOM2  DS    CL6     14   27    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   34   10  A   P    N         T        Y              
CLIWHR2H DS    CL8                                                              
CLIWHR2  DS    CL1     14   45    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL38    16    3   38  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   27    1  A   U    N         T        Y              
CLILAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
CLIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 504  BYTES                            
