*          DATA SET T406FDD    AT LEVEL 001 AS OF 05/21/79                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T406FDD      DATE 05/21/79                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
COMLIN1H DS    CL8                                                              
COMLIN1  DS    CL70     8    3   70   A    U    N         T         Y           
COMLIN2H DS    CL8                                                              
COMLIN2  DS    CL70     9    3   70   A    U    N         T         Y           
COMLIN3H DS    CL8                                                              
COMLIN3  DS    CL70    10    3   70   A    U    N         T         Y           
COMLIN4H DS    CL8                                                              
COMLIN4  DS    CL70    11    3   70   A    U    N         T         Y           
COMLIN5H DS    CL8                                                              
COMLIN5  DS    CL70    12    3   70   A    U    N         T         Y           
COMLIN6H DS    CL8                                                              
COMLIN6  DS    CL70    13    3   70   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13   77    1   A    U    N         T         Y           
COMLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
