*          DATA SET T406E2D    AT LEVEL 001 AS OF 06/15/81                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T406E2D      DATE 06/15/81                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     7    3   14   A    P    N         T         Y           
RATDATEH DS    CL8                                                              
RATDATE  DS    CL8      7   18    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16     8    3   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     8   27   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16     8   51   16   A    P    N         T         Y           
RATSP1H  DS    CL8                                                              
RATSP1   DS    CL6      9    2    6   A    U    N         T         Y           
RATLN1H  DS    CL8                                                              
RATLN1   DS    CL10     9   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      9   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10     9   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      9   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10     9   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    10   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    10   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    10   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    11   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    11   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    11   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    12   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    12   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    12   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     13    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    13   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     13   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    13   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     13   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    13   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    14   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    14   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    14   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    15   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    15   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    15   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     16    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    16   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     16   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    16   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     16   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    16   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     17    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    17   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     17   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    17   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     17   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    17   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     18    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    18   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     18   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    18   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     18   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    18   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     19    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    19   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     19   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    19   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     19   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    19   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     20    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    20   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     20   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    20   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     20   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    20   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     21    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    21   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     21   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    21   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     21   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    21   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     22    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    22   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     22   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    22   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     22   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    22   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     23    2    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    23   12   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     23   26    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    23   36   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     23   50    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    23   60   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     23   77    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL22    24    2   22   A    P    N         T         Y           
RATDTSH  DS    CL8                                                              
RATDTS   DS    CL53    24   25   53   A    P    N         T         Y           
RATLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
RATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1653 BYTES                            
