*          DATA SET T406F1D    AT LEVEL 001 AS OF 04/13/82                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T406F1D      DATE 04/13/82                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      8    3    4   A    P    N         T         Y           
NAMNAMEH DS    CL8                                                              
NAMNAME  DS    CL20     8   16   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9      9    3    9   A    P    N         T         Y           
NAMZNAMH DS    CL8                                                              
NAMZNAM  DS    CL20     9   16   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10    3    7   A    P    N         T         Y           
NAMADDRH DS    CL8                                                              
NAMADDR  DS    CL30    10   16   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    11    3   11   A    P    N         T         Y           
NAMADL2H DS    CL8                                                              
NAMADL2  DS    CL30    11   16   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    11   49   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL4     12    3    4   A    P    N         T         Y           
NAMCITYH DS    CL8                                                              
NAMCITY  DS    CL16    12   16   16   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     13    3    5   A    P    N         T         Y           
NAMSTATH DS    CL8                                                              
NAMSTAT  DS    CL2     13   16    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14    3    3   A    P    N         T         Y           
NAMZIPH  DS    CL8                                                              
NAMZIP   DS    CL5     14   16    5   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     15    3    9   A    P    N         T         Y           
NAMATTNH DS    CL8                                                              
NAMATTN  DS    CL24    15   16   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     16    3    9   A    P    N         T         Y           
NAMTELEH DS    CL8                                                              
NAMTELE  DS    CL12    16   16   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    17    3   10   A    P    N         T         Y           
NAMPREPH DS    CL8                                                              
NAMPREP  DS    CL4     17   16    4   N    U    N         T         Y           
NAMPRNH  DS    CL8                                                              
NAMPRN   DS    CL30    17   25   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL11    18    3   11   A    P    N         T         Y           
NAMTREPH DS    CL8                                                              
NAMTREP  DS    CL4     18   16    4   N    U    N         T         Y           
NAMTRNH  DS    CL8                                                              
NAMTRN   DS    CL30    18   25   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    19    3   12   A    P    N         T         Y           
NAMCREPH DS    CL8                                                              
NAMCREP  DS    CL4     19   16    4   N    U    N         T         Y           
NAMCRNH  DS    CL8                                                              
NAMCRN   DS    CL30    19   25   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    20    3   10   A    P    N         T         Y           
NAMSTCDH DS    CL8                                                              
NAMSTCD  DS    CL2     20   16    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11    21    3   11   A    P    N         T         Y           
NAMCTCDH DS    CL8                                                              
NAMCTCD  DS    CL3     21   16    3   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12    22    3   12   A    P    N         T         Y           
NAMEDTSH DS    CL8                                                              
NAMEDTS  DS    CL2     22   16    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    22   30   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9     23    3    9   A    P    N         T         Y           
NAMKDATH DS    CL8                                                              
NAMKDAT  DS    CL10    23   16   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     23   61    1   A    U    N         T         Y           
NAMLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
NAMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 758  BYTES                            
