*          DATA SET T406F5D    AT LEVEL 001 AS OF 02/07/79                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T406F5D      DATE 02/07/79                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     8    3   10   A    P    N         T         Y           
MCRTCIRH DS    CL8                                                              
MCRTCIR  DS    CL10     8   22   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      9    3    6   A    P    N         T         Y           
MCRCIR2H DS    CL8                                                              
MCRCIR2  DS    CL10     9   22   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10    3    6   A    P    N         T         Y           
MCRCIR3H DS    CL8                                                              
MCRCIR3  DS    CL10    10   22   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11    3    6   A    P    N         T         Y           
MCRCIR4H DS    CL8                                                              
MCRCIR4  DS    CL10    11   22   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12    3    6   A    P    N         T         Y           
MCRCIR5H DS    CL8                                                              
MCRCIR5  DS    CL10    12   22   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL21    12   34   21   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     13    3    6   A    P    N         T         Y           
MCRCIR6H DS    CL8                                                              
MCRCIR6  DS    CL10    13   22   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL27    13   34   27   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL11    15    3   11   A    P    N         T         Y           
MCRCIRSH DS    CL8                                                              
MCRCIRS  DS    CL4     15   22    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     16    3    9   A    P    N         T         Y           
MCRCIRDH DS    CL8                                                              
MCRCIRD  DS    CL8     16   22    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     17   61    1   A    U    N         T         Y           
MCRLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
MCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 336  BYTES                            
