*          DATA SET T406F2D    AT LEVEL 001 AS OF 04/13/82                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T406F2D      DATE 04/13/82                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     8    3   17   A    P    N         T         Y           
NPDACOMH DS    CL8                                                              
NPDACOM  DS    CL6      8   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13     9    3   13   A    P    N         T         Y           
NPDCDISH DS    CL8                                                              
NPDCDIS  DS    CL4      9   22    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13    10    3   13   A    P    N         T         Y           
NPDCSHDH DS    CL8                                                              
NPDCSHD  DS    CL3     10   22    3   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    10   41   17   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16    11    3   16   A    P    N         T         Y           
NPDCPPH  DS    CL8                                                              
NPDCPP   DS    CL3     11   22    3   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    12    3   16   A    P    N         T         Y           
NPDLPCH  DS    CL8                                                              
NPDLPC   DS    CL3     12   22    3   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    13    3   18   A    P    N         T         Y           
NPDLDTH  DS    CL8                                                              
NPDLDT   DS    CL5     13   22    5   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    14    3   18   A    P    N         T         Y           
NPDLCCH  DS    CL8                                                              
NPDLCC   DS    CL3     14   22    3   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12    15    3   12   A    P    N         T         Y           
NPDCWH   DS    CL8                                                              
NPDCW    DS    CL6     15   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   41    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     16    3    7   A    P    N         T         Y           
NPDTABLH DS    CL8                                                              
NPDTABL  DS    CL1     16   22    1   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    16   41   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13    17    3   13   A    P    N         T         Y           
NPDTOFPH DS    CL8                                                              
NPDTOFP  DS    CL1     17   22    1   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL37    17   41   37   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL14    18    3   14   A    P    N         T         Y           
NPDMDRH  DS    CL8                                                              
NPDMDR   DS    CL1     18   22    1   N    U    N         T         Y           
         DS    CL8                                                              
         DS    CL33    18   41   33   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10    19    3   10   A    P    N         T         Y           
NPDEXCLH DS    CL8                                                              
NPDEXCL  DS    CL9     19   22    9   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL38    19   41   38   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16    20    3   16   A    P    N         T         Y           
NPDBFDSH DS    CL8                                                              
NPDBFDS  DS    CL15    20   22   15   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL20    20   41   20   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12    21    3   12   A    P    N         T         Y           
NPDCDMOH DS    CL8                                                              
NPDCDMO  DS    CL3     21   22    3   A    U    N         T         Y           
NPDCDDAH DS    CL8                                                              
NPDCDDA  DS    CL3     21   27    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    21   41   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    22    3   18   A    P    N         T         Y           
NPDCLASH DS    CL8                                                              
NPDCLAS  DS    CL2     22   22    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14    23    3   14   A    P    N         T         Y           
NPDRATEH DS    CL8                                                              
NPDRATE  DS    CL1     23   22    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL22    23   41   22   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     24   61    1   A    U    N         T         Y           
NPDLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
NPDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 845  BYTES                            
