*          DATA SET T407FFD    AT LEVEL 001 AS OF 04/08/75                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T407FFD      DATE 04/08/75                 
         SPACE 3                                                                
T407FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
HDRMSGH  DS    CL8                                                              
HDRMSG   DS    CL60     1    2   60   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      3    2    6   A    P    N         T         Y           
HDRRECH  DS    CL8                                                              
HDRREC   DS    CL8      3   22    8   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL6      4    2    6   A    P    N         T         Y           
HDRACTH  DS    CL8                                                              
HDRACT   DS    CL7      4   22    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    N         T         Y           
HDRAGYH  DS    CL8                                                              
HDRAGY   DS    CL2      6   22    2   A    U    N         T         Y           
HDRAGYNH DS    CL8                                                              
HDRAGYN  DS    CL33     6   26   33   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      7    2    5   A    P    N         T         Y           
HDRMEDH  DS    CL8                                                              
HDRMED   DS    CL1      7   22    1   A    U    N         T         Y           
HDRMEDNH DS    CL8                                                              
HDRMEDN  DS    CL10     7   26   10   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13     8    2   13   A    P    N         T         Y           
HDRRPTH  DS    CL8                                                              
HDRRPT   DS    CL3      8   22    3   A    U    N         N         Y           
         DS    CL8                                                              
         DS    CL17    10    2   17   A    P    N         T         Y           
HDREMSGH DS    CL8                                                              
HDREMSG  DS    CL3     10   22    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     10   57    1   A    U    N         T         Y           
HDRLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
HDRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 337  BYTES                            
