*          DATA SET T407F3D    AT LEVEL 001 AS OF 07/15/76                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T407F3D      DATE 07/15/76                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11    12    2   11   A    P    N         T         Y           
RPTNAMH  DS    CL8                                                              
RPTNAM   DS    CL36    12   22   36   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     13    2    5   A    P    N         T         Y           
RPTPOWH  DS    CL8                                                              
RPTPOW   DS    CL4     13   22    4   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    14    2   16   A    P    N         T         Y           
RPTMSGH  DS    CL8                                                              
RPTMSG   DS    CL30    14   22   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    15    2   18   A    P    N         T         Y           
RPTMEDH  DS    CL8                                                              
RPTMED   DS    CL1     15   22    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     16   61    1   A    U    N         T         Y           
RPTLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
RPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 197  BYTES                            
