*          DATA SET T407F1D    AT LEVEL 001 AS OF 06/26/75                      
         SPACE 2                                                                
*              DSECT TO COVER SCREEN T407F1D      DATE 06/26/75                 
         SPACE 3                                                                
*                     LINE COLM LEN. A/N  PROT BRIL MOD. TRNS CUR               
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4     12    2    4   A    P    N         T         Y           
AGYNAMEH DS    CL8                                                              
AGYNAME  DS    CL33    12   22   33   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13    2    7   A    P    N         T         Y           
AGYADRSH DS    CL8                                                              
AGYADRS  DS    CL33    13   22   33   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    14    2   16   A    P    N         T         Y           
AGYABBRH DS    CL8                                                              
AGYABBR  DS    CL7     14   22    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    15    2   18   A    P    N         T         Y           
AGYEQUH  DS    CL8                                                              
AGYEQU   DS    CL2     15   22    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    16    2   17   A    P    N         T         Y           
AGYMDESH DS    CL8                                                              
AGYMDES  DS    CL10    16   22   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL18    17    2   18   A    P    N         T         Y           
AGYVDESH DS    CL8                                                              
AGYVDES  DS    CL20    17   22   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14    18    2   14   A    P    N         T         Y           
AGYACCTH DS    CL8                                                              
AGYACCT  DS    CL18    18   22   18   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     19    2    7   A    P    N         T         Y           
AGYPROFH DS    CL8                                                              
AGYPROF  DS    CL30    19   22   30   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL30    20   22   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL30    21   22   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     22   61    1   A    U    N         T         Y           
AGYLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
AGYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 470  BYTES                            
