*          DATA SET T407F2D    AT LEVEL 001 AS OF 06/21/74                      
         SPACE 2                                                                
*                     DSECT TO COVER SCREEN T407F2D    DATE 06/21/74            
         SPACE 3                                                                
*407F2D               LINE COL. LEN. A/N  PROT BRIL MOD. TRNS I.C D.B.          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13    12    2   13   A    P    N         T         Y           
MSGEMSGH DS    CL8                                                              
MSGEMSG  DS    CL60    12   18   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13   61    1   A    U    N         T         Y           
MSGLAST  DS    CL1                                                              
         DS    CL2    BEFORE=NOTHING AFTER=CLEAR                                
MSGWORK  DS    0D     START OF REMAINING SPACE                                  
