*          DATA SET T409F3D    AT LEVEL 001 AS OF 06/28/74                      
         SPACE 2                                                                
*                     DSECT TO COVER SCREEN T409F3D    DATE 06/28/74            
         SPACE 3                                                                
*409F3D               LINE COL. LEN. A/N  PROT BRIL MOD. TRNS I.C D.B.          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13    13    2   13   A    P    N         T         Y           
DSTNAMEH DS    CL8                                                              
DSTNAME  DS    CL20    13   22   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13   61    1   A    U    N         T         Y           
DSTLAST  DS    CL1                                                              
         DS    CL2    BEFORE=NOTHING AFTER=CLEAR                                
DSTWORK  DS    0D     START OF REMAINING SPACE                                  
