*          DATA SET T409F2D    AT LEVEL 001 AS OF 06/28/74                      
         SPACE 2                                                                
*                     DSECT TO COVER SCREEN T409F2D    DATE 06/28/74            
         SPACE 3                                                                
*409F2D               LINE COL. LEN. A/N  PROT BRIL MOD. TRNS I.C D.B.          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11    13    2   11   A    P    N         T         Y           
REGNAMEH DS    CL8                                                              
REGNAME  DS    CL20    13   22   20   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13   61    1   A    U    N         T         Y           
REGLAST  DS    CL1                                                              
         DS    CL2    BEFORE=NOTHING AFTER=CLEAR                                
REGWORK  DS    0D     START OF REMAINING SPACE                                  
