*          DATA SET TABIDSECT  AT LEVEL 054 AS OF 03/31/16                      
*                                                                               
*        PRINT LINE DSECTS                                                      
*                                                                               
P1LINED  DSECT                     1ST HEADING LINE DSECT                       
*                                                                               
         DS    CL3                                                              
L11      DS    CL13                                                             
LI11     DS    CL38                                                             
C11      DS    CL19                                                             
CI11     DS    CL16                                                             
         DS    CL4                                                              
R11      DS    CL10                                                             
RI11     DS    CL16                                                             
R21      DS    CL5                                                              
RI21     DS    CL6                                                              
*                                                                               
         SPACE 3                                                                
P2LINED  DSECT                     SECOND HEADING LINE                          
*                                                                               
         DS    CL3                                                              
L12      DS    CL13                                                             
LI12     DS    CL11                                                             
L22      DS    CL14                                                             
LI22     DS    CL18                                                             
L32      DS    CL12                                                             
LI32     DS    CL17                                                             
*                                                                               
         SPACE 3                                                                
P4LINED  DSECT                     PERFORMER HEADINGS LINE                      
*                                                                               
CO1      DS    CL1                 COLUMN FOR BOX                               
SSN      DS    CL9                 S/S NUMBER                                   
CO2      DS    CL1                                                              
NAME     DS    CL16                PERFORMERS NAME                              
CO3      DS    CL1                                                              
OV       DS    CL3                 OVERTIME %                                   
CO4      DS    CL1                                                              
CAT      DS    CL3                 CATEGORY                                     
CO5      DS    CL1                                                              
CAM      DS    CL3                 ON/OFF CAMERA                                
         ORG   CAM                                                              
PAYEE    DS    CL3                 PAYEE                                        
CO6      DS    CL1                                                              
AGENT    DS    CL4                 AGENT                                        
         ORG   AGENT                                                            
LOCL     DS    CL4                 LOCAL                                        
CO7      DS    CL1                                                              
STATE    DS    CL2                 STATE CODE                                   
CO8      DS    CL1                                                              
LIFT     DS    CL1                 LIFT                                         
CO9      DS    CL1                                                              
DBL      DS    CL1                 DOUBLES                                      
CO10     DS    CL1                                                              
FIRST    DS    CL6                 FIRST SERVICE DATE                           
CO11     DS    CL1                                                              
VARCOL   DS    CL5                 OT & TRAVEL HR.MN/USE RANGE/BLANK            
CO11A    DS    CL1                                                              
DY       DS    CL2                 NO DAYS                                      
CO12     DS    CL1                                                              
SPOT     DS    CL2                 NUMBER OF SPOTS                              
CO13     DS    CL1                                                              
YEAR     DS    CL3                 YEAR                                         
CO14     DS    CL1                                                              
APL      DS    CL1                 APL                                          
CO15     DS    CL1                                                              
INC      DS    CL1                 INC                                          
CO16     DS    CL1                                                              
OVRIDE   DS    CL2                 OVERRIDE BIT ON = *                          
CO17     DS    CL1                                                              
AMTAPL   DS    CL9                 AMOUNT APPLIED                               
BL2      DS    CL1                                                              
CO18     DS    CL1                                                              
GROSS    DS    CL11                GROSS WAGES                                  
CO19     DS    CL1                                                              
MISC     DS    CL10                MISC PAYMENT                                 
         ORG   MISC                                                             
DUES     DS    CL10                ACT DUES/SVC FEES                            
CO20     DS    CL1                                                              
PH       DS    CL7                                                              
CO21     DS    CL1                                                              
HW       DS    CL7                                                              
CO22     DS    CL1                                                              
*                                                                               
         ORG   LIFT                PRINT DSECT                                  
SHDTE    DS    CL8                 SHOOT DATE                                   
PCO9     DS    CL1                                                              
PUBDTE   DS    CL8                 PUB DATE                                     
PCO10    DS    CL1                                                              
EXPDTE   DS    CL8                 EXPIRATION DATE                              
PCO11    DS    CL1                                                              
         DS    CL1                                                              
AGTPCT   DS    CL5                 AGENT PERCENT                                
PCO12    DS    CL1                                                              
POVRD    DS    CL2                                                              
*                                                                               
         ORG   AMTAPL              PAYROLL PLUS DSECT                           
         DS    CL1                                                              
PPCO1    DS    CL1                                                              
PPTAXWG  DS    CL11                TAXABLE WAGES                                
PPCO2    DS    CL1                                                              
PPNTXWG  DS    CL11                NON TAXABLE WAGES                            
PPCO3    DS    CL1                                                              
PPTXNWG  DS    CL11                TAXABLE NON WAGES                            
PPCO4    DS    CL1                                                              
PPNTXNW  DS    CL11                NON TAXABLE NON WAGES                        
*                                                                               
         ORG   CAM+L'P             2ND PERFORMER HEADINGS LINE                  
CAM2     DS    CL(L'CAM)                                                        
         ORG   LOCL+L'P                                                         
LOCL2    DS    CL(L'LOCL)                                                       
         ORG   LIFT+L'P                                                         
LIFT2    DS    CL(L'LIFT)                                                       
         ORG   DBL+L'P                                                          
DBL2     DS    CL(L'DBL)                                                        
         ORG   FIRST+L'P                                                        
FIRST2   DS    CL(L'FIRST)                                                      
         ORG   VARCOL+L'P                                                       
VARCOL2  DS    CL(L'VARCOL)                                                     
         ORG   DY+L'P                                                           
DY2      DS    CL(L'DY)                                                         
         ORG   SPOT+L'P                                                         
SPOT2    DS    CL(L'SPOT)                                                       
         ORG   APL+L'P                                                          
APL2     DS    CL(L'APL)                                                        
         ORG   INC+L'P                                                          
INC2     DS    CL(L'INC)                                                        
         ORG   AMTAPL+L'P                                                       
AMTAPL2  DS    CL(L'AMTAPL)                                                     
         ORG   MISC+L'P                                                         
MISC2    DS    CL(L'MISC)                                                       
         ORG   DUES+L'P                                                         
DUES2    DS    CL(L'DUES)                                                       
         ORG   PH+L'P                                                           
PH2      DS    CL(L'PH)                                                         
         ORG   HW+L'P                                                           
HW2      DS    CL(L'HW)                                                         
*                                                                               
         ORG   SHDTE+L'P                                                        
SHDTE2   DS    CL(L'SHDTE)                                                      
         ORG   PUBDTE+L'P                                                       
PUBDTE2  DS    CL(L'PUBDTE)                                                     
         ORG   AGTPCT+L'P                                                       
AGTPCT2  DS    CL(L'AGTPCT)                                                     
         ORG   EXPDTE+L'P                                                       
EXPDTE2  DS    CL(L'EXPDTE)                                                     
*                                                                               
         ORG   PPTAXWG+L'P                                                      
PPTXWG2  DS    CL(L'PPTAXWG)                                                    
         ORG   PPNTXWG+L'P                                                      
PPNTWG2  DS    CL(L'PPNTXWG)                                                    
         ORG   PPTXNWG+L'P                                                      
PPTXNW2  DS    CL(L'PPTXNWG)                                                    
         ORG   PPNTXNW+L'P                                                      
PPNTNW2  DS    CL(L'PPNTXNW)                                                    
*                                                                               
         ORG   CAM+L'P*2           3RD PERFORMER HEADINGS LINE                  
CAM3     DS    CL(L'CAM)                                                        
         ORG   LOCL+L'P*2                                                       
LOCL3    DS    CL(L'LOCL)                                                       
         ORG   LIFT+L'P*2                                                       
LIFT3    DS    CL(L'LIFT)                                                       
         ORG   DBL+L'P*2                                                        
DBL3     DS    CL(L'DBL)                                                        
         ORG   FIRST+L'P*2                                                      
FIRST3   DS    CL(L'FIRST)                                                      
         ORG   VARCOL+L'P*2                                                     
VARCOL3  DS    CL(L'VARCOL)                                                     
         ORG   APL+L'P*2                                                        
APL3     DS    CL(L'APL)                                                        
         ORG   INC+L'P*2                                                        
INC3     DS    CL(L'INC)                                                        
*                                                                               
         SPACE 3                                                                
P5LINED  DSECT                     BOTTOM LINE                                  
*                                                                               
P5CB1    DS    CL1                 COLUMN FOR BOX                               
         DS    CL11                                                             
P5PHR    DS    CL27                                                             
         DS    CL10                                                             
P5CB2    DS    CL1                                                              
         DS    CL1                                                              
P5APLEG  DS    CL12                                                             
         DS    CL1                                                              
P5CB3    DS    CL1                                                              
         DS    CL1                                                              
P5INCL   DS    CL14                                                             
         DS    CL1                                                              
P5CB4    DS    CL1                                                              
P5TOT    DS    CL8                                                              
         DS    CL2                                                              
P5CB5    DS    CL1                                                              
P5GROSS  DS    CL11                                                             
P5CB6    DS    CL1                                                              
P5MISC   DS    CL10                                                             
P5CB7    DS    CL1                                                              
P5PNH    DS    CL7                                                              
P5CB8    DS    CL1                                                              
P5HNW    DS    CL6                                                              
P5CB9    DS    CL1                                                              
         ORG   P5INCL             PAYROLL PLUS TOTALS                           
         DS    CL7                                                              
P5TOT2   DS    CL8                                                              
         DS    CL2                                                              
P5CB10   DS    CL1                                                              
P5TAXWG  DS    CL11                                                             
P5CB11   DS    CL1                                                              
P5NTXWG  DS    CL11                                                             
P5CB12   DS    CL1                                                              
P5TXNWG  DS    CL11                                                             
P5CB13   DS    CL1                                                              
P5NTNWG  DS    CL11                                                             
*                                                                               
         SPACE 3                                                                
P6LINED  DSECT                     BOTTOM BOX                                   
*                                                                               
P6CB1    DS    CL1                 COLUMN FOR BOX                               
         DS    CL4                                                              
P6COMP1  DS    CL7                                                              
         DS    CL2                                                              
P6COMP2  DS    CL18                                                             
         ORG   P6COMP2+5                                                        
P6GPAY   DS    CL13                                                             
         DS    CL3                                                              
P6UNI1   DS    CL5                                                              
         DS    CL1                                                              
P6UNI2   DS    CL5                                                              
         DS    CL3                                                              
P6CB2    DS    CL1                                                              
         DS    CL1                                                              
P6APLEG  DS    CL12                                                             
         DS    CL1                                                              
P6CB3    DS    CL1                                                              
         DS    CL1                                                              
P6INCL   DS    CL14                                                             
         DS    CL1                                                              
P6CB4    DS    CL1                                                              
P6TOT    DS    CL22                                                             
P6CB5    DS    CL1                                                              
P6MISC   DS    CL10                                                             
P6CB6    DS    CL1                                                              
         DS    CL7                                                              
P6CB7    DS    CL1                                                              
P6WCDEC  DS    CL6                                                              
         ORG   P6WCDEC                                                          
P6WCDE   DS    CL3                                                              
         DS    CL3                                                              
P6CB8    DS    CL1                                                              
         ORG   P6CB6                                                            
         DS    CL6                                                              
P6GMWCDE DS    CL9                                                              
*                                                                               
         SPACE 3                                                                
P7LINED  DSECT                     INVOICE TOTAL BOX                            
         DS    CL2                                                              
P7COD    DS    CL70                COD MESSAGE PART ONE                         
         DS    CL9                                                              
P7CB1    DS    CL1                 COLUMN FOR BOX                               
P7INVT   DS    CL15                                                             
         DS    CL7                                                              
P7CB2    DS    CL1                                                              
P7TOT    DS    CL10                                                             
P7CB3    DS    CL1                                                              
P7US     DS    CL7                                                              
P7CB4    DS    CL1                                                              
         ORG   P7LINED+29                                                       
P7DAYS   DS    CL23                PAYMENT DUE MESSAGE                          
         ORG   P7LINED+11                                                       
P7NOW    DS    CL41                PAYMENT DUE NOW MESSAGE                      
         ORG   P7LINED+1                                                        
P7COD2   DS    CL70                                                             
*                                                                               
         SPACE 3                                                                
P8LINED  DSECT                     CLASS A TABLE                                
P8CB     DS    CL1                 COLUMN FOR BOX                               
P8TITL   DS    CL13                                                             
*                                                                               
P8CB1    DS    CL1                                                              
P8INFO1  DS    CL28                                                             
P8CB2    DS    CL1                                                              
P8INFO2  DS    CL28                                                             
P8CB3    DS    CL1                                                              
P8INFO3  DS    CL28                                                             
P8CB4    DS    CL1                                                              
P8INFO4  DS    CL28                                                             
P8CB5    DS    CL1                                                              
         SPACE 2                                                                
P8INFD   DSECT                                                                  
P8DT     DS    CL5                 DATE                                         
         DS    CL1                                                              
P8PGM    DS    CL15                PGM NAME                                     
         DS    CL1                                                              
P8LFT    DS    CL1                 LIFT                                         
         DS    CL3                                                              
P8NWK    DS    CL1                 NETWORK                                      
         DS    CL1                                                              
         SPACE 2                                                                
P9LINED  DSECT                                                                  
P9AGY    DS    CL6                 AGENCY                                       
         DS    CL4                                                              
P9INV    DS    CL6                 INVOICE NUMBER                               
         DS    CL4                                                              
P9ER1    DS    CL1                                                              
P9ERR    DS    CL2                 ERROR NUMBER                                 
         DS    CL5                                                              
P9DESC   DS    CL36                ERROR DESCRIPTION                            
         DS    CL5                                                              
P9WARN   DS    CL11                WARNING                                      
         SPACE 3                                                                
P10LINED DSECT                                                                  
         DS    CL2                                                              
         DS    CL10                                                             
P10CTX   DS    CL25                CANADIAN TAX WITHELD                         
         DS    CL2                                                              
P10RET   DS    CL91                RETRO STATUS                                 
         SPACE 3                                                                
P11LINED DSECT                                                                  
         DS    CL2                                                              
P11COD   DS    CL70                COD MESSAGE PART TWO                         
         ORG   P11LINED+29                                                      
P11SUML  DS    CL33                SUMMARY LISTING MESSAGE                      
         ORG   P11LINED+1                                                       
P11LBOXC DS    CL80                LOCK BOX MESSAGE FOR CHICAGO                 
         ORG   P11LINED+11                                                      
P11LBOXN DS    CL65                LOCK BOX MESSAGE FOR NEW YORK                
         ORG   P11LINED+1                                                       
P11LBOXD DS    CL80                LOCK BOX MESSAGE FOR NEW YORK/DDS            
         ORG   P11LINED+1                                                       
P11LBOXT DS    CL80                LOCK BOX MESSAGE FOR TP IN CHICAGO           
         ORG   P11LINED+1                                                       
P11LBOXP DS    CL80                LOCK BOX MESSAGE FOR PPS IN CHICAGO          
*                                                                               
         EJECT                                                                  
*                                                                               
*              DSECT TO COVER WORK CODE TABLE (WCLIST)                          
*                                                                               
WCLD     DSECT                                                                  
WCLCOMP  DS    CL1                 COMPANY                                      
WCLOFF   DS    CL1                 OFFICE                                       
WCLCLI   DS    CL3                 CLIENT                                       
WCLMED   DS    CL1                 MEDIA                                        
WCLUSE   DS    CL1                 USE TYPE (SESSION VS. RESIDUAL)              
WCLONOF  DS    CL1                 ON/OFF CAMERA                                
*                                                                               
WCLAFM   DS    0CL4                                                             
WCLAFMF  DS    CL2                 AFM FEES                                     
WCLAFMP  DS    CL2                 AFM P&W                                      
WCLSNG   DS    0CL4                                                             
WCLSNGF  DS    CL2                 SINGER FEES                                  
WCLSNGP  DS    CL2                 SINGER P&W                                   
WCLEXT   DS    0CL4                                                             
WCLEXTF  DS    CL2                 EXTRA FEES                                   
WCLEXTP  DS    CL2                 EXTRA P&W                                    
WCLOTH   DS    0CL4                                                             
WCLOTHF  DS    CL2                 OTHERS FEES                                  
WCLOTHP  DS    CL2                 OTHERS P&W                                   
*                                                                               
WCLHNW   DS    CL2                 H&W                                          
WCLCSF   DS    CL2                 CSF                                          
WCLTAX   DS    CL2                 TAXES                                        
WCLHND   DS    CL2                 HANDLING                                     
WCLLNQ   EQU   *-WCLD                                                           
WCLNEXT  EQU   *                                                                
         EJECT                                                                  
*                                                                               
*        NETWORK/CLASS A DSECT                                                  
*                                                                               
NETTABD  DSECT                                                                  
*                                                                               
NETDATE  DS    PL3                 USE DATE                                     
NETNAME  DS    CL15                PROGRAM NAME                                 
NETNWK   DS    CL1                 NETWORK                                      
NETLFT   DS    CL1                 LIFT CODE                                    
NETLEN   EQU   *-NETTABD                                                        
         SPACE 2                                                                
*                                                                               
*        SORT TABLE DSECT                                                       
*                                                                               
SRTINVD  DSECT                                                                  
SRTSTAT  DS    XL1                 STATUS (ACOPY)                               
SRTSCRD  EQU   X'01'               CREDIT                                       
SRTSGRT  EQU   X'02'               GUARANTEES                                   
SRTSREG  EQU   X'FF'               REGULAR INVOICE                              
*                                                                               
SRTUNI   DS    CL3                 UNION                                        
SRTLCL   DS    CL3                 LOCAL                                        
         ORG   SRTUNI                                                           
SRTACCDE DS    XL1                 SORTING CODE FOR AC COPIES                   
SRTCHAND EQU   X'01'               HAND DELIVERY                                
SRTCPRI  EQU   X'02'               PRIORITY MAIL                                
SRTCOVER EQU   X'04'               OVERNIGHT DELIVERY                           
SRTCMAIL EQU   X'08'               MAIL DELIVERY                                
SRTCPCH  EQU   X'10'               POUCH DELIVERY                               
SRTCCHI  EQU   X'20'               CHICAGO POUCH DELIVERY                       
         DS    CL5                                                              
SRTTPO   DS    CL1                 TALENT PARTNERS OFFICE                       
SRTAGY   DS    CL6                 AGENCY                                       
*                                  (COMMENT WHEN GUARANTEES GO LIVE)            
SRTATT   DS    CL2                 BILL TO CODE                                 
         DS    CL10                                                             
         ORG   SRTATT                                                           
SRTATTN  DS    CL10                ATTENTION NAME FOR AC COPIES                 
         DS    CL2                                                              
         ORG   SRTATT                                                           
SRTEST   DS    CL12                ESTIMATE NUMBER FOR AC COPIES                
*                                                                               
SRTINV   DS    PL6                 INVOICE NUMBER                               
SRTDA    DS    XL4                 DISK ADDRESS                                 
SRTILEN  EQU   *-SRTINVD                                                        
         EJECT                                                                  
*                                                                               
*        PERFORMERS TABLE DSECT                                                 
*                                                                               
TABCHKD  DSECT                                                                  
*                                                                               
TABSSN   DS    CL9                 SOCIAL SECURITY NUMBER                       
TABNAME  DS    CL16                PERFORMERS NAME                              
TABW4TY  DS    CL1                 W4 TYPE FROM PD ELEMENT                      
TABCNUM  DS    CL1                 CORP NUMBER                                  
TABCID   DS    CL9                 CORP ID NUMBER                               
TABCNAME DS    CL16                CORP NAME                                    
*                                                                               
TABSTAT  DS    XL1                 STATUS BYTE                                  
TABOV1   DS    XL4                 OVERSCALE PERCENT                            
TABOV2   DS    XL4                                                              
TABCAT   DS    CL3                 CATEGORY                                     
TABONOFF DS    CL3                 ON/OFF CAMERA                                
TABAGNT  DS    XL2                 AGENT CODE                                   
TABDSK   EQU   *-TABCHKD           DISPLACEMENT FOR SORT                        
*                                                                               
TABDA    DS    XL4                 D/A                                          
TABTAXST DS    CL3                 TAXABLE STATE                                
TABSOR   DS    CL3                 STATE OF RESIDENCE                           
*                                                                               
TABSEQ   DS    XL2                 SEQUENCE NUMBER                              
TABGSTAT DS    XL1                 RETURNED FROM TAPPGUAR - NEED TO UPD         
TABUNI   DS    CL3                 UNION                                        
TABLOCL  DS    CL3                 LOCAL                                        
TABRLOCL DS    CL3                 RESIDENCE LOCAL                              
TABSTATE DS    CL3                 STATE                                        
*                                                                               
TABLIFT  DS    CL1                 ON LIFT/ ONLY ON LIFT                        
TABDBL   DS    CL1                 NUMBER OF DOUBLES                            
TABFSERV DS    PL3                 FIRST SERVICE DATE                           
TABCAEXP DS    XL3                 CAST EXPIRATION DATE                         
TABYR    DS    CL3                 YEAR                                         
TABACDE  DS    CL1                 APL CODE                                     
TABICDE  DS    CL1                 INCLUDE                                      
TABCAST2 DS    XL1                 CAST STATUS BYTE 2                           
*                                                                               
         DS    0H                                                               
TABSP    DS    XL1                 NUMBER OF SPOTS                              
TABDAY   DS    XL1                 NUMBER OF DAYS                               
TABTAG   DS    XL1                 N'TAGS                                       
*                                                                               
TABSTAT2 DS    XL1                 2ND STATUS BYTE                              
TABSTACT EQU   X'80'               THIS IS FOR ACTRAWORKS                       
TABSTGST EQU   X'40'               PERFORMER HAS GST # ON W4                    
TABSTAOS EQU   X'20'               THIS IS FOR ACTRA AOS FCB                    
TABSTGCU EQU   X'10'               GCON RECORD UPDATED                          
TABSTSN1 EQU   X'08'               PAID 1ST NON-RENDERED VERSION                
*                                                                               
         DS    0H                                                               
TABHRS   DS    0CL6                                                             
TABOT    DS    XL1                 OT HOURS                                     
TABDT    DS    XL1                 DOUBLE TIME HOURS                            
TABTRV   DS    H                   TRAVEL TIME HOURS    (2 DEC.)                
TABPDW   DS    H                   PRIOR DAY WARDROBE   (2 DEC.)                
TABHRLNQ EQU   *-TABHRS                                                         
*                                                                               
TABUSES  DS    H                   NUMBER OF USES                               
TABSTUS  DS    H                   STARTING USE NUMBER                          
         ORG   TABUSES                                                          
TABUNITS DS    H                   NUMBER OF UNITS (VERSIONS ONLY)              
TABMAJ   DS    X                   MAJORS                                       
TABTYPE  DS    X                   USE TYPE                                     
*                                                                               
TABGRTCD DS    CL4                 GUARANTEE CODE                               
TABXLN   DS    CL1                 EXTRA LINE NEEDED FOR TAG                    
*                                                                               
TABBLK   EQU   *-TABSP                                                          
*                                                                               
*                                  PRINT FIELDS                                 
         ORG   TABSP                                                            
TABARATE DS    H                   AGENT COMMISSION RATE                        
TABPAYEE DS    CL1                 PRINT - PAYEE CODE                           
         DS    XL1                 RESERVED FOR TABSTAT2                        
TABEXPDT DS    PL3                 EXPIRATION DATE                              
TABSDATE DS    PL3                 SHOOT DATE                                   
TABPUBDT DS    PL3                 PUB DATE                                     
TABPSTAT DS    XL1                 STATUS                                       
TABPSAGT EQU   X'80'               AGENT CHECK                                  
*                                                                               
*                                  PAYROLL PLUS FIELDS                          
         ORG   TABHRS                                                           
TABTXNW  DS    F                   NON-TAXABLE WAGES                            
TABNTNW  DS    F                   NON-TAXABLE REIMB                            
*                                                                               
         ORG   TABSP+TABBLK                                                     
TABLEVL  DS    CL1                 RATE LEVEL                                   
TABMPAY  DS    F                   TOTAL MISC PAYMENT OF PERFORMER              
*                                                                               
TABGRS   DS    F                   GROSS                                        
TABAPPL  DS    F                   APPLIED CREDITS                              
TABGUAR  DS    F                   GUARANTEE CREDITS                            
TABPAYI  DS    F                   INDIVIDUAL PAYMENT                           
TABPAYC  DS    F                   CORPORATE PAYMENT                            
TABREXP  DS    F                   REIMBURSED EXPENSES                          
TABSPNH  DS    F                   SUBJECT TO P & H                             
TABMDED  DS    F                   MISC DEDUCTION                               
TABPNH   DS    F                   PENSION & HEALTH                             
TABHNW   DS    F                   HEALTH & WELFARE                             
TABINR   DS    F                   INSURANCE & RETIREMENT                       
TABDUES  DS    F                   UNION DUES                                   
         DS    F                                                                
TABPDL   EQU   (*-TABGRS)          SHOULD BE SAME AS TAPDAMTL                   
TABENTRY EQU   TABPDL/L'TABGRS                                                  
*                                                                               
TABADVR  DS    F                   ADVANCE RECONCILIATION                       
TABCNTR  DS    F                   CORP/CANADIAN NON-TAXABLE REIMB              
*                                                                               
*        RETURNED BY TALIM                                                      
*                                                                               
TABTSUI  DS    F                   THIS CHECK'S SUI                             
*                                                                               
TABNYTD  DS    F                   NEW Y-T-D EARNINGS                           
TABNFUI  DS    F                       FUI                                      
TABNSUI  DS    F                       SUI                                      
TABNFICA DS    F                       FICA                                     
TABNMED  DS    F                       MEDICARE                                 
TABNTAX  DS    F                       MEDICARE                                 
*                                                                               
TABXAMT  DS    0F                  TAXABLE AMOUNTS AT EACH LEVEL                
TABXYTD  DS    F                           YTD                                  
TABXFUI  DS    F                           FUI                                  
TABXSUI  DS    F                           SUI                                  
TABXFICA DS    F                           FICA                                 
TABXMED  DS    F                           MEDICARE                             
TABXOMED DS    F                           OVER MEDICARE                        
*                                                                               
TABTAX   DS    F                   TAX                                          
TABHND   DS    F                   HANDLING                                     
TABHNDC  DS    F                   CORP HANDLING                                
TABFICR  DS    F                   FICA                                         
TABGST   DS    F                   GST                                          
TABBDL   EQU   (*-TABTAX)                                                       
*                                                                               
TABLEN   EQU   *-TABCHKD                                                        
TABCHKLN EQU   300                 N'CHECK RECORDS                              
         EJECT                                                                  
*                                                                               
*        PCODE TABLE DSECT                                                      
*                                                                               
PCODED   DSECT                                                                  
*                                                                               
PCACCT   DS    CL14                ACCOUNT                                      
PCCONT   DS    CL14                CONTRA ACCOUNT                               
PCDISP   DS    AL2                 DISPLACEMENT TO AMOUNT IN POSTTAB            
PCDRORCR DS    CL1                 DEBIT OR CREDIT                              
PCODELEN EQU   *-PCODED                                                         
         SPACE 2                                                                
*                                                                               
*        INVOICES ERROR TABLE DSECT                                             
*                                                                               
ERRINVD  DSECT                                                                  
*                                                                               
ERRAGY   DS    CL6                 AGENCY                                       
ERRINV   DS    PL6                 INVOICE NUMBER                               
ERRNUM   DS    XL1                 ERROR NUMBER                                 
ERRLEN   EQU   *-ERRINVD                                                        
         SPACE 2                                                                
*                                                                               
*        UNION THAT GET UNION COPIES                                            
*                                                                               
UNILCLD  DSECT                                                                  
*                                                                               
UNIUNI   DS    CL3                 UNION                                        
UNILCL   DS    CL3                 LOCAL                                        
UNILEN1  EQU   *-UNILCLD                                                        
UNITURN  DS    CL1                 TURNAOUND (Y/N)                              
UNINCPY  DS    CL1                 N'COPIES                                     
UNILEN   EQU   *-UNILCLD                                                        
*                                                                               
*        BNP UNION/LOCALS TO POST PNH                                           
*                                                                               
BNPD     DSECT                                                                  
*                                                                               
BNPUNI   DS    CL3                 UNION                                        
BNPLCL   DS    CL3                 LOCAL                                        
BNPAMT   DS    F                   AMOUNT                                       
BNPLEN   EQU   *-BNPD                                                           
*                                                                               
*        DATA SET (RETRO FILE) DSECT                                            
*                                                                               
DFD      DSECT                                                                  
*                                                                               
DFAGY    DS    CL6                 AGENCY                                       
DFINV    DS    CL6                 INVOICE                                      
DFLEN    EQU   *-DFD                                                            
         SPACE 3                                                                
*                                                                               
*        DSECT TO COVER TABLE OF AGENCIES THAT DON'T GET A SURCHARGE            
*                                                                               
NSURTABD DSECT                                                                  
NSURAGY  DS    CL6                 AGENCY                                       
NSURLNQ  EQU   *-NSURTABD                                                       
         SPACE 3                                                                
*                                                                               
*        DSECT TO COVER TABLES OF WRITER ROLE COMBINATIONS                      
*                                                                               
WROLTABD DSECT                                                                  
WROLCAT  DS    CL3                 CATEGORY                                     
WROLSTAT DS    XL1                 WRITER ROLE STATUS EQUATE                    
WROLCTEQ DS    XL1                 CATVAL CATEGORY EQUATE                       
WROLTABL EQU   *-WROLTABD                                                       
         SPACE 3                                                                
*                                                                               
*        DSECT TO COVER SUBSIDIARY INVOICES                                     
*                                                                               
SITABD   DSECT                                                                  
SITBPCT  DS    F                   PERCENTAGE                                   
         ORG   SITBPCT                                                          
SITBSTAT DS    X                   STATUS - SET FOR US/CAN COMBINED             
SITBPCT3 DS    XL3                 PERCENTAGE (4 DEC PLACES)                    
SITBTOT  DS    F                   INVOICE TOTAL                                
SITBINV  DS    XL6                 INVOICE                                      
SITBEST  DS    CL16                ESTIMATE                                     
SITBIFC  DS    CL(L'IFCLR)         PROD CLT INT INFO (IF DIFF)                  
SITBLEN  EQU   *-SITABD                                                         
*                                                                               
*                                                                               
*        DSECT TO COVER FORCED SUBSIDIARY INVOICE AMOUNTS                       
*                                                                               
FRCTBLD  DSECT                                                                  
FRCTBPD  DS    0CL(TABPDL)        CUMMUL TAPD AMTS - LNGTH S/B TAPDAMTL         
FRCGRS   DS    F                                                                
FRCAPPL  DS    F                                                                
FRCGUAR  DS    F                                                                
FRCPAYI  DS    F                                                                
FRCPAYC  DS    F                                                                
FRCREXP  DS    F                                                                
FRCSPNH  DS    F                                                                
FRCMDED  DS    F                                                                
FRCPNH   DS    F                                                                
FRCHNW   DS    F                                                                
FRCINR   DS    F                                                                
FRCDUES  DS    F                                                                
         DS    F                                                                
FRCTBBD  DS    0CL(TABBDL)         CUMMULATIVE TABD AMOUNTS                     
FRCTAX   DS    F                                                                
FRCHND   DS    F                                                                
FRCHNDC  DS    F                                                                
FRCFICR  DS    F                                                                
FRCGST   DS    F                                                                
FRCPST   DS    F                                                                
*                                                                               
FRCTBPG  DS    0CL(TAPGEND-TAPGHNDI) CUMMULATIVE TAPG AMOUNTS                   
FRCPHNDI DS    F                                                                
FRCPHPRI DS    F                                                                
FRCPHNDC DS    F                                                                
FRCPHPRC DS    F                                                                
FRCPHIAG DS    F                                                                
FRCPHIAP DS    F                                                                
FRCPHCAG DS    F                                                                
FRCPHCAP DS    F                                                                
FRCPFUTA DS    F                                                                
FRCPSUTA DS    F                                                                
FRCPFICA DS    F                                                                
FRCPMED  DS    F                                                                
FRCPWCN  DS    F                                                                
FRCPWCC  DS    F                                                                
FRCPWFEE DS    F                                                                
FRCPCGST DS    F                                                                
FRCPUGST DS    F                                                                
*                                                                               
FRCTOT   DS    F                                                                
FRCTBINV DS    XL6                 SUBSIDIARY INVOICE                           
FRCTBLEN EQU   *-FRCTBLD                                                        
*                                                                               
*                                                                               
*        DSECT TO COVER EPISODE TABLE                                           
*                                                                               
EPITABD  DSECT                                                                  
EPIAGY   DS    CL6                 AGENCY                                       
EPINUM   DS    XL2                 EPISODE NUMBER                               
EPIADT   DS    XL3                 AIR DATE                                     
EPITABL  EQU   *-EPITABD                                                        
*                                                                               
*                                                                               
*        DSECT TO COVER COMMENT FOR SOAP CABLE                                  
*                                                                               
CABLED   DSECT                                                                  
CABLABLE DS    CL7                 GRS/EPI LABLE                                
         DS    CL1                                                              
CABGRSE  DS    CL11                GRS/EPI AMOUNT                               
CABCOMMA DS    CL1                 COMMA                                        
         DS    CL1                                                              
CABEPIS  DS    CL52                EPISODE INPUT                                
CABLNQ   EQU   *-CABLED                                                         
*                                                                               
*                                                                               
*        DSECT TO COVER LOCK BOX TABLE                                          
*                                                                               
LOCKTABD DSECT                                                                  
LOCKCD   DS    CL1                 LOCK BOX CODE                                
LOCKLLEN DS    XL1                 LENGTH OF LITERAL TO PRINT                   
LOCKPDSP DS    H                   DISP FROM START OF PRINT LINE                
LOCKDATA DS    F                   A(LITERAL TO PRINT)                          
LOCKTBLQ EQU   *-LOCKTABD                                                       
*                                                                               
*                                                                               
*              DSECT FOR IFTAB                                                  
IFTABD   DSECT                                                                  
IFTAGY   DS    CL6                 AGENCY                                       
IFTTAX   DS    CL3                 WC OR RTN DISP (BYTES 1&2) FOR TAXES         
IFTHAND  DS    CL3                                 HANDLING                     
IFTPNH   DS    CL3                                 P&H                          
IFTREUSE DS    CL3                                 REUSE WAGES & MISC.          
IFTSESS  DS    CL3                                 SESSION                      
IFTNEXT  EQU   *                                                                
*                                                                               
*                                                                               
*              DSECT FOR TRNSNARR                                               
NARRD    DSECT                                                                  
NARCID   DS    CL12                CID                                          
         DS    CL1                                                              
NARQUOT1 DS    CL1                 " AROUND COMM'L NAME                         
NARCONME DS    CL36                COMM'L NAME                                  
NARQUOT2 DS    CL1                 "                                            
         DS    CL1                                                              
NARUSE   DS    CL16                USE TYPE                                     
         DS    CL1                                                              
NARDET1  DS    CL27                USE DETAILS                                  
         DS    CL1                                                              
NARDET2  DS    CL27                UPGRADE OR LIFT USE DETAILS                  
         DS    CL1                                                              
NARCYC   DS    CL17                CYCLE DATES                                  
         DS    CL1                                                              
NARLESS  DS    CL4                 "LESS"                                       
         DS    CL1                                                              
NARSESS  DS    CL7                 "SESSION"                                    
         DS    CL1                                                              
NARAND   DS    CL3                 "AND"                                        
         DS    CL1                                                              
NARHOLD  DS    CL11                "HOLDING FEE"                                
NARLNQ   EQU   *-NARRD                                                          
         EJECT                                                                  
*                                                                               
*              DSECT TO COVER BLOCK FOR TAXES                                   
         SPACE 1                                                                
TXTD     DSECT                                                                  
TXTXTTAB DS    XL256               EXTRA TAX TABLE: UNIT / TAX (42 MAX)         
TXPSTTAB DS    XL256                                                            
TXTDLNQ  EQU   *-TXTD                                                           
         SPACE 3                                                                
*                                                                               
*              DSECT TO COVER BLOCK EXTRA TAXES                                 
         SPACE 1                                                                
TXTABD   DSECT                                                                  
TXTABUN  DS    CL2                 UNIT                                         
TXTABTAX DS    XL4                 EXTRA TAXES FOR THIS UNIT                    
TXTABLNQ EQU   *-TXTABD                                                         
         SPACE 3                                                                
*                                                                               
*              DSECT TO COVER BLOCK POSTING TABLES                              
*                                                                               
TXPOSTTB DSECT                     ACCUMULATORS FOR TP OFFICE POSTINGS          
POSTTAB  DS    0F                                                               
TXPGRS1  DS    F                   TP GROSS                                     
TXPGRS2  DS    F                   NON TP GROSS                                 
TXPMISC  DS    F                   MISC                                         
TXPTAX1  DS    F                   TP TAX                                       
TXPTXFCR DS    F                   NON TP TAX                                   
TXPHAND  DS    F                   HANDLING                                     
TXPPNH   DS    F                   PNH                                          
TXPBNP   DS    F                   BNP PNH                                      
*                                                                               
TXPGMIR  DS    F                   CAN GROSS+MISC+I&R                           
TXPCHND  DS    F                       HANDLING                                 
TXPGST   DS    F                       GST                                      
TXPGSTC  DS    F                       GST ON HAND & I&R CAN$                   
TXPGSTU  DS    F                       GST ON HAND & I&R US$                    
TXPGSTD  DS    F                       GST DIFFERENCE                           
*                                                                               
TXPACOMM DS    F                   AGENCY COMMISSION                            
TXPCSF   DS    F                   CONTRACT SERVICE FEE                         
*                                                                               
TXPTXWA  DS    F                   WASHINGTON BO TAX                            
TXPTXHI  DS    F                   HAWAII EXCISE TAX                            
TXPTXCA  DS    F                   CALIFORNIA SUI SURCHARGE                     
TXPTXNY  DS    F                   NEW YORK SUI SURCHARGE                       
*                                                                               
TXPTXTR  DS    F                   TAXABLE REIMBURSEMENTS (P+)                  
         DS    4F                  SPARE                                        
TXPOSTLN EQU   *-TXPOSTTB                                                       
         EJECT                                                                  
       ++INCLUDE TAYTDTABD                                                      
         SPACE                                                                  
MAXYTD   EQU   5000                SEE TABIYTD                                  
         EJECT                                                                  
       ++INCLUDE TAYTDD                                                         
