*          DATA SET TABILLD    AT LEVEL 076 AS OF 07/10/17                      
*                                                                               
*        BILLING BLOCK                                                          
*                                                                               
BILLD    DSECT                                                                  
TBILLD   DS    0D                                                               
*                                                                               
TBDA     DS    XL4                 DISK ADDRESS                                 
TBTWAAGY DS    XL10                TWA SIGN ON AGENCY                           
*                                                                               
TBOFADDR DS    0CL120              OFFICE ADDRESS                               
TBOFADD1 DS    CL30                LINES 1 - 4                                  
TBOFADD2 DS    CL30                                                             
TBOFADD3 DS    CL30                                                             
TBOFADD4 DS    CL30                                                             
*                                                                               
TBADDR   DS    0CL120              GENERAL ADDRESS                              
TBADD1   DS    CL30                                                             
TBADD2   DS    CL30                                                             
TBADD3   DS    CL30                                                             
TBADD4   DS    CL30                                                             
*                                                                               
TBAYADDR DS    0CL120              AGY ADDRESS                                  
TBAYADD1 DS    CL30                AGENCY ADDRESS LINES 1- 4                    
TBAYADD2 DS    CL30                                                             
TBAYADD3 DS    CL30                                                             
TBAYADD4 DS    CL30                                                             
*                                                                               
TBCLADDR DS    0CL120              CLI ADDRESS                                  
TBCLADD1 DS    CL30                CLIENT ADDRESS LINES 1- 4                    
TBCLADD2 DS    CL30                                                             
TBCLADD3 DS    CL30                                                             
TBCLADD4 DS    CL30                                                             
*                                                                               
TBPRADDR DS    0CL120              PRD ADDRESS                                  
TBPRADD1 DS    CL30                PRODUCT ADDRESS LINES 1- 4                   
TBPRADD2 DS    CL30                                                             
TBPRADD3 DS    CL30                                                             
TBPRADD4 DS    CL30                                                             
*                                                                               
TBATADDR DS    0CL120              ATTN ADDRESS                                 
TBATADD1 DS    CL30                ATTENTION ADDRESS LINES 1- 4                 
TBATADD2 DS    CL30                                                             
TBATADD3 DS    CL30                                                             
TBATADD4 DS    CL30                                                             
*                                                                               
TBEMADDR DS    0CL120              EMPLOYER ADDRESS                             
TBEMADD1 DS    CL30                ATTENTION ADDRESS LINES 1- 4                 
TBEMADD2 DS    CL30                                                             
TBEMADD3 DS    CL30                                                             
TBEMADD4 DS    CL30                                                             
*                                                                               
TBOFNAME DS    CL36                OFFICE NAME                                  
TBAYNAME DS    CL36                AGENCY NAME                                  
TBCLNAME DS    CL36                CLIENT NAME                                  
TBPRNAME DS    CL36                PRODUCT NAME                                 
TBCONAME DS    CL36                COMMERCIAL TITLE                             
TBEMNAME DS    CL36                EMPLOYER OF RECORD NAME                      
*                                                                               
TBATTN   DS    CL36                ATTENTION NAME                               
TBATNAME DS    CL36                ATTN REC - ATTENTION NAME                    
TBAYATTN DS    CL36                AGY REC - ATTENTION NAME                     
TBCLATTN DS    CL36                CLI REC - ATTENTION NAME                     
TBPRATTN DS    CL36                PRD REC - ATTENTION NAME                     
TBATEND  EQU   *-TBATTN                                                         
*                                                                               
TBBYTE   DS    CL1                 WORK BYTE                                    
TBSVDTE  DS    PL3                 SAVED PWOS DATE                              
TBILLDTE DS    PL3                 SAVED BILL DATE PWOS                         
TBCKDTE  DS    PL3                 SAVED CHECK DATE PWOS                        
*                                                                               
TBRUNDTE DS    CL8                 RUN DATE    - DISPLAY                        
TBRUNEND DS    PL3                 END RUN DATE- PACKED                         
TBRUNSTR DS    PL3                 START RUN DATE- PACKED                       
TBHDTE   DS    PL3                 COD PRINT DATE                               
*                                                                               
TBTODAY  DS    PL3                 TODAY'S DATE- PACKED                         
TBSCHDTE DS    CL6                 START DATE  - YYMMDD                         
TBSPDATE DS    PL3                             - PACKED                         
TBEDDATE DS    CL8                 END   DATE  - DISPLAY                        
TBECHDTE DS    CL6                             - YYMMDD                         
TBEPDATE DS    PL3                             - PACKED                         
*                                                                               
TBATT    DS    CL2                 ATTENTION CODE                               
TBPRD    DS    CL6                 PRODUCT CODE                                 
*                                                                               
TBTPO    DS    CL1                 TALENT PARTNERS OFFICE CODE                  
TBAYCOPY DS    CL1                 NUMBER OF BILLING COPIES                     
NOBIPTR  DS    CL1                 FLAG - NO OPEN ITEM POINTER EXISTS           
*                                                                               
TBINV    DS    CL6                 INVOICE NUMBER                               
TBTPC    DS    CL8                 TP PAYER                                     
TBQC     DS    CL8                 QUALITY CONTROL                              
*                                                                               
TBAIR    DS    PL3                 FIRST AIR DATE                               
TBFCYC   DS    PL3                 FIRST FIXED CYCLE                            
*                                                                               
TBEST    DS    CL16                ESTIMATE NUMBER                              
TBPER    DS    CL1                 PERIOD                                       
TBPO     DS    CL16                PO NUMBER                                    
TBVEN    DS    CL12                VENDOR                                       
*                                                                               
TBUNI1   DS    CL3                 UNIONS                                       
TBLOC1   DS    CL3                 LOCALS                                       
TBACC1   DS    CL12                ACCOUNT NUMBER                               
TBLCNAM1 DS    CL16                LOCAL NAME                                   
TBLCSSN1 DS    CL9                 IF LOCAL HAS H & W - SS NUMBER               
LOCINFLN EQU   *-TBUNI1            LENGTH OF ALL INFO FROM UNION LOCAL          
*                                                                               
TBUNI2   DS    CL3                                                              
TBLOC2   DS    CL3                                                              
TBACC2   DS    CL12                                                             
TBLCNAM2 DS    CL16                                                             
TBLCSSN2 DS    CL9                                                              
TBUNI3   DS    CL3                                                              
TBLOC3   DS    CL3                                                              
TBACC3   DS    CL12                                                             
TBLCNAM3 DS    CL16                                                             
TBLCSSN3 DS    CL9                                                              
TBALLUNI EQU   *-TBUNI1                                                         
*                                                                               
TBAREA1  DS    0C                                                               
SBYTE    DS    CL1                 INVOICE STATUS BYTE                          
TBISTAT  DS    XL1                 INVOICE TAPD STATUS BYTE                     
TBISTA2  DS    XL1                 INVOICE TAPD SECOND STATUS BYTE              
TBIPST2  DS    XL1                                                              
TBPSTAT  DS    CL1                 INVOICE PAYMENT STATUS BYTE                  
TBMED    DS    CL1                 COMMERCIAL MEDIA CODE                        
TBSEC    DS    XL1                 COMMERCIAL LENGTH                            
TBCOTYPE DS    CL1                 COMMERCIAL TYPE                              
TBCOEXP  DS    PL3                 COMMERCIAL EXPIRATION DATE                   
TBPRTINV DS    CL1                 PRINT INVOICE Y/N                            
TBPHFFNM DS    CL16                PRINT COMM'L - PHOTOGRAPHER FF NAME          
TBAREA   DS    CL3                 PRINT - AREA                                 
TBPUSE   DS    CL3                 PRINT - USE                                  
TBPHOTO  DS    CL9                 PRINT - PHOTOGRAPHER SSN                     
*                                                                               
TBVERS   DS    C                   VERSION CODE                                 
TBVERSID DS    CL12                VERSION ID                                   
         ORG   TBVERS                                                           
TBLSEC   DS    XL1                 LIFT LENGTH                                  
TBLID    DS    CL12                LIFT ID                                      
TBTID    DS    CL2                 TRACK ID                                     
TBTLN    DS    XL1                 TRACK LENGTH                                 
TBPAY    DS    CL7                 PAY TYPE                                     
TBUSE    DS    CL7                 USE TYPE                                     
TBTYPE   DS    CL1                 TYPE OF PAYMENT FOR USE                      
TBCWKS   DS    CL1                 CYCLE WEEKS                                  
*                                                                               
TBCDTS   DS    PL6                 CYCLE DATES (2 DATES - PACKED)               
TBMAJ    DS    X                   MAJORS                                       
TBUPMAJ  DS    X                   UPGRADE MAJORS                               
TBUNITS  DS    H                   UNITS                                        
TBUPUNIT DS    H                   UPGRADE UNITS                                
TBSTUS   DS    H                   START USE NUMBER                             
TBUSES   DS    H                   NUMBER USES TO MAIN COMM'L                   
TBSTUL   DS    H                   START USE NUMBER FOR LIFT ONLY               
TBUSEL   DS    H                   NUMBER USES TO LIFT                          
*                                                                               
TBFDAT   DS    CL6                 FILM DATE                                    
TBFSTUD  DS    CL12                FILM STUDIO                                  
TBFCITY  DS    CL12                FILM CITY                                    
TBFSTAT  DS    CL2                 FILM STATE                                   
TBFCTRY  DS    CL2                 FILM COUNTRY                                 
         ORG   TBFDAT                                                           
TBSDAT   DS    CL6                 SHOOT DATE                                   
TBSSTUD  DS    CL12                SHOOT STUDIO                                 
TBSCITY  DS    CL12                SHOOT CITY                                   
TBSSTAT  DS    CL2                 SHOOT STATE                                  
TBSCTRY  DS    CL2                 SHOOT COUNTRY                                
*                                                                               
TBRDAT   DS    CL6                 RECORDING DATE                               
TBRSTUD  DS    CL12                RECORDING STUDIO                             
TBRCITY  DS    CL12                RECORDING CITY                               
TBRSTAT  DS    CL2                 RECORDING STATE                              
TBRCTRY  DS    CL2                 RECORDING COUNTRY                            
*                                                                               
TBMDAT   DS    CL6                 MUSIC DATE                                   
TBMSTUD  DS    CL12                MUSIC STUDIO                                 
TBMCITY  DS    CL12                MUSIC CITY                                   
TBMSTAT  DS    CL2                 MUSIC STATE                                  
TBMCTRY  DS    CL2                 MUSIC COUNTRY                                
TBFRMLN  EQU   *-TBFDAT                                                         
*                                                                               
TBCONT   DS    0CL48               CONTRACTS                                    
TBCON1   DS    CL12                                                             
TBCON2   DS    CL12                                                             
TBCON3   DS    CL12                                                             
TBCON4   DS    CL12                                                             
USEX     EQU   *-TBMED                                                          
*                                                                               
TBSICNT  DS    XL1                 NUM OF SUBSIDIARY INVOICE ELEMENTS           
AREA1X   EQU   *-TBAREA1                                                        
*                                                                               
TBCOM    DS    CL60                COMMENTS                                     
TBCOM2   DS    CL73                EXTRA COMMENT LINE                           
TBCOMX   EQU   *-TBCOM                                                          
*                                                                               
DEFSTATE DS    CL3                 DEFAULT TAXABLE STATE                        
*                                                                               
*        AGENCY'S BILLING RULES INFO                                            
*                                                                               
AYBTYPE  DS    CL1                 BILLING TYPE                                 
AYSTAT   DS    XL1                 STATUS                                       
AYTYPO   DS    XL1                 POOL STATUS                                  
AYRECV   DS    CL12                RECIEVABLE ACCOUNT                           
AYRFUTA  DS    XL2                 EOR UP TO FUTA MAX RATE                      
AYRSUTA  DS    XL2                 EOR UP TO SUTA MAX RATE                      
AYRFICA  DS    XL2                 EOR UP TO FICA MAX RATE                      
AYROVER  DS    XL2                 EOR OVER FICA MAX RATE                       
AYRIFIC  DS    XL2                 INC FICA RATE                                
AYRHAND  DS    XL2                 HANDLING FEE                                 
AYRCAN   DS    XL2                 CANADIAN TAX                                 
AYRWCRP  DS    XL2                 WC ON CORPS                                  
*YHRULE  DS    XL1                 HANDLING RULES                               
*        DS    XL4                 SPARE                                        
AYBINFO  EQU   *-AYBTYPE                                                        
*                                                                               
*        CLIENT'S BILLING RULES INFO                                            
*                                                                               
CLBTYPE  DS    CL1                 BILLING TYPE                                 
CLSTAT   DS    XL1                 STATUS                                       
CLTYPO   DS    XL1                 POOL STATUS                                  
CLRECV   DS    CL12                RECIEVABLE ACCOUNT                           
CLRFUTA  DS    XL2                 EOR UP TO FUTA MAX RATE                      
CLRSUTA  DS    XL2                 EOR UP TO SUTA MAX RATE                      
CLRFICA  DS    XL2                 EOR UP TO FICA MAX RATE                      
CLROVER  DS    XL2                 EOR OVER FICA MAX RATE                       
CLRIFIC  DS    XL2                 INC FICA RATE                                
CLRHAND  DS    XL2                 HANDLING FEE                                 
CLRCAN   DS    XL2                 CANADIAN TAX                                 
CLRWCRP  DS    XL2                 WC ON CORPS                                  
*LHRULE  DS    XL1                 HANDLING RULES                               
*        DS    XL4                 SPARE                                        
CLBINFO  EQU   *-CLBTYPE                                                        
*                                                                               
*        GENERAL BILLING RULES INFO                                             
*                                                                               
GTYPE    DS    CL1                 BILLING TYPE                                 
GSTAT    DS    XL1                 STATUS                                       
GTYPO    DS    XL1                 POOL STATUS                                  
GRECV    DS    CL12                RECIEVABLE ACCOUNT                           
GRFUTA   DS    XL2                 EOR UP TO FUTA MAX RATE                      
GRSUTA   DS    XL2                 EOR UP TO SUTA MAX RATE                      
GRFICA   DS    XL2                 EOR UP TO FICA MAX RATE                      
GROVER   DS    XL2                 EOR OVER FICA MAX RATE                       
GRIFIC   DS    XL2                 INC FICA RATE                                
GRHAND   DS    XL2                 HANDLING FEE                                 
GRCAN    DS    XL2                 CANADIAN TAX                                 
GRRWCRP  DS    XL2                 WC ON CORPS                                  
*RHRULE  DS    XL1                 HANDLING RULES                               
*        DS    XL4                 SPARE                                        
GINFO    EQU   *-GTYPE                                                          
*                                                                               
TBUNCOPY DS    CL1                 NUMBER OF UNION COPIES                       
CLIINT   DS    CL1                 CLIENT LEVEL INTERFACE                       
*                                                                               
*        AMOUNTS FROM INVOICE REC                                               
*                                                                               
TGROSS   DS    F                   GROSS                                        
TAPPL    DS    F                   APPLIED CREDITS                              
TGUAR    DS    F                   GUARANTEE CREDITS                            
TPAYI    DS    F                   INDIVIDUAL PAYMENT                           
TPAYC    DS    F                   CORPORATE PAYMENT                            
TREXP    DS    F                   REIMBURSED EXPENSES                          
TSPNH    DS    F                   SUBJECT TO P & H                             
TMDED    DS    F                   MISC DEDUCTION                               
TPNH     DS    F                   PENSION & HEALTH                             
THNW     DS    F                   HEALTH & WELFARE                             
TINR     DS    F                   INSURANCE & RETIREMENT                       
TDUES    DS    F                   UNION DUES                                   
TGCON    DS    F                   GUARANTEE CONTRACT CREDITS                   
TACOMM   DS    F                   AGENCY COMMISSION                            
TASIGN   DS    F                   SIGNATORY FEE                                
TCSF     DS    F                   CONTRACT SERVICE FEE                         
PDAMTS   EQU   *-TGROSS            L'PAY DETAIL EL AMTS (S/B TAPDAMTL)          
*                                                                               
*        TOTALED AMOUNTS FROM CHECK RECORDS                                     
*                                                                               
TBGRS     DS    F                   GROSS                                       
TBAPPL    DS    F                   APPLIED CREDITS                             
TBGUAR    DS    F                   GUARANTEE CREDITS                           
TBPAYI    DS    F                   INDIVIDUAL PAYMENT                          
TBPAYC    DS    F                   CORPORATEPAYMENT                            
TBREXP    DS    F                   REIMBURSED EXPENSES                         
TBSPNH    DS    F                   SUBJECT TO P & H                            
TBMDED    DS    F                   MISC DEDUCTION                              
TBPNH     DS    F                   PENSION & HEALTH CONTRIBUTION               
TBHNW     DS    F                   HEALTH & WELFARE                            
TBINR     DS    F                   INSURANCE & RETIREMENT                      
TBDUES    DS    F                   UNION DUES                                  
          DS    F                                                               
NTBLAMT   EQU   (*-TBGRS)/4                                                     
LAMTS     EQU   (*-TBGRS)          S/B SAME AS TAPDAMTL                         
*                                                                               
TBGPAY1   DS    F                   GROSS PAYMENT BY LOCAL                      
TBGPAY2   DS    F                                                               
TBGPAY3   DS    F                                                               
TBGPAY4   DS    F                                                               
*                                                                               
TBPNH1    DS    F                   PENSION & HEALTH CONTRIBUTION               
TBPNH2    DS    F                           BY LOCAL                            
TBPNH3    DS    F                                                               
TBPNH4    DS    F                                                               
*                                                                               
TBHNW1    DS    F                   HEALTH & WELFARE                            
TBHNW2    DS    F                         BY LOCAL                              
TBHNW3    DS    F                                                               
TBHNW4    DS    F                                                               
PAYAMT    EQU   *-TBGPAY1                                                       
*                                                                               
TBGROSS  DS    F                   GROSS WAGES                                  
TBGM     DS    F                   GROSS + MISC PAYMENT                         
TBCONTR  DS    F                   CONTRIBUTION                                 
TBTAX    DS    F                   PAYROLL TAXES                                
TBHANDI  DS    F                   INDIVIDUAL HANDLING                          
TBHANDC  DS    F                   CORPORATE HANDLING                           
TBSTOT   DS    F                   SUBTOTAL                                     
TBTOT    DS    F                   TOTAL                                        
AMTS     EQU   *-TGROSS                                                         
*                                                                               
*                  AMOUNTS IN CAN$                                              
TBCANAMT DS    0F                  CANADIAN AMOUNTS                             
TBCSTOT  DS    F                   SUB TOTAL                                    
TBCHAND  DS    F                   HANDLING                                     
TBCANPNH DS    F                   PNH                                          
TBCGST   DS    F                   GST                                          
TBCGST2  DS    F                   GST ON HANDLING & I&R                        
TBCACTWK DS    F                   ACTRAWORKS AMOUNT                            
*                  AMOUNTS IN US$                                               
TBGMINR  DS    F                   WAGES & MISC & INR & GST                     
TBCHANDU DS    F                   HANDLING                                     
TBCPNHU  DS    F                   PNH                                          
TBGSTU   DS    F                   GST                                          
TBGSTU2  DS    F                   GST ON HANDLING & INR                        
TBACTWKU DS    F                   ACTRAWORKS AMOUNT                            
*                                                                               
TBDIFGST DS    F                   DIFFERENCE                                   
*                  PST                                                          
TBCPST   DS    F                   PST                                          
CAMTS    EQU   *-TBCANAMT                                                       
*                                                                               
AMTS2    EQU   *-TBGROSS                                                        
*                                                                               
*        ADDRESSES OF TWADCON ROUTINES                                          
*                                                                               
AMASTD   DS    A                   A(MASTER)                                    
ALOGO    DS    A                   A(LOGO)                                      
ALOGOC   DS    A                   A(LOGOC)                                     
*                                                                               
*        ADDRESSES OF SAVED POINTER BLOCKS                                      
*                                                                               
ASPBLK   DS    A                   A(SAVED PASSIVE POINTERS BLOCK)              
AAPBLK   DS    A                   A(ADD PASSIVE POINTERS BLOCK)                
PPBLOCKL EQU   3072                SIZE OF EACH PP BLOCK                        
*                                                                               
*        TABLE ADDRESSES                                                        
*                                                                               
ASRTINVT DS    A                   A(SORT INVOICE TABLE)                        
ASRTINVX DS    A                   A(LAST ENTRY IN SORT TABLE)                  
ANXTINV  DS    A                   A(NEXT ENTRY IN SORT TABLE)                  
ANXTCHK  DS    A                   A(NEXT ENTRY IN CHECK TABLE)                 
ANXTNET  DS    A                   A(NEXT ENTRY IN NETWRK TABLE)                
ANXTERR  DS    A                   A(NEXT ENTRY IN ERROR TABLE)                 
ANXTBYTD DS    A                   A(NEXT ENTRY IN YTD TABLE)                   
LASTBYTD DS    A                   A(LAST ENTRY IN YTD TABLE)                   
ANXTUNI  DS    A                   A(NEXT ENTRY IN UNION TABLE)                 
ANXTBNP  DS    A                   A(NEXT ENTRY IN BNP TABLE)                   
AEMPIO   DS    A                   A(EMPLOYER IO AREA)                          
ACHKTAB  DS    A                   A(CHECK TABLE)                               
AYTDTAB  DS    A                   A(YTD TABLE)                                 
AYTDTABX DS    A                   A(END YTD TABLE)                             
ATAYTD   DS    A                   A(TAYTD TABLE)                               
ATHISYTD DS    A                   A(CURRENT ENTRY IN YTD TABLE)                
ATHISCHK DS    A                   A(CURRENT ENTRY IN CHECK TABLE)              
*                                                                               
ATALIM   DS    A                   A(TALIM WORKING STORAGE)                     
*                                                                               
*        MISC VARIABLES                                                         
*                                                                               
TOTGRS   DS    F                   TOTALED GROSS OF CHECKS                      
TOTMISC  DS    F                   TOTALED MISC DED OF CHECKS                   
TOTCINR  DS    F                   TOTALED CANADIAN I&R                         
FICR     DS    F                   FICA CREDITS                                 
TFULL    DS    F                   TEMPORARY STORAGE                            
TXAMT    DS    F                   TAXABLE AMOUNT                               
TOTTXNW  DS    F                   TOTALED TAXABLE NON WAGES                    
TOTNTXNW DS    F                   TOTALED NON TAXABLE NON WAGES                
EAMTS    EQU   *-TOTGRS                                                         
*                                                                               
         DS    H                                                                
RECN     DS    H                   NUMBER OF RECORDS IN SORT                    
SVCKNUM  DS    H                   NUMBER OF CHECK RECORDS - SAVED              
SVCKNUM2 DS    H                                                                
SVCKNUM3 DS    H                                                                
CKREC    DS    H                   NUMBER OF CHECK RECORDS                      
CKREC2   DS    H                   NUMBER OF DOUBLE LINES                       
CKREC3   DS    H                   NUMBER OF LINES FOR AFM SUMMARY              
MIDLNS   DS    H                   NUMBER OF LINES TO MIDDLE BOX LINE           
*                                                                               
SVDA     DS    XL4                 SAVED DISK ADDRESS                           
SVST     DS    XL2                 SAVED RECORD STATUS                          
SVKEY    DS    CL38                SAVED KEY                                    
SVCLI    DS    CL6                       CLIENT                                 
SVOPT1   DS    XL1                 OPTIONS FROM TAPD                            
SVOPT2   DS    XL1                                                              
*                                                                               
TEMP     DS    CL6                 TEMPORARY STORAGE                            
STDATE   DS    CL3                 REQUESTED START DATE                         
ENDATE   DS    CL3                 REQUESTED END DATE                           
LASTTPO  DS    CL1                 LAST TPO OFFICE READ                         
FTIME    DS    CL1                 FIRST TIME THROUGH BILLING                   
*                                                                               
STATUS   DS    XL1                 COUNTER STATUS BYTE                          
STBNP    EQU   X'80'               BNP INVOICE                                  
STCOD    EQU   X'40'               COD INVOICE                                  
STURG    EQU   X'20'               URGENT INVOICE                               
STREG    EQU   X'10'               REGULAR INVOICE                              
STERR    EQU   X'08'               INVOICE IN ERROR                             
STCRDT   EQU   X'04'               CREDIT INOICE                                
STOCCR   EQU   X'02'               OVERRIDE CAN/EURO CONVERSION RATE            
STNOP    EQU   X'01'               COD REL NO PRINT INVOICE                     
*                                                                               
STAT2    DS    CL1                 INTERNAL STATUS BYTE                         
STCORP   EQU   X'80'               CORP ON INVOICE                              
STAPPLS  EQU   X'40'               SESSION APPLIED ON A CAST MEMBER             
STAPPLH  EQU   X'20'               HOLD APPLIED ON A CAST MEMBER                
STAVERS  EQU   X'10'               INVOICE FOR COMMERCIAL VERSION               
STOPEN   EQU   X'08'               OPEN TAPE (EMS ONLY)                         
STCLOSE  EQU   X'04'               CLOSE TAPE (EMS ONLY)                        
STCSF    EQU   X'02'               CHARGE CSF FEE                               
STCSFC   EQU   X'01'               CANCELING CSF FEE                            
*                                                                               
LENKEY   DS    XL1                 LENGTH OF KEY FOR COMPARE                    
*                                                                               
COUNT1   DS    0X                  COUNTERS                                     
PRCOLL   DS    XL1                 WHICH XTRA AMTS WERE PRINTED                 
PRCOLR   DS    XL1                 & ON WHICH SIDE WERE THEY PRINTED            
CPNH     EQU   X'80'                                                            
CHNW     EQU   X'40'                                                            
CMDED    EQU   X'20'                                                            
CINR1    EQU   X'10'                                                            
CINR2    EQU   X'08'                                                            
*                                                                               
LEFTHED  DS    XL1                 N'LINES NEEDED FOR LEFT HEADLINE             
RIGHTHED DS    XL1                 N'LINES NEEDED FOR RIGHT HEADLINE            
HEADLINE DS    XL1                 N'LINES NEEDED FOR HEADLINE                  
TOTALHED DS    XL1                 N'LINES NEEDED FOR HEADLINE+NWK PGMS         
CENTHED  DS    XL1                 N'LINES NEEDED FOR NETWORK PGMS              
NPAGES   DS    XL1                 N'PAGES PER INVOICE                          
PGNUM    DS    XL1                 CURRENT PAGE NUMBER                          
COPY     DS    XL1                 COPY NUMBER                                  
NUMUNI   DS    XL1                 NUMBER OF UNIONS                             
LSTAT    DS    XL1                 FLAG - LINE STATUS                           
PRB      EQU   X'80'                      MID LINE FOR CHECK TABLE              
PRB2     EQU   X'40'                      MID LINE FOR CHECK TABLE              
CHK      EQU   X'20'                      TOP LINE FOR CHECK TABLE              
ITOT     EQU   X'10'                      TOP LINE FOR INVOICE TOTAL            
CENT     EQU   X'08'                      TOP LINE FOR CLASS A TABLE            
COUNTX   EQU   *-COUNT1                                                         
*                                                                               
UNICOPY  DS    CL1                 UNION COPY FLAG                              
*                                                                               
INTXCLI  DS    CL1                 EXCLUDE CLIENT FROM INTERFACE                
INTFACE  DS    CL1                 ON/NOT ON PRODUCTION INTERFACE               
OPEN     DS    CL1                 WORKER FILE OPEN                             
*                                                                               
FLAG     DS    CL1                 FLAGS                                        
PRATTN   DS    CL1                 FLAG - WAS ATTN NAME ALREADY PRINTED         
DONE     DS    CL1                        RHS DONE PRINTING                     
SUBDONE  DS    CL1                        SUBTOTALS DONE PRINTING               
UPMAJFL  DS    CL1                        THERE ARE MAJOR UPGRADES              
READPTR  DS    CL1                        OPEN PTRS READ                        
CSWITCH  DS    CL1                        SWITCH/UPDATE CAST/COMMERCIAL         
TBNPOST  DS    CL1                        DO NOT POST INVOICE                   
*                                                                               
INV      DS    CL1                        INVOICE NUMBER                        
DAT      DS    CL1                        DATE                                  
CDAT     DS    CL1                        CHECK DATE                            
EST      DS    CL1                        ESTIMATE                              
PO       DS    CL1                        PO  NUMBER                            
VEN      DS    CL1                        VENDOR                                
MED      DS    CL1                        MEDIA                                 
CPY      DS    CL1                        COPY OF BILL                          
LEN      DS    CL1                        COMML LENGTH                          
PAY      DS    CL1                        PAY TYPE                              
USET     DS    CL1                        USE TYPE                              
CWK      DS    CL1                        CYCLE WEEKS                           
CWS      DS    CL1                        CYCLE WKS DATES                       
MAIN     DS    CL1                        MAIN USES                             
LUSE     DS    CL1                        LIFT USES                             
UPMAJ    DS    CL1                        UPGRADE MAJORS                        
MAJ      DS    CL1                        MAJORS                                
INSERT   DS    CL1                        INSERTS                               
*                                                                               
TAX      DS    CL1                        PAYROLL TAXES PRINTED ALREADY         
PNH      DS    CL1                        P & H CONTRIBUTION                    
INR      DS    CL1                        I & R CONTRIBUTION                    
FCR      DS    CL1                        FICA CREDITS                          
SUB      DS    CL1                        SUBTOTAL PRINTED ALREADY              
HND      DS    CL1                        HANDLING PRINTED ALREADY              
USUB     DS    CL1                        US SUBTOTAL                           
SBT      DS    CL1                        SUBTOTAL (CANADIAN)                   
GST      DS    CL1                        GST (CANADIAN)                        
ACTWRK   DS    CL1                        ACTRAWORKS                            
*                                                                               
PHOTO    DS    CL1                        PHOTOGRAPHER                          
PAREA    DS    CL1                        AREA                                  
USE      DS    CL1                        USE                                   
SIGN     DS    CL1                        SIGNATORY                             
PARDYST  DS    XL1                        PRINTED ALREADY STATUS                
PARDYACM EQU   X'80'                        AGENCY COMMISSION                   
PARDYSGF EQU   X'40'                        SIGNATORY FEE                       
PARDYCSF EQU   X'20'                        CONTRACT SERVICE FEE                
EMSF     DS    CL1                        EMS FEE PRINTED ALREADY               
FLAGX    EQU   *                                                                
ERRSTAT  DS    XL1                 FLAG - WAS THERE AN ERROR                    
*                                                                               
*        LAST INVOICE'S VALUES                                                  
*                                                                               
LAGY     DS    CL6                 PREVIOUS INVOICE'S AGENCY                    
LEOR     DS    CL3                 PREVIOUS INVOICE'S EMP OF RECORD             
LCLI     DS    CL6                 PREVIOUS INVOICE'S CLIENT                    
LPRD     DS    CL6                 PREVIOUS INVOICE'S PRODUCT                   
LCID     DS    CL12                PREVIOUS INVOICE'S COMMERCIAL ID             
LATT     DS    CL2                 PREVIOUS INVOICE'S ATTENTION NAME            
LPCLI    DS    CL3                 PREVIOUS INVOICE'S PROD CLIENT               
LINFO    EQU   *                                                                
*                                                                               
WCS      DS    0CL14                                                            
FEEWC    DS    CL2                                                              
PNHWC    DS    CL2                                                              
HNWWC    DS    CL2                                                              
TNHWC    DS    CL2                                                              
CSFWC    DS    CL2                                                              
HANDWC   DS    CL2                                                              
TAXWC    DS    CL2                                                              
*                                                                               
IFAYR    DS    CL250               AGENCY INTERFACE ELEMENT                     
*                                                                               
IFCLR    DS    CL250               CLIENT INTERFACE ELEMENT                     
*                                                                               
TBCID2   DS    CL12                2ND CID FOR SOC USE                          
*                                                                               
PERFSTAT DS    XL1                 PERFORMER STATUS BYTE                        
PERFSTAG EQU   X'80'               TAG PRINTED ON FIRST LINE (TG=)              
*                                                                               
TBCLI    DS    CL6                 CLIENT CODE FROM INVOICE                     
*                                                                               
STAT3    DS    CL1                 INTERNAL STATUS BYTE                         
STCSFCR  EQU   X'80'               CREDITING CSF FEE                            
STSPTAOS EQU   X'40'               ACCIDENT ON SET ON FOR SPLITS                
STCSFPST EQU   X'20'               CSF WAS POSTED                               
STCLPRTQ EQU   X'10'               CLOSE PRINT QUEUE                            
*                                                                               
PRODRECS DS    PL6                                                              
PRODCASH DS    PL6                                                              
*                                                                               
CTAMTS   DS    0F                                                               
CTGROSS  DS    F                   TOTAL GROSS WAGES                            
CTMISC   DS    F                   TOTAL MISC PAYMENTS                          
CTTOTAL  DS    F                   TOTAL                                        
CTRCVBL  DS    F                   RECEIVABLE TOTALS                            
NCTAMTS  EQU   ((*-CTAMTS)/4)                                                   
*                                                                               
*                                                                               
*        PRODUCTION INTERFACE INFO                                              
*                                                                               
AMOUNT   DS    F                                                                
SVACC    DS    CL15                                                             
SVACC2   DS    CL15                                                             
ACC      DS    CL15                THESE FIELDS FILLED IN BEFORE                
SUBAC    DS    CL15                GOING TO POST ROUTINE                        
SUBNAME  DS    CL36                                                             
DRORCR   DS    CL1                                                              
INTHEXC  DS    XL1                 CURRENT AGENCY'S HEXCOMP                     
FLCOUNT  DS    XL2                 FLIST COUNTER                                
*                                                                               
EMSRATES DS    0XL8                EMS BILLING RATES                            
EMSSESS  DS    XL2                 PAYROLL TAX ON SESSIONS                      
EMSRESI  DS    XL2                 PAYROLL TAX ON RESIDUALS                     
EMSHAND  DS    XL2                 HANDLING RATE                                
EMSEMSF  DS    XL2                 EMS FEE                                      
*                                                                               
EMSTOT   DS    F                   EMS TOTALS                                   
EMSTTAX  DS    F                   EMS TOTAL PAYROLL TAX                        
EMSTHND  DS    F                   EMS TOTAL HANDLING                           
EMSTEMS  DS    F                   EMS TOTAL EMS FEE                            
*                                                                               
AGYEMSRT DS    XL8                 AGENCY EMS BILLING RATES                     
*                                                                               
HNWFUND  DS    F                   TOTAL HNW WHEN UNI/LOC HAS FUND-EMS          
AOSAMT   DS    F                   AOS CHECK AMOUNT                             
AOSBASE  DS    F                   AOS BASE AMOUNT                              
*                                                                               
BOVRSTAT DS    XL1                 BOVER STATUS                                 
BOVRHNDB EQU   X'80'               BASIC HANDLING OVERRIDE                      
BOVRHNDP EQU   X'40'               PREM HANDLING OVERRIDE                       
BOVRHNDC EQU   X'20'               CAN HANDLING OVERRIDE                        
BOVRTAX  EQU   X'10'               TAX OVERRIDE                                 
*                                                                               
EVNTSTAT DS    CL1                 EVENT STATUS                                 
EVNTPSUI EQU   X'80'               EVENT PROCESSED SUI FOR EACH UNIT            
*                                                                               
NARRLEN  DS    CL1                                                              
SUBWORK  DS    CL2                                                              
MNTH     DS    CL2                 MONTH FOR PRODUCTION INTERFACE               
*                                                                               
ID       DS    CL16                ID FOR POSTINGS                              
ID2      DS    CL16                                                             
TBVINV   DS    PL6                 INVOICE NUMBER                               
TBVCOM   DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TBBTC    DS    CL2                 BILL TO CODE                                 
*                                                                               
MEMO     DS    CL85                                                             
TBSIGN   DS    CL6                 SIGNATORY CODE                               
*                                                                               
SIGNINFO DS    0XL6                                                             
SIGNRATE DS    XL2                 SIGNATORY RATE                               
SIGNCAP  DS    XL4                 SIGNATORY CAP                                
*                                                                               
TBACTYPE DS    CL1                 COMMERCIAL ACTRA TYPE                        
TBACTEXP DS    XL3                 ACTRA EXPIRY DATE                            
*                                                                               
AOSPSTRT DS    XL4                 AOS PST RATE                                 
AOSPST   DS    XL4                 AOS PST                                      
*                                                                               
POSTBLK  DS    0A                                                               
AAGYTARA DS    A                   A(AGENCY BILLING RATES ELEMENT)              
ACLITARA DS    A                   A(CLIENT BILLING RATES ELEMENT)              
ACURTARA DS    A                   A(CURRENT BILLING RATES ELEMENT)             
ACPYTARA DS    A                   A(COPY BILLING RATES ELEMENT)                
ACURTAPG DS    A                   A(CURRENT POSTING DETAILS ELEMENT)           
PBLNQ    EQU   (TARALNQ*4)+TAPGLNQ                                              
*                                                                               
YTDWSPNH DS    F                   YTD SOAP SUBJ TO P&H FOR WRITERS             
*                                                                               
ATAXDSCT DS    A                   A(TAX DSECT)                                 
*                                                                               
AYSTSIG  DS    XL1                 AGENCY STAT SIGNATORY                        
TNHOPT   DS    XL1                 TNH POSTINGS OPTIONS                         
TNHTOG   EQU   X'80'               ADD TAX AND HANDLING                         
TNHTAX   EQU   X'40'               POST TAX AND HANDLING SEPARATELY             
TNHHAND  EQU   X'20'                                                            
*                                                                               
COUNTED  DS    CL1                 THIS INVOICE WAS COUNTED ALREADY             
LASTPG   DS    CL1                 FLAG - LAST PAGE BEING PRINTED               
*                                                                               
COUNTS   DS    0PL4                                                             
REGINV   DS    PL4                                                              
NOPINV   DS    PL4                                                              
BNPINV   DS    PL4                                                              
CODINV   DS    PL4                                                              
URGINV   DS    PL4                                                              
NYPINV   DS    PL4                                                              
ERRINVC  DS    PL4                                                              
NCOUNTS  EQU   (*-COUNTS)/L'COUNTS                                              
*                                                                               
UNITTYP  DS    CL2                  UNIT/LEDGER FOR POSTINGS                    
*                                                                               
UNIONS   DS    15CL6                THE UNIONS ON AN INVOICE                    
ULLEN    EQU   *-UNIONS                                                         
UNILST   EQU   *                                                                
*                                                                               
UNIFILT  DS    CL1                 WHICH UNIONS TO FILTER ON                    
CUNION   DS    CL3                 CURRENT UNION                                
CLOCAL   DS    CL3                 CURRENT LOCAL                                
*                                                                               
*        INFO FOR SE/SR POSTINGS                                                
*                                                                               
SWPOST   DS    CL1                 WHICH POSTINGS ARE WE DOING                  
POSTPROD EQU   1                   POST PRODUCTION POSTINGS                     
POSTRCV  EQU   2                   POST RECEIVABLE POSTINGS                     
POSTSUMM EQU   3                   POST SUMMARY POSTINGS                        
*                                                                               
TPHEX    DS    XL1                 BILLING HEXCOMP                              
TPUSER   DS    CL6                 BILLING USER ID                              
TPORIG   DS    XL10                TALENT PARTNERS ORIG                         
TALRECS  DS    PL6                 # OF INVOICES                                
TALCASH  DS    PL6                 TOTAL CASH FOR TP OFFICE                     
TEMP2    DS    XL6                 TEMPORARY STORAGE                            
*                                                                               
TBSTAT   DS    CL1                 STATUS BYTE                                  
TBSTA2   DS    CL1                 2ND STATUS BYTE                              
TBIDTE   DS    XL3                 INVOICE DATE                                 
TBITIM   DS    XL3                 INVOICE TIME                                 
TBPRERUN DS    CL1                 RERUN/POSTING Y/N                            
TBAYSTAT DS    XL1                 AGENCY STATUS                                
TBAYSTA2 DS    XL1                 2ND AGENCY STATUS BYTE                       
TBAYSTA3 DS    XL1                 3RD AGENCY STATUS BYTE                       
TSRTSTA  DS    XL1                 SORT STATUS BYTE                             
TBCCVT   DS    PL3                 SYSTEM CANADIAN CONVERSION RATE              
TBGCVT   DS    PL3                 GENERAL CONVERSION RATE                      
*                                                                               
TBOPTS   DS    CL1                 OPTIONS FROM REQUEST SCREEN                  
TBTRACE  EQU   X'80'                       SET TRACE ON                         
TBRERUN  EQU   X'40'                       SET RERUN MODE                       
TBNOPOST EQU   X'20'                       SET POSTINGS = NO                    
TBTXTRAC EQU   X'10'                       SET TRACE TAX RECORDS                
TBPRWK   EQU   X'08'                       CREATE PROD WRKER FILE ONLY          
TBRCVBL  EQU   X'04'                       CREATE RCVB WRKER FILE ONLY          
TBTRYTD  EQU   X'02'                       TRACE YTD                            
TBRETRO  EQU   X'01'                       ONLY DO RETRO INVOICES               
*                                                                               
TBOPTS2  DS    CL1                 2ND OPTIONS FROM REQUEST SCREEN              
TBFILE   EQU   X'80'                       INPUT = DATA FILE                    
TBFIXINV EQU   X'40'                       FIX INVOICE RECS                     
TBWRYES  EQU   X'20'                       ACTUALLY DO THE WRITES               
TBOVNCPY EQU   X'10'                       OVERRIDE N'BILLING COPIES            
TBSRTEST EQU   X'08'                       SORT BY EST # VS ATTN NAME           
TBWRNPRG EQU   X'04'                       POST WARNINGS TO PROGRAMMERS         
TBREGRSN EQU   X'02'                       REGRESSION RUN                       
TBREGRS2 EQU   X'01'                       REGRESSION RUN 2                     
*                                                                               
OFFLIST  DS    CL10                LIST OF OFFICES TO RUN                       
*                                                                               
FRSTINV  DS    CL6                 FIRST INVOICE REQUESTED                      
LASTINV  DS    CL6                 LAST INVOICE REQUESTED                       
NEXTINV  DS    CL6                 NEXT INVOICE REQUESTED                       
*                                                                               
TBBDSTAT DS    XL1                 TABD STATUS BYTE                             
*                                                                               
TBEMGST# DS    CL10                GST NUMBER                                   
TBAYDAYS DS    XL1                 NUMBER OF DAYS DUE                           
TBWSTAT  DS    XL1                 WRITER ROLE STATUS                           
*                                                                               
         DS    0F                                                               
INVCR    DS    F                   INV CREDITS/POSTING                          
INVDR    DS    F                   INV DEBITS/POSTING                           
*                                                                               
APOSTTAB DS    A                   A(POSTTAB)                                   
*                                                                               
SUISURCA DS    F                   SUI SURCHARGE CA                             
SUISURNY DS    F                   SUI SURCHARGE NY                             
SSURAMTS EQU   *-SUISURCA                                                       
*                                                                               
EMSTHNDU DS    F                   EMS TOTAL CAN HANDLING US$ (CHLOE)           
TBEFFDTE DS    PL3                 EFFECTIVE DATE (PACKED)                      
SVOPT5   DS    CL1                 SAVED TAPD OPTION 5                          
         DS    8F                  SPARE                                        
TBISTA3  DS    XL1                 INVOICE TAPD THIRD STATUS BYTE               
         DS    XL3                 SPARE                                        
TBBNPPNH DS    F                   INVOICE'S BNP PNH US$                        
*                                                                               
ACVTTAB  DS    A                   A(CURRENCY CONVERSION ROUTINE)               
AMYTRACE DS    A                                                                
AMYTRAC2 DS    A                                                                
MULT     DS    A                                                                
SETPCIF  DS    A                                                                
EXTRCT   DS    A                                                                
*                                                                               
SVTAB    DS    CL(TABLEN)          SAVE SSN TABLE VALUES                        
*                                                                               
TBAYLBOX DS    CL1                 LOCK BOX CODE                                
*                                                                               
TBOBBDTE DS    XL3                 ORIGINAL BILL DATE FOR CANCELLED INV         
YTDSSPNH DS    F                   YTD SOAP SUBJ TO P&H                         
TBAYSTA4 DS    XL1                 4TH AGENCY STATUS BYTE                       
AYHRULE  DS    XL1                 AGENCY HANDLING RULE                         
CLHRULE  DS    XL1                 CLIENT HANDLING RULE                         
GRHRULE  DS    XL1                 GENERAL HANDLING RULE                        
TBXTRHND DS    F                   EXTRA HANDLING FOR BTYPE 18                  
TBAYSTA5 DS    XL1                 5TH AGENCY STATUS BYTE                       
TALCRDTS DS    PL6                 TOTAL CREDITS FOR TP OFFICE                  
TBAYSTA6 DS    XL1                 6TH AGENCY STATUS BYTE                       
TBCLSTAT DS    XL1                 CLENT STATUS BYTE                            
TBCLSTA2 DS    XL1                 2ND CLENT STATUS BYTE                        
TBPRSTAT DS    XL1                 PRODUCT STATUS BYTE                          
SVOPT4   DS    XL1                 SAVED TAPD OPTION 4                          
*                                                                               
ADRBTYPE DS    CL1                 BILLING TYPE                                 
ADRFUTA  DS    XL2                 ADD'L FUTA                                   
ADRSUTA  DS    XL2                 ADD'L SUTA                                   
ADRFICA  DS    XL2                 ADD'L FICA                                   
ADROVER  DS    XL2                 ADD'L OVER FICA                              
ADRIFIC  DS    XL2                 ADD'L INC FICA                               
ADRHAND  DS    XL2                 ADD'L HANDLING                               
ADRCAN   DS    XL2                 ADD'L CANADIAN TAX                           
ADRWCRP  DS    XL2                 ADD'L WC ON CORPS                            
*                                                                               
TBECVT   DS    PL3                 SYSTEM EURO CONVERSION RATE                  
TBPSTU   DS    XL4                 PST US$                                      
TBPSTAOS DS    XL4                 PST AOS US$                                  
*                                                                               
TBPSTSV  DS    XL4                 PST SAVED (FOR SPLIT INVOICES)               
*                                                                               
TBOPTS3  DS    CL1                 3RD OPTIONS FROM REQUEST SCREEN              
TBOLDSUI EQU   X'80'               SUI ORDER FROM TATUS (OLD WAY)               
TBNOBOVR EQU   X'40'               IGNORE BOVER FOR COMPARE                     
TBUPDDTE EQU   X'20'               UPDATE DATE OPTION (FQA/TST/CSC)             
TBECPYPR EQU   X'10'               ECOPY - INVOICES ON PRINT QUEUE              
*                                                                               
         DS    CL2                 SPARE                                        
*                                                                               
INVPTRS  DS    CL((7*L'TLDRREC)+1) BUILD POINTERS FOR INVOICE                   
*                                  (NOT DIRECTLY ADDRESSABLE)                   
NARR     DS    CL171                                                            
YTDBLK   DS    CL(TYLNQ)           TAYTD PARM LIST                              
*                                                                               
USEDET1  DS    CL22                USE DETAILS FOR TRNSNARR                     
USEDET2  DS    CL22                                                             
*                                                                               
INVTABLN EQU   20000               N'ENTRIES IN INVOICE TABLE                   
BBOXLEN  EQU   15                  N'LINES NEEDED FOR BOTTOM BOX                
ADDLINE  EQU   30                  LENGTH OF AN ADDRESS LINE                    
*                                                                               
**TRATE  EQU   700                 GST RATE (NOW DEFINED TASYSEQUS)             
*                                                                               
MAXSI    EQU   10                  MAXIMUM SUBSIDIARY INVOICES                  
*                                                                               
MAXEPIS  EQU   300                 MAXIMUM EPISODE TABLE ENTRIES                
*                                                                               
*                                  TABIPOST EQUATED MODES                       
EOPENWK  EQU   1                   OPEN WORKER FILE                             
EPOSTSE  EQU   2                   POST SE POSTINGS                             
EPOSTSR  EQU   3                   POST SR POSTINGS                             
EPOSTSX  EQU   4                   POST SX POSTINGS                             
EEOFPOST EQU   5                   EOF POSTINGS                                 
EPSTSJSV EQU   6                   POST SJ AND SV                               
EPUTTAB  EQU   7                   PUT INFO IN TABLE FOR SE POSTINGS            
ECKPOST  EQU   8                   CREATE TABLE OF POSTING BY WORK CODE         
EINVLVL  EQU   9                   SET TNH ON INVOICE LEVEL                     
*                                                                               
*                                  TABISPLT EQUATED MODES                       
EADDCKS  EQU   1                   ADD SUBSIDIARY CHECK RECORDS                 
EADDIVS  EQU   2                   ADD SUBSIDIARY INVOICE RECORDS               
EINVPST  EQU   3                   PROCESS INVOICE RELATED POSTINGS             
EINVNUM  EQU   4                   SET SUBSIDIARY INVOICE NUMBERS               
EGETSI   EQU   5                   GET INFO FROM TASI ELEM INTO TABLE           
ESETPCIF EQU   6                   SET PROD CLIENT INTERFACE INFO               
*                                                                               
TBLNQ    EQU   *-TBILLD                                                         
TBEND    EQU   *                                                                
         EJECT                                                                  
       ++INCLUDE TALIMD                                                         
