*          DATA SET TACKREPD   AT LEVEL 167 AS OF 06/23/16                      
*                                                                               
*        CHECK PROGRAM WORK AREA DSECT                                          
*                                                                               
* THIS DSECT COVERS THE WORKING STORAGE AREA FOR THE TALENT CHECK               
* PROGRAM (TAREP04, TACKREP, TACKTAX AND TACKPRT).  ALL PHASES                  
* USE IT TO COVER THE SAME MEMORY AREA, AND THEREFORE, IT ALLOWS                
* THE PHASES TO PASS INFORMATION BACK AND FORTH TO EACH OTHER.                  
*                                                                               
* IT IS BROKEN UP INTO THREE AREAS:                                             
*                                                                               
*     1) GENERAL WORKING STORAGE (FROM CHECKD TO SRTREC) - THIS IS              
*        WHERE ADDRESS CONSTANTS, SAVED KEYS, ACCUMULATORS, ETC. ARE            
*        KEPT.                                                                  
*                                                                               
*     2) SORT RECORD DATA (FROM SRTREC TO SRTCHECK) - THIS IS WHERE             
*        THE SORT RECORD BEGINS.  FOR EACH CHECK TO BE PRINTED ONE SORT         
*        RECORD IS CREATED.  DATA IS EXTRACTED FROM THE INVOICE, CHECK,         
*        AND VARIOUS SUPPORT RECORDS IN ORDER TO BUILD EACH SORT                
*        RECORD.  THE FIELDS ARE ORGANIZED ACCORDING TO WHERE THE DATA          
*        HAS COME FROM, AND FOR THE MOST PART EACH SECTION CORRESPONDS          
*        TO A SUBROUTINE THAT EXTRACTED THE DATA FOR THAT SECTION.              
*                                                                               
*     3) SORT CHECK RECORD (SRTCHECK) - THE CHECK RECORD FOR EACH CHECK         
*        IS PART OF THE INFORMATION NECESSARY TO PUT TO THE SORT FILE,          
*        SO IT IS PLACED RIGHT AFTER ALL OF THE SUPPORT DATA.  IT HAS           
*        FOUR PURPOSES:                                                         
*                                                                               
*            A) IN IT ARE CONTAINED THE CHECK WITHHOLDING ELEMENTS FOR          
*               FOR THE CHECK WHICH ARE ADDED BY THE ROUTINES EXTRW4            
*               AND CASTUNIT AND USED BY THE ROUTINE TATAX TO WITHHOLD          
*               THE TAXES.                                                      
*                                                                               
*            B) THE RECORD AS A WHOLE IS WRITTEN BACK TO THE FILE WITH          
*               THE CHECK NUMBER AFTER THE CHECK IS PRINTED.                    
*                                                                               
*            C) IN IT ARE ALSO CONTAINED DUE COMAPNY AND LIEN                   
*               WITHHOLDING ELEMENTS WHICH ARE ADDED BY THE ROUTINES            
*               DUECOMP AND LIENS AND USED BY THE ROUTINE UPDCHK TO ADD         
*               PASSIVE POINTERS FOR DUE COMPANY AND LIEN TRACKING.             
         EJECT                                                                  
CHECKD   DSECT                                                                  
*                                                                               
*        REQUESTED FILTERS (SET BY TAREP04)                                     
*                                                                               
REQURG   DS    C                   URGENT CODE                                  
REQEND1  DS    PL3                 END DATE (YMD) OR ZEROS                      
REQFORC  DS    PL3                 FORCED DATE (OPTIONAL)                       
REQAGY   DS    CL6                 AGENCY FILTER (OR ZEROS)                     
REQINV   DS    PL6                 INVOICE FILTER (OR ZEROS)                    
REQCHKN  DS    CL8                 CHECK NUMBER FILTER (OR ZEROS)               
REQSCHK  DS    XL4                 OVERRIDE OF STARTING CHECK NUMBER            
REQTAPP  DS    C                   SUPPRESS CALLS TO TAPPGUAR                   
REQTRACE DS    CL51                TRACE TYPES                                  
REQSSN   DS    CL9                 PERFORMER FILTER                             
REQASOF  DS    PL3                 AS/OF DATE (PWOS) OR ZEROS                   
REQFRCW4 DS    C                   FORCE CHECK W4 TYPE = TYPE ON W4 REC         
*                                                                               
*        VARIABLES FOUND IN THE TWA                                             
*                                                                               
AMASTD   DS    V                   A(MASTCON DSECT)                             
ORIGID   DS    XL2                 SIGN-ON ID IN HEX                            
AGYALPH  DS    CL2                 SIGN-ON ID IN ALPHANUMERIC                   
ASPBLK   DS    A                   A(SAVED PASSIVE POINTERS BLOCK)              
AAPBLK   DS    A                   A(ADD PASSIVE POINTERS BLOCK)                
PPBLOCKL EQU   3072                SIZE OF EACH PP BLOCK                        
*                                                                               
*        ADDRESSES OF TWADCON ROUTINES                                          
*                                                                               
BINSRCH  DS    V                   BINARY SEARCH/ADD ROUTINE                    
*                                                                               
*        VARIABLES FOUND IN MASTD                                               
*                                                                               
RERUN    DS    C                   MCRERUN (RERUN INDICATOR)                    
*                                                                               
*        ADDRESSES OF SPOOLD ROUTINES                                           
*                                                                               
VSORTER  DS    V                   RECORD SORTER                                
*                                                                               
*        ADDRESSES OF COMFACSD ROUTINES                                         
*                                                                               
GETRET   DS    V                   GET RETENTION HOURS                          
*                                                                               
*        ADDRESSES OF CHECK PROGRAM LOADED PHASES ROUTINES                      
*                                                                               
TASEGUE  DS    A                   A(ALLTAX SEGUE ROUTINE)                      
*                                                                               
*        ADDRESSES OF CHECK PROGRAM COMMON ROUTINES                             
*                                                                               
GETESU   DS    A                   A(ESUTAB LOOKUP ROUTINE)                     
GETSUC   DS    A                   A(STATE U.C. # LOOKUP ROUTINE)               
         DS    A                                                                
DOTRACE  DS    A                   A(TRACE INTERFACE ROUTINE)                   
BLDSORT  DS    A                   A(BUILD SORT ROUTINE)                        
ADDPTRS  DS    A                   A(INTERFACE INTO COMMON ADDPTR RTN)          
NOCALC   DS    A                   A(TEST IF DON'T WAN'T TO CALCULATE)          
NOPRNT   DS    A                   A(TEST IF DON'T WANT TO PRINT CHECK)         
ADDBIN   DS    A                   A(ADD RECORD TO BINSRCH TABLE)               
UPDPYTD  DS    A                   A(UPDATE YTD ROUTINE)                        
FLUSHI   DS    A                   A(FLUSH INVOICE INFO)                        
INITCTR  DS    A                   A(INITIALIZE COUNTERS)                       
GETPYTD  DS    A                   A(GET YTD)                                   
CALLTAPP DS    A                   A(CALL TAPPGUAR)                             
*                                                                               
*        REGISTERS OF MAIN MODULE USED IN COMMON ROUTINES                       
*                                                                               
SAVERC   DS    A                   A(WORKING STORAGE)                           
SAVERB   DS    A                   FIRST BASE REGISTER                          
SAVERA   DS    A                   SECOND BASE REGISTER                         
SAVER9   DS    A                   THIRD BASE REGISTER                          
SAVER8   DS    A                   FOURTH BASE REGISTER                         
*                                                                               
*        ADDRESSES OF TABLES                                                    
*                                                                               
AERITAB  DS    A                   A(ERROR INVOICE TABLE)                       
AWARTAB  DS    A                   A(WARNING CHECK TABLE)                       
AESUTAB  DS    A                   A(EMPLOYER/SSN/UNIT TABLE)                   
AESUINV  DS    A                   A(EMPLOYER/SSN/UNIT TABLE FOR INV.)          
ADUETAB  DS    A                   A(DUE COMPANY TABLE)                         
ALINTAB  DS    A                   A(LIEN TABLE)                                
ATRSTAB  DS    A                   A(W4 TRUSTEE TABLE)                          
AACCTAB  DS    A                   A(ACCOUNT ACCUMULATORS TABLE)                
ALCLTAB  DS    A                   A(UNION/LOCAL SORT TABLE)                    
APYTDTAB DS    A                   A(PERFORMER YTD TABLE)                       
APYTDINV DS    A                   A(PERFORMER YTD TABLE FOR AN INV.)           
AEPITAB  DS    A                   A(EPISODE TABLE)                             
AAYFTAB  DS    A                   A(AGENCY FLIST TABLE)                        
ACLFTAB  DS    A                   A(CLIENT FLIST TABLE)                        
*                                                                               
*        ADDRESSES OF IO AREAS                                                  
*                                                                               
ASRTCHK  DS    A                   A(CHECK RECORD IOAREA)                       
AINVIO   DS    A                   A(INVOICE RECORD IOAREA)                     
AEMPIO   DS    A                   A(EMPLOYER RECORD IOAREA)                    
AW4IO    DS    A                   A(W4 RECORD IOAREA)                          
*                                                                               
*        TABLE VARIABLES                                                        
*                                                                               
NEXTERI  DS    A                   A(NEXT ERITAB ENTRY TO ADD)                  
NEXTWAR  DS    A                   A(NEXT WARTAB ENTRY TO ADD)                  
*                                                                               
MAXERIS  EQU   1000                MAX NUMBER OF ERROR INVOICE ENTRIES          
MAXWARS  EQU   10000               MAX NUMBER OF WARNING CHECK ENTRIES          
MAXESUS  EQU   20000               MAX NUMBER OF EMP/SSN/UNIT ENTRIES           
MAXQTDS  EQU   20000               MAX NUMBER OF EMP/SSN/UNIT ENTRIES           
MAXDUES  EQU   2000                MAX NUMBER OF DUE COMPANY ENTRIES            
MAXLINS  EQU   2000                MAX NUMBER OF LIEN ENTRIES                   
MAXW4TS  EQU   1000                MAX NUMBER OF W4 TRUSTEE ENTRIES             
MAXACCS  EQU   2000                MAX NUMBER OF ACCOUNT ACCUM ENTRIES          
MAXLCLS  EQU   100                 MAX NUMBER OF UNION/LOCAL ENTRIES            
MAXPYTDS EQU   10000               MAX NUMBER OF PERFORMER YTD ENTRIES          
MAXCAST  EQU   300                 MAX NUMBER OF CAST MEMBERS ON AN INV         
MAXEPIS  EQU   300                 MAX NUMBER OF EPISODE ENTRIES                
MAXOFFS  EQU   40                  MAX NUMBER OF OFFICES                        
FLISTABL EQU   15000               LENGTH OF AYFTAB AND CLFTAB                  
MAXACHS  EQU   200                 MAX NUMBER OF ACH ENTRIES                    
*                                                                               
*        PROGRAM CONTROL VARIABLES                                              
*                                                                               
CHKDATE1 DS    PL3                 CHECK DATE (3-BYTE PACKED)                   
CHKDATEA DS    CL8                            (ALLTAX FORM - CCYYMMDD)          
CHKDATEL DS    PL3                 12/31/(LAST YEAR) - (3-BYTE PACKED)          
CHKDTEAL DS    CL8                            (ALLTAX FORM - CCYYMMDD)          
*                                                                               
END1     DS    PL3                 END DUE DATE (3-BYTE PACKED)                 
*                                                                               
AYSTAT7  DS    XL1                 AGENCY STATUS 6                              
         DS    XL1                 SPARE                                        
*                                                                               
PROCSEQ  DS    F                   SEQ NUM FOR ORDER CHECKS PROCESSED           
*                                                                               
TAPPTRAC DS    C                   TRACE TAPPGUAR CALLS (Y/N)                   
YTDTRACE DS    C                   TRACE TAYTD CALLS (Y/N)                      
PTRTRACE DS    C                   TRACE ADDPTR CALLS (Y/N)                     
*                                                                               
CHKSTAT  DS    X                   CHECK STATUS                                 
PAXPRO   EQU   X'80'               PAX PROGRAM                                  
*                                                                               
CHKNBIN  DS    F                   CHECK NUMBER (4-BYTE BINARY)                 
CHKNCHR  DS    CL8                              (8-BYTE EBCDIC)                 
*                                                                               
BANKCODE DS    CL6                 BANK CODE (ACCOUNT)                          
*                                                                               
SVIKEY   DS    XL48                SAVED INVOICE KEY                            
SVCKEY   DS    XL48                SAVED CHECK KEY                              
*                                                                               
PREVEMP  DS    CL3                 EMPLOYER FOR THE PREVIOUS INVOICE            
PREVAGY  DS    CL6                 AGENCY FOR THE PREVIOUS INVOICE              
PREVCLI  DS    CL6                 CLIENT FOR THE PREVIOUS INVOICE              
*                                                                               
AYSTAT6  DS    XL1                 AGENCY STATUS 6                              
CLSTAT2  DS    XL1                 CLIENT STATUS 2                              
PDOPT5   DS    XL1                 TAPDEL OPTION 5                              
*                                                                               
INVRD    DS    A                   SAVED RD FOR INVOICE ABORT                   
INVTERR  DS    X                   INVOICE ERROR NUMBER                         
*                                                                               
CHKCALC  DS    F                   CALCULATED CHECK TOTAL                       
AREMOT   DS    V                   A(REMOTE)                                    
NOSRTCKS DS    F                   NUMBER OF CHECKS IN SORTER                   
ALOGOC   DS    V                   A(LOGOC)                                     
ALOGO    DS    V                   A(LOGO)                                      
TOTPST   DS    F                   TOT PST                                      
         DS    F                   N/D                                          
*                                                                               
*        VARIABLES USED TO BUILD SORT KEY                                       
*                                                                               
LASTNAME DS    CL16                PERFORMER'S LAST NAME                        
FRSTNAME DS    CL16                PERFORMER'S FIRST NAME                       
MIDNAME  DS    CL16                PERFORMER'S MIDDLE NAME                      
*                                                                               
*        MISCELLANEOUS ACCUMULATORS AND TEMPORARY VARIABLES                     
*                                                                               
DUECOL   DS    F                   DUE COMPANY COLLECTED FROM ONE REC           
DUEBAL   DS    F                   DUE COMPANY BALANCE REMAINING                
DUEFLAG  DS    XL1                 DUE COMPANY FLAG                             
DUEFTR   EQU   X'80'               TAXABLE REIMBURSEMENT                        
DUEFNR   EQU   X'40'               NON TAXABLE REIMBURSEMENT                    
*                                                                               
LIENCOL  DS    F                   LIEN COLLECTED FROM ONLY REC                 
LIENBAL  DS    F                   LIEN BALANCE REMAINING                       
LIENSSN  DS    CL9                 LIEN PAYEE SSN                               
         ORG   LIENCOL                                                          
TRUSTCOL DS    F                   AMOUNT COLLECTED IN TRUST                    
         DS    F                   SPARE                                        
TRUSTSSN DS    CL9                 SSN OF TRUSTEE                               
*                                                                               
PRNTNAME DS    CL32                NAME TO PRINT ON CHECK                       
NUMLINES DS    F                   NUMBER OF BLANK COMMENT LINES                
COMMNAME DS    CL44                FAKE FIELD HEADER FOR COMMENT NAME           
*                                                                               
TOTALS   DS    0F                                                               
TOTEARN  DS    F                   TOTAL TAXABLE EARNINGS                       
TOTNTAX  DS    F                   TOTAL NON-TAXABLE EARNINGS                   
TOTNET   DS    F                   TOTAL NET AMOUNT                             
TOTMDED  DS    F                   TOTAL FOR MISC. DED & UNION DUES             
TOTCVERN DS    F                   TOTAL CONVERTED EARNINGS                     
TOTGSTPD DS    F                   TOTAL GST PAID                               
TOTLEN   EQU   *-TOTALS                                                         
*                                                                               
SVREMOT  DS    XL18                SAVED REMOTE KEY FROM PRTQUE                 
*                                                                               
CPTRBLK  DS    XL12                PARAMETER BLOCK TO TALDCPTR                  
*                                                                               
WORKID   DS    XL16                WORKER FILE ID                               
BLANKACC DS    XL(ACCLEN)          INITIALIZED ACCTAB LOOKUP ENTRY              
ACCOUNT  DS    CL14                ACCOUNT NUMBER                               
CONTRA   DS    CL14                CONTRA ACCOUNT NUMBER                        
MOS      DS    CL2                 MONTH OF SERVICE                             
MOSL     DS    CL2                 MONTH OF SERVICE OF END OF LAST YEAR         
POSTMOS  DS    CL2                 MOS TO POST CURRENT RECORD                   
POSTDATE DS    XL3                 POSTING DATE                                 
POSTREF  DS    CL4                 LAST 4 CHARS OF TRANS. REFERENCE             
TPOFFICE DS    C                   TP OFFICE CODE FOR TRNSANAL                  
TPOFF8   EQU   C'8'                CERTAIN PSTGS ON ALL RUNS EXCEPT PC          
TPOFFH   EQU   C'H'                CERTAIN PSTGS ON PC RUN                      
*                                                                               
DRCRFLAG DS    C                   D(EBIT)/C(REDIT) FLAG                        
POSTREC  DS    XL256               WORKER FILE RECORD                           
TOTRECS  DS    PL6                 TOTAL NUMBER OF RECORDS POSTED               
TOTCASH  DS    PL6                 TOTAL OF AMOUNTS FROM RECORDS POSTED         
CCVTRATE DS    PL3                 CANADIAN CONVERSION RATE                     
DUEDATE  DS    PL3                 DUE DATE FROM TLINC POINTER                  
YTDBLK   DS    CL(TYLNQ)           TAYTD PARAMETER BLOCK                        
DEFSTATE DS    CL2                 DEFAULT TAXABLE STATE                        
DUESTAT  DS    CL1                 STATUS USED IN DUE COMPANY ROUTINE           
DUESPCT  EQU   X'80'               % TAKEN FROM DUE COMPANY                     
DUESRERD EQU   X'40'               NEED TO RE-READ DUE COMPANY KEY              
DUESERR  EQU   X'20'               FLIST RECORD NOT FOUND                       
TOTCNT   DS    F                   TOTAL NUMBER OF CHECKS WRITTEN               
CONVDIFF DS    F                   CONVERSION DIFFERENCE DURING POST            
OFFTAB   DS    CL(MAXOFFS*OFFLNQ)  OFFICE TABLE                                 
RECIPST  DS    CL2                 RECIPROCAL STATE                             
*                                                                               
CID2     DS    CL12                2ND CID FOR SOC USE                          
REQOPTS  DS    XL1                 REQUEST OPTIONS                              
REQALTXA EQU   X'80'               LOAD TASEGUEA                                
REQOCDTE EQU   X'40'               FORCE CHECK DATE TO DUE DATE                 
REQREG   EQU   X'20'               REGRESSION RUN                               
REQREG2  EQU   X'10'               REGRESSION RUN 2                             
REQOCAL  EQU   X'08'               PICK UP CHECKS WITH CALIFORNIA WORK          
REQESUA  EQU   X'04'               LOAD TACKESUA                                
REQPYTA  EQU   X'02'               LOAD TACKPYTA                                
SVDUEKEY DS    CL(L'TLDRREC)       SAVED DUE COMPANY KEY                        
         DS    0F                                                               
TOTDIRCT DS    F                   TOTAL UNCONVERTED DIRECT+WIRE NET            
*                                                                               
PULLCHK  DS    C                   PULL CHECK?                                  
*                                                                               
DLCB     DS    CL(DLCBXLX)                                                      
*                                                                               
TOTCRDTS DS    PL6                 TOTAL OF CREDITS FROM RECORDS POSTED         
*                                                                               
LIENCASE DS    CL15                LIEN CASE NUMBER                             
LIENTYPE DS    CL2                 LIEN TYPE                                    
*                                                                               
REQOFFC  DS    CL1                 REQUEST OFFICE                               
*                                                                               
TOTSPST  DS    F                   TOTAL SUBTRACT PST (FROM NET)                
*                                                                               
AQTDTAB  DS    A                   ADDRESS OF QTD TABLE                         
GETQTD   DS    A                   A(GET QTD)                                   
*                                                                               
MINGRS   DS    F                   MINIMUM GROSS AMOUNT (25% OF GROSS)          
*                                                                               
AEVTIO   DS    A                   A(EVTIME RECORD)                             
ASUITAB  DS    A                   A(SUI TABLE)                                 
*                                                                               
*CLICLG   DS    CL(L'TGCLG)         CLIENT'S CLIENT GROUP                       
*                                                                               
* HAD TO MAKE THE LENGTH HARDCODED SO IT WOULD LINK IN TACKDUE                  
* TGCLG IS DEFINED IN TASYSWORKD BUT TACKUE DOES NOT INCLUDE IT                 
*                                                                               
CLICLG   DS    CL6                 CLIENT'S CLIENT GROUP CL(L'TGCLG)            
*                                                                               
AESUCUR  DS    A                   A(CURRENT ESU ENTRY)                         
AESUICUR DS    A                   A(CURRENT ESU INVOICE ENTRY)                 
*                                                                               
AACHTAB  DS    A                   A(ACH TABLE)                                 
*        FORCE ALIGNMENT OF SRTREC TO AN EVEN X'100' BOUNDARY                   
*                                                                               
         DS    XL(X'B00'-(*-CHECKD))  SPARE                                     
         EJECT                                                                  
*        SORT RECORD                                                            
*                                                                               
SRTREC   DS    0C                                                               
*                                                                               
*        SORT KEY                                                               
*                                                                               
SRTKEY   DS    0C                                                               
SRTKSTA  DS    X                   SORT KEY STATUS                              
SRTKHLD  EQU   0                   HOLDING FEE                                  
SRTKAGY1 EQU   1                   FIRST AGENCY                                 
SRTKFRST EQU   2                   FIRST                                        
SRTKPULL EQU   3                   PULLED CHECK                                 
SRTKSW4  EQU   4                   THIS PERFORMER'S CHECKS COME FIRST           
SRTKSDU  EQU   5                   CHECK HAS A DUE COMPANY AMOUNT               
SRTKSLN  EQU   6                   CHECK HAS A LIEN AMOUNT                      
SRTKSW4T EQU   7                   CHECK HAS A W4 TRUSTEE AMOUNT                
SRTKS50  EQU   8                   NET >= $5000                                 
SRTKASN  EQU   9                   FOR ASIAN COMMERCIALS                        
SRTKSSP  EQU   10                  FOR SPANISH COMMERCIALS                      
SRTKS199 EQU   11                  FOR AGENT 3499                               
SRTKSAF  EQU   12                  AFTRA FOR LOCALS OTHER THAN CHI, ETC         
SRTKSNA  EQU   13                  AFTRA LOCALS CHI, ETC, SAG, NO AGENT         
SRTKSWA  EQU   14                  AFTRA, CHI, ETC, SAG, WITH AGENT             
SRTKSAM  EQU   15                  AFM CHECKS                                   
SRTKSOT  EQU   99                  ALL OTHER CHECKS                             
SRTKASOF EQU   X'80'               DUE AFTER NORMAL END-SORT SEPARATELY         
*                                                                               
SRTKYEAR DS    XL1                 YEAR                                         
SRTKUN   DS    CL3                 UNION                                        
SRTKLOCL DS    CL3                 LOCAL                                        
SRTKAGY  DS    CL6                 AGENCY                                       
SRTKINV  DS    CL6                 INVOICE NUMBER                               
SRTKCST  DS    XL6                 CAST SORT KEY                                
SRTKSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
SRTKCAT  DS    CL3                 CATEGORY                                     
SRTKNCDE DS    XL2                 AGENT CODE                                   
SRTKLST  DS    CL16                LAST NAME                                    
SRTKFST  DS    CL16                FIRST NAME                                   
SRTKSEQ  DS    XL3                 ORDER PROCESSED                              
*                                                                               
SRTKEYL  EQU   *-SRTKEY            SORT KEY LENGTH                              
         EJECT                                                                  
*                                                                               
*        SORT DATA                                                              
*                                                                               
SRTDATA  DS    0C                                                               
*                                                                               
***********************************************************************         
* FIRST COME THE VARIABLES THAT ARE COMMON TO ALL THE CHECKS IN THE   *         
* INVOICE.                                                            *         
***********************************************************************         
*                                                                               
*        INVOICE KEY VARIABLES                                                  
*                                                                               
SRTAGY   DS    CL6                 AGENCY                                       
SRTINV   DS    PL6                 INVOICE                                      
SRTINDA  DS    XL4                 DISK ADDRESS OF INVOICE RECORD               
*                                                                               
*        INVOICE STATUS ELEMENT VARIABLES                                       
*                                                                               
SRTINVS  DS    X                   INVOICE STATUS                               
SRTINVS2 DS    X                   INVOICE STATUS TWO                           
SRTCDTE  DS    XL3                 CHECK DATE (PWOS)                            
SRTPDTE  DS    XL3                 PAYMENT DATE (PWOS)                          
*                                                                               
*        INVOICE ORIGINAL AGY/INV ELEMENT                                       
*                                                                               
SRTAAGY  DS    CL6                 ADJUSTMENT AGENCY                            
SRTAINV  DS    PL6                 ADJUSTMENT INVOICE                           
*                                                                               
*        INVOICE RECORD COMMERCIAL INFO VARIABLES                               
*                                                                               
SRTICOMS DS    0X                                                               
SRTTITL  DS    CL36                COMMERCIAL TITLE                             
SRTCID   DS    CL12                COMMERCIAL ID                                
SRTVERS  DS    CL1                 VERSION CODE                                 
SRTEDIT  DS    CL12                EDIT VERSION #                               
SRTFCYC  DS    PL3                 FIRST FIXED CYCLE DATE                       
SRTAIR   DS    PL3                 FIRST AIR DATE                               
SRTEXP   DS    PL3                 EXPIRATION DATE                              
SRTDUB   DS    PL3                 DUB DATE                                     
SRTMED   DS    CL1                 MEDIA                                        
SRTCTYP  DS    CL1                 COMMERCIAL TYPE                              
SRTCON   DS    CL24                2 CONTRACTS                                  
         ORG   SRTCON                                                           
SRTSTUD  DS    CL12                SHOOT STUDIO (FOR PRINT)                     
SRTCITY  DS    CL12                SHOOT CITY   (FOR PRINT)                     
*                                                                               
SRTORIG  DS    CL12                ORIGINAL COMMERCIAL ID                       
SRTFILM  DS    PL3                 FILM DATE                                    
         ORG   SRTFILM                                                          
SRTSHOOT DS    PL3                 SHOOT DATE   (FOR PRINT)                     
*                                                                               
SRTRCRD  DS    PL3                 RECORD DATE                                  
SRTMUS   DS    PL3                 MUSIC DATE                                   
SRTCOSTA DS    XL1                 COMMERCIAL STATUS                            
SRTICOML EQU   *-SRTICOMS                                                       
*                                                                               
*        INVOICE RECORD PAYMENT DETAILS ELEMENT VARIABLES                       
*                                                                               
SRTCOM   DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
SRTUSE   DS    CL3                 USE CODE                                     
SRTUTYP  DS    CL1                 USE TYPE                                     
SRTCYCS  DS    PL3                 CYCLE START DATE                             
SRTCYCE  DS    PL3                 CYCLE END DATE                               
SRTMAJ   DS    XL1                 MAJORS                                       
SRTUNT   DS    XL2                 UNITS                                        
SRTINS   DS    XL2                 INSERTS                                      
SRTITAG  DS    XL1                 TAGS FOR TAG USE                             
SRTDEMO  DS    XL1                 DEMOS                                        
SRTEMP   DS    CL3                 EMPLOYER OF RECORD                           
SRTCLI   DS    CL6                 CLIENT                                       
SRTPRD   DS    CL6                 PRODUCT                                      
SRTADJS  DS    X                   PAYROLL ADJUSTMENT INDICATORS                
SRTPST1  DS    X                   PAYMENT STATUS BYTE                          
SRTTPOF  DS    C                   TP OFFICE                                    
*                                                                               
*        INVOICE RECORD USE ELEMENTS VARIABLES                                  
*                                                                               
SRTUDATA DS    0X                                                               
SRTCLA   DS    CL(23*4)            CLASS A DATES/LIFT CODES                     
SRTUMAJ  DS    XL1                 UPGRADE MAJORS                               
SRTUUNT  DS    XL2                 UPGRADE UNITS                                
SRTUINS  DS    XL2                 UPGRADE INSERTS                              
SRTULEN  EQU   *-SRTUDATA                                                       
*                                                                               
*        INVOICE RECORD PRINT NAMES                                             
*                                                                               
         ORG   SRTUDATA                                                         
SRTPDATA DS    0X                                                               
SRTPHONM DS    CL36                PHOTOGRAPHER NAME (FOR PRINT)                
SRTSVCNM DS    CL36                SERVICES FOR NAME (FOR PRINT)                
         DS    CL25                SPARE                                        
SRTPLEN  EQU   *-SRTPDATA                                                       
         ORG                                                                    
*                                                                               
*        INVOICE RECORD MISCELLANEOUS VARIABLES                                 
*                                                                               
SRTCCVT  DS    PL3                 CANADIAN CONVERSION RATE                     
SRTINVC  DS    CL60                INVOICE COMMENTS                             
*                                                                               
*        EMPLOYER RECORD VARIABLES                                              
*                                                                               
SRTEMPN  DS    CL36                EMPLOYER NAME                                
*                                                                               
*        AGENCY RECORD VARIABLES                                                
*                                                                               
SRTAGYN  DS    CL36                AGENCY NAME                                  
*                                                                               
*        CLIENT RECORD VARIABLES                                                
*                                                                               
SRTCLIN  DS    CL36                CLIENT NAME                                  
*                                                                               
*        PRODUCT RECORD VARIABLES                                               
*                                                                               
SRTPRDN  DS    CL36                PRODUCT NAME                                 
*                                                                               
***********************************************************************         
* THESE VARIABLES ARE FOR THE INDIVIDUAL CHECK ONLY.                  *         
***********************************************************************         
SRTCVARS DS    0X                                                               
*                                                                               
*        CHECK KEY VARIABLES                                                    
*                                                                               
SRTCST   DS    XL6                 CAST SORT KEY                                
SRTSSN   DS    CL9                 SSN                                          
SRTCAT   DS    CL3                 CATEGORY                                     
SRTDSKA  DS    XL4                 DISK ADDRESS OF CHECK RECORD                 
*                                                                               
*        W4 RECORD VARIABLES                                                    
*                                                                               
SRTW4S   DS    0X                                                               
SRTNAME  DS    CL35                NAME                                         
SRTADD   DS    CL(3*30+39)         ADDRESS LINES 1-4 (4TH LINE LONGER)          
         ORG   SRTADD                                                           
SRTADD1  DS    CL30                                                             
SRTADD2  DS    CL30                                                             
SRTADD3  DS    CL30                                                             
SRTADD4  DS    CL39                                                             
SRTPNAM  DS    CL32                PAYEE NAME                                   
SRTTYPE  DS    CL1                 TYPE                                         
SRTFREQ  DS    CL1                 FREQUENCY CODE (1=WEEK, 4=MONTH)             
SRTSOR   DS    CL3                 STATE OF RESIDENCE                           
SRTCOR   DS    CL3                 CITY OF RESIDENCE                            
SRTGST#  DS    CL10                GOODS AND SERVICES TAX NUMBER                
SRTW4T   DS    0CL19               W4 TRUSTEE INFORMATION                       
SRTW4DOB DS    XL3                 "    "     DATE OF BIRTH                     
SRTW4PCT DS    XL4                 "    "     DEDUCT PERCENTAGE                 
SRTW4SSN DS    CL9                 "    "     TRUSTEE SSN                       
SRTW4SOR DS    CL3                 INDIVID. SOR IF PAYING AS A CORP             
SRTW4L   EQU   *-SRTW4S                                                         
*                                                                               
*        CHECK RECORD PAYMENT DETAILS ELEMENT VARIABLES                         
*                                                                               
SRTW4TY  DS    CL1                 W4 TYPE OR 'C' IF INDIVIDUAL AS CORP         
SRTOV1   DS    XL4                 OVERSCALE PERCENTAGE 1                       
SRTACDE  DS    CL1                 APPLIED CODE                                 
SRTPNH   DS    F                   PENSION & HEALTH                             
SRTSTUS  DS    XL2                 STARTING USE NUMBER                          
SRTUSES  DS    XL2                 NUMBER OF USES                               
SRTVMAJ  DS    XL1                 MAJORS FOR VERSIONS ONLY                     
SRTVUNT  DS    XL2                 UNITS                                        
SRTVUMAJ DS    XL1                 UPGRADE MAJORS                               
SRTVUUNT DS    XL2                 UPGRADE UNITS                                
*                                                                               
*        CHECK RECORD SESSION DETAILS ELEMENT VARIABLES                         
*                                                                               
SRTSP    DS    XL1                 SPOTS                                        
SRTDAY   DS    XL1                 DAYS                                         
SRTOT    DS    XL1                 OVERTIME HOURS                               
SRTDT    DS    XL1                 DOUBLE-TIME HOURS                            
SRTTRV   DS    XL2                 TRAVEL HOURS (2 DEC.)                        
SRTPDW   DS    XL2                 PRIOR DAY WARDROBE HOURS (2 DEC.)            
SRTTAG   DS    XL1                 TAGS                                         
         ORG   SRTTAG                                                           
SRTIST   DS    XL1                 RETAKE STATUS                                
*                                                                               
*        CHECK RECORD CAST DETAILS ELEMENT VARIABLES                            
*                                                                               
SRTONOF  DS    CL3                 CAMERA (ON/OFF)                              
SRTUNIT  DS    CL3                 TAX UNIT                                     
SRTDBL   DS    XL1                 N'DOUBLES                                    
SRTFRST  DS    PL3                 FIRST SERVICES DATE                          
SRTUN    DS    CL3                 UNION                                        
SRTLOCL  DS    CL3                 LOCAL                                        
SRTYEAR  DS    CL3                 CONTRACT YEAR                                
SRTNCDE  DS    XL2                 AGENT                                        
SRTCFCY  DS    PL3                 OVERRIDE OF CMCL FIRST CYCLE DATE            
SRTCEXP  DS    PL3                 OVERRIDE OF CMCL EXPIRATION DATE             
SRTOV2   DS    XL4                 OVERSCALE PERCENTAGE 2                       
SRTFSO   DS    CL9                 FSO SSN - IF INDIV PAID AS CORP              
SRTFSON  DS    CL36                FSO NAME - IF INDIV PAID AS CORP             
SRTSOW   DS    CL3                 STATE OF WORK                                
SRTCOW   DS    CL3                 CITY OF WORK                                 
SRTCSTAT DS    XL1                 STATUS BYTE 1                                
SRTCSTA2 DS    XL1                 STATUS BYTE 2                                
*                                                                               
*        TAXABLE UNIT VARIABLES                                                 
*                                                                               
SRTTXST  DS    CL3                 TAXABLE STATE                                
SRTTXCY  DS    CL3                 TAXABLE CITY                                 
SRTSUC   DS    CL14                TAXABLE STATE U.C. #                         
*                                                                               
*        CHECK RECORD LIEN PAYER VARIABLES                                      
*                                                                               
SRTLSSN  DS    CL9                 LIEN PAYER                                   
         ORG   SRTLSSN                                                          
SRTTSSN  DS    CL9                 MINOR PAYER                                  
         EJECT                                                                  
*        CHECK AMOUNTS (EARNINGS, TAXES, ETC.)                                  
*                                                                               
* THESE VARIABLES ARE CREATED AND UPDATED BY THE FOLLOWING ROUTINES:            
*                                                                               
* 1) EXTRCPAY - SRTAPPL, SRTGUAR, SRTREXP, SRTPAYI, SRTPAYC, SRTDUES &          
*               SRTMDED ARE EXTRACTED FROM THE PAYMENT DETAILS ELEMENT.         
*               SRTNET, THE CHECK AMOUNT ACCUMULATOR, IS INITIALIZED            
*               TO SRTPAYI FOR INDIVIDUALS AND SRTPAYC FOR CORPS.               
*                                                                               
* 2) DUECOMP  - SRTDUE IS CALCULATED FROM THE SUM OF ALL DUE COMPANY            
*               RECORDS FOR THE EMPLOYER/EMPLOYEE.  SRTNET IS LESSENED          
*               BY SRTDUE.                                                      
*                                                                               
* 3) PROCCHK  - AFTER CALLING DUECOMP, THIS ROUTINE COPIES SRTEARN FROM         
*               SRTNET                                                          
*                                                                               
* 3) TAXES    - THIS ROUTINE CALLS TATAX TO COMPUT SRTFTAX, SRTFICA,            
*               SRTWTAX, SRTSDI, SRTSUI, SRTRTAX, SRTLTAX, AND SRTCTAX.         
*               THEN SRTTDED IS CALCULATED FROM THE TOTAL OF THE TAX            
*               AMOUNTS AND SRTNET IS DECREASED BY SRTTDED.                     
*                                                                               
* 5) MISCDED  - SRTMDED AND SRTDUES IS SUBTRACTED FROM SRTNET.                  
*               SRTNET WILL NOT GO BELOW ZERO.                                  
*                                                                               
* 6) LIENS    - SRTLIEN IS CALCULATED FROM THE FIRST LIEN RECORD IT             
*               FINDS FOR THE EMPLOYEE.  SRTNET IS LESSENED BY SRTLIEN          
*                                                                               
* 7) W4 TRUSTEE SRTTRUST IS CALCULATED FROM THE PERCENTAGE SPECIFIED            
*               ON THE W4 RECORD. SRTNET IS LESSENED BY SRTTRUST                
*                                                                               
* 8) PROCCHK  - AFTER CALLING LIENS, THIS ROUTINE ADDS SRTREXP TO               
*               SRTNET WHICH WILL THEN HOLD THE FINAL NET CHECK AMNT.           
*                                                                               
SRTAMNTS DS    0F                  BEGINNING OF CHECK AMOUNTS                   
SRTGRS   DS    F                   GROSS EARNINGS                               
SRTNTAX  DS    F                   NON-TAXABLE EARNINGS (INCL. REIMB.)          
SRTINR   DS    F                   I&R FRATERNAL CONTRIBUTION                   
*                                                                               
*                                  ** PRINT LINE 20 **                          
*                                                                               
SRTAPPL  DS    F                   APPLIED CREDITS                              
SRTGUAR  DS    F                   GUARANTEE CREDITS                            
*                                                                               
*                                  ** PRINT LINE 34 **                          
*                                                                               
SRTMPT   DS    F                   MPTRF                                        
SRTCHAR  DS    F                   PERMANENT CHARITIES                          
*                                                                               
*                                  ** PRINT LINE 36 **                          
*                                                                               
SRTPAY   DS    F                   PAYMENT AMOUNT                               
SRTREXP  DS    F                   REIMBURSED EXPENSES                          
*                                                                               
SRTDUEC  DS    0X                                                               
SRTDUE   DS    F                   TOTAL AMOUNT DUE EMPLOYER                    
SRTDUETR DS    F                   TOTAL AMOUNT DUE EMPLOYER TAX REIM           
SRTDUENR DS    F                   TOTAL AMOUNT DUE EMPLOYER NONTAX REI         
SRTDUECL EQU   *-SRTDUEC                                                        
*                                                                               
SRTEARN  DS    F                   TAXABLE EARNINGS                             
SRTTDED  DS    F                   TOTAL DEDUCTIONS                             
SRTLIEN  DS    F                   TOTAL LIENS PUT ON CHECK                     
SRTTRST  DS    F                   TOTAL AMOUNT IN TRUST ON CHECK               
SRTNET   DS    F                   CHECK AMOUNT                                 
*                                                                               
*                                  ** PRINT LINE 38 **                          
*                                                                               
SRTFTAX  DS    F                   FEDERAL TAX                                  
SRTFICA  DS    F                   FICA                                         
SRTWTAX  DS    F                   WORK STATE TAX                               
SRTRTAX  DS    F                   RES. STATE TAX                               
SRTSUI   DS    F                   STATE UNEMPLOYEMENT INSURANCE                
SRTSFLI  DS    F                   STATE FAMILY LEAVE INSURANCE                 
SRTLTAX  DS    F                   LOCAL TAX                                    
SRTCTAX  DS    F                   CANADIAN TAX                                 
SRTMDED  DS    F                   MISCELLANEOUS DEDUCTIONS                     
SRTDUES  DS    F                   UNION DUES                                   
SRTSDI   DS    F                   STATE DISABILITY                             
SRTGST   DS    F                   GOODS AND SERVICES TAX                       
SRTGSTPD DS    F                   GOODS AND SERVICES TAX PAID                  
SRTPST   DS    F                   PROVINCIAL SERVICE TAX                       
SRTDIRCT DS    F                   DIRECT DEPOSIT                               
SRTWIRE  DS    F                   WIRE TRANSFER                                
SRTPPLA  DS    F                   PAYROLL+ COMMISSION                          
SRTTXRE  DS    F                   TAXABLE REIMBURSEMENTS                       
*                                                                               
*                                  ** PRINT LINE 40 **                          
*                                                                               
SRTYEARN DS    F                   YTD TAXABLE EARNINGS                         
SRTYNTAX DS    F                   YTD NON-TAXABLE EARNINGS                     
SRTYREX  DS    F                   YTD REIMBURSED EXPENSES                      
SRTYFED  DS    F                   YTD FEDERAL TAX                              
SRTYFIC  DS    F                   YTD FICA                                     
SRTYSTA  DS    F                   YTD STATE TAX                                
SRTYLOC  DS    F                   YTD LOCAL TAX                                
SRTYCAN  DS    F                   YTD CANADIAN TAX                             
SRTYGST  DS    F                   YTD GOODS AND SERVICES TAX                   
*                                                                               
SRTAMNTL EQU   *-SRTAMNTS          LENGTH OF CHECK AMOUNTS                      
SRTCVARL EQU   *-SRTCVARS          LENGTH OF CHECK VARIABLES                    
         EJECT                                                                  
*        MISCELLANEOUS VARIABLES                                                
*                                                                               
SRTBITS  DS    CL1                 DESCRIPTION BITS                             
SRTBCAN  EQU   X'80'               TAKE CANADIAN TAX                            
SRTBLIN  EQU   X'40'               THIS CHECK GENERATED BY LIEN                 
SRTBDD   EQU   X'20'               PERFORMER'S CHKS ARE DIRECT DEPOSIT          
SRTBW4   EQU   X'10'               PERFORMER'S CHECKS COME FIRST                
*                                  NEVER TURNED ON (NO-OP'D 8/2/96)             
**TBNFI  EQU   X'08'               TAKE NO FICA FOR THIS PERFORMER              
SRTBWIRE EQU   X'08'               PERFORMERS CHECKS ARE WIRED                  
SRTBLCL  EQU   X'04'               SORT THIS CHECK BY LOCAL                     
SRTBNDU  EQU   X'02'               TAKE NO DUE COMP FOR THIS PERFORMER          
SRTBNYTD EQU   X'01'               DON'T PRINT YTD AMOUNTS ON CHECK             
*                                                                               
SRTBITS2 DS    CL1                 2ND SET OF DESCRIPTION BITS                  
SRTBPPLA EQU   X'80'               P+ AGY COMM CHANGED                          
SRTPKCAN EQU   X'40'               P+ CANADIAN: NOT ALL TAXES TAKEN             
SRTADREC EQU   X'20'               ADVANCE RECONCILIATION:NOT ALL TAKEN         
SRTTAXWK EQU   X'10'               TAX ON A WEEKLY BASIS                        
SRTGSTO  EQU   X'08'               USE OLD GST RATE                             
SRTBEFTL EQU   X'04'               THIS LIEN IS EFT                             
SRTFONTX EQU   X'02'               DO NOT TAX THIS FOREIGNER                    
SRTTAXSM EQU   X'01'               TAX ON A SEMI-MONTHLY BASIS                  
*                                                                               
SRTLEAD  DS    CL32                AFM LEADER                                   
*                                                                               
SRTWTYP  DS    C                   WARNING TYPE (INVOICE/CHECK)                 
SRTWARN  DS    X                   WARNING NUMBER                               
*                                                                               
SRTYMEDC DS    F                   YTD MEDICARE TAX                             
SRTYPST  DS    F                   YTD PROVINCIAL SERVICES TAX                  
SRTYMDED DS    F                   YTD MISC DEDUCTIONS                          
SRTYMPT  DS    F                   YTD MPTRF                                    
SRTYDUE  DS    F                   YTD DUE EMPLOYER                             
SRTYDUET DS    F                   YTD DUE EMPLOYER TAX REIMBURSEMENTS          
SRTYDUEN DS    F                   YTD DUE EMPLOYER NON TAX REIM                
SRTYCHAR DS    F                   YTD PERMANENT CHARITIES                      
SRTYLIEN DS    F                   YTD LIENS                                    
SRTYDUES DS    F                   YTD UNION DUES                               
SRTYTRST DS    F                   YTD TRUST                                    
SRTYDIRT DS    F                   YTD DIRECT DEPOSIT                           
SRTYWIRE DS    F                   YTD WIRED                                    
SRTYPPLA DS    F                   YTD PAYROLL+ COMMISSION                      
SRTYTXRE DS    F                   YTD TAXABLE REIMBURSEMENTS                   
SRTYTOTD DS    F                   YTD TOTAL DEDUCTIONS                         
SRTCON34 DS    CL24                CONTRACTS 3 & 4                              
SRTCVRL2 EQU   *-SRTYMEDC                                                       
                                                                                
SRTTRBTS DS    X                   TRUST BITS                                   
SRTTTRST EQU   X'80'               THIS CHECK GENERATED BY W4 TRUSTEE           
SRTTCNTR EQU   X'40'               CANADIAN TRUSTEE                             
SRTTCATR EQU   X'20'               CALIFORNIA TRUSTEE                           
SRTTNYTR EQU   X'10'               NEW YORK TRUSTEE                             
SRTTLATR EQU   X'08'               LOUISIANA TRUSTEE                            
SRTTNMTR EQU   X'04'               NEW MEXICO TRUSTEE                           
SRTTDSTR EQU   X'02'               DISNEY TRUSTEE                               
                                                                                
SRTTUBTS DS    X                   TATU UNIT WORK PERFORMED                     
SRTTUCAW EQU   X'80'               CA WORK PERFORMED                            
SRTTUNYW EQU   X'40'               NY WORK PERFORMED                            
SRTTULAW EQU   X'20'               LA WORK PERFORMED                            
SRTTUNMW EQU   X'10'               NM WORK PERFORMED                            
SRTTUOTW EQU   X'08'               OTHER WORK PERFORMED                         
                                                                                
SRTW4CP  DS    CL2                 CANADIAN PROVINCE                            
*                                                                               
*        CHECK RECORD                                                           
*                                                                               
SRTCHECK DS    0C                                                               
         DS    CL4000                                                           
*                                                                               
SRTRECL  EQU   *-SRTREC                                                         
*                                                                               
CHECKL   EQU   *-CHECKD                                                         
         EJECT                                                                  
*        ERROR INVOICE TABLE DSECT                                              
*                                                                               
ERITABD  DSECT                                                                  
ERIAGY   DS    CL6                 AGENCY CODE                                  
ERIINV   DS    CL6                 INVOICE NUMBER                               
ERITERR  DS    X                   ERROR NUMBER                                 
ERILEN   EQU   *-ERITABD                                                        
*                                                                               
*        WARNING CHECK TABLE DSECT                                              
*                                                                               
WARTABD  DSECT                                                                  
WARCHK   DS    CL8                 CHECK NUMBER                                 
WARTERR  DS    X                   WARNING NUMBER                               
WARLEN   EQU   *-WARTABD                                                        
*                                                                               
*        ACH POSTING TABLE DSECT                                                
*                                                                               
ACHTABD  DSECT                                                                  
ACHUNIT  DS    CL3                 UNIT                                         
ACHTYPE  DS    CL1                 TYPE                                         
ACHACCT  DS    CL14                ACCOUNT                                      
ACHLEN   EQU   *-ACHTABD                                                        
*                                                                               
*        PERFORMER YTD TABLE DSECT                                              
*                                                                               
PYTDTABD DSECT                                                                  
PYTDEMP  DS    CL3                 EMPLOYER                                     
PYTDSSN  DS    CL9                 S/S NUMBER                                   
PYTDLKEY EQU   *-PYTDTABD          * L'KEY                                      
PYTDDSP  EQU   *-PYTDTABD          * DISP. TO ACCUMS                            
PYTDAMTS DS    CL(TYCYLNQ)         YTD AMOUNTS RETURNED BY TAYTD FOR            
*                                  I/P TO TALIM & UPDATED FOR EACH CHK          
* P+ CANADIAN CHECKS                                                            
PYTDCAMT DS    CL(TYCYCLNQ)        YTD AMOUNTS RETURNED BY TAYTD FOR            
*                                  I/P TO TALIM & UPDATED FOR EACH CHK          
PYTDLEN  EQU   *-PYTDTABD                                                       
*                                                                               
*        PERFORMER QTD TABLE DSECT                                              
*                                                                               
QTDTABD  DSECT                                                                  
QTDEMP   DS    CL3                 EMPLOYER                                     
QTDSSN   DS    CL9                 SOCIAL SECURITY NUMBER                       
QTDUNIT  DS    CL3                 TAX UNIT                                     
QTDLKEY  EQU   *-QTDTABD           * L'KEY                                      
QTDDSP   EQU   *-QTDTABD           * DISP. TO ACCUMS                            
QTDAMNTS DS    0X                                                               
QTDEARN  DS    XL4                 QTD EARNINGS                                 
QTDSDI   DS    XL4                 QTD SDI                                      
QTDLEN   EQU   *-QTDTABD                                                        
*                                                                               
*        EMPLOYER/SSN/UNIT YTD TABLE DSECT                                      
*                                                                               
ESUTABD  DSECT                                                                  
ESUEMP   DS    CL3                 EMPLOYER                                     
ESUSSN   DS    CL9                 SOCIAL SECURITY NUMBER                       
ESUUNIT  DS    CL3                 TAX UNIT                                     
ESULKEY  EQU   *-ESUTABD           * L'KEY                                      
ESUAMNTS DS    0X                                                               
ESUDSP   EQU   *-ESUTABD           * DISP. TO ACCUMS                            
ESUEARN  DS    XL4                 YTD EARNINGS                                 
ESUTAX   DS    XL4                 YTD TAX                                      
ESUFICA  DS    XL4                 YTD FICA (FEDERAL)                           
ESUREXP  DS    XL4                 YTD REIMBURSED EXPENSES (FEDERAL)            
         ORG   *-8                                                              
ESUSDI   DS    XL4                 YTD DISABILITY INSURANCE (STATE)             
ESUSUI   DS    XL4                 YTD UNEMPLOYMENT INSURANCE (STATE)           
         ORG   *-8                                                              
ESUPST   DS    XL4                 * RESERVED FOR PST         (CANADA)          
ESUGST   DS    XL4                 YTD GOODS AND SERVICES TAX (CANADA)          
*                                                                               
ESUSFLI  DS    XL4                 YTD FAMILY LEAVE INSURANCE (STATE)           
*                                                                               
ESUMDD   DS    XL4                 YTD MISC DEDUCTION                           
ESUMTR   DS    XL4                 YTD MPTRP                                    
ESUDTP   DS    XL4                 YTD DUE TP                                   
ESUDTPTR DS    XL4                 YTD DUE TP TAX REIM                          
ESUDTPNR DS    XL4                 YTD DUE TP NON TAX REIM                      
ESUPRC   DS    XL4                 YTD PERMANENT CHARITIES                      
ESULIE   DS    XL4                 YTD LIENS                                    
ESUUND   DS    XL4                 YTD UNION DUES                               
ESUTRS   DS    XL4                 YTD TRUSTS                                   
ESUDRT   DS    XL4                 YTD DIRECT DEPOSITS                          
ESUWRD   DS    XL4                 YTD WIRED                                    
ESUPPA   DS    XL4                 YTD PAYROLL+ COMMISSION                      
ESUTXRE  DS    XL4                 YTD TAXABLE REIMBURSEMENTS                   
ESUNTRE  DS    XL4                 YTD NON-TAXABLE REIMBURSEMENTS               
*                                                                               
ESUTSUI  DS    XL4                 TAXABLE SUI FOR UNIT                         
ESUYSUI  DS    XL4                 YTD TAXABLE SUI FOR CHECK                    
*                                                                               
ESUCTXRE DS    XL4                 YTD TAXABLE REIMBURSEMENTS CAD               
ESUCNTRE DS    XL4                 YTD NON-TAXABLE REIMBURSEMENTS CAD           
ESUCEARN DS    XL4                 YTD EARNINGS CAD                             
*                                                                               
ESUUTAX  DS    XL4                 TAXES                                        
ESUUPP   DS    XL4                 PENSION PLAN                                 
ESUUEI   DS    XL4                 EMP INSURANCE                                
ESUUPIP  DS    XL4                 PARENTAL PLAN                                
ESUCTAX  DS    XL4                 TAXES CAD                                    
ESUCPP   DS    XL4                 PENSION PLAN CAD                             
ESUCEI   DS    XL4                 EMP INSURANCE CAD                            
ESUCPIP  DS    XL4                 PARENTAL PLAN CAD                            
*                                                                               
ESUFERN  DS    XL4                 FEDERAL EARNINGS AT PROV LEVEL               
*                                                                               
         DS    XL50                SPARE                                        
*                                                                               
ESUAMNTL EQU   *-ESUAMNTS                                                       
ESULEN   EQU   *-ESUTABD                                                        
*                                                                               
*        DUE COMPANY AMOUNTS TABLE DSECT                                        
*                                                                               
DUETABD  DSECT                                                                  
DUESSN   DS    CL9                 SOCIAL SECURITY NUMBER                       
DUEDUC   DS    CL6                 DUE COMPANY CODE                             
DUEEMP   DS    CL3                 EMPLOYER                                     
DUELKEY  EQU   *-DUETABD           L'KEY                                        
DUEELEM  DS    XL(TADULNQ)         DUE COMPANY DETAILS ELEMENT                  
DUEINV   DS    XL4                 AMOUNT COLLECTED THIS INVOICE                
DUELEN   EQU   *-DUETABD                                                        
*                                                                               
*        LIEN AMOUNTS TABLE DSECT                                               
*                                                                               
LINTABD  DSECT                                                                  
LINSSN   DS    CL9                 SOCIAL SECURITY NUMBER                       
LINLIN   DS    CL6                 LIEN CODE                                    
LINLKEY  EQU   *-LINTABD           L'KEY                                        
LINELEM  DS    XL(TALNLNQ)         LIEN DETAILS ELEMENT                         
LININV   DS    XL4                 AMOUNT COLLECTED THIS INVOICE                
LINLEN   EQU   *-LINTABD                                                        
*                                                                               
*                                                                               
*        W4 TRUSTEE TABLE DSECT                                                 
*                                                                               
TRSTABD  DSECT                                                                  
TRSTSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TRSTEMP  DS    CL3                 EMPLOYER                                     
TRSTLKEY EQU   *-TRSTABD           L'KEY                                        
TRSTTSSN DS    CL9                 TRUSTEE SSN                                  
TRSTCOL  DS    XL4                 AMOUNT COLLECTED                             
TRSTINV  DS    XL4                 AMOUNT COLLECTED THIS INVOICE                
TRSTLEN  EQU   *-TRSTABD                                                        
*                                                                               
*        SAVED DUE COMPANY AMOUNTS TABLE DSECT (FOR SOON CHECKS)                
*                                                                               
SDUED    DSECT                                                                  
SDUESSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
SDUEDWEL DS    CL(TADWLNQ)         DUE COMPANY WITHHOLDING EL.                  
SDUELEN  EQU   *-SDUED                                                          
*                                                                               
*        SAVED LIEN AMOUNTS TABLE DSECT (FOR SOON CHECKS)                       
*                                                                               
SLIND    DSECT                                                                  
SLINSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
SLINLWEL DS    CL(TALWLNQ)         LIEN WITHHOLDING ELEMENT                     
SLINLEN  EQU   *-SLIND                                                          
*                                                                               
*        SAVED W4 TRUSTEE TABLE DSECT (FOR SOON CHECKS)                         
*                                                                               
STRSTD   DSECT                                                                  
STRSTSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
STRSTTSN DS    CL9                 TRUSTEE SSN                                  
STRSTCTP DS    XL4                 AMOUNT COLLECTED & HELD FOR TP               
STRSTCPK DS    XL4                 AMOUNT COLLECTED & HELD FOR P+               
STRSTCPP DS    XL4                 AMOUNT COLLECTED & HELD FOR PP               
STRSTERN DS    XL4                 AMOUNT EARNED                                
STRSTLEN EQU   *-STRSTD                                                         
*                                                                               
*        ACCOUNT ACCUMULATORS DSECT                                             
*                                                                               
ACCTABD  DSECT                                                                  
ACCENTRY DS    0CL11               LABEL WITH LENGTH OF WHOLE ETRY              
ACCTYPE  DS    C                   ACCOUNT TYPE                                 
*                                  '1' = SE42001 (EARNINGS)                     
*                                  '2' = SE42002                                
*                                  '3' = SE42003                                
*                                  '4' = SXTX    (WITHHOLDING)                  
*                                  '5' = SC2001(OR 1002)  (CASH)                
*                                  '6' = SE42005          (P&H)                 
*                                  '7' = SXPW             (P&H)                 
*                                  '8' = SE11209 OR SE11210 (MDED&DUES)         
*                                  '9' = SE42009  (CAN$ EARN)                   
*                                  'C' = SK2CDNPR (CONVERSION)                  
*                                  'D' = SK2CDNM (CONV FOR MDED & DUES)         
*                                  'E' = SK2CDNPW (CONVERSION FOR P&H)          
ACCKEY   DS    CL6                 ACCOUNT KEY                                  
*                                  FOR '1' = TPOFFICE(1)                        
*                                  FOR '2' = TPOFFICE(1)                        
*                                  FOR '3' = TPOFFICE(1)                        
*                                  FOR '4' = TAX UNIT/TAX TYPE(4)               
*                                  FOR '5' = NOTHING                            
*                                  FOR '6' = TPOFFICE(1)                        
*                                  FOR '7' = UNION/LOCAL(6)                     
*                                  FOR '8' = TPOFFICE(1)                        
*                                  FOR '9' = TPOFFICE(1)                        
*                                  FOR 'C' = NOTHING                            
*                                  FOR 'D' = NOTHING                            
*                                  FOR 'E' = UNION(3)                           
ACCLKEY  EQU   *-ACCTABD           L'KEY                                        
ACCDSP   EQU   *-ACCTABD           DISP. TO ACCUMS                              
ACCAMNT  DS    XL4                 ACCUMULATED AMOUNT                           
ACCLEN   EQU   *-ACCTABD                                                        
*                                                                               
*        DSECT TO COVER BINSRCH TABLES                                          
*                                                                               
BIND     DSECT                                                                  
BININ    DS    F                   NUMBER IN TABLE                              
BINLEN   DS    F                   RECORD LENGTH                                
BINDISP  DS    CL1                 DISPLACEMENT IN RECORD OF KEY                
BINKEY   DS    CL3                 KEY LENGTH                                   
BINMAX   DS    F                   MAXIMUM NUMBER IN TABLE                      
BINNUMB  DS    CL1                 NUMBER OF BUCKETS                            
BINFRST  DS    CL1                 DISP. TO FIRST BUCKET                        
BINSTAT  DS    CL1                 X'80' BINARY DATA                            
         DS    CL1                 SPARE                                        
BNPRMLNQ EQU   *-BIND                                                           
BINTABLE DS    0C                  THE TABLE                                    
*                                                                               
*        DSECT TO COVER OFFICE TABLE                                            
*                                                                               
OFFD     DSECT                                                                  
OFFCODE  DS    CL1                 CODE                                         
OFFNAME  DS    CL15                NAME                                         
OFFTEL   DS    CL10                TEL#                                         
OFFLNQ   EQU   *-OFFD                                                           
OFFNEXT  EQU   *                                                                
*                                                                               
*        DSECT TO COVER EPISODE TABLE                                           
*                                                                               
EPITABD  DSECT                                                                  
EPIAGY   DS    CL6                 AGENCY                                       
EPINUM   DS    CL5                 EPISODE NUMBER                               
EPIWDT   DS    XL3                 WORK DATE                                    
EPIADT   DS    XL3                 AIR DATE                                     
EPILEN   EQU   *-EPITABD                                                        
EPINEXT  EQU   *                                                                
*                                                                               
*        DSECT TO COVER AGENCY AND CLIENT FLIST TABLE                           
*                                                                               
FLSTTABD DSECT                                                                  
FLSTCODE DS    CL8                 AGENCY OR CLIENT FLIST RECORD CODE           
FLSTNUM  DS    XL1                 NUMBER OF CODES IN FLIST                     
FLSTDATA DS    0CL6                AGENCY OR CLIENT CODES                       
FLSTLEN  EQU   *-FLSTTABD                                                       
FLSTNEXT EQU   *                                                                
         EJECT                                                                  
*                                                                               
*        DSECT TO COVER SUI TABLE BUILT IN TACKTAX (P+)                         
*                                                                               
SUITABD  DSECT                                                                  
SUITUNIT DS    CL3                 UNIT                                         
SUITAMNT DS    XL4                 AMOUNT                                       
SUITYTDE DS    XL4                 YTD EARNINGS                                 
SUITTSUI DS    XL4                 TAXABLE SUI                                  
SUITSTAT DS    XL1                 STATUS                                       
SUITWAGE EQU   X'80'               WAGE                                         
SUITTAX  EQU   X'40'               TAXABLE NON WAGE                             
SUITFLAG DS    XL1                 FLAGS                                        
SUITFPRO EQU   X'FF'               PROCESSED                                    
SUITABLN EQU   *-SUITUNIT                                                       
         EJECT                                                                  
       ++INCLUDE TAYTDD                                                         
