*          DATA SET TACLARUSD  AT LEVEL 002 AS OF 07/21/15                      
***********************************************************************         
*        DSECT TO COVER NON-DDS CLARUS FILE LAYOUT                    *         
***********************************************************************         
                                                                                
***********************************************************************         
*                                                                     *         
*        NON-DDS CLARUS UPLOAD HEADER RECORD                          *         
*                                                                     *         
***********************************************************************         
                                                                                
NDHDD    DSECT                     FILE HEADER RECORD                           
NDHDR    DS    0C                  FILE HEADER RECORD                           
NDHDID   DS    CL3                 RECORD ID                                    
NDHDIDQ  EQU   C'000'                FILE HEADER                                
NDHDMDCO DS    CL10                MEDIA COMPANY ID                             
NDHDDATE DS    CL8                 DATE - YYYYMMDD                              
NDHDTIME DS    CL8                 TIME - HH:MM:SS                              
NDHDFLNM DS    CL36                UNIQUE FILE NAME                             
NDHDRLN  EQU   *-NDHDR             LENGTH OF RECORD                             
*                                                                               
         TITLE 'T70365 - NON-DDS CLARUS - NDTWD'                                
***********************************************************************         
*                                                                     *         
*        NON-DDS CLARUS UPLOAD TV -WILDSPOT                           *         
*                                                                     *         
***********************************************************************         
                                                                                
NDTWD    DSECT                     TV WILD SPOT DSECT                           
NDTWREC  DS    0C                  TV WILD SPOT RECORD                          
NDTWID   DS    CL3                 RECORD ID                                    
NDTWIDQ  EQU   C'001'                TV WILDSPOT                                
NDTWUPID DS    CL10                UNIQUE ID                                    
NDTWAGY  DS    CL6                 TALENT AGENCY CODE                           
NDTWCMID DS    CL12                COMMERCIAL ID/AD-ID                          
NDTWCMLN DS    CL3                 COMMERCIAL LENGTH IN SECONDS                 
NDTWCMTL DS    CL36                COMMERCIAL TITLE                             
NDTWCLCD DS    CL6                 CLIENT  CODE                                 
NDTWCLNM DS    CL36                CLIENT  NAME                                 
NDTWPRCD DS    CL6                 PRODUCT CODE                                 
NDTWPRNM DS    CL36                PRODUCT NAME                                 
NDTWASTR DS    CL8                 ACTIVE START DATE - YYYYMMDD                 
NDTWAEND DS    CL8                 ACTIVE END   DATE - YYYYMMDD                 
NDTWMKCD DS    CL4                 MARKET CODE - TALENT                         
NDTWMKNM DS    CL15                MARKET NAME                                  
NDTWLN   EQU   *-NDTWREC           LENGTH OF RECORD                             
*                                                                               
         TITLE 'T70365 - NON-DDS CLARUS - NDRWD'                                
***********************************************************************         
*                                                                     *         
*        NON-DDS CLARUS UPLOAD - RADIO WILDSPOT                       *         
*                                                                     *         
***********************************************************************         
                                                                                
NDRWD    DSECT                     RADIO WILDSPOT DSECT                         
NDRWREC  DS    0C                  RADIO WILD SPOT RECORD                       
NDRWID   DS    CL3                 RECORD ID                                    
NDRWIDQ  EQU   C'002'                RADIO WILDSPOT                             
NDRWUPID DS    CL10                UNIQUE ID                                    
NDRWAGY  DS    CL6                 TALENT AGENCY CODE                           
NDRWCMID DS    CL12                COMMERCIAL ID/AD-ID                          
NDRWCMLN DS    CL3                 COMMERCIAL LENGTH IN SECONDS                 
NDRWCMTL DS    CL36                COMMERCIAL TITLE                             
NDRWCLCD DS    CL6                 CLIENT  CODE                                 
NDRWCLNM DS    CL36                CLIENT  NAME                                 
NDRWPRCD DS    CL6                 PRODUCT CODE                                 
NDRWPRNM DS    CL36                PRODUCT NAME                                 
NDRWASTR DS    CL8                 ACTIVE START DATE - YYYYMMDD                 
NDRWAEND DS    CL8                 ACTIVE END   DATE - YYYYMMDD                 
NDRWMKCD DS    CL4                 MARKET CODE - ALPHA                          
NDRWMKNM DS    CL15                MARKET NAME                                  
NDRWLN   EQU   *-NDRWREC           LENGTH OF RECORD                             
*                                                                               
         TITLE 'T70365 - NON-DDS CLARUS - NDLCD'                                
***********************************************************************         
*                                                                     *         
*        NON-DDS CLARUS UPLOAD - LOCAL CABLE                          *         
*                                                                     *         
***********************************************************************         
                                                                                
NDLCD    DSECT                     LOCAL CABLE DSECT                            
NDLCREC  DS    0C                  LOCAL CABLE RECORD                           
NDLCID   DS    CL3                 RECORD ID                                    
NDLCIDQ  EQU   C'003'               LOCAL CABLE                                 
NDLCUPID DS    CL10                UNIQUE ID                                    
NDLCAGY  DS    CL6                 TALENT AGENCY CODE                           
NDLCCMID DS    CL12                COMMERCIAL ID/AD-ID                          
NDLCCMLN DS    CL3                 COMMERCIAL LENGTH IN SECONDS                 
NDLCCMTL DS    CL36                COMMERCIAL TITLE                             
NDLCCLCD DS    CL6                 CLIENT  CODE                                 
NDLCCLNM DS    CL36                CLIENT  NAME                                 
NDLCPRCD DS    CL6                 PRODUCT CODE                                 
NDLCPRNM DS    CL36                PRODUCT NAME                                 
NDLCASTR DS    CL8                 ACTIVE START DATE - YYYYMMDD                 
NDLCAEND DS    CL8                 ACTIVE END   DATE - YYYYMMDD                 
NDLCSYCD DS    CL6                 LOCAL CABLE SYSTEM - CODE                    
NDLCSYNM DS    CL15                LOCAL CABLE SYSTEM - NAME                    
NDLCLN   EQU   *-NDLCREC           LENGTH OF RECORD                             
*                                                                               
         TITLE 'T70365 - NON-DDS CLARUS - NDCBD'                                
***********************************************************************         
*                                                                     *         
*        NON-DDS CLARUS UPLOAD - CABLE                                *         
*                                                                     *         
***********************************************************************         
                                                                                
NDCBD    DSECT                     CABLE DSECT                                  
NDCBREC  DS    0C                  CABLE RECORD                                 
NDCBID   DS    CL3                 RECORD ID                                    
NDCBIDQ  EQU   C'004'               CABLE                                       
NDCBUPID DS    CL10                UNIQUE ID                                    
NDCBAGY  DS    CL6                 TALENT AGENCY CODE                           
NDCBCMID DS    CL12                COMMERCIAL ID/AD-ID                          
NDCBCMLN DS    CL3                 COMMERCIAL LENGTH IN SECONDS                 
NDCBCMTL DS    CL36                COMMERCIAL TITLE                             
NDCBCLCD DS    CL6                 CLIENT  CODE                                 
NDCBCLNM DS    CL36                CLIENT  NAME                                 
NDCBPRCD DS    CL6                 PRODUCT CODE                                 
NDCBPRNM DS    CL36                PRODUCT NAME                                 
NDCBUDTE DS    CL8                 USE DATE - YYYYMMDD                          
NDCBSTCD DS    CL4                 CABLE STATION CODE - NTI                     
NDCBSTNM DS    CL15                CABLE STATION NAME                           
NDCBLN   EQU   *-NDCBREC           LENGTH OF RECORD                             
*                                                                               
         TITLE 'T70365 - NON-DDS CLARUS - NDNTD'                                
***********************************************************************         
*                                                                     *         
*        NON-DDS CLARUS UPLOAD - NETWORK                              *         
*                                                                     *         
***********************************************************************         
                                                                                
NDNTD    DSECT                     NETWORK DSECT                                
NDNTREC  DS    0C                  NETWORK RECORD                               
NDNTID   DS    CL3                 RECORD ID                                    
NDNTIDQ  EQU   C'005'               CABLE                                       
NDNTUPID DS    CL10                UNIQUE ID                                    
NDNTAGY  DS    CL6                 TALENT AGENCY CODE                           
NDNTCMID DS    CL12                COMMERCIAL ID/AD-ID                          
NDNTCMLN DS    CL3                 COMMERCIAL LENGTH IN SECONDS                 
NDNTCMTL DS    CL36                COMMERCIAL TITLE                             
NDNTCLCD DS    CL6                 CLIENT  CODE                                 
NDNTCLNM DS    CL36                CLIENT  NAME                                 
NDNTPRCD DS    CL6                 PRODUCT CODE                                 
NDNTPRNM DS    CL36                PRODUCT NAME                                 
NDNTUDTE DS    CL8                 USE DATE - YYYYMMDD                          
NDNTPGNM DS    CL15                PROGRAM NAME                                 
NDNTNTCD DS    CL1                 NETWORK CODE                                 
*                                    A - ABC                                    
*                                    C - CBS                                    
*                                    F - FOX                                    
*                                    I - ITN                                    
*                                    M - MNT OR MY                              
*                                    N - NBC                                    
*                                    X - PAX                                    
*                                    U - UPN                                    
*                                    W - WB OR CW                               
*                                    S - SYNDICATED                             
NDNTUNMK DS    CL1                 UNMARKED - T/F                               
NDNTNAIR DS    CL1                 UNAIRED  - T/F                               
NDNTLCHG DS    CL1                 LENGTH     CHANGED  - T/F                    
NDNTPCHG DS    CL1                 PRODUCT    CHANGED  - T/F                    
NDNTDCHG DS    CL1                 DATE       CHANGED  - T/F                    
NDNTCCHG DS    CL1                 COMMERCIAL CHANGED  - T/F                    
NDNTFLAT DS    CL1                 FLAT RATE/LATE NIGHT- T/F                    
NDNTNWHY DS    CL1                 REASON NOT AIRED                             
*                                    D - DELETED                                
*                                    P - PREEMPTED                              
*                                    M - MISSED                                 
NDNTMRUN DS    CL1                 MULTIPLE RUN        - T/F                    
NDNTLN   EQU   *-NDNTREC           LENGTH OF RECORD                             
*                                                                               
         TITLE 'T70365 - NON-DDS CLARUS - NDTRD'                                
***********************************************************************         
*                                                                     *         
*        NON-DDS CLARUS UPLOAD - TRAILER                              *         
*                                                                     *         
***********************************************************************         
                                                                                
NDTRD    DSECT                     TRAILER DSECT                                
NDTRREC  DS    0C                  TRAILER RECORD                               
NDTRID   DS    CL3                 RECORD ID                                    
NDTRIDQ  EQU   C'999'               CABLE                                       
NDTRCT   DS    CL10                RECORD COUNT                                 
NDTRLN   EQU   *-NDTRREC           LENGTH OF RECORD                             
*                                                                               
*                                                                               
         EJECT                                                                  
