*          DATA SET TACNVUSES  AT LEVEL 006 AS OF 08/06/90                      
*              LOOK UP FOR OTHER USE TYPES                                      
         SPACE 3                                                                
SUPUSE   NTR1                                                                   
         L     R2,0(R1)            P1=A(4 BYTE USE)                             
         CLC   0(3,R2),=C'UPW'     REPAIR UPW                                   
         BNE   XIT                                                              
         MVC   0(3,R2),=C'WSP'                                                  
         CLI   3(R2),4             CHANGE 4 TO 5                                
         BNE   *+8                                                              
         MVI   3(R2),5                                                          
         CLI   3(R2),3             CHANGE 3 TO 4                                
         BNE   *+8                                                              
         MVI   3(R2),4                                                          
         B     XIT                                                              
         SPACE 1                                                                
         LA    R1,SUPUSTAB                                                      
         SPACE 1                                                                
SUPUSE2  CLI   0(R1),X'FF'                                                      
         BE    XIT                                                              
         CLC   0(3,R2),0(R1)                                                    
         BE    SUPUSE4                                                          
         LA    R1,7(R1)                                                         
         B     SUPUSE2                                                          
         SPACE 1                                                                
SUPUSE4  MVC   0(4,R2),3(R1)       RETURN USE AND TYPE                          
         B     XIT                                                              
         SPACE 1                                                                
*              USE TYPE TABLES                                                  
         SPACE 1                                                                
SUPUSTAB DS    0C                                                               
         DC    C'GRT'                                                           
         DC    C'GRT',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'GRX'                                                           
         DC    C'GRT',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'BSS'                                                           
         DC    C'BSS',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'SBS'                                                           
         DC    C'BSS',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'HLD'                                                           
         DC    C'HLD',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'LFT'                                                           
         DC    C'LFT',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'CAB'                                                           
         DC    C'CAB',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'CLA'                                                           
         DC    C'CLA',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'CLH'                                                           
         DC    C'CLA',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'CLB'                                                           
         DC    C'LOC',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'CBX'                                                           
         DC    C'LOC',AL1(2)                                                    
         SPACE 1                                                                
         DC    C'CLC'                                                           
         DC    C'LOC',AL1(3)                                                    
         SPACE 1                                                                
         DC    C'DAN'                                                           
         DC    C'DLR',AL1(2)                                                    
         SPACE 1                                                                
         DC    C'DAX'                                                           
         DC    C'DLR',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'DBN'                                                           
         DC    C'DLR',AL1(4)                                                    
         SPACE 1                                                                
         DC    C'DBX'                                                           
         DC    C'DLR',AL1(3)                                                    
         SPACE 1                                                                
         DC    C'DEM'                                                           
         DC    C'DEM',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'FGN'                                                           
         DC    C'FGN',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'G13'                                                           
         DC    C'CLA',AL1(2)                                                    
         SPACE 1                                                                
         DC    C'WSP'                                                           
         DC    C'WSP',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'UPA'                                                           
         DC    C'CLA',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'UPN'                                                           
         DC    C'LOC',AL1(4)                                                    
         SPACE 1                                                                
         DC    C'UPX'                                                           
         DC    C'LOC',AL1(5)                                                    
         SPACE 1                                                                
         DC    C'UPW'                                                           
         DC    C'WSP',AL1(4)                                                    
         SPACE 1                                                                
         DC    C'DLR'                                                           
         DC    C'DLR',AL1(5)                                                    
         SPACE 1                                                                
         DC    C'L04'                                                           
         DC    C'RLO',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'L13'                                                           
         DC    C'RLO',AL1(2)                                                    
         SPACE 1                                                                
         DC    C'NAB'                                                           
         DC    C'RNT',AL1(7)                                                    
         SPACE 1                                                                
         DC    C'N01'                                                           
         DC    C'RNT',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'N04'                                                           
         DC    C'RNT',AL1(2)                                                    
         SPACE 1                                                                
         DC    C'N08'                                                           
         DC    C'RNT',AL1(3)                                                    
         SPACE 1                                                                
         DC    C'N13'                                                           
         DC    C'RNT',AL1(4)                                                    
         SPACE 1                                                                
         DC    C'R13'                                                           
         DC    C'RRN',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'U26'                                                           
         DC    C'RNT',AL1(5)                                                    
         SPACE 1                                                                
         DC    C'U39'                                                           
         DC    C'RNT',AL1(6)                                                    
         SPACE 1                                                                
         DC    C'WS8'                                                           
         DC    C'WSP',AL1(2)                                                    
         SPACE 1                                                                
         DC    C'UP8'                                                           
         DC    C'WSP',AL1(5)                                                    
         SPACE 1                                                                
         DC    C'OTH'                                                           
         DC    C'OTH',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'PEN'                                                           
         DC    C'PEN',AL1(0)                                                    
         SPACE 1                                                                
         DC    C'C04'                                                           
         DC    C'CAB',AL1(2)                                                    
         SPACE 1                                                                
         DC    C'C13'                                                           
         DC    C'CAB',AL1(3)                                                    
         SPACE 1                                                                
         DC    C'C52'                                                           
         DC    C'CAB',AL1(4)                                                    
         SPACE 1                                                                
         DC    C'UCA'                                                           
         DC    C'CAB',AL1(5)                                                    
         SPACE 1                                                                
         DC    C'UCB'                                                           
         DC    C'CAB',AL1(6)                                                    
         SPACE 1                                                                
         DC    C'UCC'                                                           
         DC    C'CAB',AL1(7)                                                    
         SPACE 1                                                                
         DC    C'DUB'                                                           
         DC    C'MUS',AL1(1)                                                    
         SPACE 1                                                                
         DC    C'DU8'                                                           
         DC    C'MUS',AL1(2)                                                    
         SPACE 1                                                                
         DC    C'MUS'                                                           
         DC    C'MUS',AL1(3)                                                    
         SPACE 1                                                                
         DC    C'MU8'                                                           
         DC    C'MUS',AL1(4)                                                    
         SPACE 1                                                                
         DC    C'NEW'                                                           
         DC    C'MUS',AL1(5)                                                    
         SPACE 1                                                                
         DC    C'NW8'                                                           
         DC    C'MUS',AL1(6)                                                    
         SPACE 1                                                                
         DC    X'FF'                                                            
