*          DATA SET TAETHCTY   AT LEVEL 001 AS OF 07/16/13                      
***********************************************************************         
*        TABLE OF VALID ETHNICITIES                                   *         
***********************************************************************         
                                                                                
VETHCTY  DS    0CL2                                                             
         DC    CL2'AP'                                                          
         DC    CL2'B '                                                          
         DC    CL2'C '                                                          
         DC    CL2'I '                                                          
         DC    CL2'LH'                                                          
         DC    CL2'M '                                                          
         DC    CL2'S '                                                          
         DC    X'FF'                                                            
