*          DATA SET TAGENPAYD  AT LEVEL 131 AS OF 03/30/16                      
         SPACE 2                                                                
*              DSECT TO COVER CAST SELECT SCREEN LINE                           
         SPACE 1                                                                
SELD     DSECT                                                                  
SELCODEH DS    CL8                                                              
SELCODE  DS    CL1                 SELECT CODE                                  
SELCODEX DS    CL8                                                              
SELSKIPH DS    CL8                                                              
SELSKIP  DS    CL1                 AUTOSKIP                                     
SELDATAH DS    CL8                                                              
SELDATA  DS    0CL66                                                            
SELSSN   DS    CL11                S/S NUMBER                                   
         DS    CL1                                                              
SELNAME  DS    CL16                NAME                                         
         DS    CL1                                                              
SELCAT   DS    CL3                 CATEGORY                                     
         DS    CL1                                                              
SELCAM   DS    CL3                 ON/OFF CAMERA                                
         DS    CL2                                                              
SELDBL   DS    CL1                 N'DOUBLES                                    
         DS    CL2                                                              
SELUNI   DS    CL3                 UNION                                        
         DS    CL1                                                              
SELLCL   DS    CL3                 LOCAL                                        
         DS    CL1                                                              
SELYR    DS    CL3                 YEAR                                         
         DS    CL1                                                              
SELOV1   DS    CL6                 OVERSCALE 1                                  
         DS    CL1                                                              
SELOV2   DS    CL6                 OVERSCALE 2                                  
SELSEQH  DS    CL8                                                              
SELSEQ   DS    CL4                 CAST SEQUENCE NUMBER                         
SELNEXT  EQU   *                                                                
         SPACE 3                                                                
*              DSECT TO COVER CAST PAGE TABLE                                   
         SPACE 1                                                                
PAGED    DSECT                                                                  
PAGESSN  DS    F                   S/S NUMBER                                   
PAGECAUH DS    A                   D/A(CAST UH REC WHEN PAYING VERSION)         
PAGESKEY DS    XL6                 SORT KEY                                     
PAGENCW  DS    XL1                 N'CHECK WITHHOLDING ELS. REQUIRED            
*                                  X'80'=CAST GETS 2X FIXED RATE IN H&W         
*                                  X'40'=CAST GETS 1X FIXED RATE IN H&W         
*                                  X'20'=WITHHOLD ACTRA UNION DUES              
PAGEW4TY DS    CL1                 W4 TYPE                                      
PAGELOCL DS    CL3                 RESIDENCE LOCAL                              
PAGELNQ  EQU   *-PAGED                                                          
PAGENEXT EQU   *                                                                
         EJECT                                                                  
*              DSECT TO COVER MARKET TABLE                                      
         SPACE 1                                                                
MKTTABLD DSECT                                                                  
MTCODE   DS    CL(L'TAMTCODE)                                                   
MTINUM   DS    XL(L'TAMTINUM)                                                   
MT1DATE  DS    XL(L'TAMTCYCS)                                                   
MTCYCEND DS    XL(L'TAMTCYCE)                                                   
MTSTAT   DS    CL1                                                              
MTNOCALC EQU   X'80'               DO INCLUDE IN AUTOMATIC CALCULATION          
MTPROCDS EQU   X'40'               ALREADY PROCESSED                            
MKTLNQ   EQU   *-MKTTABLD                                                       
         EJECT                                                                  
*              DSECT TO COVER INTERNET/NEW MEDIA TABLE                          
         SPACE 1                                                                
MEDTABLD DSECT                                                                  
MEDTYP   DS    CL(L'TLMDTYPE)                                                   
MEDCOD   DS    CL(L'TLMDCODE)                                                   
MEDLNQ   EQU   *-MEDTABLD                                                       
         EJECT                                                                  
       ++INCLUDE TAPAYBRKD                                                      
         EJECT                                                                  
*              DSECT TO COVER TABLE THAT DETERMINES WHICH COMMERCIAL            
*              RECORD THE VERSION CODE IS ON                                    
         SPACE 1                                                                
VINDEXD  DSECT                                                                  
VINDUPLM DS    X                 RECORD'S UPPER LIMIT                           
VINDEQUT DS    X                 RECORD'S EQUATE                                
VINDLNQ  EQU   *-VINDEXD                                                        
         EJECT                                                                  
*              DSECT TO COVER TEMPORARY STORAGE                                 
         SPACE 1                                                                
TMPPAYD  DSECT                                                                  
GQTABLE  DS    48CL(L'TAGQSBEL)    GRT TRACKING REQUESTS FOR INV APPRVE         
NGQTAB   EQU   (*-GQTABLE)/L'GQTABLE (SEE TAGQSBEL)                             
*              IF CHANGE NGQTAB, MUST MAKE CHANGE IN SCRNELS IN TAGEN50         
*                                                                               
FQTABLE  DS    58CL(L'TAFQSBEL)    FIXED CYCLE TRACKING REQUESTS                
NFQTAB   EQU   (*-FQTABLE)/L'FQTABLE (SEE TAFQSBEL)                             
*              IF CHANGE NFQTAB, MUST MAKE CHANGE IN SCRNELS IN TAGEN50         
*                                                                               
UNLCLLST DS    30CL6               LIST OF ALL PERF'S UNION/LOCALS PAID         
*                                  BYTES 1-3 = UNION                            
*                                        4-6 = LOCAL                            
NUNLCL   EQU   (*-UNLCLLST)/L'UNLCLLST                                          
*                                                                               
INVPTRS  DS    CL((6*L'TLDRREC)+1) INVOICE POINTER BLOCK                        
CHKPTRS  DS    CL((6*L'TLDRREC)+1) CHECK POINTER BLOCK                          
DUEPTRS  DS    CL((2*L'TLDRREC)+1) DUE COMPANY POINTER BLOCK                    
         ORG   DUEPTRS                                                          
CASTPTRS DS    CL((5*L'TLDRREC)+1) CAST POINTER BLOCK                           
UHMTPTRS DS    CL((56*L'TLDRREC)+1) USAGE HISTORY POINTER BLOCK                 
*                                                                               
SOPCMTEL DS    CL63                CHECK COMMENT ELEMENT FOR SOP                
*                                                                               
SAVTGROS DS    F                   TGROSS BEFORE ACTRA FUND ADDITION            
*                                                                               
TSARAREA DS    480C                AREA FOR TSAR REC FOR SOAP RESIDUALS         
*                                                                               
         ORG   TSARAREA                                                         
MAXAGT   EQU   75                  MAX NUMBER OF AGENTS                         
MAXAGSSN EQU   30                  MAX NUMBER OF CAST/AGENT                     
AGTTAB   DS    (MAXAGT)CL(AGTTLNQ) TABLE OF AGENTS, CHK AMTS, & CASTS           
*                                                                               
TMPLNQ   EQU   *-TMPPAYD                                                        
         SPACE 3                                                                
*              DSECT TO COVER TABLE FOR ACT, UDA, DGA, AND WGA LOCALS           
         SPACE 1                                                                
LCLTABD  DSECT                                                                  
LCLTFST  DS    F                   FIRST AMOUNT                                 
LCLT2ND  DS    F                   SECOND AMOUNT                                
LCLT3RD  DS    F                   THIRD AMOUNT                                 
         ORG LCLTFST                                                            
LCLPENS  DS    F                   PENSION AMOUNT FOR WGA                       
LCLHLTH  DS    F                   HEALTH AMOUNT FOR WGA                        
         ORG LCLTFST                                                            
LCLPNH   DS    F                   P&H AMOUNT FOR DGA                           
         ORG LCLTFST                                                            
LCLINR   DS    F                   I&R AMOUNT FOR ACT AND UDA                   
LCLMDED  DS    F                   MISC. DED AMT FOR ACT,UDA, AND DGA           
LCLDUES  DS    F                   UNION DUE AMT FOR ACT                        
*                                                                               
LCLTNCHK DS    XL1                 NUMBER OF CHECKS                             
LCLLOCAL DS    CL3                 LOCAL                                        
LCLTLNQ  EQU   *-LCLTABD                                                        
         EJECT                                                                  
       ++INCLUDE TACLAD                                                         
         SPACE 3                                                                
*              DSECT TO COVER AGENT TABLE                                       
         SPACE 1                                                                
AGTTABD  DSECT                                                                  
AGTTAGT  DS    CL4                 AGENT CODE                                   
AGTTAMT  DS    F                   AMOUNT FOR CHECK                             
AGTTSSN  DS    (MAXAGSSN)CL9       SSN OF CONTRIBUTING CAST                     
AGTTNXT  EQU   *                                                                
AGTTLNQ  EQU   *-AGTTABD                                                        
         SPACE 3                                                                
*              DSECT TO COVER EPISAIR TABLE                                     
***** IF CHANGE EPISATBD, MUST ALSO CHANGE IN TASYSCALC *****                   
         SPACE 1                                                                
EPISATBD DSECT                                                                  
EPATEPI  DS    XL2                 EPISODE NUMBER                               
EPATAIR  DS    XL3                 AIR DATE PWOS                                
EPATNCON DS    X                   # OF CONTRACT AND F/C'S FOR CABLE            
EPATNU5  DS    X                   # OF U/5'S FOR CABLE                         
EPATNXT  EQU   *                                                                
         EJECT                                                                  
*              DSECT TO COVER TABLE OF ECAST RECORDS IN TSAR FOR SOR            
***** IF CHANGE ECASTABD OR EPISD, MUST ALSO CHANGE IN TASYSCALC *****          
***** MAKE SURE IT FITS IN TSARAREA AND BLOCK *****                             
         SPACE 1                                                                
ECASTABD DSECT                                                                  
ECSTSORT DS    XL1                 CAST SORT                                    
ECSTSSN  DS    CL9                 SSN                                          
ECSTCAT  DS    CL3                 CATEGORY                                     
ECSTSTAT DS    XL1                 CAST STATUS                                  
ECSTS2ND EQU   X'80'               CAST FROM 2ND COMM'L (FOR AFT CABLE)         
ECSTKLNQ EQU   *-ECASTABD          LENGTH OF KEY                                
*                                                                               
ECSTNEPI DS    XL1                    NUMBER OF EPISODES                        
ECSTEPIS DS    (MAXEPIS)XL(EPINUMLN)  EPISODE INFO                              
MAXEPIS  EQU   30                     MAXIMUM NUMBER OF EPISODES                
ECSTRLNQ EQU   *-ECASTABD                                                       
         SPACE 2                                                                
*              DSECT TO COVER ECSTEPIS                                          
EPISD    DSECT                                                                  
EPINUM   DS    H                   EPISODE NUMBER (IN BINARY)                   
EPISTAT  DS    XL1                 STATUS                                       
EPISTBAL EQU   X'80'               CREDIT BALANCE LEFT                          
EPISTHW  EQU   X'40'               HEAD WRITER ROLE                             
EPISTSW  EQU   X'20'               SCRIPT WRITER ROLE                           
EPISTBW  EQU   X'10'               BREAKDOWN WRITER ROLE                        
EPIAPPL  DS    XL3                 APPLIED CREDITS                              
EPIPNH   DS    H                   P&H AMOUNT                                   
EPIPAY   DS    XL3                 PAYMENT AMOUNT                               
EPIBAL   DS    XL3                 CREDIT BALANCE                               
EPINUMLN EQU   *-EPISD                                                          
         ORG   EPIAPPL                                                          
EPIWPCT  DS    XL3                 WRITER ROLE PERCENTAGE                       
EPIPENS  DS    H                   WGA PENSION                                  
         ORG   EPIBAL                                                           
         DS    X                                                                
EPIHLTH  DS    H                   WGA HEALTH                                   
         ORG   EPIBAL                                                           
         DS    X                                                                
EPIMDED  DS    H                   DGA MISC. DED                                
*                                                                               
         ORG   EPISTAT             JUST IN FIRST TSAR REC TEMPORARILY:          
EPINCON  DS    X                   # OF CONTRACT AND F/C'S FOR CABLE            
EPINU5   DS    X                   # OF U/5'S FOR CABLE                         
         EJECT                                                                  
*              DSECT TO COVER PAY GLOBAL SAVED STORAGE                          
         SPACE 1                                                                
PAYD     DSECT                                                                  
ACASTSEL DS    A                   A(CAST SELECT VALIDATION PHASE)              
APAYOVLY DS    A                   A(PAY OVERLAY)                               
APAYCNTL DS    A                   A(PAY CONTROL)                               
ARATECLC DS    A                   A(RATE CALCULATION ROUTINE)                  
ATMPPAYD DS    A                   A(TEMPORARY STORAGE)                         
ADTLFSTH DS    A                   A(FIRST DETAIL LINE HEADER)                  
ADTLLSTH DS    A                   A(LAST FLD HDR IN LAST DETAIL LINE)          
ATHSLINE DS    A                   A(CURRENT DETAIL LINE)                       
ADTLCMTH DS    A                   A(COMML COMMENT FLD HDR ON DTL SCRN)         
ADTLDUEH DS    A                   A(DUE DATE FIELD HEADER ON DTL SCRN)         
ADTLCURH DS    A                   A(HDR TO PLACE CURSOR ON DTL SCRN)           
AMKTTABL DS    A                   A(TABLE OF CNET/SYS/MARKETS)                 
AMEDTABL DS    A                   A(TABLE OF INTERNET/NEW MEDIA CODES)         
APAYVERS DS    A                   A(INPUTTED VERSIONS (VRE/VNR))               
ACSTVERS DS    A                   A(VERSIONS TO PAY (VRE/VNR))                 
PRGR5    DS    F                   OVERLAY'S 4TH BASE REGISTER                  
SAVRC    DS    F                   SAVED RC FOR 2ND NMOD IN TAGEN50             
PRGR6    DS    F                   OVERLAY'S 3RD BASE REGISTER                  
PRGRB    DS    F                   OVERLAY'S BASE REGISTER                      
PRGR7    DS    F                   2ND BASE REGISTER                            
*                                                                               
PAYCOMM  DS    0V                  A(PAY COMMON ROUTINES)                       
VALPFK   DS    V                   CHECK FOR LOCAL PFKEY INPUT                  
VALAGY   DS    V                   VALIDATE AGENCY                              
VALINV   DS    V                   VALIDATE INVOICE                             
VALCOM   DS    V                   VALIDATE COMMERCIAL                          
VALMID   DS    V                   VALIDATE MIDDLE OF SCREEN                    
GETCAST  DS    V                   GET A CAST MEMBER                            
VALRHS   DS    V                   VALIDATE RHS OF DETAIL SCREENS               
CHECK    DS    V                   BUILD A CHECK RECORD                         
INVOICE  DS    V                   BUILD INVOICE RECORD                         
PUTSCRN  DS    V                   WRITE SCREEN RECORDS                         
GETSCRN  DS    V                   READ SCREEN RECORDS                          
MYADD    DS    V                   ADD A DIRECTORY RECORD                       
MYWRITE  DS    V                   WRITE A DIRECTORY RECORD                     
PAYDONE  DS    V                   WRAPS UP PAYMENT                             
MYADDREC DS    V                   ADD A FILE RECORD                            
MYPUTREC DS    V                   WRITE A FILE RECORD                          
DISRHS   DS    V                   DISPLAY RHS OF DETAIL SCREENS                
PVAL     DS    V                   CONTROL PERVAL CALLS                         
CASTDET  DS    V                   EXTRACT CAST DETAILS                         
GETDUE   DS    V                   GET DUE DATE                                 
W4DET    DS    V                   EXTRACT W4 DETAILS                           
LCLCHECK DS    V                   BUILD CHECK RECORD FOR LOCALS                
GUARNTEE DS    V                   BUILD A GUARANTEE RECORD                     
ADDREQEL DS    V                   ADD GTRACK AND FTRACK REQUEST ELS            
DELSCRS  DS    V                   DELETE SCREEN RECORDS                        
ADJTBCST DS    V                   ADJUST CNET/MKT/CSYS TABLE PER CAST          
LCBUHFX  DS    V                   ADJUST OLD LCB UH TO NEW STYLE               
LCB2CBL  DS    V                   TRANSLATE LCB UH INTO CBL/SCB TERMS          
STLCBTY  DS    V                   SET LCB TYPE BASED ON SUBSCRIBERS            
STLCBSB  DS    V                   SET LCB SUBSCRIBERS BASED ON TYPE            
TPRELCB  DS    V                   READ UH FOR PREV AGY/COM AND LCB             
TRYOCEL  DS    V                   READ UH FOR PREV AGY/COM                     
LCBTYPE  DS    V                   SET LCB TYPE FOR CAST MEMBER                 
GETCAUH  DS    V                   GET CAST UH IF PAYING A VERSION              
         DS    V                                                                
         DS    V                                                                
         DS    V                                                                
NPAYCOMM EQU   (*-PAYCOMM)/4                                                    
         DS    V                                                                
*                                                                               
DSPFLDS  DS    0H                  DISPLACEMENTS TO MIDDLE FIELDS               
DSPAUTH  DS    H                   AUTH/PO                                      
DSPEST   DS    H                   ESTIMATE NUMBER/JOB                          
DSPPD    DS    H                   ESTIMATE PERIOD                              
DSPCYC   DS    H                   CYCLE DATES                                  
DSPLCYC  DS    H                   L'CYCLE                                      
DSPDTL   DS    H                   DETAIL OPTION                                
DSPBNP   DS    H                   BILL-NO-PAY OPTION                           
DSPUSNME DS    H                   USE NAME ON BASE SCREEN FOR APPROVE          
DSPEINV  DS    H                   ERROR INVOICE NUMBER                         
DSPOPTS  DS    H                   OPTIONS                                      
DSPOVLY  DS    H                   DETAIL SCREEN OVERLAY START                  
DSPGCOM  DS    H                   GENERAL COMMENT                              
DSPHCOM  DS    H                   HISTORY COMMENT                              
DSPCMNT  DS    H                   COMMERCIAL COMMENT                           
DSPDUE   DS    H                   DUE DATE                                     
*                                                                               
DSPXVC   DS    H                   POST-COMMERCIAL VALIDATION ROUTINE           
DSPVSCR  DS    H                   VALSCRN ROUTINE FOR USE                      
DSPXVM   DS    H                   POST-MIDDLE OF SCREEN VALIDATION             
DSPDDTL  DS    H                   DISPLAY DETAIL ROUTINE                       
DSPVDTL  DS    H                   VALIDATE DETAIL ROUTINE                      
DSPBINV  DS    H                   BUILD INVOICE ROUTINE FOR USE                
         DS    H                                                                
*                                                                               
DSPNEXT  DS    H                   NEXT DETAIL LINE                             
DSPOINF  DS    H                   OPTIONAL DISPLAY INFORMATION                 
DSPFRST  DS    H                   FIRST FIELD WHICH AFFECTS PAYMENT            
DSPNP    DS    H                   NP                                           
DSPAPPLI DS    H                   APPLIED AMOUNT INDICATOR                     
DSPREIMI DS    H                   REIMBURSED EXPENSE INDICATOR                 
*                                  * THE FOLLOWING SAME ORDER AS ACCUMS         
DSPAPPL  DS    H                   APPLIED AMOUNT FIELD                         
DSPREIM  DS    H                   REIMBURSED EXPENSE                           
DSPSPNH  DS    H                   SUBJECT TO P&H                               
DSPMDED  DS    H                   MISCELLANEOUS DEDUCTION                      
DSPPAY   DS    H                   PAYMENT AMOUNT                               
*                                                                               
DSPAGT   DS    H                   AGENT                                        
DSPCCOM  DS    H                   CHECK COMMENT                                
         DS    3H                                                               
DSPLNQ   EQU   *-DSPFLDS                                                        
*                                                                               
SPACES   DS    CL80                SPACES                                       
*                                                                               
MYMODE   DS    XL1                 MODE FOR COMMUNICATION W/ OVERLAYS           
XVALCOM  EQU   X'10'               POST-COMMERCIAL VALIDATION                   
VALISCRN EQU   X'20'               VALIDATE BASE SCREEN                         
XVALMID  EQU   X'30'               POST-MIDDLE OF SCREEN VALIDATION             
DISPDTL  EQU   X'40'               DISPLAY A DETAIL LINE                        
VALIDTL  EQU   X'50'               VALIDATE A DETAIL LINE                       
BLDCHK   EQU   X'60'               BUILDING A CHECK RECORD                      
BLDINV   EQU   X'70'               BUILDING AN INVOICE RECORD                   
*                                                                               
LCLSTAT  DS    XL1                 LOCAL PAY STATUS                             
TOPOK    EQU   X'80'               TOP KEY FLDS SUCCESSFULLY VALIDATED          
FINISHED EQU   X'40'               FINISHED DISPLAYING CAST                     
PERFPAID EQU   X'20'               AT LEAST 1 PERFORMER HAS BEEN PAID           
DTLFIRST EQU   X'10'               FIRST TIME FOR DETAIL                        
MANOVER  EQU   X'08'               MANUAL OVERRIDE FOR INVOICE                  
MUSONCOM EQU   X'04'               MUSICIANS ON COMMERCIAL                      
FIRSTHLD EQU   X'02'               THIS IS FIRST HLD FOR COMML                  
NOHNWADJ EQU   X'01'               NO H&W ADJUSTMENTS MADE                      
*                                                                               
PAYSTATS DS    0CL3                CORRESPONDS EXACTLY WITH TAPDEL              
PAYSTAT1 DS    XL1                                                              
CASTSELD EQU   TAPDPSEL            CAST HAS BEEN SELECTED                       
CREDIT   EQU   TAPDPCRD            CREDIT PAYMENT                               
BNP      EQU   TAPDPBNP            BILL-NO-PAYROLL                              
DETAIL   EQU   TAPDPDTL            DISPLAY CAST DETAILS                         
CHANGED  EQU   TAPDPCHG            PAYMENT WAS CHANGED                          
OVERMKTS EQU   TAPDOVER            MARKET INPUT OVERRIDDEN                      
ELIMINTD EQU   TAPDELIM            DUPLICATE MARKETS OVERRIDDEN                 
DIFFERUH EQU   TAPDDFUH            CAST HAS DIFFERING USAGE HISTORY             
PAYSTAT2 DS    XL1                                                              
PCYCCOML EQU   TAPDPCYC            PAYMENT TO PER CYCLE COMMERCIAL              
FROMWEB  EQU   TAPDFWEB            PAYMENT FROM WEB APPLICATION                 
EURO     EQU   TAPDPEUR            EURO PAYMENT                                 
         DS    CL1                 SPARE - FOR PAYSTATS                         
*                                                                               
PAYMODE  DS    XL1                 MODE CONTROL                                 
DRAFT    EQU   X'80'               DRAFT MODE - DON'T WRITE RECORDS             
VALSCRN  EQU   X'40'               VALIDATE ONLY - DON'T PROCESS RECS           
DTLONSCR EQU   X'20'               DETAIL SCREEN LOADED                         
DTLONBSE EQU   X'10'               DETAIL ON BASE SCREEN                        
DTLDSPLD EQU   X'08'               DETAIL INFO DISPLAYED                        
*                                                                               
LCLSTAT4 DS    XL1                 4TH LOCAL PAY STATUS                         
NOAGT    EQU   X'80'               NO AGENT FOR PRINT AGENT FEE CHECK           
POOKAY   EQU   X'40'               OK TO CLOSE PO                               
MAXOVER  EQU   X'20'               OVER CSF MAXIMUM WARNING PENDING             
POERR    EQU   X'08'               PURCHASE ORDER ERROR PENDING                 
POOVERR  EQU   X'04'               PURCHASE ORDER ERROR OVERRIDDEN              
NONACTON EQU   X'02'               NON-ACTRA CAST ON PAYMENT                    
ACTON    EQU   X'01'               ACTRA CAST ON PAYMENT                        
NWKREQ   DS    CL1                 NETWORK REQ'D ON CLA USES FOR PYMT           
*                                                                               
BILLTYPE DS    XL1                 BILLING TYPE                                 
TYPE     DS    XL1                 USE TYPE                                     
AGYEOR   DS    CL3                 EMPLOYER OF RECORD FOR AGENCY                
EOR      DS    CL3                 EMPLOYER OF RECORD FOR PAYMENT               
AGYINTER DS    CL1                 INTERFACE SWITCH FOR AGENCY                  
INTER    DS    CL1                 INTERFACE SWITCH FOR PAYMENT                 
CLINAME  DS    CL16                CLIENT NAME                                  
AGYNAME  DS    CL16                AGENCY NAME                                  
SVADVSTU DS    H                   SAVED STARTING USE FOR ADVICE                
SVADVENU DS    H                         ENDING                                 
SVADVCID DS    CL12                      C=CID                                  
SVTCPNH  DS    XL4                 SAVED TCPNH FOR DGA & WGA AUTO CHKS          
COMCMNTH DS    CL8                 DUMMY HEADER USED TO GET COMMENT             
COMCMNT  DS    CL60                COMMERCIAL COMMENT                           
LIFT     DS    CL1                 Y=PAYING LIFT                                
LIFTID   DS    CL12                LIFT ID OR VERSION ID                        
CASTNAME DS    CL16                NAME                                         
NTACWS   DS    XL1                 N'CHECK WITHHOLDING ELS. REQ'D.              
FSTFXCYC DS    PL3                 COMMERCIAL 1ST FIXED CYCLE DATE              
FLMDATE  DS    PL3                 FILM DATE                                    
RECDATE  DS    PL3                 RECORD DATE                                  
MUSDATE  DS    PL3                 MUSIC DATE                                   
LIFTPAID DS    CL1                 N=NO USES PAID TO LIFT                       
         SPACE                                                                  
LCLSTAT2 DS    XL1                 2ND LOCAL PAY STATUS                         
GLOBCLI  EQU   X'80'               CLIENT IS GLOBAL (USED BY DUECOMP)           
GUARERR  EQU   X'40'               HAVE GUARANTEE ERROR (NOT SET IF 56)         
ABORT    EQU   X'20'               ABORT PFKEY PRESSED (ONLY SET BY 56)         
JOBERR   EQU   X'10'               JOB NUMBER ERROR PENDING                     
JOBOVRER EQU   X'08'               JOB NUMBER ERROR OVERRIDDEN                  
PRIMCOMM EQU   X'04'               FIXED CYCLE PYMNT ON PRIMARY COMM'L          
NOFUND   EQU   X'02'               NO FUND FOR I&R LOCAL CHECK                  
GOTINV   EQU   X'01'               ALREADY GOT INV # TO PAY FOR CLIENTS         
         SPACE                                                                  
HASLIFT  DS    CL1                 Y=COMM'L HAS LIFT                            
AGYSTAT2 DS    CL1                 2ND AGENCY STATUS BYTE                       
         SPACE                                                                  
LCLSTAT3 DS    XL1                 3RD LOCAL PAY STATUS                         
FORCEUPG EQU   X'80'               FORCED WSP UPGRADE                           
CLADUEER EQU   X'40'               CLA DUE DATE WARNING PENDING                 
OVCLADER EQU   X'20'               OVERRODE CLA DUE DATE WARNING                
WSPTYPCH EQU   X'10'               WILDSPOT USE TYPE CHANGED                    
COMRELER EQU   X'08'               COMMERCIAL RELEASED ERROR PENDING            
W4LOCKED EQU   X'04'               W4 RECORD LOCKED                             
SOAPRES  EQU   X'02'               USE CODE IS A SOAP RESIDUAL                  
SPLIT    EQU   X'01'               INVOICE WILL BECOME A SPLIT BILL             
         SPACE                                                                  
PREVDUE  DS    XL3                 DUE DATE FOR PREV CLA USES                   
AGYSTAT3 DS    XL1                 3RD AGENCY STATUS BYTE                       
*                                                                               
AGYNWKRQ DS    CL1                 NETWORK REQ'D ON CLA USES FOR AGENCY         
*                                                                               
NEPIS    DS    XL1                 NUMBER OF EPISODES                           
*                                                                               
DPAGE    DS    XL1                 FIRST DETAIL SCREEN PAGE NUMBER              
*                                                                               
SVCASTKY DS    CL32                SAVED CAST KEY USED BY GETCAST               
*                                                                               
*                                  * NON-SELECT PAYMENT SCREEN VALUES           
GPAGE    DS    XL1                 CURRENT PAGE NUMBER                          
FPAGE    DS    XL1                 FIRST NON-SELECT SCREEN PAGE NUMBER          
LPAGE    DS    XL1                 LAST PAGE NUMBER                             
*                                                                               
SPAGE    DS    XL1                 CURRENT CAST/SELECT SCREEN PAGE NO.          
PPAGE    DS    XL1                 LAST SCREEN REC PAGE NUMBER FROM PUT         
GSCRN    DS    XL1                 LAST SCREEN REC SCREEN CODE FROM GET         
*                                                                               
MXCASTPG EQU   12                   MAXIMUM N'CAST ON ONE PAGE                  
PAGETBL  DS    CL(MXCASTPG*PAGELNQ) SAVED CAST DATA FOR PAGE                    
NCASTPG  DS    XL1                  N'CAST ON CURRENT PAGE                      
*                                                                               
AGYSTAT  DS    XL1                 AGENCY STATUS BYTE                           
PRODCLI  DS    CL3                 PRODUCTION CLIENT                            
PRODPRD  DS    CL3                            PRODUCT                           
ESTPD    DS    XL1                 ESTIMATE PERIOD                              
*                                                                               
PAYOPTS  DS    0CL3                CORRESPONDS EXACTLY WITH TAPDEL              
PAYOPTS1 DS    XL1                 PAYMENT OPTIONS 1                            
OAPPLYH  EQU   TAPDOAPH            TAKE APPLIED CREDITS (CODE=APPLHLD)          
ONOAPPLY EQU   TAPDONAC            DON'T TAKE APPLIED CREDITS                   
ONOGUARC EQU   TAPDONGC            DON'T TAKE GUARANTEE CREDITS                 
OGSTAMT  EQU   TAPDOGST            GST AMOUNT OVERRIDE                          
OCANTAX  EQU   TAPDOCAN            TAKE CANADIAN TAXES                          
OPNHR    EQU   TAPDOPHR            P&H RATE OVERRIDE                            
OTAXAMT  EQU   TAPDOTAX            TAX AMOUNT OVERRIDE                          
OHANDAMT EQU   TAPDOHND            HANDLING AMT OVERRIDE (INDIV & CORP)         
*                                                                               
PAYOPTS2 DS    XL1                 PAYMENT OPTIONS 2                            
OPURGENT EQU   TAPDOURG            URGENT PAYMENT - DUE TODAY                   
ORCVCLI  EQU   TAPDODCL            DUE COMPANY RECOVER FROM CLIENT ONLY         
ORCVAGY  EQU   TAPDODAY            DUE COMPANY RECOVER FROM AGENCY ONLY         
ORCVALL  EQU   TAPDODAL            DUE COMPANY RECOVER FROM ALL                 
OFICR    EQU   TAPDOFCR            FICA CREDITS OVERRIDE                        
OAPPLYS  EQU   TAPDOAPS            TAKE APPLIED CREDITS (CODE=APPLSESS)         
OPRVTUS  EQU   TAPDOPTU            PREVIOUS TOTAL USES PAID OVERRIDE            
OPRVLUS  EQU   TAPDOPLU            PREVIOUS LIFT USES PAID OVERRIDE             
*                                                                               
PAYOPTS3 DS    XL1                                                              
ONUMUSE  EQU   TAPDONUS            NUMBER OF USES TO PAY OVERRIDE               
OHNWADJ  EQU   TAPDOHNW            H&W AMOUNT ADJUSTMENT                        
OCCR     EQU   TAPDOCCR            CANADIAN CONVERSION RATE                     
ODUMMY   EQU   TAPDODUM            DUMMY PAYMENT                                
ORETRO   EQU   TAPDORET            RETROACTIVE                                  
OCOD     EQU   TAPDOCOD            COD INVOICE                                  
OHNDCAMT EQU   TAPDOHNC            CORP HANDLING AMOUNT OVERRIDE                
*                                                                               
         DS    0F                                                               
OPTS     DS    0CL50               * OPTION OVERRIDES *                         
OPTAMTS  DS    0F                  OPTIONAL AMOUNTS MUST GO HERE                
OPTTAX   DS    F                   PAYROLL TAX AMOUNT                           
OPTHAND  DS    F                   INDIV. HANDLING AMOUNT                       
OPTFICR  DS    F                   FICA CREDITS                                 
OPTHNW   DS    F                   H&W ADJUSTMENT AMOUNT                        
OPTGST   DS    F                   GST AMOUNT                                   
OPTCSF$  DS    F                   CSF=$$$ AMOUNT                               
OPTFEE   DS    F                   FEE                                          
OPTCHAND DS    F                   CHLOE HANDLING AMT/RATE                      
NOPTAMTS EQU   (*-OPTAMTS)/L'OPTAMTS                                            
         DS    CL1                                                              
OPTEXPD  DS    XL3                 EXPIRATION DATE OVERRIDE (PRINT)             
OPTCCR   DS    PL3                 CANADIAN CONVERSION RATE                     
         DS    CL1                 ALIGN BOUNDARY                               
OPTPRVTU DS    H                   PREVIOUS TOTAL USES PAID                     
OPTPRVLU DS    H                   PREVIOUS LIFT USES PAID                      
OPTNUMUS DS    H                   NUMBER OF USES TO PAY                        
OPTPNHR  DS    H                   PENSION & HEALTH RATE                        
OPTAGNT  DS    H                   BINARY AGENT CODE OVERRIDE                   
*                                                                               
DSPLYINV DS    CL6                 INVOICE NUMBER FOR DISPLAY                   
INVNO    DS    PL6                 INVOICE NUMBER (NON-COMPLEMENTED)            
SCRINVNO DS    CL6                 DUMMY INV FOR SCRN RECS WHEN CLIENT          
*                                  MAKES OWN PYMNT - DATE(3), TIME(3)           
*                                                                               
ACAUHREC DS    A                   D/A(CAST UH REC FOR VERSIONS)                
*                                                                               
STRTUSE  DS    H                   STARTING USE NUMBER (MAIN COMM'L)            
STRTUSEL DS    H                   STARTING USE NUMBER (LIFT)                   
*                                                                               
ITOTS    EQU   *                   INV REC TOTALS (SAME ORDER AS CTOTS)         
TGROSS   DS    F                   GROSS                                        
TAPPLCR  DS    F                   APPLIED CREDITS                              
TEXPENSE DS    F                   REIMBURSED EXPENSES                          
TSUBJPNH DS    F                   SUBJECT TO P&H                               
TMISCDED DS    F                   MISCELLANEOUS DEDUCTION                      
TPAYI    DS    F                   INDIVIDUAL PAYMENT AMOUNT                    
TPAYC    DS    F                   CORPORATE PAYMENT AMOUNT                     
TPNH     DS    F                   PENSION & HEALTH AMOUNT                      
TINR     DS    F                   INSURANCE & RETIREMENT AMOUNT (INV)          
THNW     DS    F                   HEALTH & WELFARE AMOUNT                      
TGUAR    DS    F                   GUARANTEE CREDITS                            
TDUES    DS    F                   UNION DUES (ANOTHER DEDUCTION)               
TACTWRK  DS    F                   AMT FOR ACTRAWORKS (NOT A DEDUCTION)         
         DS    F                                                                
TACTAOS  DS    F                   AMT FOR ACTRA AOS                            
TTXNW    DS    F                   TAXABLE REIMBURSED EXPENSES                  
ITOTLNQ  EQU   *-ITOTS                                                          
*                                                                               
CTOTS    EQU   *                   CAN REC TOTALS (SAME ORDER AS CTOTS)         
CGROSS   DS    F                   GROSS                                        
CAPPLCR  DS    F                   APPLIED CREDITS                              
CEXPENSE DS    F                   REIMBURSED EXPENSES                          
CSUBJPNH DS    F                   SUBJECT TO P&H                               
CMISCDED DS    F                   MISCELLANEOUS DEDUCTION                      
CPAYI    DS    F                   INDIVIDUAL PAYMENT AMOUNT                    
CPAYC    DS    F                   CORPORATE PAYMENT AMOUNT                     
CPNH     DS    F                   PENSION & HEALTH AMOUNT                      
CINR     DS    F                   INSURANCE & RETIREMENT AMOUNT (INV)          
CHNW     DS    F                   HEALTH & WELFARE AMOUNT                      
CGUAR    DS    F                   GUARANTEE CREDITS                            
CDUES    DS    F                   UNION DUES (ANOTHER DEDUCTION)               
CACTWRK  DS    F                   AMT FOR ACTRAWORKS (NOT A DEDUCTION)         
         DS    F                                                                
CACTAOS  DS    F                   AMT FOR ACTRA AOS                            
CTXNW    DS    F                   TAXABLE REIMBURSED EXPENSES                  
CTOTLNQ  EQU   *-CTOTS                                                          
*                                                                               
ELTACO   DS    CL(TACOLNQ2)        COMMERCIAL DETAILS ELEMENT                   
ELTACS   DS    CL(3*TACSLNQ)       COMMERCIAL STUDIO ELEMENTS                   
ELTACC   DS    CL(TACCLNQ+4*L'TACCCON) COMMERCIAL CONTRACTS ELEMENT             
ELTACA   DS    CL(TACALNQ)         CAST DETAILS ELEMENT                         
ELTASD   DS    CL(TASDLNQ)         SESSION DETAILS ELEMENT                      
ELTALF   DS    CL(TALFLNQ)         LIFT DETAILS ELEMENT                         
ELTATI   DS    CL(TATILNQ)         TAX ID ELEMENT FOR INDIV PD AS CORP.         
ELTADU   DS    CL(TADWLNQ*3)       DUE COMP WITHHOLD EL FOR CREDIT PYMT         
*                                                                               
INV04A   DS    CL6                 GEN'D CAN INVOICE NUMBER FOR 2404A           
*                                                                               
LCLSTAT5 DS    XL1                 5TH LOCAL PAY STATUS                         
CKCANTAX EQU   X'80'               TAKE CANADIAN TAX ON THIS CHECK              
OPTINERR EQU   X'40'               INVALID OPTION                               
OPTRHERR EQU   X'20'               INVALID RHS FOR OPTION                       
CSTPDPRE EQU   X'10'               PAYMENT INCLUDES CAST PAID PREV.             
CSTNPPRE EQU   X'08'               PAYMENT INCLUDES CAST NOT PAID PREV.         
CSTMSNOT EQU   X'04'               PAYMENT IS MISSING CAST DUE HF               
CSTEXPGT EQU   X'02'               CAST HAS AN EXPIRING GUARANTEE               
FORCEINI EQU   X'01'               FORCE INITIAL PAYMENT                        
*                                                                               
DALSTADD DS    XL4                 DISK ADDRESS OF LAST ADDED RECORD            
DALSTCAD DS    XL4                 DISK ADDRESS OF LAST ADDED CHECK             
*                                                                               
LCLSTAT6 DS    XL1                 6TH LOCAL PAY STATUS                         
GRRPENDG EQU   X'80'               GRR PAYMENT PENDING                          
PCYPENDG EQU   X'40'               PER CYCLE PAYMENT PENDING                    
AFTRPAID EQU   X'20'               AFTRA CAST ON PAYMENT                        
GRTNTAPI EQU   X'10'               GRT PAYMENT MUST BE APPROVED (A/I)           
PCYNTAPI EQU   X'08'               PCY PAYMENT MUST BE APPROVED (A/I)           
NTDLRCVR EQU   X'04'               AT LEAST 1 PERF. NOT COVERED BY DLR          
GRTINERI EQU   X'02'               GRT PAYMENT IN ERROR (A/I)                   
PCYINERI EQU   X'01'               PCY PAYMENT MUST BE APPROVED (A/I)           
*                                                                               
GRTDUEDT DS    XL3                 GUARANTEE DUE DATE                           
GRTDUPID DS    CL6                 PID FOR DUE GUARANTEE                        
*                                                                               
LCLSTAT7 DS    XL1                 7TH LOCAL PAY STATUS                         
GTLRGOVS EQU   X'80'               LARGE OVERSCALE GUARANTEE                    
GTPERCYC EQU   X'40'               PER CYCLE GUARANTEE                          
NGRTABAL EQU   X'20'               GRT/PAY NOT ALLOWED FOR ASC.BALANCE          
GACNMTCH EQU   X'10'               GRT/PAY AGY/CLI MISMATCH                     
HLDPENDG EQU   X'08'               HLD PAYMENT PENDING                          
SNW0UNIT EQU   X'04'               SNW UPGRADE FOR 0 UNITS                      
CRINVCSF EQU   X'02'               CREDIT INVOICE HAS NO CSF                    
CKPERCYC EQU   X'01'               CHECK FOR PER CYCLE COVERAGE                 
*                                                                               
PAYBYTE  DS    XL1                 PAY'S OWN BYTE                               
*                                                                               
DUEDATE  DS    PL3                 DUE DATE                                     
DSPLSEL  DS    H                   DISPLACEMENT TO LAST SEL. CAST               
DSPLMDED DS    H                   DISPLACEMENT TO LAST MISC. DED.              
EINVNO   DS    CL6                 ERROR INVOICE (FOR CREDIT PAYMENTS)          
WORK2    DS    CL24                SECONDARY WORK AREA                          
         DS    CL1                 SPARE (LEAVE IN CASE WORK2 NEEDS)            
RET4INV  DS    XL6                 RETRO FOR INVOICE NUMBER                     
*                                                                               
GRTDUAGY DS    CL6                 GUARANTEE AGENCY MUST BE MADE URGENT         
GRTDUINV DS    CL6                 GUARANTEE INVOICE MUST BE MADE URG           
*                                                                               
SEQSTAT  DS    XL1                 SEQUENCE STATUS BYTE                         
SSLATCHK EQU   X'80'               LATER INVOICES - CHECK IF OK                 
SSLATOK  EQU   X'40'               LATER INVOICES - IT IS OK                    
*                                                                               
KFLDCHA  DS    XL1                 KEY FIELD CHANGE INDICATORS                  
KAY      EQU   X'80'               AGENCY                                       
KIN      EQU   X'40'               INVOICE                                      
KCO      EQU   X'20'               COMMERCIAL ID                                
*                                                                               
MFLDCHA  DS    XL1                 MIDDLE FIELD CHANGE INDICATORS               
MAUTH    EQU   X'80'               AUTH/PO                                      
MEST     EQU   X'40'               ESTIMATE/JOB                                 
MPD      EQU   X'20'               ESTIMATE PERIOD                              
MCYC     EQU   X'10'               CYCLE DATES                                  
MDTL     EQU   X'08'               DETAIL OPTION                                
MBNP     EQU   X'04'               B-N-P OPTION                                 
MCR      EQU   X'02'               CREDIT OPTION                                
MOPTS    EQU   X'01'               OPTIONS                                      
*                                                                               
MFLDCHA2 DS    XL1                 2ND MIDDLE FIELD CHANGE INDICATORS           
*                                                                               
LASTINV  DS    CL6                 LAST INVOICE NO. FROM USAGE HISTORY          
*                                                                               
DCYCS    DS    CL8                 DISPLAYABLE CYCLE START                      
CYCSTAT  DS    XL1                 CYCLE DATE VALIDATION STATUS                 
CYSTAUTO EQU   X'80'               AUTO-CALCULATION OF END DATE REQ'D           
CYSTEEND EQU   X'40'               BAD END DATE WARNING PENDING                 
CYSTEOVR EQU   X'20'               OVERLAP WARNING PENDING                      
CYSTECTG EQU   X'10'               NON-CONTIGUOUS WARNING PENDING               
CYSTERRS EQU   CYSTEEND+CYSTEOVR+CYSTECTG+CYSTDHLD                              
CYSTOVRE EQU   X'08'               CYCLE ERROR(S) OVERRIDEN                     
CYSTGENC EQU   X'04'               CYCLE AUTOMATICALLY GENERATED BY PAY         
CYSTUPCY EQU   X'02'               CNET/MKT/CSYS UPDATE PENDING                 
CYSTDHLD EQU   X'01'               DEALER EARLIER THAN LATEST HF                
*                                                                               
ACOML    DS    A                   A(COMML RECORD) GOOD THROUGH XVALMID         
*                                                                               
COMNAME  DS    CL36                COMMERCIAL NAME                              
*                                                                               
GUARSTAT DS    XL1                 CORRESPONDS EXACTLY WITH TAGUEL              
DESCBAL  EQU   TAGUSDES            DESCENDING BALANCE                           
PAYPNH   EQU   TAGUSPNH            PAY P&H                                      
PAYOVRAG EQU   TAGUSOVR            PAY OVERAGE                                  
PAYADDED EQU   TAGUSPAY            ADDED BY PAY PROGRAM                         
INSTLMNT EQU   TAGUSINS            INSTALLMENT PAYMENT                          
*                                                                               
LCYCLE   DS    CL5                 DISPLAYABLE LENGTH OF CYCLE                  
*                                                                               
FRSTUSE  DS    PL3                 FIRST USE DATE FOR CLA                       
*                                                                               
ELTAOC   DS    CL(TAOCLNQ)         OLD AGENCY/CID ELEMENT                       
*                                                                               
GRTERROR DS    CL1                 GUARANTEE ERROR SET BY GUARVAL               
GRTERSSN DS    CL9                 FIRST SS# THAT CAUSED GRT ERROR              
*                                                                               
SVSVCKEY DS    CL32                SAVE SVCASTKY - CLEARED BY CALC              
*                                                                               
SVMENU   DS    XL1                 SAVED MENU SCREEN BEFORE CAST SELECT         
*                                                                               
LCLLTBLS DS    0CL96               CHECK TOTALS FOR LOCALS                      
LCLAFM   DS    10CL7               CHECK TOTALS FOR AFM LOCALS                  
LCLNAFM  EQU   (*-LCLAFM)/L'LCLAFM BYTES 1-4 = AMOUNT, 5-7 = LOCAL              
*                                                                               
LSTHFSTD DS    XL3                 LAST HOLDING FEE START DATE                  
*                                                                               
LCLSTAT8 DS    XL1                 8TH LOCAL PAY STATUS                         
CNNOTCAN EQU   X'80'               CN NO LONGER VALID FOR CANADA                
VINVNFND EQU   X'40'               VALIDATED INVOICE NOT FOUND                  
VINVPAID EQU   X'20'               VALIDATED INVOICE PAID                       
DVDELPND EQU   X'10'               ADVICE/INVOICE DELETE PENDING                
MORE1SSN EQU   X'08'               MORE THAN 1 SS# ON PAYMENT                   
NOGCCAST EQU   X'04'               CAST MEMBER DOES NOT HAVE GCON               
NOGCPEND EQU   X'02'               NO GCON SPECIFIED PENDING                    
VGCONCHG EQU   X'01'               VALIDATED GCON CHANGED                       
*                                                                               
ISUTYPE1 DS    XL1                 USE TYPE 1                                   
ISUTYPE2 DS    XL1                 USE TYPE 2                                   
*                                                                               
AACTCYCE DS    A                   A(ACTRA CYCLE END DATE FIELD)                
ACTCYCE  DS    XL3                 ACTRA CYCLE END DATE                         
ORIGCYCE DS    XL3                 ORIGINAL CYCLE END DATE                      
*                                                                               
GUARSTA2 DS    XL1                 CORRESPONDS EXACTLY WITH TAGUSTA2            
*                                                                               
LCLSTAT9 DS    XL1                 9TH LOCAL PAY STATUS                         
CASTGRT  EQU   X'80'               CAST IS ON GRT                               
AGYBRATE EQU   X'40'               AGENCY HAS BRATE                             
CLIBRATE EQU   X'20'               CLIENT HAS BRATE                             
EVEMSCAN EQU   X'10'               EMPLOYEE MISSING CAN TAXES                   
NOCOTXCN EQU   X'08'               NO CORP TAX ON CANADIAN                      
CASTCALI EQU   X'04'               CAST WORKED IN CALIFORNIA                    
CRPLCKED EQU   X'02'               CAST CORP RECORD LOCKED                      
CN16INCL EQU   X'01'               PAYMENT INCLUDED 16 YEAR PERFS               
*                                                                               
PPACPCT  DS    XL4                 PAYROLL PLUS AGENCY COMMISSION RATE          
PPACTOT  DS    XL4                 PAYROLL PLUS AGENCY COMMISION TOTAL          
*                                                                               
         ORG   LCLLTBLS                                                         
LCLDGA   DS    3CL(LCLTLNQ)        CHECK TOTALS FOR DGA LOCALS                  
LCLNDGA  EQU   (*-LCLDGA)/L'LCLDGA                                              
LCLWGA   DS    3CL(LCLTLNQ)        CHECK TOTALS FOR WGA LOCALS                  
LCLNWGA  EQU   (*-LCLWGA)/L'LCLWGA                                              
*                                                                               
         ORG   LCLLTBLS                                                         
LCLACT   DS    3CL(LCLTLNQ)        CHECK TOTALS FOR ACT LOCALS                  
LCLNACT  EQU   (*-LCLACT)/L'LCLACT                                              
LCLUDA   DS    3CL(LCLTLNQ)        CHECK TOTALS FOR UDA LOCALS                  
LCLNUDA  EQU   (*-LCLUDA)/L'LCLUDA                                              
         ORG                                                                    
*                                                                               
ELTAFNP  DS    CL(L'TAFNNAME+TAFNLNQ)  FREE FORM PROD NAME FROM COMM'L          
*                                                                               
COMLEN   DS    CL4                 DISPLAYABLE COMMERCIAL LENGTH IN SEC         
*                                                                               
MAXTYPES EQU   5                                                                
ADDTYPES DS    XL(MAXTYPES)        VALID TYPES FOR ADDENDUM USE                 
         DS    XL2                 SPARE IN CASE ADDTYPES NEEDS                 
*                                                                               
ELTADL   DS    CL(TADLLNQ)         DEAL ELEMENT (PRINT)                         
*                                                                               
GQSTRT   DS    XL3                 CYCLE START DATE FOR GTRACK REQUEST          
*                                                                               
CID2     DS    CL12                2ND CID FOR SOAP CABLE                       
COM2     DS    XL4                 2ND INT COMM # FOR SOAP CABLE REUSE          
SVTGCOM  DS    XL4                 SAVED TGCOM                                  
*                                                                               
VERSION  DS    C                   VERSION BEING PAID                           
ELTAVR   DS    CL(TAVRLNQ)         VERSION ELEMENT                              
SVTAUHEL DS    CL(TAUHLNQ)         SAVED COMM'L'S TAUH (ONLY FOR VERS.)         
*                                                                               
SVTCUNIT DS    XL2                 SAVED COMM'L'S TCUNITS (VERS. ONLY)          
SVTCMAJ  DS    XL1                 SAVED COMM'L'S TCMAJORS                      
SVINPUNT DS    XL2                 SAVED UNITS INPUT                            
SVINPMAJ DS    XL1                 SAVED MAJORS INPUT                           
*                                                                               
UHVERS   DS    C                   VERSION CODE FOR UH RECORD                   
*                                                                               
PAYOPTS4 DS    XL1                 PAYMENT OPTIONS 4                            
OGENCSF  EQU   TAPDOCSF            GENERATE CONTRACT SERVICE FEE CHK(S)         
ONEWSOC  EQU   TAPDOSOC            NEW SOC RATE                                 
OPNOINT  EQU   TAPDONOI            NO INTERFACE                                 
OAGRTEND EQU   TAPDGRTE            APPLY TO GUARANTEE BASED ON END DATE         
OPAYEURO EQU   TAPDOEUR            EURO-BASED PAYMENT                           
OCHLOEHA EQU   TAPDOHDA            CHLOE HANDLING AMOUNT OVERRIDE               
OCHLOEHP EQU   TAPDOHDP            CHLOE HANDLING PERCENTAGE OVERRIDE           
PAYOPTS5 DS    CL1                 PAYMENT OPTIONS 5                            
OREG2    EQU   TAPDORG2            PROCESS IN SECOND REGRESSION RUN             
CSFAMT   DS    F                   CONTRACT SERVICE FEE AMOUNT                  
SVCSFMAX DS    F                   MAXIMUM CSF AMOUNT FROM CSFTBL               
CLTSTAT  DS    XL1                 SAVED CLIENT STATUS                          
LENGTHS  DS    CL3                 ESTIMATE SETUP LENGTHS FOR CPJ               
DUEDATE2 DS    PL3                 ORIGINAL DUE DATE                            
*                                                                               
SVINPSUB DS    XL4                 SAVED SUBSCRIBER INPUT                       
SVUPTOTY DS    X                   SAVED UPGRADE "TO" TYPE                      
SVUPFRTY DS    X                   SAVED UPGRADE "FROM" TYPE                    
SVUSTYP  DS    X                   SAVED USE TYPE                               
SVUSTYST DS    X                   SAVED TYPE STATUS                            
*                                                                               
AGYSTAT7 DS    XL1                 7TH AGENCY STATUS BYTE                       
CLTSTAT2 DS    XL1                 2ND CLIENT STATUS BYTE                       
PRDSTAT  DS    XL1                 PRODUCT STATUS BYTE                          
*                                                                               
CYCSTAT2 DS    XL1                 CYCLE DATE VALIDATION STATUS                 
CYSTMUPD EQU   X'80'               MUS PAYMENT HAS BEEN MADE TO COMML           
CYSTMUPC EQU   X'40'               MUS PAYMENT OVERLAPS THIS CYCLE              
                                                                                
ERMAPCOD DS    XL1                 ERROR MAP CODE                               
                                                                                
AWEBRES  DS    A                   A(CAST ENTRY IN WEB RES DETAIL AREA)         
                                                                                
AGYSTAT5 DS    XL1                 5TH AGENCY STATUS BYTE                       
*                                                                               
AGYSTAT4 DS    XL1                 4TH AGENCY STATUS BYTE                       
*                                                                               
SVADVDA  DS    XL4                 SAVED ADVICE DISK ADDRESS                    
*                                                                               
GCCYEAR  DS    0XL6                GRT CONTRACT YEAR                            
GCCYEARS DS    XL3                 GRT CONTRACT START DATE                      
GCCYEARE DS    XL3                 GRT CONTRACT END DATE                        
GUARCONT DS    XL4                 GRT CONTRACT CODE                            
GCLIM    DS    F                   GRT CONTRACT LIMIT                           
GCBAL    DS    F                   GRT CONTRACT BALANCE                         
GCWRKBAL DS    F                   GRT CONTRACT WORKING BALANCE                 
                                                                                
***********************************************************************         
*                                                                               
* -----> THE FOLLOWING AREA APPLY TO INDIV. CAST MEMBERS <------                
*                                                                               
***********************************************************************         
         SPACE                                                                  
PYCAST   DS    0C                                                               
*                                                                               
UHCUR    EQU   X'80'               TRIED THIS USE FOR CURR AGY/COMM'L           
UHPRE    EQU   X'40'               TRIED THIS USE FOR PREV AGY/COMM'L           
UHCURLCB EQU   X'20'               TRIED LCB FOR CURRENT AGY/COMM'L             
UHPRELCB EQU   X'10'               TRIED LCB FOR PREVIOUS AGY/COMM'L            
UHDONE   EQU   X'08'                                                            
*                                                                               
         DS    CL11                SPARE                                        
ELTANUM  DS    CL12                TANU EL FOR ACTRA MEMBERSHIP #               
         SPACE                                                                  
CASTSTAT DS    XL1                 CAST STATUS                                  
CSTMAN   EQU   X'80'               MANUAL OVERRIDE                              
CSTINPY  EQU   X'40'               PAYMENT AMOUNT MANUALLY INPUT                
CSTGERR  EQU   X'20'               GUARANTEE ERROR                              
CSTGCOM  EQU   X'10'               GUARANTEE RECORD SPECIFIES COMM'L            
CSTNPAY  EQU   X'08'               DON'T PAY THIS CAST MEMBER                   
CSTGPER  EQU   X'04'               GUARANTEE PERIOD ERROR                       
CSTGIAC  EQU   X'02'               GUARANTEE AGENCY/CLIENT ERROR                
CSTGCRP  EQU   X'01'               GUARANTEE CORPORATION ERROR                  
*                                                                               
CAGUARST DS    XL1                 CAST GUARANTEE STATUS (SEE GUARSTAT)         
*                                                                               
ELTASO   DS    CL(TASOLNQ+5*L'TASOSEPI)  TASOELQ -  MAX OF 5 EPISODES           
ELTACR   DS    CL(TACRLNQ)         TACR EL FOR SOP                              
CSTRSPNH DS    XL4                 RETRO - ORIGINAL SUBJ P&H                    
CSTRPNHD DS    XL4                 RETRO - P&H DIFF                             
CSTTADU  DS    XL4                 A(TADU ELEMENT)                              
CSTDUEFL DS    XL1                 DUE COMPANY FLAGS                            
         SPACE                                                                  
PYCSTLNQ EQU   *-PYCAST            L'INDIV. CAST AREA                           
***********************************************************************         
*                                                                               
ELTAFNPH DS    CL(L'TAFNNAME+TAFNLNQ)  FFN OF PHOTOGRAPHER FROM COMM'L          
ELTAFNS  DS    CL(L'TAFNNAME+TAFNLNQ)  FFN OF SERVICES FOR AGENCY               
PHOTOSSN DS    CL9                     SSN OF PHOTOGRAPHER                      
SRVCODE  DS    CL6                     SERVICES FOR AGENCY CODE                 
*                                                                               
EPISAIR  DS    (MAXEPIS)XL7        TABLE OF EPISODES & THEIR AIR DATE           
*                                  & THE COUNT OF PERFORMERS FOR CABLE          
         DS    X                   EXTRA BYTE TO MARK END OF TABLE              
*                                                                               
ELTANUSA DS    CL9                 SIGNATORY FOR AGENCY                         
ELTANUSC DS    CL9                 SIGNATORY FOR CLIENT                         
*                                                                               
*                                                                               
***********************************************************************         
*                                                                               
* -----> THE FOLLOWING AREA APPLY TO HOLDING FEE PAYMENTS <------               
*                                                                               
***********************************************************************         
*                                                                               
HSD      DS    0C                                                               
HSAUTH   DS    CL(L'HLDAUTH)                                                    
HSEST    DS    CL(L'HLDEST)                                                     
HSPD     DS    CL(L'HLDPD)                                                      
HSCYC    DS    CL(L'HLDCYC)                                                     
HSDTL    DS    CL(L'HLDDTL)                                                     
HSBNP    DS    CL(L'HLDBNP)                                                     
HSEINV   DS    CL(L'HLDEINV)                                                    
HSHCOM   DS    CL(L'HLDHCOM)                                                    
HSOPT    DS    CL(L'HLDOPT)                                                     
HSICOM   DS    CL(L'HLDICOM)                                                    
HSLNQ    EQU   *-HSD                                                            
*                                                                               
TMSHTS   DS    0XL26               TIMESHEET INFO                               
TMSPOT   DS    XL1                 SPOTS ON TIMESHEET                           
TMDAYS   DS    XL1                 DAYS ON TIMESHEET                            
TMOVTM   DS    XL1                 OVERTIME HOURS ON TIMESHEET                  
TMDBTM   DS    XL1                 DOUBLE TIME HOURS ON TIMESHEET               
TMTRVL   DS    XL2                 TRAVEL HOURS.MINS ON TIMESHEET               
TMPDWD   DS    XL2                 PRIOR DAY WARDROBE HRS.MINS                  
TMTAGS   DS    XL1                 TAGS ON TIMESHEET                            
TMNP10   DS    XL2                 NIGHT PREMIUM HOURS - 10%                    
TMNP20   DS    XL2                 NIGHT PREMIUM HOURS - 20%                    
TM16HR   DS    XL1                 16 HOUR RULE - NUMBER OF HRS OVER            
TMINCL   DS    CL1                 INCLUDE CODE ON TIMESHEET                    
TMREIM   DS    XL4                 REIMBURSED EXP. ON TIMESHEET                 
TMNSPH   DS    XL4                 AMOUNT NOT SUBJECT TO PNH                    
TMPYMT   DS    XL4                 ADDITION TO PAYMENT AMOUNT                   
TMADJ    DS    XL4                 ADJUSTMENT AMOUNT                            
TMXSAT   DS    XL2                 EXTRAS SATURDAY PAY ON FRIDAYS               
         DS    XL4                 SPARE FOR TIMESHEETS                         
HASTIME  DS    CL1                 Y=INVOICE HAS TIMESHEETS                     
*                                                                               
COMNAME2 DS    CL36                COMMERCIAL NAME FOR VERSIONS>1               
*                                                                               
INVRSPNH DS    XL4                 RETRO - ORIGINAL SUBJ P&H (INV LVL)          
INVRPNHD DS    XL4                 RETRO - P&H DIFF          (INV LVL)          
*                                                                               
AGYSCDE  DS    CL6                 PAY OPTION: AGENCY STUDIO CODE               
*                                                                               
DEFJOB   DS    CL15                AGENCY DEFAULT JOB                           
*                                                                               
*        DEFINE NEW STORAGE BEFORE THIS POINT (SEE ALSO AFTER SYSCALCD)         
*                                                                               
SPARELNQ EQU   X'FFF'-((*-PAYD)+TCEND+3-TCD)  L'AVAILABLE W/S                   
SPAREPAY DS    CL(SPARELNQ)        DEFINE IT, SO ERROR IF EXCEEDED              
         EJECT                                                                  
         SPACE 1                                                                
       ++INCLUDE TASYSCALCD                                                     
         SPACE 3                                                                
*                                                                               
*        REMAINING STORAGE (ONLY FIRST BYTE IS DIRECTLY ADDRESSABLE)            
*                                                                               
MAXHNW   EQU   200                                                              
HNWBUFF  DS    CL(MAXHNW*4)        H&W BUFFER WITH XL4'SSN'                     
MAXMKT   EQU   28                                                               
MKTTABL  DS    CL((MAXMKT*MKTLNQ)+1) MARKET TABLE                               
MAXMED   EQU   20                                                               
MEDTABL  DS    CL((MAXMED*MEDLNQ)+1) INTERNET/NEW MEDIA TABLE                   
PAYVERS  DS    XL251               INPUTTED VERSIONS (VRE/VNR)                  
CSTVERS  DS    XL251               VERSIONS TO PAY (VRE/VNR)                    
*                                                                               
*                                                                               
SPARELQ2 EQU   L'TWAHOLE-(*-PAYD)  L'AVAILABLE W/S                              
         DS    CL(SPARELQ2)        DEFINE IT, SO ERROR IF EXCEEDED              
         SPACE 3                                                                
*              *** END OF PAYD ***                                              
