*          DATA SET TAGENFILE  AT LEVEL 007 AS OF 12/12/17                      
***********************************************************************         
*##PROCESS OFF                                                        *         
***********************************************************************         
                                                                                
       ++INCLUDE TAGENTXT                                                       
         EJECT                                                                  
***********************************************************************         
*        GENERAL DIRECTORY RECORD DSECT                               *         
***********************************************************************         
                                                                                
TLDRD    DSECT                                                                  
TLDRREC  DS    0CL38                                                            
TLDRKEY  DS    0CL32                                                            
TLDRCD   DS    XL1                 RECORD CODE                                  
         DS    CL31                REMAINDER OF KEY                             
TLDRSTAT DS    XL2                 DIRECTORY STATUS                             
TLDRDA   DS    XL4                 DISK ADDRESS OF RECORD                       
                                                                                
***********************************************************************         
*        GENERAL FILE RECORD DSECT                                    *         
***********************************************************************         
                                                                                
TLRCD    DSECT                                                                  
TLRCKEY  DS    0CL32                                                            
TLRCCD   DS    XL1                 RECORD CODE                                  
         DS    CL31                REMAINDER OF KEY                             
TLRCLEN  DS    XL2                 L'RECORD                                     
TLRCSTAT DS    XL2                 STATUS BYTES                                 
         DS    CL4                                                              
TLRCELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*##PROCESS ON                                                         *         
*##PROCESS ELEMENT OFF                                                *         
***********************************************************************         
         EJECT                                                                  
***********************************************************************         
*        <   > 1099 RECORD                                            *         
***********************************************************************         
*##FILENAME CHKFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TL99D    DSECT                                                                  
TL99KEY  DS    0CL32                                                            
TL99CD   DS    XL1                                                              
TL99CDQ  EQU   X'24'                                                            
TL99SCD  DS    XL1                                                              
TL99SCDQ EQU   X'04'               ACTIVE KEY                                   
TL99YEAR DS    CL4                 DISPLAYABLE YEAR (EBCDIC)                    
TL99CUR  DS    CL1                 CURRENCY                                     
TL99EMP  DS    CL3                 EMPLOYER                                     
TL99FID  DS    CL9                 FEDERAL ID NUMBER                            
TL99W4TY DS    CL1                 W4 TYPE                                      
TL99TYB  EQU   C'B'                BENEFICIARY                                  
TL99TYC  EQU   C'C'                CONTRACTOR                                   
TL99TYE  EQU   C'E'                ASSOCIATED ESTATE                            
TL99TYL  EQU   C'L'                LLC                                          
TL99TYP  EQU   C'P'                PARTNERSHIP                                  
TL99CDTE DS    XL3                 CHANGED DATE - PWOS COMPLEMENTED             
         DS    XL9                                                              
                                                                                
TL99LEN  DS    XL2                                                              
TL99STAT DS    XL2                                                              
         DS    CL4                                                              
TL99ELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > AGENCY RECORD                                          *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLAYD    DSECT                                                                  
TLAYKEY  DS    0CL32                                                            
TLAYCD   DS    XL1                                                              
TLAYCDQ  EQU   X'10'               ACTIVE KEY                                   
         DS    CL21                                                             
TLAYAGY  DS    CL6                 AGENCY CODE                                  
         DS    CL4                                                              
                                                                                
TLAYLEN  DS    XL2                                                              
TLAYSTAT DS    XL2                                                              
         DS    CL4                                                              
TLAYELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        AGENCY RECORD PASSIVE KEYS                                   *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLAYPD   DSECT                                                                  
TLAYPKEY DS    0CL32                                                            
TLAYPCD  DS    CL1                                                              
TLAYNCDQ EQU   X'11'               PASSIVE KEY (NAME)                           
         DS    CL11                                                             
TLAYNAME DS    CL16                AGENCY NAME                                  
TLAYNSEQ DS    XL4                 SEQUENCE NUMBER                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLAYPCD+1                                                        
TLAYGCDQ EQU   X'12'               PASSIVE KEY (AGENCY GROUP)                   
         DS    CL15                                                             
TLAYGAGG DS    CL6                 AGENCY GROUP CODE                            
TLAYGAGY DS    CL6                 AGENCY CODE                                  
         DS    CL4                                                              
                                                                                
***********************************************************************         
                                                                                
TLBRPD   DSECT                                                                  
TLBRPKEY DS    0CL32                                                            
TLBRPCD  DS    CL1                                                              
TLBRCCDQ EQU   X'65'               PASSIVE KEY (BRATE)                          
TLBRCAGY DS    CL6                 AGENCY CODE                                  
TLBRCCLI DS    CL6                 CLIENT CODE                                  
         DS    CL19                                                             
                                                                                
***********************************************************************         
                                                                                
         ORG   TLBRPCD+1                                                        
TLBRNCDQ EQU   X'66'               PASSIVE KEY (BRATE BY NAME)                  
TLBRNAGY DS    CL6                 AGENCY CODE                                  
TLBRNNAM DS    CL19                NAME                                         
TLBRNCOD DS    CL6                 CLIENT CODE                                  
         EJECT                                                                  
***********************************************************************         
*        <   > AGENCY GROUP RECORD                                    *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLAGD    DSECT                                                                  
TLAGKEY  DS    0CL32                                                            
TLAGCD   DS    XL1                                                              
TLAGCDQ  EQU   X'18'               ACTIVE KEY                                   
         DS    CL23                                                             
TLAGAGG  DS    CL6                 AGENCY GROUP CODE                            
         DS    CL2                                                              
                                                                                
TLAGLEN  DS    XL2                                                              
TLAGSTAT DS    XL2                                                              
         DS    CL4                                                              
TLAGELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        AGENCY GROUP RECORD PASSIVE KEYS                             *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLAGPD   DSECT                                                                  
TLAGPKEY DS    0CL32                                                            
TLAGPCD  DS    CL1                                                              
TLAGNCDQ EQU   X'19'               PASSIVE KEY (NAME)                           
         DS    CL11                                                             
TLAGNAME DS    CL16                AGENCY GROUP NAME                            
TLAGNSEQ DS    XL4                 SEQUENCE NUMBER                              
         EJECT                                                                  
***********************************************************************         
*        <   > ALIAS RECORD                                           *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLAKD    DSECT                                                                  
TLAKKEY  DS    0CL32                                                            
TLAKCD   DS    XL1                                                              
TLAKCDQ  EQU   X'D8'               ACTIVE KEY                                   
TLAKAGY  DS    CL6                 AGENCY CODE                                  
TLAKADID DS    CL12                TRAFFIC COMMERCIAL ID                        
TLAKNCLI DS    CL3                 SPOT/NETWORK CLIENT                          
TLAKNPRD DS    CL3                 SPOT/NETWORK PRODUCT                         
TLAKMED  DS    CL1                 MEDIA CODE                                   
TLAKVER  DS    XL1                 VERSION                                      
TLAKCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL1                                                              
                                                                                
TLAKLEN  DS    XL2                                                              
TLAKSTAT DS    XL2                                                              
TLAKSLFT EQU   X'01'               ALIAS IS A LIFT ID                           
         DS    CL4                                                              
TLAKELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > AGENT RECORD                                           *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLAND    DSECT                                                                  
TLANKEY  DS    0CL32                                                            
TLANCD   DS    XL1                                                              
TLANCDQ  EQU   X'50'               ACTIVE KEY                                   
         DS    CL25                                                             
TLANAGT  DS    CL4                 AGENT NUMBER                                 
         DS    CL2                                                              
                                                                                
TLANLEN  DS    XL2                                                              
TLANSTAT DS    XL2                                                              
         DS    CL4                                                              
TLANELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        AGENT RECORD PASSIVE KEYS                                    *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLANPD   DSECT                                                                  
TLANPKEY DS    0CL32                                                            
TLANPCD  DS    CL1                                                              
TLANNCDQ EQU   X'51'               PASSIVE KEY (NAME)                           
         DS    CL11                                                             
TLANNAME DS    CL16                SHORT NAME                                   
TLANNSEQ DS    XL4                 SEQUENCE NUMBER                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLANPCD+1                                                        
TLANCCDQ EQU   X'52'               PASSIVE KEY (COMBINED DPS/T&R)               
         DS    CL27                                                             
TLANCAGT DS    CL4                 AGENT NUMBER                                 
                                                                                
***********************************************************************         
                                                                                
         ORG   TLANPCD+1                                                        
TLANBCDQ EQU   X'55'               PASSIVE KEY (NAME BREAKDOWN)                 
TLANBNAM DS    CL26                NAME BREAKDOWN                               
TLANBAGT DS    CL4                 AGENT NUMBER                                 
TLANBELQ DS    XL1                 ELCODE - TANAELQ OR TASNELQ                  
                                                                                
***********************************************************************         
                                                                                
         ORG   TLANPCD+1                                                        
TLANSCDQ EQU   X'5B'               PASSIVE KEY (SS NUMBER)                      
TLANSSSN DS    CL9                 SS NUMBER FOR AGENT                          
TLANSAGT DS    CL4                 AGENT NUMBER                                 
         DS    XL18                                                             
         EJECT                                                                  
***********************************************************************         
*        <   > AREA RECORD                                            *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLARD    DSECT                                                                  
TLARKEY  DS    0CL32                                                            
TLARCD   DS    XL1                                                              
TLARCDQ  EQU   X'88'               ACTIVE KEY                                   
         DS    CL25                                                             
TLARAREA DS    CL3                 AREA CODE                                    
         DS    CL3                                                              
                                                                                
TLARLEN  DS    XL2                                                              
TLARSTAT DS    XL2                                                              
         DS    CL4                                                              
TLARELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > ATTENTION RECORD                                       *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLATD    DSECT                                                                  
TLATKEY  DS    0CL32                                                            
TLATCD   DS    XL1                                                              
TLATCDQ  EQU   X'1C'               ACTIVE KEY                                   
         DS    CL15                                                             
TLATAGY  DS    CL6                 AGENCY CODE                                  
         DS    CL2                                                              
TLATATT  DS    CL2                 ATTENTION CODE                               
         DS    CL6                                                              
                                                                                
TLATLEN  DS    XL2                                                              
TLATSTAT DS    XL2                                                              
         DS    CL4                                                              
TLATELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > BALANCE RECORD                                         *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLBAD    DSECT                                                                  
TLBAKEY  DS    0CL32                                                            
TLBACD   DS    XL1                                                              
TLBACDQ  EQU   X'C0'               ACTIVE KEY                                   
         DS    CL23                                                             
TLBADATE DS    XL3                 PWOS DATE (COMPLEMENTED)                     
TLBACURR DS    CL1                 CURRENCY                                     
TLBACUS  EQU   C'U'                U.S. DOLLARS                                 
TLBACCAN EQU   C'C'                CANADIAN DOLLARS                             
TLBACEUR EQU   C'E'                EUROS                                        
TLBAEMP  DS    CL3                 EMPLOYER                                     
TLBASEQ  DS    XL1                 SEQUENCE NUMBER                              
                                                                                
TLBALEN  DS    XL2                                                              
TLBASTAT DS    XL2                                                              
         DS    CL4                                                              
TLBAELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > CAST RECORD                                            *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLCAD    DSECT                                                                  
TLCAKEY  DS    0CL32                                                            
TLCACD   DS    XL1                                                              
TLCACDQ  EQU   X'80'               ACTIVE KEY                                   
         DS    CL7                                                              
TLCACOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCASORT DS    0XL6                SORT KEY                                     
TLCASRT  DS    XL4                 BYTE 0 - BIT FLAGS                           
TLCASRMQ EQU   X'80'                   X'80' - MEMBER IS A MUSICIAN             
*                                      X'40' - SPARE                            
TLCASREQ EQU   X'20'                   X'20' - MEMBER IS AN EXTRA               
*                                      X'10' - SPARE                            
TLCASRFQ EQU   X'08'                   X'08' - MEMBER IS OFF CAMERA             
*                                      X'04' - SPARE                            
TLCASRGQ EQU   X'02'                   X'02' - MEMBER IS NOT A GUAR             
*                                      X'01' - SPARE                            
*                                  BYTE 1 - SORT CODE FROM CATEGORY TAB         
*                                  BYTE 2-3 - VITA INPUT SEQUENCE NUM           
         ORG   TLCASORT                                                         
TLCASRBF DS    XL1                 BYTE 0 - BIT FLAGS                           
TLCASRSC DS    XL1                 BYTE 1 - SORT CODE FROM CATEGORY TAB         
TLCASRVS DS    XL2                 BYTE 2-3 - VITA INPUT SEQUENCE NUM           
TLCASEQ  DS    XL2                 BYTES 4-5 - INPUT SEQUENCE NUMBER            
TLCASSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCACAT  DS    CL3                 CATEGORY                                     
TLCASPR2 DS    CL2                                                              
                                                                                
TLCALEN  DS    XL2                                                              
TLCASTAT DS    XL2                                                              
TLCASDCG EQU   X'80'               X'80' - DELETED DUE TO A KEY CHANGE          
TLCASDEL EQU   X'40'               X'40' - REALLY DELETED (CAST/DELETE)         
TLCASLFT EQU   X'20'               CAST MEMBER ON LIFT                          
         DS    CL4                                                              
TLCAELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        CAST RECORD PASSIVE KEYS                                     *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLCAPD   DSECT                                                                  
TLCAPKEY DS    0CL32                                                            
TLCAPCD  DS    CL1                                                              
TLCACCDQ EQU   X'81'               PASSIVE KEY (EMPLOYEE'S COMMLS)              
         DS    CL7                                                              
TLCACSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL6                                                              
TLCACCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCACCAT DS    CL3                 CATEGORY                                     
TLCACSEQ DS    XL2                 SEQUENCE NUMBER                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCAPCD+1                                                        
TLCAACDQ EQU   X'82'               PASSIVE KEY (AGENT)                          
         DS    CL1                                                              
TLCAAAGT DS    CL4                 AGENT NUMBER                                 
         DS    CL2                                                              
TLCAASSN DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL6                                                              
TLCAACOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCAACAT DS    CL3                 CATEGORY                                     
TLCAASEQ DS    XL2                 SEQUENCE NUMBER                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCAPCD+1                                                        
TLCAGCDQ EQU   X'83'               PASSIVE KEY (GUARANTEE)                      
         DS    CL9                                                              
TLCAGSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCAGGUA DS    CL4                 GUARANTEE CODE                               
TLCAGCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCAGCAT DS    CL3                 CATEGORY                                     
TLCAGSEQ DS    XL2                 SEQUENCE NUMBER                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCAPCD+1                                                        
TLCAHCDQ EQU   X'85'               PASSIVE KEY (HOLDING FEE)                    
TLCAHCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCAHSRT DS    XL6                 CAST SORT KEY (ZEROS IF FROM COMML)          
TLCAHDTE DS    XL3                 APPLICABLE DATE: TACOFCYC FROM COMML         
*                                    - TACAFCYC OR TACREND+1 FROM CAST          
*                                  * FROM COMMERCIAL                            
TLCAHAGY DS    CL6                 AGENCY                                       
TLCAHCLI DS    CL6                 CLIENT                                       
TLCAHPRD DS    CL6                 PRODUCT                                      
         ORG   TLCAHAGY            * FROM CAST                                  
TLCAHNXT DS    XL3                 NEXT HF CYCLE AS OF LAST HF NOTIF.           
TLCAHMRK DS    XL3                 DATE LAST MARKED BY HF NOTIFICATION          
TLCAHSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCAHFFC DS    XL3                 CAST FIRST FIXED CYCLE DATE                  
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCAPCD+1                                                        
TLCATCDQ EQU   X'86'               PASSIVE KEY (MUSIC CONTRACT TRACK)           
TLCATMCO DS    XL4                 TYPE M INTERNAL COMMERCIAL NUMBER            
TLCATMCS DS    XL2                 TYPE M CAST SEQUENCE NUMBER                  
TLCATCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCATSEQ DS    XL2                 CAST SEQUENCE NUMBER                         
TLCATSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    XL10                                                             
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCAPCD+1                                                        
TLCANCDQ EQU   X'87'               PASSIVE KEY (NAME)                           
TLCANCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCANNAM DS    CL25                LAST/FIRST NAME-CORPORATION NAME             
TLCANSEQ DS    XL2                 CAST SEQUENCE NUMBER                         
         EJECT                                                                  
***********************************************************************         
*        <   > CLIENT GROUP RECORD                                    *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLCGD    DSECT                                                                  
TLCGKEY  DS    0CL32                                                            
TLCGCD   DS    XL1                                                              
TLCGCDQ  EQU   X'28'               ACTIVE KEY                                   
         DS    CL23                                                             
TLCGCLG  DS    CL6                 CLIENT GROUP                                 
         DS    CL2                                                              
                                                                                
TLCGLEN  DS    XL2                                                              
TLCGSTAT DS    XL2                                                              
         DS    CL4                                                              
TLCGELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        CLIENT GROUP RECORD PASSIVE KEYS                             *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLCGPD   DSECT                                                                  
TLCGPKEY DS    0CL32                                                            
TLCGPCD  DS    CL1                                                              
TLCGNCDQ EQU   X'29'               PASSIVE KEY (NAME)                           
         DS    CL11                                                             
TLCGNAME DS    CL16                NAME                                         
TLCGNSEQ DS    XL4                 SEQUENCE NUMBER                              
         EJECT                                                                  
***********************************************************************         
*        <   > CHECK RECORD                                           *         
***********************************************************************         
*##FILENAME CHKFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLCKD    DSECT                                                                  
TLCKKEY  DS    0CL32                                                            
TLCKCD   DS    XL1                                                              
TLCKCDQ  EQU   X'A0'               ACTIVE KEY (INVOICE ACCESS)                  
TLCKAGY  DS    CL6                 AGENCY                                       
TLCKINV  DS    XL6                 INVOICE NUMBER                               
TLCKSORT DS    XL6                 SORT KEY                                     
TLCKSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCKCAT  DS    CL3                 CATEGORY                                     
TLCKSEQ  DS    XL1                 SEQUENCE NUMBER                              
*                                  STARTS AT X'FF' AND PROCEEDS DOWN 2          
*                                  AT A TIME EACH TIME A CHECK IS ADDED         
*                                  WITH THE SAME CAST PAYMENT HISTORY           
*                                  DETAILS (OR TLCKC FOR TAX XFER/REF)          
*                                  LOW NUMBERS USED BY CONVERSION               
                                                                                
TLCKLEN  DS    XL2                                                              
TLCKSTAT DS    XL2                                                              
TLCKSDEL EQU   X'01'               OK TO DELETE RECORD - SEE TALDPRGE           
         DS    CL4                                                              
TLCKELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        CHECK RECORD PASSIVE KEYS                                    *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLCKPD   DSECT                                                                  
TLCKPKEY DS    0CL32                                                            
TLCKPCD  DS    CL1                                                              
         ORG   TLCKPCD+1                                                        
TLCKHCDQ EQU   X'A1'               PASSIVE KEY (CAST PAYMENT HISTORY)           
TLCKHCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCKHSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCKHCAT DS    CL3                 CATEGORY                                     
TLCKHINV DS    XL6                 INVOICE NUMBER (COMPLEMENTED)                
TLCKHSEQ DS    XL2                 CAST SEQUENCE NUMBER                         
TLCKHCSQ DS    CL1                 SEQUENCE NUMBER (SAME AS TLCKSEQ)            
TLCKHDA  DS    XL4                 DISK ADDRESS                                 
         DS    CL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKDCDQ EQU   X'A2'               PASSIVE KEY (DUE COMPANY TRACKING)           
         DS    CL9                                                              
TLCKDSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCKDDUC DS    CL6                 DUE COMPANY CODE                             
TLCKDDTE DS    XL3                 CHECK DATE (PWOS - COMPLEMENTED)             
TLCKDSEQ DS    XL4                 CHECK RUN SEQ NUMBER (COMPLEMENTED)          
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKLCDQ EQU   X'A3'               PASSIVE KEY (LIEN TRACKING)                  
         DS    CL9                                                              
TLCKLSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCKLLIN DS    CL6                 LIEN CODE                                    
TLCKLDTE DS    XL3                 CHECK DATE (PWOS - COMPLEMENTED)             
TLCKLSEQ DS    XL4                 CHECK RUN SEQ NUMBER (COMPLEMENTED)          
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKCCDQ EQU   X'A5'               PASSIVE KEY (CHECKS)                         
         DS    CL16                                                             
TLCKCCHK DS    CL8                 CHECK NUMBER (COMPLEMENTED)                  
TLCKCBNK DS    CL6                 BANK CODE (ACCOUNT)                          
TLCKCSEQ DS    XL1                 SEQUENCE NUMBER (SAME AS TLCKSEQ)            
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKECDQ EQU   X'A6'               PASSIVE KEY (EMPLOYEE'S CHECKS)              
TLCKESSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCKECUR DS    CL1                 CURRENCY                                     
TLCKEEMP DS    CL3                 EMPLOYER                                     
TLCKEDTE DS    XL3                 CHECK DATE (PWOS - COMPLEMENTED)             
*                                  IF CHECK NOT WRITTEN YET, DATE IS            
*                                  X'00',CAST INPUT SEQ NUMBER (2)              
*                                  AND SEQ NUMBER IS BINARY INV NO.(5)          
TLCKESEQ DS    XL4                 SEQUENCE NUMBER (COMPLEMENTED)               
TLCKEAGY DS    CL6                 AGENCY                                       
TLCKEAGT DS    CL4                 AGENT NUMBER                                 
TLCKESTA DS    XL1                 STATUS                                       
TLCKEMSC EQU   X'80'               MULTI-CONTRACT SERVICE                       
TLCKEFRC EQU   X'40'               CHECK DATE FORCED TO 12/31/(YEAR-1)          
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKYCDQ EQU   X'A7'               PASSIVE KEY (PAYROLL YTD)                    
TLCKYEAR DS    CL4                 TAX YEAR                                     
TLCKYCUR DS    CL1                 CURRENCY                                     
TLCKYEMP DS    CL3                 EMPLOYER                                     
TLCKYSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCKYTXU DS    CL3                 TAX UNIT                                     
         DS    CL1                                                              
TLCKYDTE DS    XL3                 CHECK DATE (PWOS - COMPLEMENTED)             
TLCKYSEQ DS    XL4                 SEQUENCE NUMBER (COMPLEMENTED)               
TLCKYW4T DS    CL1                 W4 TYPE (SEE TAW4TYPE FOR EQUATES)           
TLCKYSTS DS    XL1                 STATUS  (SEE TACWSTAT FOR EQUATES)           
TLCKYCSQ DS    XL1                 SEQUENCE NUMBER (SAME AS TLCKSEQ)            
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKCSSQ EQU   X'A9'               PASSIVE KEY (CHK STOP - STOP DATE)           
TLCKCSSX DS    XL1                 CHECK STOP CANCELLED?                        
         DS    CL11                                                             
TLCKCSSD DS    XL3                 CHECK STOP DATE                              
TLCKCSSC DS    CL8                 CHECK NUMBER                                 
TLCKCSSI DS    XL6                 INVOICE NUMBER                               
         DS    XL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKCSCQ EQU   X'AA'               PASSIVE KEY (CHK STOP - STOP DATE)           
TLCKCSCX DS    XL1                 CHECK STOP CANCELLED?                        
         DS    CL11                                                             
TLCKCSCD DS    XL3                 CHECK DATE                                   
TLCKCSCC DS    CL8                 CHECK NUMBER                                 
TLCKCSCI DS    XL6                 INVOICE NUMBER                               
         DS    XL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKKCDQ EQU   X'AB'               PASSIVE KEY (EMPLOYEE'S CHECKS)              
TLCKKSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCKKCUR DS    CL1                 CURRENCY                                     
TLCKKEMP DS    CL3                 EMPLOYER                                     
TLCKKDTE DS    XL3                 CHECK DATE                                   
*                                  IF CHECK NOT WRITTEN YET, DATE IS            
*                                  X'00',CAST INPUT SEQ NUMBER (2)              
*                                  AND SEQ NUMBER IS BINARY INV NO.(5)          
TLCKKSEQ DS    XL4                 SEQUENCE NUMBER                              
TLCKKCKN DS    CL8                 CHECK NUMBER                                 
         DS    CL3                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKCPSQ EQU   X'AD'               PASSIVE KEY (CHK PULL - PULL DATE)           
TLCKCPSD DS    XL3                 CHECK PULL DATE                              
TLCKCPSR DS    XL1                 REASON CHECK PULLED                          
TLCKCPSI DS    XL6                 INVOICE NUMBER                               
TLCKCPSE DS    XL1                 CHECK SEQUENCE NUMBER                        
TLCKCPSC DS    CL8                 CHECK NUMBER                                 
TLCKCPSS DS    XL2                 CAST SEQUENCE NUMBER                         
TLCKCPSN DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL1                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKCPCQ EQU   X'AE'               PASSIVE KEY (CHK PULL - CHK DATE)            
TLCKCPCD DS    XL3                 CHECK DATE                                   
TLCKCPCR DS    XL1                 REASON CHECK PULLED                          
TLCKCPCI DS    XL6                 INVOICE NUMBER                               
TLCKCPCE DS    XL1                 CHECK SEQUENCE NUMBER                        
TLCKCPCC DS    XL4                 CHECK NUMBER IN BINARY                       
TLCKCPCS DS    XL2                 CAST SEQUENCE NUMBER                         
TLCKCPCN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCKCPDA DS    XL4                 DISK ADDRESS                                 
         DS    CL1                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKBCDQ EQU   X'AF'               PASSIVE KEY (BILLING YTD)                    
TLCKBCUR DS    CL1                 CURRENCY                                     
TLCKBEMP DS    CL3                 EMPLOYER                                     
TLCKBSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCKBDTE DS    XL3                 BILL RUN DATE (PWOS - COMPLEMENTED)          
TLCKBTIM DS    XL4                 BILL RUN TIME (PWOS - COMPLEMENTED)          
TLCKBAGY DS    CL6                 AGENCY                                       
TLCKBINV DS    XL3                 LAST 3 BYTES OF INV (TLCKINV+2)              
TLCKBSEQ DS    XL2                 CAST SEQUENCE NUMBER (COMPLEMENTED)          
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCKPCD+1                                                        
TLCKRCDQ EQU   X'B1'               PASSIVE KEY (CREDIT INVOICE)                 
TLCKRAGY DS    CL6                 AGENCY                                       
TLCKRCIN DS    XL6                 CREDITED INVOICE                             
TLCKRCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCKRCSQ DS    XL2                 CAST SEQUENCE NUMBER                         
TLCKRINV DS    XL6                 INVOICE                                      
TLCKRSSN DS    XL4                 SOCIAL SECURITY (BINARY)                     
         DS    XL3                 SPARE                                        
         EJECT                                                                  
***********************************************************************         
*        <   > CLIENT RECORD                                          *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLCLD    DSECT                                                                  
TLCLKEY  DS    0CL32                                                            
TLCLCD   DS    XL1                                                              
TLCLCDQ  EQU   X'20'               ACTIVE KEY                                   
TLCLSPR1 DS    CL15                                                             
TLCLAGY  DS    CL6                 AGENCY (OR BINARY ZEROS)                     
TLCLSPR2 DS    CL2                                                              
TLCLCLI  DS    CL6                 CLIENT                                       
TLCLSPR3 DS    CL2                                                              
                                                                                
TLCLLEN  DS    XL2                                                              
TLCLSTAT DS    XL2                                                              
         DS    CL4                                                              
TLCLELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        CLIENT RECORD PASSIVE KEYS                                   *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLCLPD   DSECT                                                                  
TLCLPKEY DS    0CL32                                                            
TLCLPCD  DS    CL1                                                              
TLCLNCDQ EQU   X'21'               PASSIVE KEY (NAME)                           
         DS    CL1                                                              
TLCLNAGY DS    CL6                 AGENCY (OR BINARY ZEROS)                     
         DS    CL2                                                              
TLCLNAME DS    CL16                NAME                                         
         DS    CL2                                                              
TLCLNSEQ DS    XL4                 SEQUENCE NUMBER                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCLPCD+1                                                        
TLCLGCDQ EQU   X'22'               PASSIVE KEY (CLIENT GROUP)                   
TLCLGCS1 DS    CL7                   SPARE                                      
TLCLGCLG DS    CL6                 CLIENT GROUP                                 
TLCLGCS2 DS    CL2                   SPARE                                      
TLCLGAGY DS    CL6                 AGENCY (OR BINARY ZEROS)                     
TLCLGCS3 DS    CL2                   SPARE                                      
TLCLGCLI DS    CL6                 CLIENT                                       
TLCLGCS4 DS    CL2                   SPARE                                      
         EJECT                                                                  
***********************************************************************         
*        <   > COMMENT RECORD                                         *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLCMD    DSECT                                                                  
TLCMKEY  DS    0CL32                                                            
TLCMCD   DS    XL1                                                              
TLCMCDQ  EQU   X'C4'               ACTIVE KEY                                   
TLCMSPR1 DS    CL1                                                              
TLCMAGY  DS    CL6                 AGENCY                                       
TLCMTYP  DS    CL1                 COMMENT TYPE                                 
TLCMTCON EQU   C'A'                CONTRACT (AGREEMENT)                         
TLCMTCOM EQU   C'C'                COMMERCIAL                                   
TLCMTFCL EQU   C'F'                FINAL CAST LIST                              
TLCMTGUA EQU   C'G'                GUARANTEE                                    
TLCMTINV EQU   C'I'                INVOICE                                      
TLCMTADV EQU   C'V'                ADVICE (DETAILS)                             
TLCMDATA DS    CL18                                                             
*                                                                               
         ORG   TLCMDATA            *** GUARANTEE ***                            
TLCMSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLCMGUA  DS    CL4                 GUARANTEE CODE                               
*                                                                               
         ORG   TLCMDATA            *** COMMERCIAL/FINAL CAST LIST ***           
TLCMCID  DS    CL12                COMM'L ID                                    
TLCMICOM DS    XL4                 INTERNAL COMM'L #                            
TLCMVER  DS    CL1                 VERSION                                      
TLCMSEQ  DS    XL1                 SEQUENCE COMPLEMENTED (TYPE F ONLY)          
*                                                                               
         ORG   TLCMDATA            *** CONTRACT **                              
TLCMCNID DS    CL12                CONTRACT ID                                  
TLCMTRMS DS    XL3                 TERM START DATE                              
TLCMTRME DS    XL3                 TERM END DATE                                
*                                                                               
         ORG   TLCMDATA            *** INVOICE **                               
TLCMINV  DS    XL6                 INVOICE NUMBER (COMPLEMENTED)                
         DS    XL12                                                             
*                                                                               
         ORG   TLCMDATA            *** ADVICE (DETAILS) **                      
TLCMVCID DS    CL12                COMM'L ID                                    
TLCMVADV DS    CL6                 ADVICE NUMBER                                
*                                                                               
         ORG                                                                    
TLCMLEV  DS    CL1                 LEVEL OF COMMENT                             
TLCMTPC  EQU   X'80'               TALENT PARTNER'S COMMENT                     
         DS    CL4                 SPARE                                        
                                                                                
TLCMLEN  DS    XL2                                                              
TLCMSTAT DS    XL2                                                              
         DS    CL4                                                              
TLCMELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > COMMERCIAL RECORD                                      *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLCOD    DSECT                                                                  
TLCOKEY  DS    0CL32                                                            
TLCOCD   DS    XL1                                                              
TLCOCDQ  EQU   X'40'               ACTIVE KEY                                   
TLCOVER  DS    XL1                 VERSIONS INCLUDED ON THIS COMM'L...          
TLCOV026 EQU   0                   VERSIONS 1-26                                
TLCOV120 EQU   1                   VERSIONS 27-120                              
TLCOV210 EQU   2                   VERSIONS 121-210                             
TLCOV250 EQU   3                   VERSIONS 211-250                             
TLCOAGY  DS    CL6                 AGENCY                                       
TLCOCLI  DS    CL6                 CLIENT                                       
TLCOPRD  DS    CL6                 PRODUCT (OR BINARY ZEROS)                    
TLCOCID  DS    CL8                 COMM ID (PARTIAL - FOR SEQUENCING)           
TLCOCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
                                                                                
TLCOLEN  DS    XL2                                                              
TLCOSTAT DS    XL2                 X'40'=COPIED FROM - TREAT AS DELETED         
TLCOSDEL EQU   X'01'               OK TO DELETE RECORD-SEE TALDPRGE             
TLCOSERR EQU   X'02'               NOT OKAY TO DELETE -SEE COPURGE/REP          
         DS    CL4                                                              
TLCOELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        COMMERCIAL RECORD PASSIVE KEYS                               *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLCOPD   DSECT                                                                  
TLCOPKEY DS    0CL32                                                            
TLCOPCD  DS    CL1                                                              
TLCONCDQ EQU   X'41'               PASSIVE KEY (NAME)                           
TLCONCLI DS    CL6                 CLIENT                                       
TLCONAME DS    CL20                NAME                                         
TLCONVER DS    XL1                 VERSION NUMBER                               
TLCONCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOICDQ EQU   X'42'               PASSIVE KEY (COMM ID)                        
         DS    CL3                                                              
TLCOIAGY DS    CL6                 AGENCY                                       
         DS    CL2                                                              
TLCOICID DS    CL12                COMMERCIAL ID OR VERSION ID                  
         DS    CL2                                                              
TLCOICOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCOIVER DS    XL1                 VERSION                                      
         DS    CL1                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOCCDQ EQU   X'43'               PASSIVE KEY (INTERNAL#)                      
         DS    CL25                                                             
TLCOCCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOMCDQ EQU   X'45'               PASSIVE KEY (MUSIC)                          
         DS    CL2                                                              
TLCOMAGY DS    CL6                 AGENCY                                       
TLCOMMUS DS    CL8                 MUSIC                                        
         DS    CL1                                                              
TLCOMCID DS    CL12                COMMERCIAL ID                                
         DS    CL1                                                              
TLCOMVER DS    XL1                 VERSION                                      
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOPCDQ EQU   X'46'               PASSIVE KEY (PRINT COMMERCIAL)               
         DS    CL1                                                              
TLCOPAGY DS    CL6                 AGENCY                                       
TLCOPCLI DS    CL6                 CLIENT                                       
TLCOPPRD DS    CL6                 PRODUCT                                      
TLCOPCID DS    CL8                 COMM ID (PARTIAL - FOR SEQUENCING)           
TLCOPCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOACDQ EQU   X'47'               PASSIVE KEY (AFM CONTRACTS)                  
         DS    CL1                                                              
TLCOAAGY DS    CL6                 AGENCY                                       
TLCOACON DS    CL12                CONTRACT NUMBER                              
TLCOACID DS    CL12                COMMERCIAL ID                                
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOKCDQ EQU   X'49'               PASSIVE KEY (AKA COMMERCIAL)                 
         DS    CL1                                                              
TLCOKAGY DS    CL6                 AGENCY                                       
TLCOKAKA DS    CL12                AKA COMMERCIAL ID                            
TLCOKCID DS    CL12                COMMERCIAL ID                                
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOGCDQ EQU   X'4A'               PASSIVE KEY (CLIENT GROUP & CID)             
         DS    CL1                                                              
TLCOGCLG DS    CL6                 CLIENT GROUP                                 
TLCOGCID DS    CL12                COMMERCIAL ID                                
TLCOGAGY DS    CL6                 AGENCY CODE                                  
TLCOGCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOLCDQ EQU   X'4B'               PASSIVE KEY (CLIENT GROUP & NAME)            
         DS    CL1                                                              
TLCOLCLG DS    CL6                 CLIENT GROUP                                 
TLCOLNAM DS    CL20                COMMERCIAL NAME                              
TLCOLCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL2                                                              
         ORG   TLCOPCD+1                                                        
                                                                                
***********************************************************************         
                                                                                
TLCOVRDQ EQU   X'4D'               PASSIVE KEY (VERSION NUMBER)                 
TLCOVAGY DS    CL6                 AGENCY                                       
TLCOVCLI DS    CL6                 CLIENT                                       
TLCOVPRD DS    CL6                 PRODUCT (OR BINARY ZEROS)                    
TLCOVCID DS    CL8                 COMM ID (PARTIAL - FOR SEQUENCING)           
TLCOVCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCOVVER DS    XL1                 VERSION NUMBER                               
         ORG   TLCOPCD+1                                                        
                                                                                
***********************************************************************         
                                                                                
TLCOGIDQ EQU   X'4E'               PASSIVE KEY (COMM'L GROUP & CID)             
         DS    CL1                                                              
TLCOGICG DS    CL6                 COMMERCIAL GROUP                             
TLCOGIID DS    CL12                COMMERCIAL ID                                
TLCOGIAY DS    CL6                 AGENCY CODE                                  
TLCOGIIN DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOGNDQ EQU   X'4F'               PASSIVE KEY (COMM'L GROUP & NAME)            
         DS    CL1                                                              
TLCOGNCG DS    CL6                 COMMERCIAL GROUP                             
TLCOGNNM DS    CL20                COMMERCIAL NAME                              
TLCOLNIN DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOBCDQ EQU   X'53'               PASSIVE KEY (NAME BREAKDOWN)                 
TLCOBNAM DS    CL26                NAME BREAKDOWN                               
TLCOBSTA DS    XL1                 STATUS                                       
TLCOBSID EQU   X'80'               IS THE COMMERCIAL ID                         
TLCOBCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOTCDQ EQU   X'56'               PASSIVE KEY (MUSIC TRACK)                    
TLCOTMCO DS    XL4                 TYPE M INTERNAL COMMERCIAL NUMBER            
TLCOTTRK DS    CL1                 TRACK                                        
TLCOTCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCOTVER DS    XL1                 VERSION NUMBER                               
         DS    CL21                                                             
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOWCDQ EQU   X'57'               PASSIVE KEY (WEB RECORD ID)                  
         DS    XL1                                                              
TLCOWWID DS    CL12                WEB APPLICATION RECORD ID                    
TLCOWCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL14                                                             
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOOCDQ EQU   X'5A'               PASSIVE KEY (MUSIC W/O AGENCY)               
TLCOOMUS DS    CL8                 MUSIC                                        
TLCOOCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLCOOVER DS    XL1                 VERSION NUMBER                               
         DS    CL18                                                             
                                                                                
***********************************************************************         
                                                                                
         ORG   TLCOPCD+1                                                        
TLCOECDQ EQU   X'5D'               PASSIVE KEY (ACTIVE SINCE 1/1/2007)          
         DS    CL25                                                             
TLCOECOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL2                                                              
         EJECT                                                                  
***********************************************************************         
*        <   > COMMERCIAL GROUP RECORD                                *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLOGD    DSECT                                                                  
TLOGKEY  DS    0CL32                                                            
TLOGCD   DS    XL1                                                              
TLOGCDQ  EQU   X'EC'               ACTIVE KEY                                   
TLOGAGY  DS    CL6                 AGENCY                                       
TLOGCLI  DS    CL6                 CLIENT                                       
TLOGPRD  DS    CL6                 PRODUCT                                      
TLOGCOG  DS    CL6                 COMMERCIAL GROUP                             
         DS    CL7                                                              
                                                                                
TLOGLEN  DS    XL2                                                              
TLOGSTAT DS    XL2                                                              
         DS    CL4                                                              
TLOGELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        COMMERCIAL GROUP RECORD PASSIVE KEYS                         *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLOGPD   DSECT                                                                  
TLOGPKEY DS    0CL32                                                            
TLOGPCD  DS    CL1                                                              
TLOGNCDQ EQU   X'ED'               PASSIVE KEY (NAME)                           
         DS    CL5                                                              
TLOGNAGY DS    CL6                 AGENCY                                       
TLOGNAME DS    CL16                NAME                                         
TLOGNSEQ DS    XL4                 SEQUENCE NUMBER                              
         EJECT                                                                  
***********************************************************************         
*        <   > CONTRACT RECORD                                        *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLCND    DSECT                                                                  
TLCNKEY  DS    0CL32                                                            
TLCNCD   DS    XL1                                                              
TLCNCDQ  EQU   X'CC'               ACTIVE KEY                                   
         DS    CL1                                                              
TLCNAGY  DS    CL6                 AGENCY                                       
         DS    CL3                                                              
TLCNCNID DS    CL12                CONTRACT ID                                  
         DS    CL3                                                              
TLCNTRMS DS    XL3                 TERM START DATE                              
TLCNTRME DS    XL3                 TERM END DATE                                
                                                                                
TLCNLEN  DS    XL2                                                              
TLCNSTAT DS    XL2                                                              
         DS    CL4                                                              
TLCNELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        CONTRACT RECORD PASSIVE KEYS                                 *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLCNPD   DSECT                                                                  
TLCNPKEY DS    0CL32                                                            
TLCNPCD  DS    CL1                                                              
TLCNPCDQ EQU   X'CD'               PASSIVE KEY (ASSIGNED TO)                    
TLCNPCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL1                                                              
TLCNPAGY DS    CL6                 AGENCY                                       
TLCNPCND DS    CL12                CONTRACT ID                                  
TLCNPTRS DS    XL3                 TERM START DATE                              
TLCNPTRE DS    XL3                 TERM END DATE                                
         DS    CL1                                                              
TLCNPVER DS    XL1                 VERSION NUMBER                               
         EJECT                                                                  
***********************************************************************         
*        <   > CONTROL RECORD                                         *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLCTD    DSECT                                                                  
TLCTKEY  DS    0CL32                                                            
TLCTCD   DS    XL1                                                              
TLCTCDQ  EQU   X'3C'               ACTIVE KEY                                   
         DS    CL7                                                              
TLCTAGY  DS    CL6                 AGENCY                                       
         DS    CL2                                                              
TLCTCLI  DS    CL6                 CLIENT (OR BINARY ZEROS)                     
         DS    CL2                                                              
TLCTPRD  DS    CL6                 PRODUCT (OR BINARY ZEROS)                    
         DS    CL2                                                              
                                                                                
TLCTLEN  DS    XL2                                                              
TLCTSTAT DS    XL2                                                              
         DS    CL4                                                              
TLCTELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > ADVICE CAST RECORDS (FOR COMPLETION ADVICES)           *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLDCD    DSECT                                                                  
TLDCKEY  DS    0CL32                                                            
TLDCCD   DS    XL1                                                              
TLDCCDQ  EQU   X'DC'               ACTIVE KEY                                   
         DS    CL1                                                              
TLDCAGY  DS    CL6                 AGENCY                                       
         DS    CL2                                                              
TLDCCID  DS    CL12                COMMERCIAL ID                                
         DS    CL1                                                              
TLDCADV  DS    CL6                 ADVICE NUMBER                                
         DS    CL1                                                              
TLDCSEQ  DS    XL1                 SEQUENCE NUMBER                              
         DS    CL1                                                              
                                                                                
TLDCLEN  DS    XL2                                                              
TLDCSTAT DS    XL2                                                              
         DS    CL4                                                              
TLDCELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > DEAL RECORD                                            *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLDLD    DSECT                                                                  
TLDLKEY  DS    0CL32                                                            
TLDLCD   DS    XL1                                                              
TLDLCDQ  EQU   X'2C'               ACTIVE KEY                                   
         DS    CL15                                                             
TLDLAGY  DS    CL6                 AGENCY                                       
         DS    CL2                                                              
TLDLCLI  DS    CL6                 CLIENT (OR BINARY ZEROS)                     
         DS    CL2                                                              
                                                                                
TLDLLEN  DS    XL2                                                              
TLDLSTAT DS    XL2                                                              
         DS    CL4                                                              
TLDLELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > DUE COMPANY TRACKING MANUAL ADJUSTMENT RECORD          *         
***********************************************************************         
*##FILENAME CHKFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLDTD    DSECT                                                                  
TLDTKEY  DS    0CL32                                                            
TLDTCD   DS    XL1                                                              
TLDTCDQ  EQU   X'78'               ACTIVE KEY                                   
         DS    CL9                                                              
TLDTSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLDTDUC  DS    CL6                 DUE COMPANY CODE                             
TLDTDTE  DS    XL3                 DATE (PWOS - COMPLEMENTED)                   
TLDTSEQ  DS    XL4                 SEQ NUMBER (COMPLEMENTED)                    
                                                                                
TLDTLEN  DS    XL2                                                              
TLDTSTAT DS    XL2                                                              
         DS    CL4                                                              
TLDTELEM DS    0C                  1ST ELEMENT                                  
                                                                                
*        NOTE - TLCKDCDQ POINTERS ARE CREATED FROM THESE RECORDS                
         EJECT                                                                  
***********************************************************************         
*        <   > DUE COMPANY RECORD                                     *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLDUD    DSECT                                                                  
TLDUKEY  DS    0CL32                                                            
TLDUCD   DS    XL1                                                              
TLDUCDQ  EQU   X'70'               ACTIVE KEY                                   
         DS    CL7                                                              
TLDUSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL2                                                              
TLDUDUC  DS    CL6                 DUE COMPANY CODE                             
         DS    CL7                                                              
                                                                                
TLDULEN  DS    XL2                                                              
TLDUSTAT DS    XL2                                                              
TLDUSPND EQU   X'40'               PRINT PENDING                                
         DS    CL4                                                              
TLDUELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        DUE COMPANY RECORD PASSIVE KEYS                              *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLDUPD   DSECT                                                                  
TLDUPKEY DS    0CL32                                                            
TLDUPCD  DS    CL1                                                              
TLDUPCDQ EQU   X'71'               PASSIVE KEY (DUE COMPANY TYPE)               
         DS    CL7                                                              
TLDUPSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLDUPTYP DS    XL1                                                              
TLDUPCMP EQU   X'01'               TYPE DUE COMPANY                             
TLDUPAGY EQU   X'02'               OR AGENCY ERROR                              
         DS    CL1                                                              
TLDUPDUC DS    CL6                 DUE COMPANY CODE                             
         DS    CL7                                                              
                                                                                
         DS    XL2                                                              
TLDUPST  DS    XL2                                                              
         EJECT                                                                  
***********************************************************************         
*        <   > ADVICE RECORD                                          *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLDVD    DSECT                                                                  
TLDVKEY  DS    0CL32                                                            
TLDVCD   DS    XL1                                                              
TLDVCDQ  EQU   X'D0'               ACTIVE KEY                                   
         DS    CL1                                                              
                                                                                
         ORG   TLDVCD                                                           
TLPVCD   DS    XL1                                                              
TLPVCDQ  EQU   X'24'                                                            
TLPVSCD  DS    XL1                                                              
TLPVSCDQ EQU   X'09'                                                            
                                                                                
TLDVAGY  DS    CL6                 AGENCY                                       
         DS    CL2                                                              
TLDVCID  DS    CL12                COMMERCIAL ID                                
         DS    CL1                                                              
TLDVADV  DS    CL6                 ADVICE NUMBER                                
         DS    CL1                                                              
TLDVSEQ  DS    XL1                 SEQUENCE NUMBER                              
         DS    CL1                                                              
                                                                                
TLDVLEN  DS    XL2                                                              
TLDVSTAT DS    XL2                                                              
         DS    CL4                                                              
TLDVELEM DS    0C                  1ST ELEMENT                                  
*        NOTE - TLDCCDQ RECORDS ARE CREATED BASED ON THIS RECORD                
*               IF ADVICE IS A SESSION                                          
                                                                                
***********************************************************************         
*        ADVICE RECORD PASSIVE KEYS                                   *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLDVPD   DSECT                                                                  
TLDVPKEY DS    0CL32                                                            
TLDVPCD  DS    CL1                                                              
TLDVOCDQ EQU   X'D1'               PASSIVE KEY (OFFICE/SEND DATE)               
TLDVOOFF DS    CL1                 TALENT PARTNERS OFFICE                       
TLDVOAGY DS    CL6                 AGENCY                                       
         DS    CL1                                                              
TLDVODTE DS    XL3                 SEND DATE, ELSE PAID DATE,                   
*                                  ELSE BINARY ZEROES                           
         DS    CL1                                                              
TLDVOCID DS    CL12                COMMERCIAL ID                                
TLDVOADV DS    CL6                 ADVICE NUMBER                                
TLDVOSEQ DS    XL1                 SEQUENCE NUMBER                              
*                                                                               
TLDVOSTA DS    XL1                 DIRECTORY STATUS                             
TLDVOST2 DS    XL1                 ADVICE STATUS (SEE TADVSTAT)                 
                                                                                
***********************************************************************         
                                                                                
         ORG   TLDVPCD+1                                                        
TLDVEDDQ EQU   X'D2'               PASSIVE KEY (EARLIEST DUE DATE)              
TLDVEOFF DS    CL1                 TALENT PARTNERS OFFICE                       
TLDVEAGY DS    CL6                 AGENCY                                       
TLDVESTA DS    XL1                 STATUS                                       
TLDVEIND EQU   X'01'               INCOMPLETE WITH DUE DATE                     
TLDVECMD EQU   X'02'               COMPLETE WITH DUE DATE                       
TLDVEINW EQU   X'03'               INCOMPLETE WITHOUT DUE DATE                  
TLDVECMW EQU   X'04'               COMPLETE WITHOUT DUE DATE                    
TLDVEDUE DS    XL3                 EARLIEST DUE DATE, ELSE X'FF'S               
TLDVECID DS    CL12                COMMERCIAL ID                                
TLDVEADV DS    CL6                 ADVICE NUMBER                                
TLDVESEQ DS    XL1                 SEQUENCE NUMBER                              
         DS    XL1                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLDVPCD+1                                                        
TLDVRDDQ EQU   X'D3'               PASSIVE KEY (REGULAR DUE DATE)               
TLDVROFF DS    CL1                 TALENT PARTNERS OFFICE                       
TLDVRAGY DS    CL6                 AGENCY                                       
TLDVRSTA DS    XL1                 STATUS                                       
TLDVRDUE DS    XL3                 REGULAR DUE DATE, ELSE X'FF'S                
TLDVRCID DS    CL12                COMMERCIAL ID                                
TLDVRADV DS    CL6                 ADVICE NUMBER                                
TLDVRSEQ DS    XL1                 SEQUENCE NUMBER                              
         DS    XL1                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLDVPCD+1                                                        
TLDVMDDQ EQU   X'D6'               PASSIVE KEY (MUSIC DUE DATE)                 
TLDVMOFF DS    CL1                 TALENT PARTNERS OFFICE                       
TLDVMAGY DS    CL6                 AGENCY                                       
TLDVMSTA DS    XL1                 STATUS                                       
TLDVMDUE DS    XL3                 MUSIC DUE DATE, ELSE X'FF'S                  
TLDVMCID DS    CL12                COMMERCIAL ID                                
TLDVMADV DS    CL6                 ADVICE NUMBER                                
TLDVMSEQ DS    XL1                 SEQUENCE NUMBER                              
         DS    XL1                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLDVPCD+1                                                        
TLDVCCDQ EQU   X'D7'               PASSIVE KEY (CLIENT)                         
TLDVCAGY DS    CL6                 AGENCY                                       
TLDVCCLI DS    CL6                 CLIENT                                       
TLDVCCID DS    CL12                COMMERCIAL ID                                
TLDVCADV DS    CL6                 ADVICE NUMBER                                
TLDVCSEQ DS    XL1                 SEQUENCE NUMBER                              
         EJECT                                                                  
***********************************************************************         
*        <   > ECAST RECORD                                           *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLECD    DSECT                                                                  
TLECKEY  DS    0CL32                                                            
TLECCD   DS    XL1                                                              
TLECCDQ  EQU   X'68'               ACTIVE KEY                                   
TLECCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLECEPI  DS    CL5                 EPISODE NUMBER (COMPLEMENTED)                
         DS    CL1                 SPARE                                        
TLECSORT DS    XL1                 SORT CODE FROM CATEGORY TABLE                
         DS    CL2                 SPARE                                        
TLECSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLECCAT  DS    CL3                 CATEGORY                                     
TLECINV  DS    XL6                 INVOICE NUMBER                               
                                                                                
TLECLEN  DS    XL2                                                              
TLECSTAT DS    XL2                                                              
TLECSBAL EQU   X'40'               CREDIT BALANCE                               
         DS    CL4                                                              
TLECELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        ECAST RECORD PASSIVE KEYS                                    *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLECPD   DSECT                                                                  
TLECPKEY DS    0CL32                                                            
TLECPCD  DS    CL1                                                              
TLECCCDQ EQU   X'69'               PASSIVE KEY (SSN)                            
TLECCSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
TLECCEPI DS    CL5                 EPISODE NUMBER (COMPLEMENTED)                
TLECCCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL4                 SPARE                                        
TLECCCAT DS    CL3                 CATEGORY                                     
TLECCINV DS    XL6                 INVOICE NUMBER                               
         EJECT                                                                  
***********************************************************************         
*        <   > EDIT TYPE RECORD                                       *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLEDD    DSECT                                                                  
TLEDKEY  DS    0CL32                                                            
TLEDCD   DS    XL1                                                              
TLEDCDQ  EQU   X'24'               ACTIVE KEY                                   
         DS    CL16                                                             
TLEDAGY  DS    CL6                 AGENCY                                       
TLEDYEAR DS    XL1                 YEAR (COMPLEMENTED)                          
TLEDEDT  DS    CL6                 EDIT TYPE                                    
         DS    CL2                                                              
                                                                                
TLEDLEN  DS    XL2                                                              
TLEDSTAT DS    XL2                                                              
         DS    CL4                                                              
TLEDELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > EMPLOYER RECORD                                        *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLEMD    DSECT                                                                  
TLEMKEY  DS    0CL32                                                            
TLEMCD   DS    XL1                                                              
TLEMCDQ  EQU   X'58'               ACTIVE KEY                                   
         DS    CL26                                                             
TLEMEMP  DS    CL3                 EMPLOYER                                     
         DS    CL2                                                              
                                                                                
TLEMLEN  DS    XL2                                                              
TLEMSTAT DS    XL2                                                              
         DS    CL4                                                              
TLEMELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > EPISODE RECORD                                         *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLEPD    DSECT                                                                  
TLEPKEY  DS    0CL32                                                            
TLEPCD   DS    XL1                                                              
TLEPCDQ  EQU   X'64'               ACTIVE KEY                                   
         DS    CL18                SPARE                                        
TLEPAGY  DS    CL6                 AGENCY                                       
TLEPEPI  DS    CL5                 EPISODE NUMBER (COMPLEMENTED)                
         DS    CL2                 SPARE                                        
                                                                                
TLEPLEN  DS    XL2                                                              
TLEPSTAT DS    XL2                                                              
         DS    CL4                                                              
TLEPELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > ESTIMATE RECORD                                        *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLESD    DSECT                                                                  
TLESKEY  DS    0CL32                                                            
TLESCD   DS    XL1                                                              
TLESCDQ  EQU   X'E0'               ACTIVE KEY                                   
         DS    CL4                                                              
TLESAGY  DS    CL6                 AGENCY                                       
TLESEST  DS    CL20                ESTIMATE NUMBER                              
TLESSEQ  DS    XL1                 SEQUENCE NUMBER                              
                                                                                
TLESLEN  DS    XL2                                                              
TLESSTAT DS    XL2                                                              
         DS    CL4                                                              
TLESELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > EMPLOYER TAX RECORD                                    *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLEXD    DSECT                                                                  
TLEXKEY  DS    0CL32                                                            
TLEXCD   DS    XL1                                                              
TLEXCDQ  EQU   X'5C'               ACTIVE KEY                                   
         DS    CL26                                                             
TLEXEMP  DS    CL3                 EMPLOYER                                     
         DS    CL2                                                              
                                                                                
TLEXLEN  DS    XL2                                                              
TLEXSTAT DS    XL2                                                              
         DS    CL4                                                              
TLEXELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > ECAST TRACKING RECORD                                  *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLETD    DSECT                                                                  
TLETKEY  DS    0CL32                                                            
TLETCD   DS    XL1                                                              
TLETCDQ  EQU   X'BC'               ACTIVE KEY                                   
         DS    CL2                                                              
TLETSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLETCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLETCAT  DS    CL3                 CATEGORY                                     
TLETEPI  DS    CL5                 EPISODE NUMBER  (COMPLEMENTED)               
TLETTRK  DS    XL2                 TRACKING NUMBER (COMPLEMENTED)               
TLETINV  DS    XL6                 INVOICE NUMBER                               
                                                                                
TLETLEN  DS    XL2                                                              
TLETSTAT DS    XL2                                                              
         DS    CL4                                                              
TLETELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > FIXED CYCLE TRACKING RECORD                            *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLFTD    DSECT                                                                  
TLFTKEY  DS    0CL32                                                            
TLFTCD   DS    XL1                                                              
TLFTCDQ  EQU   X'AC'               ACTIVE KEY                                   
         DS    CL2                                                              
TLFTSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLFTCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLFTCAST DS    XL2                 CAST INPUT SEQUENCE NUMBER                   
TLFTSTRT DS    XL3                 START DATE      (COMPLEMENTED)               
TLFTEND  DS    XL3                 END DATE        (COMPLEMENTED)               
TLFTTRK  DS    XL2                 TRACKING NUMBER (COMPLEMENTED)               
TLFTINV  DS    XL6                 INVOICE NUMBER                               
                                                                                
TLFTLEN  DS    XL2                                                              
TLFTSTAT DS    XL2                                                              
         DS    CL4                                                              
TLFTELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > GUARANTEE CONTRACT RECORD                              *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLGCD    DSECT                                                                  
TLGCKEY  DS    0CL32                                                            
TLGCCD   DS    XL1                                                              
TLGCCDQ  EQU   X'84'               ACTIVE KEY                                   
TLGCSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLGCGCNT DS    XL4                 GRT CONTRACT CODE (COMPLEMENTED)             
         DS    XL18                                                             
                                                                                
TLGCLEN  DS    XL2                                                              
TLGCSTAT DS    XL2                                                              
         DS    CL4                                                              
TLGCELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > GENERAL LIST RECORD                                    *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLGLD    DSECT                                                                  
TLGLKEY  DS    0CL32                                                            
TLGLCD   DS    XL1                                                              
TLGLCDQ  EQU   X'F4'               ACTIVE KEY                                   
         DS    CL20                                                             
TLGLTYPE DS    CL1                 LIST TYPE                                    
TLGLTYPF EQU   C'F'                          F=FILTER                           
         DS    CL1                                                              
TLGLLST  DS    CL8                 LIST CODE                                    
         DS    CL1                                                              
                                                                                
TLGLLEN  DS    XL2                                                              
TLGLSTAT DS    XL2                                                              
         DS    CL4                                                              
TLGLELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        GENERAL LIST RECORD PASSIVE KEYS                             *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLGLPD   DS    0CL32                                                            
TLGLPCD  DS    CL1                                                              
TLGLNCDQ EQU   X'F9'               PASSIVE KEY (NAME)                           
TLGLNTYP DS    CL1                 LIST TYPE                                    
TLGLNNAM DS    CL22                NAME                                         
TLGLNCOD DS    CL8                 CODE                                         
         EJECT                                                                  
***********************************************************************         
*        <   > GUARANTEE TRACKING RECORD                              *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLGTD    DSECT                                                                  
TLGTKEY  DS    0CL32                                                            
TLGTCD   DS    XL1                                                              
TLGTCDQ  EQU   X'A8'               ACTIVE KEY                                   
         DS    CL1                                                              
TLGTSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL3                                                              
TLGTGUA  DS    CL4                 GUARANTEE CODE                               
         DS    CL2                                                              
TLGTSTRT DS    XL3                 START DATE COMPLEMENTED (OPTIONAL)           
TLGTEND  DS    XL3                 END DATE COMPLEMENTED   (OPTIONAL)           
         DS    CL2                                                              
TLGTTRK  DS    XL2                 GUARANTEE TRACKING NUMBER (COMPL)            
         DS    CL2                                                              
                                                                                
TLGTLEN  DS    XL2                                                              
TLGTSTAT DS    XL2                                                              
         DS    CL4                                                              
TLGTELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > GUARANTEE RECORD                                       *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLGUD    DSECT                                                                  
TLGUKEY  DS    0CL32                                                            
TLGUCD   DS    XL1                                                              
TLGUCDQ  EQU   X'6C'               ACTIVE KEY                                   
         DS    CL14                                                             
TLGUSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL2                                                              
TLGUGUA  DS    CL4                 GUARANTEE CODE  (COMPLEMENTED)               
         DS    CL2                                                              
                                                                                
TLGULEN  DS    XL2                                                              
TLGUSTAT DS    XL2                                                              
         DS    CL4                                                              
TLGUELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > HISTORY COMMENT RECORD                                 *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLHCD    DSECT                                                                  
TLHCKEY  DS    0CL32                                                            
TLHCCD   DS    XL1                                                              
TLHCCDQ  EQU   X'9C'               ACTIVE KEY                                   
TLHCSPR1 DS    CL15                                                             
TLHCCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLHCSPR2 DS    CL2                                                              
TLHCINV  DS    XL6                 INVOICE NUMBER (COMPLEMENTED)                
TLHCSPR3 DS    CL1                                                              
TLHCSEQ  DS    XL1                 COMMENT SEQUENCE (COMPLEMENTED)              
TLHCSPR4 DS    CL2                                                              
                                                                                
TLHCLEN  DS    XL2                                                              
TLHCSTAT DS    XL2                                                              
         DS    CL4                                                              
TLHCELEM DS    0C                  1ST ELEMENT                                  
                                                                                
*        NOTE - TLINHCDQ POINTERS ARE CREATED FROM THESE RECORDS                
         EJECT                                                                  
***********************************************************************         
*        <   > INTERFACE RECORD                                       *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLIFD    DSECT                                                                  
TLIFKEY  DS    0CL32                                                            
TLIFCD   DS    XL1                                                              
TLIFCDQ  EQU   X'54'               ACTIVE KEY                                   
         DS    CL17                                                             
TLIFAGY  DS    CL6                 AGENCY                                       
TLIFCLI  DS    CL6                 CLIENT (OR BINARY ZEROS)                     
         ORG   TLIFCLI                                                          
TLIFPCLI DS    CL6                 PRODUCTION CLIENT (OR BINARY ZEROES)         
         DS    CL2                                                              
                                                                                
TLIFLEN  DS    XL2                                                              
TLIFSTAT DS    XL2                                                              
         DS    CL4                                                              
TLIFELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > JOB RECORD                                             *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLJBD    DSECT                                                                  
TLJBKEY  DS    0CL32                                                            
TLJBCD   DS    XL1                                                              
TLJBCDQ  EQU   X'14'               ACTIVE KEY                                   
TLJBAGY  DS    CL6                 AGENCY                                       
TLJBDTE  DS    XL3                 DATE VALID (PWOS - COMPLEMENTED)             
*                                                                               
TLJBCLI  DS    CL6                 CLIENT                                       
TLJBPRD  DS    CL6                 PRODUCT                                      
         DS    CL9                                                              
*                                                                               
         ORG   TLJBAGY                                                          
TLJBSPCL DS    XL1                 SPECIAL JOBS FOR JWT                         
TLJBSPJW EQU   X'FA'                                                            
TLJBPRJI DS    CL7                 PROJECT ID                                   
TLJBDATE DS    XL3                 DATE VALID (PWOS - COMPLEMENTED)             
TLJBBUNT DS    CL5                 BUSINESS UNIT                                
TLJBCSTI DS    CL6                 CUSTOMER ID                                  
TLJBPRDI DS    CL3                 PRODUCT                                      
         DS    CL5                                                              
*                                                                               
TLJBSEQ  DS    XL1                 SEQUENCE NUMBER                              
                                                                                
TLJBLEN  DS    XL2                                                              
TLJBSTAT DS    XL2                                                              
         DS    CL4                                                              
TLJBELEM DS    0C                  1ST ELEMENT                                  
*                                                                               
         ORG   TLJBPRJI                                                         
TLJBSPBD EQU   X'FB'               SPECIAL JOBS FOR BBDO                        
TLJBPROJ DS    CL16                PROJECT ID                                   
TLJBDAT  DS    XL3                 DATE VALID (PWOS - COMPLEMENTED)             
         DS    CL19                                                             
         EJECT                                                                  
***********************************************************************         
*        <   > INVOICE RECORD                                         *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLIND    DSECT                                                                  
TLINKEY  DS    0CL32                                                            
TLINCD   DS    XL1                                                              
TLINCDQ  EQU   X'90'               ACTIVE KEY (INVOICE ACCESS)                  
         DS    CL13                                                             
TLINAGY  DS    CL6                 AGENCY                                       
         DS    CL2                                                              
TLININV  DS    XL6                 INVOICE NUMBER (COMPLEMENTED)                
         DS    CL4                                                              
                                                                                
TLINLEN  DS    XL2                                                              
TLINSTAT DS    XL2                                                              
TLINSDEL EQU   X'01'               DELETED                                      
         DS    CL4                                                              
TLINELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        INVOICE RECORD PASSIVE KEYS                                  *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLINPD   DSECT                                                                  
TLINPKEY DS    0CL32                                                            
TLINPCD  DS    CL1                                                              
TLINHCDQ EQU   X'91'               PASSIVE KEY (PAYMENT HISTORY)                
         DS    CL15                                                             
TLINHCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL2                                                              
TLINHINV DS    XL6                 INVOICE NUMBER (COMPLEMENTED)                
         DS    CL1                                                              
TLINHSEQ DS    XL1                 SEQUENCE (COMPLEMENTED)                      
*                                  FOR INVOICES, WILL BE 255 DOWN               
*                                  FOR HISTORY COMMENTS, 128 DOWN               
         DS    CL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLINPCD+1                                                        
TLINBCDQ EQU   X'92'               PASSIVE (STATUS/BILLING OPEN ITEMS)          
         DS    CL15                                                             
TLINBAGY DS    CL6                 AGENCY                                       
         DS    CL2                                                              
TLINBINV DS    XL6                 INVOICE NUMBER (COMPLEMENTED)                
         DS    CL2                                                              
*                                                                               
TLINBSTA DS    XL1                 DIRECTORY STATUS                             
TLINBST2 DS    XL1                 INVOICE STATUS (TAINSTAT)                    
                                                                                
***********************************************************************         
                                                                                
         ORG   TLINPCD+1                                                        
TLINCCDQ EQU   X'93'               PASSIVE KEY (CHECKS OPEN ITEMS)              
         DS    CL15                                                             
TLINCDUE DS    XL3                 DUE DATE (PWOS)                              
*                                  X'000004' = PAYROLL ADJUSTMENT               
*                                  X'000008' = URGENT                           
TLINCSRT DS    XL1                 SORT BYTE                                    
*                                  X'02'=GUARANTEES                             
*                                  X'08'=ALL OTHERS                             
TLINCAGY DS    CL6                 AGENCY                                       
TLINCINV DS    XL6                 INVOICE                                      
                                                                                
***********************************************************************         
                                                                                
         ORG   TLINPCD+1                                                        
TLINDCDQ EQU   X'95'               PASSIVE KEY (BILL DATE SEQUENCE)             
TLINDDTE DS    XL3                 BILL DATE (PWOS)                             
TLINDAGY DS    CL6                 AGENCY                                       
TLINDINV DS    XL6                 INVOICE NUMBER                               
TLINDCUR DS    CL1                 CURRENCY                                     
TLINDEMP DS    CL3                 EMPLOYER                                     
TLINDOFF DS    CL1                 TP OFFICE                                    
TLINDCLI DS    CL6                 CLIENT                                       
TLINDADJ DS    XL3                 ADJUSTMENT INVOICE NUMBER+2(3)               
         DS    CL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLINPCD+1                                                        
TLINKCDQ EQU   X'96'               PASSIVE KEY (CHECK DATE SEQUENCE)            
TLINKDTE DS    XL3                 CHECK DATE (PWOS)                            
TLINKAGY DS    CL6                 AGENCY                                       
TLINKINV DS    XL6                 INVOICE NUMBER                               
TLINKCUR DS    CL1                 CURRENCY                                     
TLINKEMP DS    CL3                 EMPLOYER                                     
TLINKOFF DS    CL1                 TP OFFICE                                    
TLINKCLI DS    CL6                 CLIENT                                       
TLINKADJ DS    XL3                 ADJUSTMENT INVOICE NUMBER+2(3)               
         DS    CL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLINPCD+1                                                        
TLINPCDQ EQU   X'97'               PASSIVE KEY (PAY DATE SEQUENCE)              
TLINPDTE DS    XL3                 PAY DATE (PWOS)                              
TLINPAGY DS    CL6                 AGENCY                                       
TLINPINV DS    XL6                 INVOICE NUMBER                               
TLINPCUR DS    CL1                 CURRENCY                                     
TLINPEMP DS    CL3                 EMPLOYER                                     
TLINPOFF DS    CL1                 TP OFFICE                                    
TLINPCLI DS    CL6                 CLIENT                                       
TLINPADJ DS    XL3                 ADJUSTMENT INVOICE NUMBER+2(3)               
         DS    CL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLINPCD+1                                                        
TLINWCDQ EQU   X'9A'               PASSIVE KEY (WEB APPLICATION ID)             
TLINWWID DS    CL18                WEB APPLICATION ID                           
         DS    CL1                                                              
TLINWAGY DS    CL6                 AGENCY                                       
TLINWINV DS    CL6                 INVOICE NUMBER                               
                                                                                
***********************************************************************         
                                                                                
         ORG   TLINPCD+1                                                        
TLINOCDQ EQU   X'9B'               PASSIVE KEY (BOVER)                          
TLINOAGY DS    CL6                 AGENCY                                       
TLINOINV DS    CL6                 INVOICE NUMBER                               
         DS    XL19                                                             
                                                                                
***********************************************************************         
                                                                                
         ORG   TLINPCD+1                                                        
TLINECDQ EQU   X'9D'               PASSIVE KEY (ETIME)                          
TLINECOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLINETPS DS    XL3                 PAY PERIOD START DATE (COMPLEMENTED)         
TLINEAGY DS    CL6                 AGENCY                                       
TLINEINV DS    CL6                 INVOICE NUMBER (COMPLEMENTED)                
TLINESTA DS    XL1                 STATUS                                       
TLINESCR EQU   X'80'               CREDIT INVOICE                               
         DS    XL11                                                             
                                                                                
***********************************************************************         
                                                                                
         ORG   TLINPCD+1                                                        
TLINRCDQ EQU   X'9E'               PASSIVE KEY(RETRO INVOICE)                   
TLINRAGY DS    CL6                 AGENCY                                       
TLINROIN DS    XL6                 ORIGINAL INVOICE                             
TLINRRIN DS    XL6                 RETRO INVOICE                                
         DS    XL13                                                             
                                                                                
***********************************************************************         
                                                                                
TLRID    DSECT                                                                  
TLRIKEY  DS    0CL32                                                            
TLRICD   DS    XL1                                                              
TLRICDQ  EQU   X'24'                                                            
TLRISCD  DS    XL1                                                              
TLRISCDQ EQU   X'81'               PASSIVE KEY                                  
TLRIAGY  DS    CL6                 AGENCY                                       
TLRIINV  DS    CL6                 INVOICE NUMBER                               
         DS    CL18                                                             
*                                                                               
TLRISTAT DS    XL2                 DIRECTORY STATUS                             
TLRIDA   DS    XL4                 DISK ADDRESS                                 
         EJECT                                                                  
***********************************************************************         
*        <   > LIEN RECORD                                            *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLLND    DSECT                                                                  
TLLNKEY  DS    0CL32                                                            
TLLNCD   DS    XL1                                                              
TLLNCDQ  EQU   X'74'               ACTIVE KEY                                   
         DS    CL12                                                             
TLLNSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL2                                                              
TLLNLIN  DS    CL6                 LIEN CODE                                    
         DS    CL2                                                              
                                                                                
TLLNLEN  DS    XL2                                                              
TLLNSTAT DS    XL2                                                              
         DS    CL4                                                              
TLLNELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        LIEN RECORD PASSIVE KEYS                                     *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLLNPD   DSECT                                                                  
TLLNPKEY DS    0CL32                                                            
TLLNPCD  DS    CL1                                                              
TLLNRCDQ EQU   X'75'               PASSIVE KEY (RANK)                           
         DS    CL9                                                              
TLLNRSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL2                                                              
TLLNRRNK DS    CL1                 RANK - CORRESPONDS TO TYPE                   
         DS    CL2                                                              
TLLNRLIN DS    CL6                 LIEN CODE                                    
         DS    CL2                                                              
         EJECT                                                                  
***********************************************************************         
*        <   > LOCAL RECORD                                           *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLLOD    DSECT                                                                  
TLLOKEY  DS    0CL32                                                            
TLLOCD   DS    XL1                                                              
TLLOCDQ  EQU   X'B0'               ACTIVE KEY                                   
         DS    CL22                                                             
TLLOUN   DS    CL3                 UNION                                        
         DS    CL1                                                              
TLLOLCL  DS    CL3                 LOCAL                                        
         DS    CL2                                                              
                                                                                
TLLOLEN  DS    XL2                                                              
TLLOSTAT DS    XL2                                                              
         DS    CL4                                                              
TLLOELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > CNET/CSYS/MARKET RECORD                                *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLMTD    DSECT                                                                  
TLMTKEY  DS    0CL32                                                            
TLMTCD   DS    XL1                                                              
TLMTCDQ  EQU   X'E4'               ACTIVE KEY                                   
         DS    CL6                                                              
TLMTTYPE DS    CL1                 MEDIA                                        
TLMTCODE DS    CL6                 CNET/CSYS/MARKET CODE                        
TLMTINUM DS    XL4                 INTERNAL CNET/CSYS/MARKET NUMBER             
         DS    CL14                                                             
TLMTLEN  DS    XL2                                                              
TLMTSTAT DS    XL2                                                              
         DS    CL4                                                              
TLMTELEM DS    0C                  1ST ELEMENT                                  
                                                                                
TLMTPD   DSECT                                                                  
TLMTPKEY DS    0CL32                                                            
TLMTPCD  DS    CL1                                                              
TLMTNMDQ EQU   X'E5'               PASSIVE KEY (NAME)                           
TLMTNMTY DS    CL1                 MEDIA                                        
TLMTNMNM DS    CL24                NAME                                         
TLMTNMCD DS    CL6                 CNET/CSYS/MARKET CODE                        
                                                                                
***********************************************************************         
*        CNET/CSYS/MARKET RECORD PASSIVE KEYS                         *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
         ORG   TLMTPCD+1                                                        
TLMTALDQ EQU   X'E6'               PASSIVE KEY (ALPHA CODE)                     
         DS    CL6                 FOR TMKTS ONLY                               
TLMTALAL DS    CL4                 ALPHA CODE                                   
         DS    CL2                                                              
TLMTALIN DS    XL4                 INTERNAL CNET/CSYS/MARKET NUMBER             
         DS    CL15                                                             
                                                                                
***********************************************************************         
                                                                                
         ORG   TLMTPCD+1                                                        
TLMTICDQ EQU   X'E7'               PASSIVE KEY (INTERNAL CODE)                  
         DS    CL6                                                              
TLMTICIC DS    XL4                 INTERNAL CNET/CSYS/MARKET NUMBER             
TLMTICCD DS    CL6                 CNET/CSYS/RMKT CODE OR TMKT ALPHA            
         DS    CL15                                                             
         EJECT                                                                  
***********************************************************************         
*        <   > MEDIA RECORD                                           *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLMDD    DSECT                                                                  
TLMDKEY  DS    0CL32                                                            
TLMDCD   DS    XL1                                                              
TLMDCDQ  EQU   X'44'               ACTIVE KEY                                   
TLMDTYPE DS    XL1                 MEDIA                                        
TLMDCODE DS    CL4                 CODE                                         
         DS    CL26                                                             
                                                                                
TLMDLEN  DS    XL2                                                              
TLMDSTAT DS    XL2                                                              
         DS    CL4                                                              
TLMDELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > MUSIC RECORD                                           *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLMUD    DSECT                                                                  
TLMUKEY  DS    0CL32                                                            
TLMUCD   DS    XL1                                                              
TLMUCDQ  EQU   X'4C'               ACTIVE KEY                                   
         DS    CL14                                                             
TLMUAGY  DS    CL6                 AGENCY (BLANK IF NEW STYLE)                  
         DS    CL1                                                              
TLMUMUS  DS    CL8                 MUSIC NUMBER                                 
         DS    CL2                                                              
                                                                                
TLMULEN  DS    XL2                                                              
TLMUSTAT DS    XL2                                                              
         DS    CL4                                                              
TLMUELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        MUSIC RECORD PASSIVE KEYS                                    *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLMUPD   DSECT                                                                  
TLMUPKEY DS    0CL32                                                            
TLMUPCD  DS    XL1                                                              
TLMUPCDQ EQU   X'59'               PASSIVE KEY (COMPOSITION NAME)               
TLMUPCMP DS    CL23                COMPOSITION NAME                             
TLMUPMUS DS    CL8                 MUSIC NUMBER                                 
         EJECT                                                                  
***********************************************************************         
*        <   > SPOT AND NETWORK TRANSFER RECORD                       *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLNXD    DSECT                                                                  
TLNXKEY  DS    0CL32                                                            
TLNXCD   DS    XL1                                                              
TLNXCDQ  EQU   X'D4'               ACTIVE KEY                                   
TLNXAGY  DS    CL6                 AGENCY                                       
TLNXNID  DS    CL8                 TRAFFIC COMMERCIAL ID                        
TLNXNCLI DS    CL3                 SPOT/NETWORK CLIENT                          
TLNXNPRD DS    CL3                 SPOT/NETWORK PRODUCT                         
TLNXMED  DS    CL1                 MEDIA CODE                                   
TLNXUSE  DS    CL3                 USE CODE                                     
TLNXDATE DS    XL3                 PWOS DATE ADDED (COMPLEMENTED)               
TLNXUID  DS    XL2                 USER ID NUMBER                               
TLNXCCDE DS    XL1                 CHG CODE (SEE TANXCCDE FOR EQUATES)          
TLNXSEQ  DS    XL1                 SEQUENCE NUMBER                              
                                                                                
TLNXLEN  DS    XL2                                                              
TLNXSTAT DS    XL2                                                              
TLNXSMAT EQU   X'01'               MATCHED                                      
TLNXSDEL EQU   X'02'               DELETED                                      
TLNXSUSD EQU   X'04'               USED                                         
TLNXADID EQU   X'08'               AD-ID                                        
TLNXPACK EQU   X'10'               PACKED                                       
         DS    CL4                                                              
TLNXELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        SPOT AND NETWORK TRANSFER RECORD PASSIVE KEYS                *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLNXPD   DSECT                                                                  
TLNXPKEY DS    0CL32                                                            
TLNXPCD  DS    CL1                                                              
TLNXNCDQ EQU   X'D5'               PASSIVE KEY (NAME)                           
TLNXNAGY DS    CL6                 AGENCY                                       
TLNXNAME DS    CL16                SHORT NAME                                   
TLNXNDTE DS    XL3                 PWOS DATE ADDED (COMPLEMENTED)               
         DS    XL2                 SPARE                                        
TLNXNSEQ DS    XL4                 SEQUENCE NUMBER                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLNXPCD+1                                                        
TLNXCCDQ EQU   X'D9'               PASSIVE KEY (12 CHARACTER ID)                
TLNXCAGY DS    CL6                 AGENCY                                       
TLNXCCID DS    CL12                12 CHARACTER NETWORK ID                      
TLNXCCLI DS    CL3                 SPOT/NETWORK CLIENT                          
TLNXCPRD DS    CL3                 SPOT/NETWORK PRODUCT                         
TLNXCMED DS    CL1                 MEDIA CODE                                   
TLNXCUSE DS    XL1                 USE EQUATE                                   
         DS    XL1                                                              
TLNXCDAD DS    XL4                 DISK ADDRESS                                 
         EJECT                                                                  
***********************************************************************         
*        <   > NR4 RECORD                                             *         
***********************************************************************         
*##FILENAME CHKFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLN4D    DSECT                                                                  
TLN4KEY  DS    0CL32                                                            
TLN4CD   DS    XL1                                                              
TLN4CDQ  EQU   X'24'                                                            
TLN4SCD  DS    XL1                                                              
TLN4SCDQ EQU   X'08'               ACTIVE KEY                                   
TLN4YEAR DS    CL4                 DISPLAYABLE YEAR (EBCDIC)                    
TLN4CUR  DS    CL1                 CURRENCY                                     
TLN4EMP  DS    CL3                 EMPLOYER                                     
TLN4SSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    XL13                                                             
                                                                                
TLN4LEN  DS    XL2                                                              
TLN4STAT DS    XL2                                                              
TLN4SPND EQU   X'40'               PRINT PENDING                                
         DS    CL4                                                              
TLN4ELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > OFFICE RECORD                                          *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLOFD    DSECT                                                                  
TLOFKEY  DS    0CL32                                                            
TLOFCD   DS    XL1                                                              
TLOFCDQ  EQU   X'0C'               ACTIVE KEY                                   
         DS    CL30                                                             
TLOFOFF  DS    CL1                 OFFICE                                       
                                                                                
TLOFLEN  DS    XL2                                                              
TLOFSTAT DS    XL2                                                              
         DS    CL4                                                              
TLOFELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > GUARANTEE CONTRACT TRACKING RECORD                     *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLOTD    DSECT                                                                  
TLOTKEY  DS    0CL32                                                            
TLOTCD   DS    XL1                                                              
TLOTCDQ  EQU   X'48'               ACTIVE KEY                                   
TLOTSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLOTGCNT DS    XL4                 GRT CONTRACT CODE (COMPELEMENTED)            
TLOTSTRT DS    XL3                 START DATE                                   
TLOTSEQ  DS    XL2                 SEQUENCE NUMBER (COMPLEMENTED)               
TLOTSTA  DS    XL1                 STATUS                                       
TLOTSBA0 EQU   X'80'               STARTING BALANCE WAS 0                       
TLOTSPHA EQU   X'40'               SUBJECT TO P&H WAS ADJUSTED                  
TLOTAGY  DS    CL6                 AGENCY                                       
TLOTINV  DS    XL6                 INVOICE NUMBER                               
TLOTLEN  DS    XL2                                                              
TLOTSTAT DS    XL2                                                              
         DS    CL4                                                              
TLOTELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > PAYMENT TYPE RECORD                                    *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLPMD    DSECT                                                                  
TLPMKEY  DS    0CL32                                                            
TLPMCD   DS    XL1                                                              
TLPMCDQ  EQU   X'24'                                                            
TLPMSCD  DS    XL1                                                              
TLPMSCDQ EQU   X'01'               ACTIVE KEY                                   
TLPMPTYP DS    CL6                 PAYMENT TYPE                                 
         DS    XL24                                                             
                                                                                
TLPMLEN  DS    XL2                                                              
TLPMSTAT DS    XL2                                                              
TLPMSUSD EQU   X'01'               USED ON TPROFILE OR EVTIME                   
         DS    CL4                                                              
TLPMELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        PAYMENT TYPE RECORD PASSIVE KEYS                             *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLPMPD   DSECT                                                                  
TLPMPKEY DS    0CL32                                                            
TLPMPCD  DS    CL1                                                              
TLPMNCDQ EQU   X'26'               PASSIVE KEY (NAME)                           
TLPMNAME DS    CL24                NAME                                         
TLPMNPTY DS    CL6                 PAYMENT TYPE                                 
TLPMNSCD DS    XL1                                                              
         EJECT                                                                  
***********************************************************************         
*        <   > PRODUCT RECORD                                         *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLPRD    DSECT                                                                  
TLPRKEY  DS    0CL32                                                            
TLPRCD   DS    XL1                                                              
TLPRCDQ  EQU   X'30'               ACTIVE KEY                                   
         DS    CL7                                                              
TLPRAGY  DS    CL6                 AGENCY (OR BINARY ZEROS)                     
         DS    CL2                                                              
TLPRCLI  DS    CL6                 CLIENT (OR BINARY ZEROS)                     
         DS    CL2                                                              
TLPRPRD  DS    CL6                 PRODUCT                                      
         DS    CL2                                                              
                                                                                
TLPRLEN  DS    XL2                                                              
TLPRSTAT DS    XL2                                                              
TLPRSBRD EQU   X'01'               BRAND PRODUCT                                
         DS    CL4                                                              
TLPRELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        PRODUCT RECORD PASSIVE KEYS                                  *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLPRPD   DSECT                                                                  
TLPRPKEY DS    0CL32                                                            
TLPRPCD  DS    CL1                                                              
TLPRNCDQ EQU   X'31'               PASSIVE KEY (NAME)                           
TLPRNAGY DS    CL6                 AGENCY (OR BINARY ZEROS)                     
TLPRNCLI DS    CL6                 CLIENT (OR BINARY ZEROS)                     
TLPRNAME DS    CL15                NAME                                         
TLPRNSEQ DS    XL4                 SEQUENCE NUMBER                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLPRPCD+1                                                        
TLPRGCDQ EQU   X'32'               PASSIVE KEY (PRODUCT GROUP)                  
         DS    CL7                                                              
TLPRGAGY DS    CL6                 AGENCY                                       
TLPRGCLI DS    CL6                 CLIENT                                       
TLPRGPRG DS    CL6                 PRODUCT GROUP                                
TLPRGPRD DS    CL6                 PRODUCT                                      
                                                                                
***********************************************************************         
                                                                                
         ORG   TLPRPCD+1                                                        
TLPRTCDQ EQU   X'33'               PASSIVE KEY (PRODUCT TYPE)                   
         DS    CL7                                                              
TLPRTAGY DS    CL6                 AGENCY                                       
TLPRTPRT DS    CL6                 PRODUCT TYPE                                 
TLPRTCLI DS    CL6                 CLIENT                                       
TLPRTPRD DS    CL6                 PRODUCT                                      
         EJECT                                                                  
***********************************************************************         
*        <   > PRODUCT GROUP RECORD                                   *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLPGD    DSECT                                                                  
TLPGKEY  DS    0CL32                                                            
TLPGCD   DS    XL1                                                              
TLPGCDQ  EQU   X'38'               ACTIVE KEY                                   
         DS    CL11                                                             
TLPGAGY  DS    CL6                 AGENCY                                       
TLPGCLI  DS    CL6                 CLIENT                                       
TLPGPRG  DS    CL6                 PRODUCT GROUP                                
         DS    CL2                                                              
                                                                                
TLPGLEN  DS    XL2                                                              
TLPGSTAT DS    XL2                                                              
         DS    CL4                                                              
TLPGELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        PRODUCT GROUP RECORD PASSIVE KEYS                            *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLPGPD   DSECT                                                                  
TLPGPKEY DS    0CL32                                                            
TLPGPCD  DS    CL1                                                              
TLPGNCDQ EQU   X'39'               PASSIVE KEY (NAME)                           
         DS    CL5                                                              
TLPGNAGY DS    CL6                 AGENCY                                       
TLPGNAME DS    CL16                NAME                                         
TLPGNSEQ DS    XL4                 SEQUENCE NUMBER                              
         EJECT                                                                  
***********************************************************************         
*        <   > PRODUCT TYPE RECORD                                    *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLPTD    DSECT                                                                  
TLPTKEY  DS    0CL32                                                            
TLPTCD   DS    XL1                                                              
TLPTCDQ  EQU   X'34'               ACTIVE KEY                                   
         DS    CL17                                                             
TLPTAGY  DS    CL6                 AGENCY                                       
TLPTPRT  DS    CL6                 PRODUCT TYPE                                 
         DS    CL2                                                              
                                                                                
TLPTLEN  DS    XL2                                                              
TLPTSTAT DS    XL2                                                              
         DS    CL4                                                              
TLPTELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        PRODUCT TYPE RECORD PASSIVE KEYS                             *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLPTPD   DSECT                                                                  
TLPTPKEY DS    0CL32                                                            
TLPTPCD  DS    CL1                                                              
TLPTNCDQ EQU   X'35'               PASSIVE KEY (NAME)                           
         DS    CL5                                                              
TLPTNAGY DS    CL6                 AGENCY                                       
TLPTNAME DS    CL16                NAME                                         
TLPTNSEQ DS    XL4                 SEQUENCE NUMBER                              
         EJECT                                                                  
***********************************************************************         
*        <   > PURCHASE ORDER RECORD                                  *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLPUD    DSECT                                                                  
TLPUKEY  DS    0CL32                                                            
TLPUCD   DS    XL1                                                              
TLPUCDQ  EQU   X'24'                                                            
TLPUSCD  DS    XL1                                                              
TLPUSCDQ EQU   X'00'               ACTIVE KEY                                   
TLPUAGY  DS    CL6                 AGENCY                                       
TLPUPO   DS    CL10                PO NUMBER                                    
         DS    CL14                                                             
                                                                                
TLPULEN  DS    XL2                                                              
TLPUSTAT DS    XL2                                                              
         DS    CL4                                                              
TLPUELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > RL-1 RECORD                                                      
***********************************************************************         
*##FILENAME CHKFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLR1D    DSECT                                                                  
TLR1KEY  DS    0CL32                                                            
TLR1CD   DS    XL1                                                              
TLR1CDQ  EQU   X'24'                                                            
TLR1SCD  DS    XL1                                                              
TLR1SCDQ EQU   X'06'               ACTIVE KEY                                   
TLR1YEAR DS    CL4                 DISPLAYABLE YEAR (EBCDIC)                    
TLR1CUR  DS    CL1                 CURRENCY                                     
TLR1EMP  DS    CL3                 EMPLOYER                                     
TLR1SSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    XL13                                                             
                                                                                
TLR1LEN  DS    XL2                                                              
TLR1STAT DS    XL2                                                              
TLR1SPND EQU   X'40'               PRINT PENDING                                
         DS    CL4                                                              
TLR1ELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > SCREEN RECORD                                          *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLSCD    DSECT                                                                  
TLSCKEY  DS    0CL32                                                            
TLSCCD   DS    XL1                                                              
TLSCCDQ  EQU   X'F0'               ACTIVE KEY                                   
         DS    CL11                                                             
TLSCAGY  DS    CL6                 AGENCY                                       
         DS    CL2                                                              
TLSCINV  DS    XL6                 INVOICE NUMBER (OR TAINIDTE/TAINITIM         
         DS    CL1                                 IF TAINSSCR BIT ON)          
TLSCPG   DS    XL1                 PAGE NUMBER                                  
         DS    CL1                                                              
TLSCSCR  DS    XL1                 SCREEN NUMBER                                
         DS    CL1                                                              
TLSCSEQ  DS    XL1                 SEQUENCE NUMBER                              
                                                                                
TLSCLEN  DS    XL2                                                              
TLSCSTAT DS    XL2                                                              
TLSCSCON EQU   X'01'               CONTINUATION BIT                             
         DS    CL4                                                              
TLSCELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > SECURITY RECORD                                        *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLSED    DSECT                                                                  
TLSEKEY  DS    0CL32                                                            
TLSECD   DS    XL1                                                              
TLSECDQ  EQU   X'F8'               ACTIVE KEY                                   
         DS    CL14                                                             
TLSEPROG DS    XL1                 PROGRAM - $GEN=02 - $REP=03                  
TLSEREC  DS    CL8                 RECORD  - OR BINARY ZEROES                   
TLSEACT  DS    CL8                 ACTION  - OR BINARY ZEROES                   
                                                                                
TLSELEN  DS    XL2                                                              
TLSESTAT DS    XL2                                                              
         DS    CL4                                                              
TLSEELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > SOAP GUARANTEE RECORD                                  *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLSGD    DSECT                                                                  
TLSGKEY  DS    0CL32                                                            
TLSGCD   DS    XL1                                                              
TLSGCDQ  EQU   X'7C'               ACTIVE KEY                                   
         DS    CL14                                                             
TLSGSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL2                                                              
TLSGGUA  DS    CL4                 SOAP GUARANTEE CODE  (COMPLEMENTED)          
         DS    CL2                                                              
                                                                                
TLSGLEN  DS    XL2                                                              
TLSGSTAT DS    XL2                                                              
         DS    CL4                                                              
TLSGELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > SESSION ESTIMATE RECORD                                *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLSSD    DSECT                                                                  
TLSSKEY  DS    0CL32                                                            
TLSSCD   DS    XL1                                                              
TLSSCDQ  EQU   X'E8'               ACTIVE KEY                                   
         DS    CL3                                                              
TLSSTYPE DS    CL1                 TYPE                                         
TLSSTYPR EQU   C'R'                  RADIO                                      
TLSSTYPT EQU   C'T'                  TV                                         
TLSSAGY  DS    CL6                 AGENCY                                       
TLSSEST  DS    CL20                ESTIMATE NUMBER                              
TLSSSEQ  DS    XL1                 SEQUENCE NUMBER                              
                                                                                
TLSSLEN  DS    XL2                                                              
TLSSSTAT DS    XL2                                                              
         DS    CL4                                                              
TLSSELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > STAFF RECORD                                           *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLSTD    DSECT                                                                  
TLSTKEY  DS    0CL32                                                            
TLSTCD   DS    XL1                                                              
TLSTCDQ  EQU   X'08'               ACTIVE KEY                                   
TLSSPR1  DS    CL17                SPARE                                        
TLSTUSER DS    XL2                 USER ID NUMBER                               
TLSSPR2  DS    CL2                 SPARE                                        
TLSTSTAF DS    CL8                 STAFF ID                                     
TLSSPR3  DS    CL1                 SPARE                                        
TLSTSSEQ DS    XL1                 SEQUENCE NUMBER                              
                                                                                
TLSTLEN  DS    XL2                                                              
TLSTSTAT DS    XL2                                                              
         DS    CL4                                                              
TLSTELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        STAFF RECORD PASSIVE KEYS                                    *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLSTPD   DSECT                                                                  
TLSTPKEY DS    0CL32                                                            
TLSTPCD  DS    CL1                                                              
TLSTNCDQ EQU   X'09'               PASSIVE KEY (NAME)                           
         DS    CL3                                                              
TLSTNLST DS    CL12                LAST NAME                                    
TLSTNFST DS    CL12                FIRST NAME                                   
TLSTNSEQ DS    XL4                 SEQUENCE NUMBER                              
                                                                                
         ORG   TLSTPCD+1                                                        
TLSTCCDQ EQU   X'EA'               PASSIVE KEY (CLIENT GROUP)                   
TLSTCCGP DS    CL6                 CLIENT GROUP                                 
         DS    CL11                                                             
TLSTCUSR DS    XL2                 USER ID NUMBER                               
         DS    CL2                                                              
TLSTCSTA DS    CL8                 STAFF ID                                     
         DS    CL1                                                              
TLSTCSEQ DS    XL1                 SEQUENCE NUMBER                              
         EJECT                                                                  
***********************************************************************         
*        <   > SYSTEM CONTROL RECORD                                  *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLSYD    DSECT                                                                  
TLSYKEY  DS    0CL32                                                            
TLSYCD   DS    XL1                                                              
TLSYCDQ  EQU   X'04'               ACTIVE KEY                                   
TLSYTYPE DS    XL1                 TYPE                                         
TLSYSYS  EQU   X'00'               SYSTEM RECORD                                
TLSYHFFN EQU   X'01'               HOLDING FEE WEB FILENAMES RECORD             
TLSYSNFN EQU   X'02'               SPOT/NET TRANSFER FILENAMES RECORD           
TLSYNCFN EQU   X'03'               NON-DDS CLARUS FILENAMES RECORD              
TLSYSAVE EQU   X'04'               SAVED SYSTEM RECORD                          
TLSYACHM EQU   X'05'               ACH MAPPINGS                                 
TLSYSNDT DS    XL3                 SPOT/NET TRANSFER PICKUP DATE                
         DS    XL27                                                             
         ORG   TLSYSNDT                                                         
TLSYNCDT DS    XL3                 NON-DDS CLARUS DATE                          
TLSYNUID DS    XL2                 USER ID NUMBER                               
         DS    CL24                                                             
TLSYSEQ  DS    XL1                 SEQUENCE NUMBER                              
         ORG   TLSYSNDT                                                         
TLSYSVDT DS    XL3                 SAVED SYSTEM RECORD DATE                     
         DS    XL27                                                             
         ORG   TLSYSNDT                                                         
TLSYAEMP DS    CL3                 EMPLOYER                                     
         DS    XL27                                                             
                                                                                
TLSYLEN  DS    XL2                                                              
TLSYSTAT DS    XL2                                                              
         DS    CL4                                                              
TLSYELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > T4A-NR RECORD                                          *         
***********************************************************************         
*##FILENAME CHKFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLTAD    DSECT                                                                  
TLTAKEY  DS    0CL32                                                            
TLTACD   DS    XL1                                                              
TLTACDQ  EQU   X'24'                                                            
TLTASCD  DS    XL1                                                              
TLTASCDQ EQU   X'07'               ACTIVE KEY                                   
TLTAYEAR DS    CL4                 DISPLAYABLE YEAR (EBCDIC)                    
TLTACUR  DS    CL1                 CURRENCY                                     
TLTAEMP  DS    CL3                 EMPLOYER                                     
TLTASSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    XL13                                                             
                                                                                
TLTALEN  DS    XL2                                                              
TLTASTAT DS    XL2                                                              
TLTASPND EQU   X'40'               PRINT PENDING                                
         DS    CL4                                                              
TLTAELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > TASK RECORD                                            *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLTKD    DSECT                                                                  
TLTKKEY  DS    0CL32                                                            
TLTKCD   DS    XL1                                                              
TLTKCDQ  EQU   X'24'                                                            
TLTKSCD  DS    XL1                                                              
TLTKSCDQ EQU   X'02'               ACTIVE KEY                                   
TLTKTASK DS    CL6                 TASK CODE                                    
         DS    XL24                                                             
                                                                                
TLTKLEN  DS    XL2                                                              
TLTKSTAT DS    XL2                                                              
TLTKSUSD EQU   X'01'               USED ON TPROFILE OR EVTIME                   
         DS    CL4                                                              
TLTKELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        TASK RECORD PASSIVE KEYS                                     *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLTKPD   DSECT                                                                  
TLTKPKEY DS    0CL32                                                            
TLTKPCD  DS    CL1                                                              
TLTKNCDQ EQU   X'25'               PASSIVE KEY (NAME)                           
TLTKNAME DS    CL24                NAME                                         
TLTKNTSK DS    CL6                 TASK                                         
TLTKNSCD DS    XL1                                                              
         EJECT                                                                  
***********************************************************************         
*        <   > TASK PROFILE RECORD                                    *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLTRD    DSECT                                                                  
TLTRKEY  DS    0CL32                                                            
TLTRCD   DS    XL1                                                              
TLTRCDQ  EQU   X'24'                                                            
TLTRSCD  DS    XL1                                                              
TLTRSCDQ EQU   X'03'               ACTIVE KEY                                   
TLTRAGY  DS    CL6                 AGENCY                                       
TLTRCLI  DS    CL6                 CLIENT                                       
TLTRTASK DS    CL6                 TASK CODE                                    
TLTRPTYP DS    CL6                 PAYMENT TYPE                                 
         DS    XL6                                                              
                                                                                
TLTRLEN  DS    XL2                                                              
TLTRSTAT DS    XL2                                                              
         DS    CL4                                                              
TLTRELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > TIMESHEET RECORD                                       *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLTMD    DSECT                                                                  
TLTMKEY  DS    0CL32                                                            
TLTMCD   DS    XL1                                                              
TLTMCDQ  EQU   X'B8'               ACTIVE KEY                                   
TLTMSTA  DS    XL1                                                              
TLTMSPPL EQU   X'80'               PAYROLL PLUS TIMESHEET                       
TLTMSWEB EQU   X'40'               WEB-CREATED TIMESHEET                        
         DS    CL2                                                              
TLTMCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLTMINV  DS    XL6                 INVOICE NUMBER (COMPLEMENTED)                
TLTMSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLTMSORT DS    XL6                 SORT KEY                                     
TLTMCAT  DS    CL3                 CATEGORY                                     
                                                                                
TLTMLEN  DS    XL2                                                              
TLTMSTAT DS    XL2                                                              
         DS    CL4                                                              
TLTMELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > T4 RECORD                                              *         
***********************************************************************         
*##FILENAME CHKFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLT4D    DSECT                                                                  
TLT4KEY  DS    0CL32                                                            
TLT4CD   DS    XL1                                                              
TLT4CDQ  EQU   X'24'                                                            
TLT4SCD  DS    XL1                                                              
TLT4SCDQ EQU   X'05'               ACTIVE KEY                                   
TLT4YEAR DS    CL4                 DISPLAYABLE YEAR (EBCDIC)                    
TLT4CUR  DS    CL1                 CURRENCY                                     
TLT4EMP  DS    CL3                 EMPLOYER                                     
TLT4SSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    XL13                                                             
                                                                                
TLT4LEN  DS    XL2                                                              
TLT4STAT DS    XL2                                                              
TLT4SPND EQU   X'40'               PRINT PENDING                                
         DS    CL4                                                              
TLT4ELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > USAGE HISTORY RECORD                                   *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLUHD    DSECT                                                                  
TLUHKEY  DS    0CL32                                                            
TLUHCD   DS    XL1                                                              
TLUHCDQ  EQU   X'98'               ACTIVE KEY                                   
TLUHPR1  DS    CL12                                                             
TLUHCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLUHCSEQ DS    XL2                 CAST INPUT SEQ NUMBER(VERSIONS ONLY)         
TLUHUSE  DS    CL3                 USE CODE                                     
TLUHPR2  DS    CL2                                                              
TLUHINV  DS    XL6                 INVOICE NUMBER (COMPLEMENTED)                
TLUHPR3  DS    CL2                                                              
                                                                                
TLUHLEN  DS    XL2                                                              
TLUHSTAT DS    XL2                                                              
         DS    CL4                                                              
TLUHELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        USAGE HISTORY RECORD PASSIVE KEYS                            *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLUHPD   DSECT                                                                  
TLUHPKEY DS    0CL32                                                            
TLUHPCD  DS    CL1                                                              
TLUHMTDQ EQU   X'99'               PASSIVE KEY (CNET/CSYS/MARKET)               
TLUHMINM DS    XL4                 INTERNAL CNET/CSYS/MARKET NUMBER             
TLUHMCOM DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLUHMSEQ DS    XL2                 CAST INPUT SEQ NUMBER(VERSIONS ONLY)         
TLUHMUSE DS    CL3                 USE CODE                                     
TLUHMINV DS    XL6                 INVOICE NUMBER (COMPLEMENTED)                
TLUHMTYP DS    XL1                 USE TYPE                                     
TLUHMVER DS    CL1                 VERSION LETTER                               
TLUHMCCS DS    XL3                 COMMERCIAL CYCLE START                       
TLUHMC1D DS    XL3                 CNET/CSYS/MKT 1ST USE DATE                   
TLUHMCYE DS    XL3                 CNET/CSYS/MKT CYCLE END                      
TLUHMSTA DS    CL1                 STATUS                                       
TLUHMCRD EQU   X'08'               CREDIT PAYMENT OR CANCELLED                  
         EJECT                                                                  
***********************************************************************         
*        <   > USE RECORD                                             *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLUSD    DSECT                                                                  
TLUSKEY  DS    0CL32                                                            
TLUSCD   DS    XL1                                                              
TLUSCDQ  EQU   X'8C'               ACTIVE KEY                                   
         DS    CL25                                                             
TLUSUSE  DS    CL3                 USE CODE                                     
         DS    CL3                                                              
                                                                                
TLUSLEN  DS    XL2                                                              
TLUSSTAT DS    XL2                                                              
         DS    CL4                                                              
TLUSELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > W2 RECORD                                              *         
***********************************************************************         
*##FILENAME CHKFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLW2D    DSECT                                                                  
TLW2KEY  DS    0CL32                                                            
TLW2CD   DS    XL1                                                              
TLW2CDQ  EQU   X'B4'               ACTIVE KEY                                   
         DS    XL11                                                             
TLW2YEAR DS    CL4                 DISPLAYABLE YEAR (EBCDIC)                    
TLW2CUR  DS    CL1                 CURRENCY                                     
TLW2EMP  DS    CL3                 EMPLOYER                                     
TLW2SSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TLW2CDTE DS    XL3                 CHANGED DATE - PWOS COMPLEMENTED             
                                                                                
TLW2LEN  DS    XL2                                                              
TLW2STAT DS    XL2                                                              
TLW2SPND EQU   X'40'               PRINT PENDING                                
         DS    CL4                                                              
TLW2ELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > VERSION RECORD                                         *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLVRD    DSECT                                                                  
TLVRKEY  DS    0CL32                                                            
TLVRCD   DS    XL1                                                              
TLVRCDQ  EQU   X'C8'               ACTIVE KEY                                   
         DS    CL12                                                             
TLVRCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    CL12                                                             
TLVRVER  DS    XL1                 VERSION NUMBER                               
         DS    CL2                                                              
                                                                                
TLVRLEN  DS    XL2                                                              
TLVRSTAT DS    XL2                                                              
         DS    CL4                                                              
TLVRELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > W4 RECORD (EMPLOYEE/CORPORATION)                       *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLW4D    DSECT                                                                  
TLW4KEY  DS    0CL32                                                            
TLW4CD   DS    XL1                                                              
TLW4CDQ  EQU   X'60'               ACTIVE KEY                                   
         DS    CL20                                                             
TLW4SSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
         ORG   TLW4SSN                                                          
TLW4FID  DS    CL9                 FEDERAL ID NUMBER (TYPE=TAW4TYCO)            
         DS    CL2                                                              
                                                                                
TLW4LEN  DS    XL2                                                              
TLW4STAT DS    XL1                                                              
TLW4STA2 DS    XL1                 W4 TYPE (SEE TAW4TYPE)                       
         DS    CL4                                                              
TLW4ELEM DS    0C                  1ST ELEMENT                                  
                                                                                
***********************************************************************         
*        W4 RECORD (EMPLOYEE/CORPORATION) PASSIVE KEYS                *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY ON                                             *         
***********************************************************************         
                                                                                
TLW4PD   DSECT                                                                  
TLW4PKEY DS    0CL32                                                            
TLW4PCD  DS    CL1                                                              
TLW4NCDQ EQU   X'61'               PASSIVE KEY (NAME)                           
         DS    CL2                                                              
TLW4NLST DS    CL16                LAST NAME                                    
TLW4NFST DS    CL8                 FIRST NAME                                   
TLW4NSTA DS    XL1                 STATUS                                       
TLW4NSAK EQU   X'10'               THIS IS AN AKA NAME                          
TLW4NSEQ DS    XL4                 SEQUENCE NUMBER                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLW4PCD+1                                                        
TLW4CCDQ EQU   X'62'               PASSIVE KEY (CORPORATION)                    
         DS    CL9                                                              
TLW4CCRP DS    CL9                 CORPORATION                                  
         DS    CL2                                                              
TLW4CSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL1                                                              
TLW4CTYP DS    CL1                 W4 TYPE                                      
                                                                                
***********************************************************************         
                                                                                
         ORG   TLW4PCD+1                                                        
TLW4OCDQ EQU   X'63'               PASSIVE KEY (OLD CONVERTED)                  
         DS    CL17                                                             
TLW4OEMP DS    CL3                 EMPLOYER                                     
TLW4OSSN DS    CL9                 SOCIAL SECURITY NUMBER                       
         DS    CL2                                                              
                                                                                
***********************************************************************         
                                                                                
         ORG   TLW4PCD+1                                                        
TLW4LCDQ EQU   X'67'               PASSIVE KEY (LLC OR LLP)                     
TLW4LFID DS    CL9                 FEDERAL ID NUMBER (TYPE=TAW4TYCO)            
TLW4LEST DS    CL9                 SSN (TYPE=TAW4TYES)                          
TLW4LFLT DS    CL1                 FILTER CODE                                  
         DS    CL12                                                             
         EJECT                                                                  
***********************************************************************         
*        <   > WEB TRANSACTION RECORD                                 *         
***********************************************************************         
*##FILENAME TALFIL                                                    *         
*##PROCESS ACTIVE KEY ON                                              *         
*##PROCESS ACTIVE RECORD ON                                           *         
*##PROCESS PASSIVE KEY OFF                                            *         
***********************************************************************         
                                                                                
TLWTD    DSECT                                                                  
TLWTKEY  DS    0CL32                                                            
TLWTCD   DS    XL1                                                              
TLWTCDQ  EQU   X'A4'               ACTIVE KEY                                   
TLWTWBAP DS    XL1                 WEB APPLICATION                              
TLWTWACO EQU   1                   CERNO                                        
TLWTWAVI EQU   2                   VITA                                         
TLWTMFCG EQU   3                   CLIENT GROUP CHANGE                          
TLWTDATE DS    XL3                 TRANSACTION DATE                             
TLWTTIME DS    XL2                 TRANSACTION TIME                             
TLWTACTN DS    XL1                 ACTION                                       
TLWTAHLD EQU   0                   HOLD COMMERCIAL                              
TLWTARCO EQU   1                   RELEASE COMMERCIAL                           
TLWTARCA EQU   2                   RELEASE CAST                                 
TLWTAAW4 EQU   3                   ADD W4                                       
TLWTACW4 EQU   4                   CHANGE W4                                    
TLWTAACO EQU   5                   ADD COMMERCIAL                               
TLWTACCO EQU   6                   CHANGE COMMERCIAL                            
TLWTAACA EQU   7                   ADD CAST                                     
TLWTACCA EQU   8                   CHANGE CAST                                  
TLWTAPAY EQU   9                   PAYMENT                                      
TLWTADCA EQU   10                  DELETE CAST                                  
TLWTAAVR EQU   11                  ADD VERSION                                  
TLWTACVR EQU   12                  CHANGE VERSION                               
TLWTADVR EQU   13                  DELETE VERSION                               
TLWTAANM EQU   14                  ADD NEW MEDIA                                
TLWTAAIN EQU   15                  ADD INTERNET                                 
TLWTWBID DS    CL16                WEB APPLICATION ID                           
TLWTUNIQ DS    CL8                 UNIQUE IDENTIFIER                            
         ORG   TLWTUNIQ            ** TLWTAAW4, TLWTACW4 **                     
TLWTUPID DS    CL6                 PID                                          
         DS    CL2                                                              
         ORG   TLWTUNIQ            ** TLWTAACO, TLWTACCO **                     
TLWTUCOM DS    CL8                 INTERNAL COMMERCIAL NUMBER                   
         ORG   TLWTUNIQ            ** TLWTAACA, TLWTACCA, TLWTADCA **           
TLWTUCCO DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLWTUCSQ DS    XL2                 CAST SEQUENCE NUMBER                         
         DS    XL2                                                              
         ORG   TLWTUNIQ            ** TLWTAPAY **                               
TLWTUINV DS    CL6                 INVOICE                                      
         DS    CL2                                                              
         ORG   TLWTUNIQ            ** TLWTAAVR, TLWTACVR, TLWTADVR **           
TLWTUVCO DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLWTUVER DS    XL1                 VERSION NUMBER                               
         DS    XL3                                                              
         ORG   TLWTUNIQ            ** TLWTAAIN, TLWTAANM **                     
TLWTUNIC DS    CL4                 NEW MEDIA/INTERNET CODE                      
         DS    XL4                                                              
         ORG   TLWTWBID            ** CLIENT GROUP UPDATE **                    
TLWTCGAY DS    CL6                 AGENCY                                       
TLWTCGCL DS    CL6                 CLIENT                                       
TLWTCGCG DS    CL6                 NEW CLIENT GROUP                             
         DS    XL6                                                              
                                                                                
TLWTLEN  DS    XL2                                                              
TLWTSTAT DS    XL2                                                              
TLWTSAUD EQU   X'01'               AUDITED                                      
         DS    CL4                                                              
TLWTELEM DS    0C                  1ST ELEMENT                                  
         EJECT                                                                  
***********************************************************************         
*        <   > ACTIVITY ELEMENT                                       *         
***********************************************************************         
*##PROCESS ACTIVE KEY OFF                                             *         
*##PROCESS ACTIVE RECORD OFF                                          *         
*##PROCESS PASSIVE KEY OFF                                            *         
*##PROCESS ELEMENT ON                                                           
***********************************************************************         
                                                                                
TAACD    DSECT                                                                  
TAACEL   DS    XL1                 ELEMENT CODE                                 
TAACELQ  EQU   X'F4'                                                            
TAACLEN  DS    XL1                 ELEMENT LENGTH                               
TAACID   DS    XL2                 STAFF USER ID NUMBER                         
TAACSTAF DS    CL8                 STAFF                                        
*##DATATYPE DATCON1                                                             
TAACCDTE DS    XL3                 LAST CHANGE DATE                             
*##DATATYPE TIMEHHMMSS                                                          
TAACCTIM DS    XL3                 LAST CHANGE TIME (HMS)                       
TAACSCR  DS    XL1                 SCREEN PHASE (OPTIONAL)                      
TAACMAJ  DS    XL1                 EASYEST MAJOR VERSION                        
TAACMIN  DS    XL1                 EASYEST MINOR VERSION                        
TAACBLD  DS    XL2                 EASYEST BUILD NUMBER                         
TAACTSCR DS    XL1                 TRUE SCREEN PHASE WHEN TAACSCR=X'FF'         
         DS    CL3                                                              
*##ASSOCIATED TAACLEN                                                           
TAACLNQ  EQU   *-TAACD                                                          
                                                                                
***********************************************************************         
*        <   > ADDRESS ELEMENT                                        *         
***********************************************************************         
                                                                                
TAADD    DSECT                                                                  
TAADEL   DS    XL1                 ELEMENT CODE                                 
TAADELQ  EQU   X'22'                                                            
TAADLEN  DS    XL1                 ELEMENT LENGTH                               
TAADLNES DS    XL1                 N'LINES (MAX 4)                              
TAADADD  DS    0CL30               ADDRESS                                      
*##ASSOCIATED TAADLEN                                                           
TAADLNQ  EQU   *-TAADD                                                          
                                                                                
***********************************************************************         
*##PROCESS OFF                                                        *         
***********************************************************************         
*        <   > ADVICE/INVOICE ASSIGN ELEMENT                          *         
***********************************************************************         
                                                                                
TAAID    DSECT                                                                  
TAAIEL   DS    XL1                 ELEMENT CODE                                 
TAAIELQ  EQU   X'FC'                                                            
TAAILEN  DS    XL1                 ELEMENT LENGTH                               
*                                  (ADVICE INFO SAVED IN INVOICE)               
TAAIACID DS    CL12                COMMERCIAL ID ON ADVICE                      
TAAIAADV DS    CL6                 ADVICE NUMBER                                
TAAIAPTY DS    XL1                 PAYMENT TYPE:                                
TAAIAREU EQU   1                   REUSE                                        
TAAIAMUS EQU   2                   MUSIC                                        
*##ASSOCIATED TAAILEN                                                           
TAAIALNQ EQU   *-TAAID                                                          
         ORG   TAAIACID            (INVOICE INFO SAVED IN ADVICE)               
TAAIINUM DS    CL6                 INVOICE NUMBER                               
TAAIINU2 DS    CL6                 INVOICE NUMBER 2                             
*##ASSOCIATED TAAILEN                                                           
TAAIILNQ EQU   *-TAAID                                                          
TAAIINUX DS    0CL6                ADDITIONAL INVOICE #'S FOR NWK               
                                                                                
***********************************************************************         
*##PROCESS ON                                                         *         
***********************************************************************         
*        <   > EMPLOYEE AKA NAME ELEMENT                              *         
***********************************************************************         
                                                                                
TAAKD    DSECT                                                                  
TAAKEL   DS    XL1                 ELEMENT CODE                                 
TAAKELQ  EQU   X'79'                                                            
TAAKLEN  DS    XL1                 ELEMENT LENGTH                               
TAAKNAM2 DS    CL16                LAST NAME                                    
TAAKNAM1 DS    CL16                FIRST/MIDDLE NAME                            
*##ASSOCIATED TAAKLEN                                                           
TAAKLNQ  EQU   *-TAAKD                                                          
                                                                                
***********************************************************************         
*        <   > AGENT ELEMENT                                          *         
***********************************************************************         
                                                                                
TAAND    DSECT                                                                  
TAANEL   DS    XL1                 ELEMENT CODE                                 
TAANELQ  EQU   X'64'                                                            
TAANLEN  DS    XL1                 ELEMENT LENGTH                               
TAANTEL  DS    CL12                TELEPHONE NUMBER                             
TAANSTAT DS    XL1                 STATUS                                       
TAANSNCK EQU   X'80'               IGNORE ON SAG CHECKS                         
TAANSOVR EQU   X'40'               ALLOWABLE OVERRIDE                           
TAANTNR  DS    CL4                 OLD T&R CODE                                 
TAANSSN  DS    CL9                 SS NUMBER FOR AGENT                          
         DS    CL4                                                              
*##ASSOCIATED TAANLEN                                                           
TAANLNQ  EQU   *-TAAND                                                          
                                                                                
***********************************************************************         
*        <   > CONTRACT ASSIGN ELEMENT                                *         
***********************************************************************         
                                                                                
TAASD    DSECT                                                                  
TAASEL   DS    XL1                 ELEMENT CODE                                 
TAASELQ  EQU   X'BF'                                                            
TAASLEN  DS    XL1                 ELEMENT LENGTH                               
TAASCID  DS    CL12                COMMERCIAL ID (FOR SEQUENCING)               
TAASCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TAASVER  DS    CL1                 VERSION LETTER                               
         DS    XL1                 SPARE                                        
*##ASSOCIATED TAASLEN                                                           
TAASLNQ  EQU   *-TAASD                                                          
                                                                                
***********************************************************************         
*        <   > CANADIAN TAX WITHHOLDING ELEMENT                       *         
***********************************************************************         
                                                                                
TAATD    DSECT                                                                  
TAATEL   DS    XL1                 ELEMENT CODE                                 
TAATELQ  EQU   X'0B'                                                            
TAATLEN  DS    XL1                 ELEMENT LENGTH                               
TAATUNIT DS    CL3                 UNIT CODE                                    
TAATCCVT DS    PL3                 CANADIAN CONVERSION RATE                     
         DS    CL4                                                              
         DS    0F                                                               
TAATWHLD DS    0CL20               EMPLOYEE WITHHOLDINGS                        
TAATTAX  DS    F                   TAXES (ALL)                                  
TAATPP   DS    F                   PENSION PLAN (PROVINCE)                      
TAATEI   DS    F                   EMP INSURANCE PREM (PROVINCE)                
TAATPIP  DS    F                   PARENTIAL INSURANCE PLAN (QUEBEC)            
TAATLNQ  EQU   *-TAATD                                                          
*                                                                               
TAATCWHL DS    0CL20               EMPLOYEE WITHHOLDINGS CAD                    
TAATCTAX DS    F                   TAXES (ALL) CAD                              
TAATCPP  DS    F                   PENSION PLAN (PROVINCE) CAD                  
TAATCEI  DS    F                   EMP INSURANCE PREM (PROVINCE) CAD            
TAATCPIP DS    F                   PARENTIAL INSURANCE PLAN (QUE) CAD           
TAATLN2Q EQU   *-TAATD                                                          
*                                                                               
***********************************************************************         
*        <   > ACCESS VIOLATION ELEMENT                               *         
***********************************************************************         
                                                                                
TAAVD    DSECT                                                                  
TAAVEL   DS    XL1                 ELEMENT CODE                                 
TAAVELQ  EQU   X'F2'                                                            
TAAVLEN  DS    XL1                 ELEMENT LENGTH                               
TAAVLINE DS    CL4                 LINE ID OF TERMINAL                          
TAAVADDR DS    CL4                 ADDRESS OF TERMINAL                          
TAAVERRS DS    XL1                 N'ERRORS                                     
TAAVEMAX EQU   6                   MAXIMUM N'ERRORS ALLOWED                     
TAAVDATE DS    XL3                 DATE VIOLATION OCCURED                       
TAAVTIME DS    XL3                 TIME VIOLATION OCCURED                       
TAAVSTAF DS    CL8                 STAFF ID                                     
TAAVUSER DS    XL2                 USER ID NUMBER                               
         DS    XL6                 SPARE                                        
*##ASSOCIATED TAAVLEN                                                           
TAAVLNQ  EQU   *-TAAVD                                                          
                                                                                
***********************************************************************         
*        <   > AGENCY ELEMENT                                         *         
***********************************************************************         
                                                                                
TAAYD    DSECT                                                                  
TAAYEL   DS    XL1                 ELEMENT CODE                                 
TAAYELQ  EQU   X'2A'                                                            
TAAYLEN  DS    XL1                 ELEMENT LENGTH                               
TAAYAGG  DS    CL6                 AGENCY GROUP                                 
TAAYTPOF DS    CL1                 TALENT PARTNERS OFFICE                       
TAAYTEL  DS    CL12                TELEPHONE                                    
TAAYNBIL DS    XL1                 N'BILLING COPIES                             
TAAYSTAT DS    XL1                 STATUS                                       
TAAYSCOD EQU   X'80'               C.O.D. AGENCY                                
TAAYSAPO EQU   X'40'               AUTH/PO REQUIRED                             
TAAYS13W EQU   X'20'               USING 13W CYCLES (DEFAULT IS 3M)             
TAAYSCTX EQU   X'10'               CHARGE CAN TAXES(IF C=Y AT PAY TIME)         
TAAYSATX EQU   X'08'               AUTOMATICALLY CHARGE CAN TAXES               
TAAYSNFT EQU   X'04'               DON'T WANT FIXED CYCLE TRACKING              
TAAYSEST EQU   X'02'               ESTIMATE REQUIRED ON PAYMENTS                
TAAYSPAC EQU   X'01'               AGENCY COPIES PRINT AT AGENCY                
TAAYHLD  DS    X                   HOLDING FEE NOTIFICATION FREQUENCY           
*                                  X'80' = MONTHLY NOTICE (ELSE WEEKLY)         
*                                  < X'80' = # WEEKS NOTICE                     
TAAYHLDS DS    X                   HOLDING FEE NOTICE STATUS BITS               
TAAYHS2D EQU   X'80'               AGENCY DOESN'T WANT SECOND NOTICE            
TAAYHSCO EQU   X'40'               SHOW AGY COMMISSION ON TOTALS                
TAAYHSNO EQU   X'20'               AGENCY DOESN'T WANT ANY NOTICES              
TAAYHSNC EQU   X'10'               PAPER AND ELECTRONIC - NO CHANGES            
TAAYHSEL EQU   X'08'               ELECTRONIC ONLY                              
TAAYHSPE EQU   X'04'               PAPER AND ELECTRONIC                         
TAAYHSPO EQU   X'02'               PAPER ONLY                                   
TAAYSTA2 DS    XL1                 2ND STATUS                                   
TAAYSNDF EQU   X'80'               NO DEFAULT JOBS ALLOWED                      
TAAYSTRK EQU   X'40'               PRINT ALL TRACKING PAGES                     
TAAYSRET EQU   X'20'               RETRO INVOICES HAVE BEEN GENERATED           
TAAYSHND EQU   X'10'               HAND DELIVERY                                
TAAYSMAL EQU   X'08'               MAIL DELIVERY                                
TAAYSPCH EQU   X'04'               POUCH DELIVERY                               
TAAYSOVN EQU   X'02'               OVERNIGHT DELIVERY                           
TAAYSCHI EQU   X'01'               MAILED FROM CHICAGO                          
TAAYSTA3 DS    XL1                 3RD STATUS                                   
TAAYSLCK EQU   X'80'               AGENCY IS LOCKED                             
TAAYSPRI EQU   X'40'               PRIORITY MAIL                                
TAAYSRES EQU   X'20'               SOAP RESIDUAL AGENCY - TEMPORARY             
TAAYS30M EQU   X'10'               30 MINUTE SOAP SERIAL (NOT 1 HR)             
TAAYSNSD EQU   X'08'               NO SENDING OF GENERATED ADVICES              
TAAYSNCS EQU   X'04'               NO CAST SHOWN WHEN ADDING ADVICES            
TAAYSPNX EQU   X'02'               TNX/TAG PRINT AT AGENCY                      
TAAYSADV EQU   X'01'               AUTOMATIC ADVICE NUMBERS                     
TAAYSTA4 DS    XL1                 4TH STATUS                                   
TAAYSNGT EQU   X'80'               DON'T WANT GUARANTEE TRACKING                
TAAYSCPO EQU   X'40'               CLOSE THE PO                                 
TAAYSLN  EQU   X'20'               GENERATE LATE NIGHT USES                     
TAAYSNHD EQU   X'10'               NO HANDLING ON AGENT CHKS FOR PRINT          
TAAYINTC EQU   X'08'               INTFACE COD, POST IN BILLING EVEN IF         
*                                    INVOICE IS HELD                            
TAAYDCAE EQU   X'04'               DO NOT CLEAR ESTIMATE #'S ON ADVICE          
TAAYAEXT EQU   X'02'               ADVICE SESSIONS PULL EXTRAS                  
TAAYPOV  EQU   X'01'               PURCHASE ORDER VALIDATION (O&M)              
TAAYSTA5 DS    CL1                 5TH STATUS                                   
TAAYSPTI EQU   X'80'               CAN USE SPOT INTERFACE                       
TAAYNETI EQU   X'40'               CAN USE NET INTERFACE                        
TAAYISPL EQU   X'20'               VAL JOB RECORDS FOR ISPLIT                   
TAAYBUSU EQU   X'10'               BUSINESS UNITS IN CLIENT FOR SAATCHI         
TAAYNOGL EQU   X'08'               NO GLOBAL                                    
TAAYCIHR EQU   X'04'               ENABLED FOR CERNO PAY/RELEASE                
TAAYNETC EQU   X'02'               CAN USE NET CABLE INTERFACE                  
TAAYSOTH EQU   X'01'               SUPPRESS CERTAIN FIELDS ON INVOICE           
TAAYLBOX DS    CL1                 LOCK BOX CODE                                
TAAYLCHI EQU   C'C'                FOR CHICAGO                                  
TAAYLNY  EQU   C'N'                NEW YORK                                     
TAAYLDDS EQU   C'D'                NEW YORK - DDS ADDRESS                       
TAAYLP   EQU   C'P'                PRINT PAYROLL SERVICES IN CHICAGO            
TAAYLLA  EQU   C'L'                LOS ANGELES                                  
TAAYLOTH EQU   C'O'                OTHER                                        
TAAYLT   EQU   C'T'                TALENT PARTNERS IN CHICAGO                   
TAAYDAYS DS    XL1                 NUMBER OF DAYS DUE                           
TAAYTID  DS    XL2                 USER ID OF TPC                               
TAAYTPC  DS    CL8                 DEFAULT TALENT PAYMENT COORDINATOR           
TAAYIAGY DS    CL6                 USE INVOICE NUMBER OF THIS AGENCY            
TAAYRINV DS    XL2                 RESET INVOICE NUMBER                         
TAAYNINV DS    XL6                 NEXT INVOICE NUMBER                          
TAAYNADV DS    CL6                 NEXT ADVICE CODE (GEN ADVICES ONLY)          
TAAYAAGY DS    CL6                 USE ADVICE NUMBER OF THIS AGENCY             
TAAYRADV DS    XL2                 RESET ADVICE NUMBER                          
TAAYMISC DS    CL1                 MISCELLANEOUS STATUSES                       
TAAYPREM EQU   X'80'               PREMIUM SERVICE LEVEL                        
TAAYSTA6 DS    XL1                 6TH STATUS                                   
TAAYSFIL EQU   X'80'               VITA FILLABLE PDFS                           
TAAYSPLH EQU   X'40'               CHLOE, SPLIT OUT HANDLING                    
TAAYSTPS EQU   X'20'               TALENT PARTNERS SIGNATORY                    
TAAYVIBE EQU   X'10'               ENABLED FOR VITA BETA FEATURES               
TAAYST10 EQU   X'08'               TYPE 10 JOB VALIDATION                       
TAAYSTCA EQU   X'04'               PRINT ACOPY IN CANADIAN DOLLARS              
TAAYSREG EQU   X'02'               REGRESSION TESTING AGENCY                    
TAAYJPCY EQU   X'01'               CAN TAKE JPC CONTRACT SERVICE FEE            
TAAYBUNT DS    XL2                 BUSINESS UNIT (JWT ONLY)                     
TAAYSGNS DS    XL1                 SIGNATORY FEE STATUS                         
TAAYSGN0 EQU   0                   IND + CORP/MISC + TAXES + P&H + HAND         
TAAYSGN1 EQU   1                   IND + CORP/MISC                              
TAAYSGN2 EQU   2                   IND + CORP/MISC + PAYROLL TAX                
TAAYSGN3 EQU   3                   IND + CORP/MUSIC + P&H                       
TAAYSGN4 EQU   4                   IND + CORP/MUSIC + HANDLING                  
TAAYSGN5 EQU   5                   IND + CORP/MISC + TAXES + P&H                
TAAYSGN6 EQU   6                   IND + CORP/MISC + P&H + HANDLING             
TAAYSGN7 EQU   7                   IND + CORP/MISC + TAXES + HANDLING           
TAAYSTA7 DS    XL1                 7TH STATUS                                   
TAAYSPPL EQU   X'80'               PAYROLL PLUS AGENCY                          
TAAYSTSM EQU   X'40'               TAX USING SEMI-MONTHLY FREQUENCY             
TAAYSCDT EQU   X'20'               ALL CHECKS DUE TODAY                         
TAAYSTWK EQU   X'10'               TAX USING WEEKLY FREQUENCY                   
TAATSPLA EQU   X'08'               PRINT CALIFORNIA CHECKS IN LA                
TAAYSBBD EQU   X'04'               BBDO JOB VAL NOT IN ACCPAK                   
*##ASSOCIATED TAAYLEN                                                           
TAAYLNQ  EQU   *-TAAYD                                                          
                                                                                
***********************************************************************         
*        <   > ADDRESS ELEMENT - 2ND TYPE FOR W4                      *         
***********************************************************************         
                                                                                
TAA2D    DSECT                                                                  
TAA2EL   DS    XL1                 ELEMENT CODE                                 
TAA2ELQ  EQU   X'23'                                                            
TAA2LEN  DS    XL1                 ELEMENT LENGTH                               
TAA2ADDR DS    0CL90                                                            
*AA2ADDR DS    0CL(3*30)                                                        
TAA2ADD1 DS    CL30                ADDRESS 1                                    
TAA2ADD2 DS    CL30                        2                                    
TAA2ADD3 DS    CL30                        3                                    
TAA2CITY DS    CL25                CITY                                         
TAA2ST   DS    CL2                 STATE                                        
TAA2ZIP  DS    CL10                ZIP                                          
TAA2CTRY DS    CL2                 COUNTRY                                      
*##ASSOCIATED TAA2LEN                                                           
TAA2LNQ  EQU   *-TAA2D                                                          
                                                                                
***********************************************************************         
*        <   > BALANCE ELEMENT                                        *         
***********************************************************************         
                                                                                
TABAD    DSECT                                                                  
TABAEL   DS    XL1                 ELEMENT CODE                                 
TABAELQ  EQU   X'D0'                                                            
TABALEN  DS    XL1                 ELEMENT LENGTH                               
TABATYPE DS    CL1                 ANALYSIS TYPE                                
TABATDUE EQU   C'D'                DUE DATE ANALYSIS                            
TABATINV EQU   C'I'                INVOICE DATE ANALYSIS                        
TABADATE DS    XL3                 PWOS DATE                                    
         DS    CL2                 SPARE                                        
TABABPRE DS    F                   PREVIOUS BILLS AMOUNT                        
TABABCUR DS    F                   CURRENT BILL AMOUNT                          
TABABCAN DS    F                   CANCELLED BILLS AMOUNT                       
TABAPPRE DS    F                   PAYROLL - PREVIOUS INVOICE                   
TABAPCUR DS    F                   PAYROLL - CURRENT INVOICE                    
*##ASSOCIATED TABALEN                                                           
TABALNQ  EQU   *-TABAD                                                          
                                                                                
***********************************************************************         
*        <   > BILL DETAILS ELEMENT                                   *         
***********************************************************************         
                                                                                
TABDD    DSECT                                                                  
TABDEL   DS    XL1                 ELEMENT CODE                                 
TABDELQ  EQU   X'84'               REGULAR BILL DETAILS ELEMENT CODE            
TABDELQ2 EQU   X'FB'               EMS BILL DETAILS ELEMENT CODE                
TABDELQ3 EQU   X'FE'               EURO BILL DETAILS ELEMENT CODE               
TABDELQ4 EQU   X'EE'               CAN$ BILL DETAILS ELEMENT CODE               
TABDLEN  DS    XL1                 ELEMENT LENGTH                               
TABDTYPE DS    XL1                 BILLING TYPE                                 
TABDCCVT DS    PL3                 CANADIAN CONVERSION RATE (N.NNNN)            
TABDLEVL DS    CL1                 LOWEST BILLING LEVEL USED (A - E)            
TABDSTAT DS    XL1                 STATUS BYTE                                  
TABDSCNW EQU   X'80'               CANADIAN - NEW PRINTING STYLE                
TABDSB10 EQU   X'40'               LIKE BILLING TYPE 10                         
TABDSB13 EQU   X'20'               LIKE BILLING TYPE 13                         
TABDSB16 EQU   X'10'               LIKE BILLING TYPE 16                         
TABDAMTS DS    0F                                                               
TABDTOT  DS    F                   BILL TOTAL                                   
TABDTAX  DS    F                   PAYROLL TAXES                                
TABDHND  DS    F                   HANDLING                                     
TABDHNDC DS    F                   CORPORATION HANDLING                         
TABDCSF  DS    F                   CONTRACT SERVICE FEE AMOUNT                  
TABDFICR DS    F                   FICA CREDIT AMOUNT                           
TABDGST  DS    F                   CANADIAN GST                                 
TABDAMTL EQU   *-TABDAMTS                                                       
TABDLNQ  EQU   *-TABDD                                                          
TABDACOM DS    F                   AGENCY COMMISSION                            
TABDSIGN DS    F                   SIGNATORY FEE                                
TABDPST  DS    F                   PST                                          
TABDAM2L EQU   *-TABDAMTS                                                       
*##ASSOCIATED TABDLEN                                                           
TABDLN2Q EQU   *-TABDD                                                          
                                                                                
***********************************************************************         
*        <   > BREAKOUT ELEMENT                                       *         
***********************************************************************         
                                                                                
TABKD    DSECT                                                                  
TABKEL   DS    XL1                 ELEMENT CODE                                 
TABKELQ  EQU   X'CA'                                                            
TABKLEN  DS    XL1                 ELEMENT LENGTH                               
TABKUTYP DS    XL1                 UNIT TYPE                                    
TABKUCUN EQU   X'80'               CABLE UNITS                                  
TABKUHRS EQU   X'40'               HOURS                                        
TABKSTAT DS    XL1                 STATUS                                       
TABKSTOV EQU   X'80'               USER OVERRIDE                                
TABKNSUB DS    XL1                 NUMBER OF SUB-ELEMENTS                       
TABKDATA DS    0C                  DATA                                         
*##ASSOCIATED TABKLEN                                                           
TABKLNQ  EQU   *-TABKD                                                          
                                                                                
TABKCODE DS    XL1                 CODE FOR SUB-ELEMENT                         
         DS    XL1                                                              
TABKUN1  DS    XL4                 UNIT START #                                 
TABKUN2  DS    XL4                 UNIT END #                                   
TABKNOUN DS    XL4                 NUMBER OF UNITS                              
TABKRATE DS    XL4                 RATE PER UNIT                                
*##ASSOCIATED TABKLEN                                                           
TABKSLNQ EQU   *-TABKCODE                                                       
                                                                                
***********************************************************************         
*        <   > BILLING RULES ELEMENT                                  *         
***********************************************************************         
                                                                                
TABRD    DSECT                                                                  
TABREL   DS    XL1                 ELEMENT CODE                                 
TABRELQ  EQU   X'2B'                                                            
TABRLEN  DS    XL1                 ELEMENT LENGTH                               
TABRTYPE DS    XL1                 BILLING TYPE                                 
TABRTY1  EQU   1                                                                
TABRTY2  EQU   2                                                                
TABRTY6  EQU   6                                                                
TABRTY7  EQU   7                                                                
TABRTY8  EQU   8                                                                
TABRTY9  EQU   9                                                                
TABRTY10 EQU   10                                                               
TABRTY11 EQU   11                                                               
TABRTY12 EQU   12                                                               
TABRTY13 EQU   13                                                               
TABRTY14 EQU   14                                                               
TABRTY15 EQU   15                                                               
TABRTY16 EQU   16                  FOR AGENCY COMMISSION                        
TABRTY18 EQU   18                                                               
TABRTY20 EQU   20                  FOR RICHARDS GROUP                           
TABRTY21 EQU   21                  SEPARATE HANDLING FOR SESSION/REUSE          
TABRTY22 EQU   22                  FOR MCCANN                                   
TABRTY23 EQU   23                  FOR CHRYSLER                                 
TABRTY24 EQU   24                  FOR IPG                                      
TABRTY25 EQU   25                  FOR CHLOE                                    
TABRTY26 EQU   26                  FOR CHLOE                                    
TABRTY31 EQU   31                  FOR CHLOE                                    
TABRTY32 EQU   32                        "                                      
TABRTY33 EQU   33                        "                                      
TABRTY34 EQU   34                        "                                      
TABRTY99 EQU   99                                                               
TABRTYE  EQU   C'E'                                                             
TABRSTAT DS    XL1                 STATUS                                       
TABRSQTR EQU   X'80'               ESTIMATE PERIOD IS QUARTER                   
TABRSCIN EQU   X'40'               CLIENT LEVEL PRODUCTION INTERFACE            
TABRS75K EQU   X'20'               NO CHARGE ABOVE $75000                       
TABRSACP EQU   X'10'               ACOPY BILLING TYPE                           
TABRSNWK EQU   X'08'               NETWORK REQUIRED FOR CLA USES                
TABRSSRC EQU   X'04'               USE STANDARD RATE CARD                       
TABRSNIN EQU   X'02'               NOT ON PRODUCTION INTERFACE                  
TABRSINT EQU   X'01'               ON PRODUCTION INTERFACE                      
         DS    CL8                                                              
TABROEOR DS    CL3                 OVERRIDE EMPLOYER-OF-RECORD                  
TABRRECV DS    CL12                RECEIVABLE ACCOUNT                           
TABRRATE DS    0CL16               BILLING RATES                                
TABRFUTA DS    XL2                 EOR UP TO FUTA MAX RATE                      
TABRSUTA DS    XL2                 EOR UP TO SUTA MAX RATE                      
TABRFICA DS    XL2                 EOR UP TO FICA MAX RATE                      
TABROVER DS    XL2                 EOR OVER FICA MAX RATE                       
TABRIFIC DS    0XL2                                                             
TABRCORP DS    XL2                 CORPORATE RATE                               
TABRHAND DS    XL2                 HANDLING FEE                                 
TABRCAN  DS    XL2                 CANADIAN TAX                                 
TABROMED DS    XL2                 OVER MEDICARE                                
         ORG   TABROMED                                                         
TABRWCRP DS    XL2                 WC FOR CORPS                                 
TABRHRLS DS    CL1                 HANDLING RULES                               
         DS    CL3                                                              
*##ASSOCIATED TABRLEN                                                           
TABRLNQ  EQU   *-TABRD                                                          
                                                                                
***********************************************************************         
*        <   > BILLING RATES ELEMENT                                  *         
***********************************************************************         
                                                                                
TARAD    DSECT                                                                  
TARAEL   DS    XL1                 ELEMENT CODE                                 
TARAELQ  EQU   X'55'                                                            
TARALEN  DS    XL1                 ELEMENT LENGTH                               
TARAREV  DS    XL4                 REVISION #                                   
TARATYPE DS    XL1                 BILLING TYPE                                 
TARASTA1 DS    XL1                 STATUS 1                                     
TARASPRE EQU   X'80'               AGENCY IS PREMIUM SERVICE                    
TARASBTI EQU   X'40'               WAGE BREAK AT TIER LEVEL                     
TARASBFI EQU   X'20'               WAGE BREAK AT FICA LEVEL                     
TARASBNL EQU   X'10'               WAGE BREAK AT NO LEVEL                       
TARASB10 EQU   X'08'               LIKE BILLING TYPE 10                         
TARASB13 EQU   X'04'               LIKE BILLING TYPE 13                         
TARASB16 EQU   X'02'               LIKE BILLING TYPE 16                         
TARASTA2 DS    XL1                                                              
TARASSHD EQU   X'80'               BASIC HANDLING IN DOLLARS                    
TARASSCD EQU   X'40'               BASIC CAN HANDLING IN DOLLARS                
TARASSPD EQU   X'20'               PREM HANDLING IN DOLLARS                     
TARASFUD EQU   X'10'               FUTA IN DOLLARS                              
TARASSUD EQU   X'08'               SUTA IN DOLLARS                              
TARASFID EQU   X'04'               FICA IN DOLLARS                              
TARASMED EQU   X'02'               MEDICARE IN DOLLARS                          
TARASWCD EQU   X'01'               WC IN DOLLARS                                
         DS    XL1                                                              
TARASGNS DS    XL1                 SIGNATORY FEE STATUS                         
TARACOMM DS    CL1                 COMMISSION CALCULATION BASIS                 
TARACYES EQU   C'Y'                ALL (NOT INCL. T&H)                          
TARACPAY EQU   C'P'                PAY + H&W ONLY                               
TARACTNH EQU   C'T'                ALL + T&H                                    
TARACHND EQU   C'H'                ALL + HANDLING                               
TARACNO  EQU   C'N'                DON'T CALCULATE COMMISSION                   
TARACCLI EQU   C'C'                DON'T CALC AT THIS LEVEL (OK ON CLI)         
*                                  SESSION HANDLING FEE                         
TARAHFB  DS    XL4                 BASIC                                        
TARAHFBC DS    XL4                 BASIC CANADIAN                               
TARAHFP  DS    XL4                 PREMIUM                                      
*                                  REUSE HANDLING FEE                           
TARARFB  DS    XL4                 BASIC                                        
TARARFBC DS    XL4                 BASIC CANADIAN                               
TARARFP  DS    XL4                 PREMIUM                                      
*                                  TAXES                                        
TARATFU  DS    XL4                 FUTA                                         
TARATSU  DS    XL4                 SUTA                                         
TARATFI  DS    XL4                 FICA                                         
TARATM   DS    XL4                 MEDICARE                                     
TARATWC  DS    XL4                 WC                                           
         DS    XL20                SPARE                                        
*                                  APPLIED GUARANTEES                           
TARAGRUL DS    CL1                 RULE                                         
TARAGCAP DS    XL3                                                              
*                                  AGENCY FEES                                  
TARAAACO DS    XL2                 AGENCY COMMISSION RATE                       
TARAASFE DS    XL4                 SIGNATORY RATE                               
TARAASCA DS    XL4                 SIGNATORY CAP                                
TARAASIG DS    CL6                 SIGNATORY                                    
*##ASSOCIATED TARALEN                                                           
TARALNQ  EQU   *-TARAD                                                          
                                                                                
***********************************************************************         
*        <   > BILLING YTD ELEMENT                                    *         
***********************************************************************         
                                                                                
TABYD    DSECT                                                                  
TABYEL   DS    XL1                 ELEMENT CODE                                 
TABYELQ  EQU   X'86'                                                            
TABYLEN  DS    XL1                 ELEMENT LENGTH                               
TABYDATE DS    XL3                 BILL RUN DATE (PWOS)                         
TABYTIME DS    XL4                 BILL RUN TIME (PWOS)                         
TABYLVL  DS    CL1                 LOWEST LEVEL BILLED                          
         DS    CL2                                                              
TABYEARN DS    F                   YTD EARNINGS                                 
TABYSUI  DS    F                   YTD SUI EARNINGS                             
TABYTSUI DS    F                   THIS CHECK'S SUI EARNINGS                    
*##ASSOCIATED TABYLEN                                                           
TABYLNQ  EQU   *-TABYD                                                          
                                                                                
***********************************************************************         
*        <   > DEFAULT TO CLAIM CODE 1 ELEMENT                        *         
***********************************************************************         
                                                                                
TAC1D    DSECT                                                                  
TAC1EL   DS    XL1                 ELEMENT CODE                                 
TAC1ELQ  EQU   X'0F'                                                            
TAC1LEN  DS    XL1                 ELEMENT LENGTH                               
TAC1UNIT DS    CL3                 FEDERAL/PROVINCE CODE                        
TAC1DCC1 DS    XL4                 DEFAULT TO CLAIM CODE 1 VALUE                
*##ASSOCIATED TAC1LEN                                                           
TAC1LNQ  EQU   *-TAC1D                                                          
                                                                                
***********************************************************************         
*        <   > CAST DETAIL ELEMENT                                    *         
***********************************************************************         
                                                                                
TACAD    DSECT                                                                  
TACAEL   DS    XL1                 ELEMENT CODE                                 
TACAELQ  EQU   X'74'                                                            
TACALEN  DS    XL1                 ELEMENT LENGTH                               
TACARATE DS    H                   AGENT COMMISSION RATE                        
TACASTA3 DS    XL1                 3RD STATUS                                   
TACASXFT EQU   X'80'               DON'T APPLY TO FTRACK                        
TACASPPL EQU   X'40'               PAYROLL PLUS EMPLOYEE                        
TACASACT EQU   X'20'               ACTOR                                        
TACASNAC EQU   X'10'               NON-ACTOR                                    
TACASLCK EQU   X'08'               LOCKED                                       
TACASEQY EQU   X'04'               EQUITY PERFORMER                             
TACAONOF DS    CL3                 ON/OFF CAMERA                                
TACAUN   DS    CL3                 UNION                                        
TACALOCL DS    CL3                 LOCAL                                        
TACAYEAR DS    CL3                 DISPLAYABLE CONTRACT YEAR                    
TACAFRST DS    XL3                 FIRST SERVICES DATE                          
TACALAST DS    XL3                 LAST SERVICES DATE                           
TACAEXP  DS    XL3                 EXPIRATION DATE                              
TACASDTE DS    XL3                 SHOOT DATE                                   
TACANCDE DS    XL2                 AGENT CODE                                   
TACACORP DS    CL1                 CORPORATION NUMBER                           
TACAUNIT DS    CL3                 TAX UNIT CODE                                
TACAOV2  DS    XL4                 2ND OVERSCALE RATE FIELD                     
         ORG   TACAOV2                                                          
TACAWPCT DS    XL4                 SOAP WRITER ROLE PCT (3 DEC.)                
TACADBL  DS    CL1                 N'DOUBLES                                    
TACASTAT DS    XL1                 STATUS                                       
TACASTLF EQU   X'80'               ON LIFT                                      
TACASTLO EQU   X'40'               ONLY ON LIFT                                 
TACASTAG EQU   X'20'               CHECKS SHOULD GO TO AGENT                    
TACASXAC EQU   X'10'               DON'T APPLY FIX CYC GUAR AGAINST CBL         
TACASXAP EQU   X'08'               DON'T APPLY FIX CYC GUAR AGAINST PAX         
TACASTNF EQU   X'04'               DON'T WANT FIXED CYCLE TRACKING RPT          
TACASTAO EQU   X'01'               AGENT OVERRIDE FROM PAY                      
TACASTA2 DS    XL1                 2ND STATUS                                   
TACASTCR EQU   X'80'               PAY CANADIAN RATES                           
TACASTDP EQU   X'40'               DON'T PAY CANADIAN RATES                     
TACASCLB EQU   X'20'               CELEBRITY                                    
TACASFGR EQU   X'10'               NO FOREIGN USE                               
TACASINR EQU   X'08'               NO INDUSTRIAL USE                            
TACASINA EQU   X'04'               NO INTERACTIVE USE                           
TACASPUS EQU   X'02'               GRR AMOUNT DUE ONCE PER USE PER CYC          
TACASEUR EQU   X'01'               PAY PERFORMER IN EUROS                       
TACAPAYE DS    CL1                 PAYEE CODE                                   
TACAPAGT EQU   C'A'                AGENT                                        
TACAPCOM EQU   C'C'                COMM ONLY TO AGENT (CHK TO MODEL)            
TACAPMOD EQU   C'M'                MODEL                                        
TACAPPHO EQU   C'P'                PHOTOGRAPHER                                 
TACAEBAS DS    CL1                 EXPIRATION DATE BASIS                        
TACAEPUB EQU   C'P'                PUBLICATION DATE                             
TACAESHT EQU   C'S'                SHOOT DATE                                   
TACAFCYC DS    XL3                 FIRST FIXED CYCLE DATE                       
TACAGUA  DS    CL4                 GUARANTEE CODE                               
TACALFTF DS    XL4                 LIFTED FROM COMMERCIAL                       
TACARERC DS    XL3                 RERECORD DATE                                
TACATCOM DS    XL4                 TRANSFERRED FROM COMMERCIAL                  
TACATSEQ DS    XL2                 TRANSFERRED FROM CAST SEQ NUMBER             
TACASTA4 DS    XL1                 4TH STATUS                                   
TACAST2O EQU   X'80'               ONLY ON 2ND LIFT                             
TACAS2LF EQU   X'40'               ON 2ND LIFT                                  
TACASALL EQU   X'20'               ON LIFT AND 2ND LIFT                         
TACASL2O EQU   X'10'               ON LIFT AND 2ND LIFT ONLY                    
*##ASSOCIATED TACALEN                                                           
TACALNQ  EQU   *-TACAD                                                          
                                                                                
***********************************************************************         
*        <   > COMMERCIAL CONTRACT ELEMENT                            *         
***********************************************************************         
                                                                                
TACCD    DSECT                                                                  
TACCEL   DS    XL1                 ELEMENT CODE                                 
TACCELQ  EQU   X'75'                                                            
TACCLEN  DS    XL1                 ELEMENT LENGTH                               
         DS    CL1                 SPARE                                        
TACCNCON DS    XL1                 N'CONTRACTS                                  
TACCCON  DS    0CL12               CONTRACT NUMBER(S)                           
TACCDATA DS    0C                  CONTR NUMS + TRK,LFT,LEN,AFM BASIC           
*##ASSOCIATED TACCLEN                                                           
TACCLNQ  EQU   *-TACCD                                                          
                                                                                
***********************************************************************         
*        <   > CHECK DETAILS ELEMENT                                  *         
***********************************************************************         
                                                                                
TACDD    DSECT                                                                  
TACDEL   DS    XL1                 ELEMENT CODE                                 
TACDELQ  EQU   X'C1'                                                            
TACDLEN  DS    XL1                 ELEMENT LENGTH                               
TACDDTE  DS    XL3                 CHECK DATE                                   
TACDRUN  DS    XL3                 RUN DATE                                     
TACDCSH  DS    XL3                 DATE CASHED                                  
TACDBNK  DS    CL6                 BANK CODE                                    
TACDSTAT DS    XL1                 STATUS                                       
TACDSLIN EQU   X'80'               THIS CHECK WAS GENERATED BY A LIEN           
TACDSVOI EQU   X'40'               THIS CHECK HAS BEEN VOIDED                   
TACDSGRY EQU   X'20'               THIS CHECK CAME FROM GREY                    
TACDSFRC EQU   X'10'               CHECK DATE FORCED TO 12/31/(YEAR-1)          
TACDSSTA EQU   X'08'               THIS CHECK IS STALE DATED                    
TACDS2ND EQU   X'04'               THIS CHK FROM 2ND COMM OF SOC USE            
TACDSTRS EQU   X'02'               THIS CHK WAS GENERATED BY W4 TRUSTEE         
TACDHLDY EQU   X'01'               THIS CHK HAS A HOLIDAY TIMESHEET             
TACDSTA2 DS    XL1                 STATUS 2                                     
TACDSELN EQU   X'80'               EFT LIEN                                     
TACDSMSC EQU   X'40'               MULTI-CONTRACT SERVICE                       
TACDCHK  DS    CL8                 CHECK NUMBER                                 
TACDFREQ DS    CL1                 FREQUENCY CODE                               
TACDEARN DS    F                   FOR INDIVIDUALS: TAXABLE EARNINGS            
*                                     =TAPDPAYI-(SUM)TADWREC                    
TACDNTAX DS    F                   FOR CORPORATIONS: NON-TAXABLE                
*                                     EARNINGS PLUS REIMBURSED EXPENSES         
*                                     =TAPDPAYC+TAPDREXP-(SUM)TADWREC           
*                                  FOR INDIVIDUALS: REIMBURSED EXPENSES         
*                                     =TAPDREXP                                 
*                                  FOR P+: NON-TAXABLE REIMBURSEMENTS           
TACDNET  DS    F                   NET CHECK AMOUNT                             
TACDSEQ2 DS    F                   SEQ# FOR PREV YEAR WHEN TACDSFRC SET         
TACDYREX DS    F                   YTD REIMBURSED EXPENSES                      
TACDSEQ  DS    F                   SEQUENCE NUMBER (FIRST BYTE IS STAT)         
TACDSD30 EQU   X'20'               SPECIAL 12/30/YY OVERNIGHT                   
*                                    TO FIX YTD PROBLEM                         
TACDSQUR EQU   X'10'               CHECK WAS RUN DURING URGENT RUN              
*##ASSOCIATED TACDLEN                                                           
TACDLNQ  EQU   *-TACDD                                                          
                                                                                
***********************************************************************         
*        <   > CAST ERROR ELEMENT                                     *         
***********************************************************************         
                                                                                
TACED    DSECT                                                                  
TACEEL   DS    XL1                 ELEMENT CODE                                 
TACEELQ  EQU   X'F7'                                                            
TACELEN  DS    XL1                 ELEMENT LENGTH                               
TACEDATE DS    XL3                 DATE OF ERROR                                
TACETIME DS    XL3                 TIME OF ERROR                                
TACECYC  DS    0XL6                CYCLE DATES                                  
TACECYCS DS    XL3                 START DATE                                   
TACECYCE DS    XL3                 END DATE                                     
TACEINV  DS    XL6                 INVOICE NUMBER                               
TACEUSEQ DS    XL1                 USE CODE EQUATE                              
TACENUM  DS    XL1                 N'SUB-ELEMENTS                               
*##ASSOCIATED TACELEN                                                           
TACELNQ  EQU   *-TACED                                                          
TACEERR  DS    XL1                 ERROR CODE SUB-ELEMENT DEFINITIONS           
TACEESUB EQU   1                   SUBSEQUENT TRACKING - REC NOT DEL.           
TACEENTR EQU   2                   NO TRACKING RECORD TO DELETE                 
TACEENFT EQU   3                   NO FTRACK RECORD TO DELETE                   
TACEENFR EQU   4                   NO FTRACK REC TO RESTORE CREDITS TO          
TACEENEG EQU   5                   FTRACK BAL < 0 - CREDIT NOT RESTORED         
TACEEBAL EQU   6                   DELETED FTRACK REC ALREADY CREDITED          
TACEEFUL EQU   7                   COULDN'T RESTORE FULL APPLIED AMOUNT         
TACEEDUE EQU   8                   DUE COMPANY RECORD NOT FOUND                 
TACEEGRT EQU   9                   GRT REC NOT DELETED-INSTALLMENT PAID         
TACEEGRB EQU   10                  COULDN'T RESTORE INSTMNT AMT TO BAL          
TACEEFTK EQU   11                  ADDED CAST WITH EXISTING FTRACK RECS         
TACEXSUB DS    0C                  END OF SUB-ELEMENT                           
                                                                                
***********************************************************************         
*        <   > CLIENT INFORMATION ELEMENT                             *         
***********************************************************************         
                                                                                
TACID    DSECT                                                                  
TACIEL   DS    XL1                 ELEMENT CODE                                 
TACIELQ  EQU   X'2C'                                                            
TACILEN  DS    XL1                 ELEMENT LENGTH                               
TACICLG  DS    CL6                 CLIENT GROUP                                 
TACISTAT DS    XL1                 CLIENT STATUS                                
TACISLCK EQU   X'80'               LOCKED                                       
TACISCOD EQU   X'40'               C.O.D. CLIENT                                
TACIDCAE EQU   X'20'               DO NOT CLEAR ESTIMATE # ON ADVICE            
TACIHSNC EQU   X'10'               TAAYHSNC - PAP*ELEC NO CHANGES               
TACIHSEL EQU   X'08'               TAAYHSEL - ELECTRONIC ONLY                   
TACIHSPE EQU   X'04'               TAAYHSPE - PAPER AND ELECTRONIC              
TACIHSPO EQU   X'02'               TAAYHSPO - PAPER ONLY                        
TACIJPCY EQU   X'01'               TAAYJPCY - CAN CHARGE JPC CSF                
TACISTA2 DS    XL1                 CLIENT STATUS 2                              
TACIJPCN EQU   X'80'               DON'T CHARGE JPC CSF                         
TACISPLH EQU   X'40'               CHLOE, SEPARATE HANDLING                     
TACICIHR EQU   X'20'               ENABLED FOR CERNO PAY/RELEASE                
TACISTCA EQU   X'10'               PRINT ACOPY IN CANADIAN DOLLARS              
TACISREG EQU   X'08'               REGRESSION TESTING CLIENT                    
TACITID  DS    XL2                 USER ID OF TPC                               
TACITPC  DS    CL8                 DEFAULT TALENT PAYMENT COORDINATOR           
*##ASSOCIATED TACILEN                                                           
TACILNQ  EQU   *-TACID                                                          
                                                                                
***********************************************************************         
*        <   > VARIABLE LENGTH COMMENT ELEMENT                        *         
***********************************************************************         
                                                                                
TACMD    DSECT                                                                  
TACMEL   DS    XL1                 ELEMENT CODE                                 
TACMELQ  EQU   X'8D'                                                            
TACMLEN  DS    XL1                 ELEMENT LENGTH                               
TACMTYPE DS    CL1                 COMMENT TYPE                                 
TACMTYPA EQU   C'A'                APPLY COMMENT (ADVICE)                       
TACMTBRA EQU   C'B'                BRATE COMMENT                                
TACMTYPC EQU   C'C'                CHECK                                        
TACMTYPD EQU   C'D'                ROLE DESCRIPTION (CAST)                      
TACMTYPF EQU   C'F'                FILENAME                                     
TACMTYPG EQU   C'G'                GENERAL                                      
TACMTYPH EQU   C'H'                PAYMENT HISTORY                              
TACMTYPI EQU   C'I'                E-MAIL ADDRESS                               
TACMTYPL EQU   C'L'                LIEN CASE/ACCOUNT#                           
TACMTYPM EQU   C'M'                MUSIC USE COMMENT (ADVICE)                   
TACMTYPR EQU   C'R'                RETURNED CHECK (RCHECK)                      
TACMTYPS EQU   C'S'                SOAP RESIDUALS PAY EPIS INPUT                
TACMTYPT EQU   C'T'                LIEN TYPE                                    
TACMTYPU EQU   C'U'                USE COMMENT (ADVICE)                         
TACMTYPX EQU   C'X'                EXTRA COMMERCIAL COMMENT                     
TACMCOMM DS    0CL180              VARIABLE LENGTH COMMENT                      
*##ASSOCIATED TACMLEN                                                           
TACMLNQ  EQU   *-TACMD                                                          
                                                                                
***********************************************************************         
*        <   > CHECK STOP/PULL CANCEL ELEMENT                         *         
***********************************************************************         
                                                                                
TACND    DSECT                                                                  
TACNEL   DS    XL1                 ELEMENT CODE                                 
TACNELQ  EQU   X'BD'                                                            
TACNLEN  DS    XL1                 ELEMENT LENGTH                               
TACNTYPE DS    XL1                 ELEMENT TYPE                                 
TACNTYPP EQU   C'P'                CHECK PULL CANCEL                            
TACNTYPS EQU   C'S'                CHECK STOP CANCEL                            
TACNBY   DS    XL8                 CANCELLED BY                                 
TACNDT   DS    XL3                 CANCELLED DATE                               
*##ASSOCIATED TACNLEN                                                           
TACNLNQ  EQU   *-TACND                                                          
                                                                                
***********************************************************************         
*        <   > COMMERCIAL DETAILS ELEMENT                             *         
***********************************************************************         
                                                                                
TACOD    DSECT                                                                  
TACOEL   DS    XL1                 ELEMENT CODE                                 
TACOELQ  EQU   X'72'                                                            
TACOLEN  DS    XL1                 ELEMENT LENGTH                               
TACOCONT DS    CL1                 CONTRACT TYPE                                
TACOCID  DS    CL12                COMMERCIAL ID                                
TACOFCYC DS    XL3                 FIRST FIXED CYCLE DATE                       
TACOAIR  DS    XL3                 FIRST AIR DATE                               
TACOEXP  DS    XL3                 EXPIRATION DATE                              
TACOVDTE DS    XL3                 CAST VERIFICATION DATE                       
TACOVSTU DS    XL2                 USER ID OF CAST VERIFIER                     
TACOVST  DS    CL8                 CAST VERIFIER STAFF ID                       
TACODUB  DS    XL3                 DUB DATE                                     
TACOUVST DS    XL1                 UNVERIFICATION STATUS                        
TACOUVCO EQU   X'80'               UNVERIFIED BY COMMERCIAL                     
TACOUVMU EQU   X'40'                             MUSICIAN                       
TACOUVNM EQU   X'20'                             NON - MUSICIAN                 
TACOUVER EQU   X'10'               COMML WAS VERIFIED (ONCE)                    
TACOSPCY DS    CL1                 SPLIT CYCLES?                                
TACOSES  DS    CL1                 SESSION TYPE (MUSIC)                         
TACOSESD EQU   C'D'                DEMO                                         
TACOSESF EQU   C'F'                FINAL                                        
TACOSESM EQU   C'M'                MASTER RECORDING                             
TACOSEST EQU   C'T'                TEST MARKET                                  
TACOCLG  DS    CL6                 CLIENT GROUP                                 
TACOMED  DS    CL1                 MEDIA                                        
TACOMEDC EQU   C'C'                CABLE                                        
TACOMEDE EQU   C'E'                EVENT                                        
TACOMEDI EQU   C'I'                INTERNET                                     
TACOMEDN EQU   C'N'                NEW MEDIA                                    
TACOMEDO EQU   C'O'                OTHERS                                       
TACOMEDP EQU   C'P'                PRINT                                        
TACOMEDR EQU   C'R'                RADIO                                        
TACOMEDT EQU   C'T'                TELEVISION                                   
TACOADST DS    CL2                 ADDENDUM STATE                               
TACOSEC  DS    XL1                 LENGTH IN SECONDS                            
TACOCTYP DS    CL1                 ACTRA TYPE                                   
TACOTYPE DS    CL1                 COMMERCIAL TYPE                              
TACOSTA2 DS    XL1                 STATUS BITS                                  
TACOSANO EQU   X'80'               ANNOUNCER IS ONLY NON-MUSICIAN               
TACOSLFT EQU   X'40'               SOME CAST MEMBERS ON THE LIFT                
TACOCHHF EQU   X'20'               COMM'L/CAST CHANGED SINCE LAST HF            
TACOHFUP EQU   X'10'               LAST HOLDING FEE WAS IN UPDATE RUN           
TACOLHFS EQU   X'08'               LAST HOLDING FEE WAS RUN SOON                
TACOPCYC EQU   X'04'               PER CYCLE COMMERCIAL                         
TACOSJPC EQU   X'02'               JPC CONTRACT SERVICE FEE PAID                
TACOSNCS EQU   X'01'               DO NOT CHARGE JPC CSF ON THIS COMML          
TACOPDTE DS    XL3                 LAST PAID DATE                               
TACOSAIR DS    XL3                 SECOND SEASON FIRST AIR DATE                 
TACOTID  DS    CL2                 TRACK ID                                     
TACOTLN  DS    XL1                 TRACK LENGTH                                 
TACOAFM  DS    CL1                 AFM RATE                                     
TACOATT  DS    CL2                 ATTENTION CODE (BILL-TO)                     
TACOSTAT DS    XL1                 STATUS                                       
TACOSTLO EQU   X'80'               LOCKED                                       
TACOSTNO EQU   X'40'               NO HOLDING FEE                               
TACOSTRL EQU   X'20'               RELEASED                                     
TACOSCAN EQU   X'10'               CANADIAN DOLLARS                             
TACOSCRT EQU   X'08'               CANADIAN RATES                               
TACOSWDT EQU   X'04'               WORK DATE ON CHECKS                          
TACOSRES EQU   X'02'               SOAP RESIDUALS                               
TACOSPRT EQU   X'01'               BILLING DISPLAYS AS PRINT COMM'L             
*##ASSOCIATED TACOLEN                                                           
TACOLNQ  EQU   *-TACOD                                                          
TACOEDT  DS    CL6                 EDIT TYPE                                    
TACOACT  DS    XL3                 ACTIVE DATE                                  
TACOINAC DS    XL3                 INACTIVE DATE                                
TACOBPRD DS    CL6                 BRAND PRODUCT                                
TACOCGRP DS    CL6                 COMMERCIAL GROUP                             
TACOEDYR DS    XL1                 EDIT TYPE YEAR                               
TACOAUSE DS    XL1                 ALLOWABLE USES                               
TACORUSE DS    XL1                 REMAINING FREE USES                          
TACOAEXP DS    XL3                 ACTRA EXPIRATION DATE (FOR 2404A)            
TACOSTA3 DS    XL1                 STATUS                                       
TACOSNHF EQU   X'80'               NO HOLDING FEE NOTICES                       
TACOS26K EQU   X'40'               SPECIAL OFFERS & PROMOTIONS VERSION          
TACOSSMW EQU   X'20'               SOCIAL MEDIA WAIVER                          
*##ASSOCIATED TACOLEN                                                           
TACOLNQ2 EQU   *-TACOD                                                          
TACOVTIM DS    XL3                 VERIFICATION TIME                            
         DS    XL20                                                             
TACOLNQ3 EQU   *-TACOD                                                          
                                                                                
***********************************************************************         
*        <   > COMMERCIAL PUBLISHED MUSIC ELEMENT                     *         
***********************************************************************         
                                                                                
TACPD    DSECT                                                                  
TACPEL   DS    XL1                 ELEMENT CODE                                 
TACPELQ  EQU   X'7E'                                                            
TACPLEN  DS    XL1                 ELEMENT LENGTH                               
TACPMUS  DS    CL8                 MUSIC CODE                                   
*##ASSOCIATED TACPLEN                                                           
TACPLNQ  EQU   *-TACPD                                                          
                                                                                
***********************************************************************         
*        <   > QTD WITHHOLDING ELEMENT                                *         
***********************************************************************         
                                                                                
TACQD    DSECT                                                                  
TACQEL   DS    XL1                 ELEMENT CODE                                 
TACQELQ  EQU   X'CC'                                                            
TACQLEN  DS    XL1                 ELEMENT LENGTH                               
TACQUNIT DS    CL3                 TAX UNIT                                     
         DS    CL3                                                              
TACQAMTS DS    0CL20               QTD AMOUNTS                                  
TACQTAX  DS    F                   TAXES                                        
TACQFICA DS    F                   FICA     (FEDERAL)                           
TACQMED  DS    F                   MEDICARE (FEDERAL)                           
         ORG   *-8                                                              
TACQSDI  DS    F                   DISABILITY INSURANCE   (STATE)               
TACQSUI  DS    F                   UNEMPLOYMENT INSURANCE (STATE)               
         ORG   *-8                                                              
TACQPST  DS    F                   PROVINCIAL SERVICE TAX    (CANADA)           
TACQGST  DS    F                   GOODS & SERVICES TAX PAID (CANADA)           
*                                                                               
TACQEARN DS    F                   EARNINGS                                     
TACQSFLI DS    F                   FAMILY LEAVE INSURANCE (STATE)               
*##ASSOCIATED TACYLEN                                                           
TACQLNQ  EQU   *-TACQD                                                          
TACQTSDI DS    F                   TAXABLE DISABILITY INSURANCE                 
TACQLN2Q EQU   *-TACQD                                                          
                                                                                
***********************************************************************         
*        <   > APPLIED CREDIT HISTORY ELEMENT                         *         
***********************************************************************         
                                                                                
TACRD    DSECT                                                                  
TACREL   DS    XL1                 ELEMENT CODE                                 
TACRELQ  EQU   X'68'                                                            
TACRLEN  DS    XL1                 ELEMENT LENGTH                               
TACRSTRT DS    XL3                 CYCLE START DATE                             
TACREND  DS    XL3                 CYCLE END DATE                               
TACRSCAL DS    F                   SCALE AMOUNT OR PERF RATE FOR SOAPS          
TACRAPPL DS    F                   AMOUNT TO BE APPLIED                         
TACRBAL  DS    F                   BALANCE                                      
TACRLPG  DS    XL1                 LAST PAGE PRINTED (FXD CYC GUAR TRK)         
TACRSTAT DS    XL1                 STATUS                                       
TACRSTRK EQU   X'80'               TRACKING ENABLED                             
TACRSGUA EQU   X'40'               IS A GUARANTEE                               
TACRSSEA EQU   X'20'               SEASON COMMERCIAL                            
TACRHDLR EQU   X'10'               HOLDING FEE ADDED BY DEALER PAYMENT          
TACRRFIX EQU   X'08'               ADJUSTED BY RETRO FILE FIX                   
TACRUSE  DS    CL3                 USE CODE                                     
TACRINV  DS    XL6                 INVOICE NUMBER                               
TACRTYPE DS    XL1                 TYPE OF PAYMENT FOR USE                      
*##ASSOCIATED TACRLEN                                                           
TACRLNQ  EQU   *-TACRD                                                          
                                                                                
***********************************************************************         
*        <   > COMMERCIAL STUDIO ELEMENT                              *         
***********************************************************************         
                                                                                
TACSD    DSECT                                                                  
TACSEL   DS    XL1                 ELEMENT CODE                                 
TACSELQ  EQU   X'73'                                                            
TACSLEN  DS    XL1                 ELEMENT LENGTH                               
TACSTYPE DS    CL1                 TYPE                                         
TACSTYPF EQU   C'F'                FILM                                         
TACSTYPM EQU   C'M'                MUSIC                                        
TACSTYPR EQU   C'R'                RECORD                                       
TACSTYPS EQU   C'S'                SHOOT                                        
         DS    CL1                 N/D                                          
TACSDATE DS    XL3                 DATE                                         
TACSSTUD DS    CL12                STUDIO                                       
TACSCITY DS    CL12                CITY                                         
TACSSTAT DS    CL2                 STATE                                        
*##ASSOCIATED TACSLEN                                                           
TACSLNQ  EQU   *-TACSD                                                          
                                                                                
***********************************************************************         
*        <   > CLIENT ELEMENT                                         *         
***********************************************************************         
                                                                                
TACTD    DSECT                                                                  
TACTEL   DS    XL1                 ELEMENT CODE                                 
TACTELQ  EQU   X'37'                                                            
TACTLEN  DS    XL1                 ELEMENT LENGTH                               
TACTCLI  DS    CL6                 CLIENT CODE                                  
*##ASSOCIATED TACTLEN                                                           
TACTLNQ  EQU   *-TACTD                                                          
                                                                                
***********************************************************************         
*        <   > CONVERSION ELEMENT                                     *         
***********************************************************************         
                                                                                
TACVD    DSECT                                                                  
TACVEL   DS    XL1                 ELEMENT CODE                                 
TACVELQ  EQU   X'F0'                                                            
TACVLEN  DS    XL1                 ELEMENT LENGTH                               
TACVTYPE DS    CL1                 TYPE                                         
*                                  B=BURNETT CONVERSION                         
*                                  C=OLD COMMERCIAL NUMBER                      
*                                  L=OLD LEDGER AND OFFICE                      
*                                  P=OLD PRODUCT                                
*                                  S=OLD (EMP) AND SS NUMBER (W4)               
TACVDATA DS    0C                  DATA BASED ON TYPE                           
*##ASSOCIATED TACVLEN                                                           
TACVLNQ  EQU   *-TACVD                                                          
                                                                                
***********************************************************************         
*        <   > CHECK WITHHOLDING ELEMENT                              *         
***********************************************************************         
                                                                                
TACWD    DSECT                                                                  
TACWEL   DS    XL1                 ELEMENT CODE                                 
TACWELQ  EQU   X'C2'                                                            
TACWLEN  DS    XL1                 ELEMENT LENGTH                               
TACWUNIT DS    CL3                 UNIT CODE                                    
TACWMST  DS    CL1                 MARITAL STATUS 1=MARRD 2=SINGLE 3=HH         
TACWEXS  DS    CL2                 EXEMPTIONS                                   
TACWSTAT DS    XL1                 STATUS                                       
TACWSRES EQU   X'80'               RESIDENCE INDICATOR                          
TACWSWRK EQU   X'40'               WORKING INDICATOR                            
TACWSTAX EQU   X'20'               TAXABLE INDICATOR                            
TACWSDEF EQU   X'10'               DEFAULT STATE INDICATOR                      
TACWNCRP EQU   X'08'               NON-RESIDENT CORPORATION                     
TACWNFOR EQU   X'04'               NON-RESIDENT FOREIGNER                       
         DS    CL3                                                              
         DS    0F                                                               
TACWWHLD DS    0CL20               EMPLOYEE WITHHOLDINGS                        
TACWTAX  DS    F                   TAXES (ALL)                                  
         DS    F                   N/D   (ALL)                                  
TACWFICA DS    F                   FICA     (FEDERAL)                           
TACWMED  DS    F                   MEDICARE (FEDERAL)                           
         ORG   *-8                                                              
TACWSDI  DS    F                   DISABILITY INSURANCE   (STATE)               
TACWSUI  DS    F                   UNEMPLOYMENT INSURANCE (STATE)               
         ORG   *-8                                                              
TACWRTX  DS    F                   RESIDENT CITY TAX (CITY)                     
         DS    F                                                                
         ORG   *-8                                                              
TACWINR  DS    F                   INSURANCE & RETIREMENT     (CANADA)          
TACWGST  DS    F                   GOODS & SERVICES TAX PAID  (CANADA)          
TACWLNQ  EQU   *-TACWD                                                          
*                                                                               
TACWSFLI DS    F                   FAMILY LEAVE INSURANCE (STATE)               
*##ASSOCIATED TACWLEN                                                           
TACWLN2Q EQU   *-TACWD                                                          
*                                                                               
TACWPFTX DS    F                   FEDERAL TAX (STATE/CITY)                     
TACWPFFI DS    F                   FICA (STATE/CITY)                            
*##ASSOCIATED TACWLEN                                                           
TACWLN3Q EQU   *-TACWD                                                          
*                                                                               
TACWPSTX DS    F                   STATE TAX (CITY)                             
TACWPSDI DS    F                   DISABILITY INSURANCE   (CITY)                
TACWPSUI DS    F                   UNEMPLOYMENT INSURANCE (CITY)                
TACWPFLI DS    F                   FAMILY LEAVE INSURANCE (CITY)                
*##ASSOCIATED TACWLEN                                                           
TACWLN4Q EQU   *-TACWD                                                          
*                                                                               
***********************************************************************         
*        <   > CHECK EXTRA DETAILS ELEMENT                            *         
***********************************************************************         
                                                                                
TACXD    DSECT                                                                  
TACXEL   DS    XL1                 ELEMENT CODE                                 
TACXELQ  EQU   X'C8'                                                            
TACXLEN  DS    XL1                 ELEMENT LENGTH                               
         DS    CL2                                                              
TACXGST  DS    F                   GOODS & SERVICES TAX DUE                     
TACXGSTY DS    F                   GOODS & SERVICES TAX DUE YTD                 
TACXPST  DS    F                   PROVINCIAL SERVICES TAX DUE                  
TACXPSTY DS    F                   PROVINCIAL SERVICES TAX DUE YTD              
TACXMDDY DS    F                   MISC DEDUCTION YTD                           
TACXMTRY DS    F                   MPTRP YTD                                    
TACXDTPY DS    F                   MONIES DUE TP YTD                            
TACXPRCY DS    F                   PERMANENT CHARITIES YTD                      
TACXLIEY DS    F                   LIENS / GARNISHMENTS YTD                     
TACXUNDY DS    F                   UNION DUES YTD                               
TACXTRSY DS    F                   TRUST YTD                                    
TACXDRTY DS    F                   DIRECT DEPOSIT YTD                           
TACXWRDY DS    F                   WIRED YTD                                    
TACXPPAC DS    F                   PAYROLL PLUS AGENCY COMMISSION YTD           
TACXLNQ  EQU   *-TACXD                                                          
TACXDTPT DS    F                   MONIES DUE TP YTD TAX REIM                   
TACXDTPN DS    F                   MONIES DUE TP YTD NON TAX REIM               
*##ASSOCIATED TACXLEN                                                           
TACXLNQ2 EQU   *-TACXD                                                          
                                                                                
***********************************************************************         
*        <   > YTD WITHHOLDING ELEMENT                                *         
***********************************************************************         
                                                                                
TACYD    DSECT                                                                  
TACYEL   DS    XL1                 ELEMENT CODE                                 
TACYELQ  EQU   X'C6'                                                            
TACYLEN  DS    XL1                 ELEMENT LENGTH                               
TACYUNIT DS    CL3                 TAX UNIT                                     
         DS    CL3                                                              
TACYAMTS DS    0CL20               YTD AMOUNTS                                  
TACYTAX  DS    F                   TAXES                                        
TACYFICA DS    F                   FICA     (FEDERAL)                           
TACYMED  DS    F                   MEDICARE (FEDERAL)                           
         ORG   *-8                                                              
TACYSDI  DS    F                   DISABILITY INSURANCE   (STATE)               
TACYSUI  DS    F                   UNEMPLOYMENT INSURANCE (STATE)               
         ORG   *-8                                                              
TACYPST  DS    F                   PROVINCIAL SERVICE TAX    (CANADA)           
TACYGST  DS    F                   GOODS & SERVICES TAX PAID (CANADA)           
*                                                                               
TACYEARN DS    F                   EARNINGS                                     
*##ASSOCIATED TACYLEN                                                           
TACYLNQ  EQU   *-TACYD                                                          
*                                                                               
TACYSFLI DS    F                   FAMILY LEAVE INSURANCE (STATE)               
TACYLN2Q EQU   *-TACYD                                                          
*                                                                               
TACYTXRE DS    F                   TAXABLE REIMBURSEMENTS                       
TACYNTRE DS    F                   NON-TAXABLE REIMBURSEMENTS                   
*##ASSOCIATED TACYLEN                                                           
TACYLN3Q EQU   *-TACYD                                                          
*                                                                               
TACYTSUI DS    F                   TAXABLE SUI AMOUNT AT THIS LEVEL             
TACYYSUI DS    F                   YTD SUI AMOUNT                               
*##ASSOCIATED TACYLEN                                                           
TACYLN4Q EQU   *-TACYD                                                          
*                                                                               
TACYCTXR DS    F                   CANADIAN TAXABLE REIMBURSEMENTS              
TACYCNTR DS    F                   CANADIAN NON-TAXABLE REIMBURSEMENTS          
TACYCERN DS    F                   CANADIAN EARNINGS                            
TACYCAMT DS    0CL32               YTD AMOUNTS P+ CANADIAN                      
TACYUTAX DS    F                   TAXES                                        
TACYUPP  DS    F                   PENSION PLAN                                 
TACYUEI  DS    F                   EMP INSURANCE                                
TACYUPIP DS    F                   PARENTAL PLAN                                
TACYCTAX DS    F                   TAXES CAD                                    
TACYCPP  DS    F                   PENSION PLAN CAD                             
TACYCEI  DS    F                   EMP INSURANCE CAD                            
TACYCPIP DS    F                   PARENTAL PLAN CAD                            
TACYLN5Q EQU   *-TACYD                                                          
TACYFERN DS    F                   FEDERAL EARNINGS AT PROV LEVEL               
TACYLN6Q EQU   *-TACYD                                                          
                                                                                
***********************************************************************         
*        <   > TD1 ELEMENT                                                      
***********************************************************************         
                                                                                
TAD1D    DSECT                                                                  
TAD1EL   DS    XL1                 ELEMENT CODE                                 
TAD1ELQ  EQU   X'06'                                                            
TAD1LEN  DS    XL1                 ELEMENT LENGTH                               
TAD1STAT DS    XL1                 STATUS                                       
TAD1SCAN EQU   X'80'               CANADIAN FEDERAL                             
TAD1SPRO EQU   X'40'               PROVINCIAL                                   
TAD1SEXM EQU   X'20'               EXEMPT                                       
TAD1SCC1 EQU   X'10'               DEFAULT TO CLAIM CODE 1                      
TAD1SEHC EQU   X'08'               EXEMPT FROM HEALTH CONTRIBUTIONS             
TAD1SECP EQU   X'04'               EXEMPT FROM CPP                              
TAD1NCL1 DS    F                   NET CLAIM                                    
TAD1PZON DS    F                   PRESCRIBED ZONE                              
         DS    F                                                                
         DS    F                                                                
TAD1HOUS DS    F                   HOUSING DEDUCTION                            
TAD1SPRT DS    F                   SUPPORT PAYMENT                              
         DS    XL12                                                             
*##ASSOCIATED TAD1LEN                                                           
TAD1LNQ  EQU   *-TAD1D                                                          
                                                                                
***********************************************************************         
*        <   > DELETE COUNT ELEMENT                                   *         
***********************************************************************         
                                                                                
TADCD    DSECT                                                                  
TADCEL   DS    XL1                 ELEMENT CODE                                 
TADCELQ  EQU   X'04'                                                            
TADCLEN  DS    XL1                 ELEMENT LENGTH                               
TADCTYPE DS    CL1                 TYPE                                         
TADCTKP  EQU   C'K'                GENERATED BY CKPURGE/REPORT                  
TADCTCP  EQU   C'C'                GENERATED BY COPURGE/REPORT                  
TADCDATE DS    XL3                 DATE                                         
TADCCNT  DS    XL4                 RECORD COUNT                                 
TADCPGS  DS    XL2                 PAGE COUNT                                   
*##ASSOCIATED TADCLEN                                                           
TADCLNQ  EQU   *-TADCD                                                          
                                                                                
***********************************************************************         
*        <   > DUE DATE ELEMENT                                       *         
***********************************************************************         
                                                                                
TADDD    DSECT                                                                  
TADDEL   DS    XL1                 ELEMENT CODE                                 
TADDELQ  EQU   X'93'                                                            
TADDLEN  DS    XL1                 ELEMENT LENGTH                               
TADDDATE DS    XL3                 DUE DATE                                     
TADDPREV DS    XL3                 PREVIOUS DUE DATE                            
         ORG   TADDPREV                                                         
TADDDATM DS    XL3                 MUSIC DUE DATE (FOR ADVICES)                 
TADDCHNG DS    XL3                 DATE OF LAST CHANGE                          
TADDOVRD DS    XL3                 ORIGINAL OVERRIDEN DUE DATE                  
*##ASSOCIATED TADDLEN                                                           
TADDLNQ  EQU   *-TADDD                                                          
                                                                                
***********************************************************************         
*        <   > DEAL ELEMENT (PRINT)                                   *         
***********************************************************************         
                                                                                
TADLD    DSECT                                                                  
TADLEL   DS    XL1                 ELEMENT CODE                                 
TADLELQ  EQU   X'77'                                                            
TADLLEN  DS    XL1                 ELEMENT LENGTH                               
TADLAREA DS    CL3                 AREA                                         
TADLUSE  DS    CL3                 USE                                          
TADLAMT  DS    F                   AMOUNT                                       
TADLRATE DS    H                   AGENT COMMISSION RATE                        
TADLTERM DS    XL1                 TERM (N'MONTHS)                              
TADLTUNL EQU   X'FF'               UNLIMITED USE                                
TADLT1X  EQU   X'FE'               ONE TIME ONLY                                
TADLPUB  DS    XL3                 PUBLICATION DATE                             
TADLEXP  DS    XL3                 EXPIRATION DATE                              
         DS    CL1                 WAS EXP DATE BASIS (SEE TACAEBAS)            
*##ASSOCIATED TADLLEN                                                           
TADLLNQ  EQU   *-TADLD                                                          
                                                                                
***********************************************************************         
*        <   > DUE COMPANY LETTER ELEMENT                             *         
***********************************************************************         
                                                                                
TADRD    DSECT                                                                  
TADREL   DS    XL1                 ELEMENT CODE                                 
TADRELQ  EQU   X'54'                                                            
TADRLEN  DS    XL1                 ELEMENT LENGTH                               
TADRUSE  DS    CL3                 USE TYPE                                     
TADRCID  DS    CL12                COMMERCIAL ID                                
TADRCYC  DS    0XL6                CYCLE DATES                                  
TADRCYCS DS    XL3                 CYCLE START                                  
TADRCYCE DS    XL3                 CYCLE END                                    
         DS    CL5                 N/D                                          
TADREARN DS    F                   GROSS EARNINGS                               
TADRNET  DS    F                   NET AMOUNT                                   
TADRCHK  DS    CL8                 CHECK NUMBER                                 
TADRDTE  DS    XL3                 CHECK DATE                                   
TADRNCDE DS    XL2                 AGENT CODE                                   
         DS    CL2                 N/D                                          
TADRPDTE DS    XL3                 DATE PRINTED                                 
TADRUID  DS    XL2                 USER ID                                      
TADRSTAF DS    CL8                 STAFF ID OF PAYER                            
         DS    CL10                N/D                                          
*##ASSOCIATED TADRLEN                                                           
TADRLNQ  EQU   *-TADRD                                                          
                                                                                
***********************************************************************         
*        <   > DUE COMPANY DETAILS ELEMENT                            *         
***********************************************************************         
                                                                                
TADUD    DSECT                                                                  
TADUEL   DS    XL1                 ELEMENT CODE                                 
TADUELQ  EQU   X'51'                                                            
TADULEN  DS    XL1                 ELEMENT LENGTH                               
TADUAGY  DS    CL6                 ERROR AGENCY                                 
TADUINV  DS    XL6                 ERROR INVOICE NUMBER                         
TADUCINV DS    XL6                 CREDIT INVOICE NUMBER                        
TADUFCLI DS    CL6                 CLIENT FILTER FOR RECOVERY                   
TADUTYPE DS    CL1                 TYPE                                         
TADUTYAY EQU   C'A'                AGENCY ERROR                                 
TADUTYDU EQU   C'D'                DUE COMPANY                                  
TADUSTAT DS    XL1                 STATUS                                       
TADUSAGY EQU   X'80'               COLLECT ONLY FROM AGENCY                     
TADUSCLI EQU   X'40'               COLLECT ONLY FROM CLIENT                     
TADUSAUT EQU   X'20'               GENERATED AUTOMATICALLY BY PAY               
TADUSCAN EQU   X'10'               CANADIAN DOLLARS                             
TADUSHLD EQU   X'08'               ON HOLD - AWAITING APPROVAL                  
TADUSLCK EQU   X'04'               LOCKED  - AWAITING DLETTER RESPONSE          
TADUSEUR EQU   X'02'               EUROS                                        
TADUSNTR EQU   X'01'               NON-TAXABLE REIMBURSEMENTS                   
TADUDUE  DS    F                   AMOUNT DUE                                   
TADUCOL  DS    F                   COLLECTED AMOUNT                             
TADUPCT  DS    XL2                 DEDUCTION PERCENTAGE                         
TADUUNI  DS    CL3                 UNION                                        
TADUEMP  DS    CL3                 EMPLOYER                                     
TADUAYFL DS    CL8                 AGENCY FLIST CODE                            
TADUCLFL DS    CL8                 CLIENT FLIST CODE                            
TADUSTA2 DS    XL1                 STATUS 2                                     
TADUSTXR EQU   X'80'               TAXABLE REIMBURSEMENTS                       
*##ASSOCIATED TADULEN                                                           
TADULNQ  EQU   *-TADUD                                                          
                                                                                
***********************************************************************         
*        <   > TALENT ADVICE DETAILS ELEMENT                          *         
***********************************************************************         
                                                                                
TADVD    DSECT                                                                  
TADVEL   DS    XL1                 ELEMENT CODE                                 
TADVELQ  EQU   X'D1'                                                            
TADVLEN  DS    XL1                 ELEMENT LENGTH                               
TADVOFF  DS    CL1                 TALENT PARTNERS OFFICE                       
TADVSTAT DS    XL1                 STATUS                                       
TADVSVER EQU   X'80'               VERIFIED                                     
TADVSSNT EQU   X'40'               SENT                                         
TADVSRCV EQU   X'20'               RECEIVED                                     
TADVSPAY EQU   X'10'               PAID                                         
TADVSCMP EQU   X'08'               COMPLETE                                     
TADVVINF DS    0CL16               VERIFY INFO                                  
TADVVID  DS    H                   USERID                                       
TADVVST  DS    CL8                 STAFF                                        
TADVVDTE DS    XL3                 DATE                                         
TADVVTIM DS    XL3                 TIME                                         
TADVSINF DS    0CL16               SENDER INFO                                  
TADVSID  DS    H                   USERID                                       
TADVSST  DS    CL8                 STAFF                                        
TADVSDTE DS    XL3                 DATE                                         
TADVSTIM DS    XL3                 TIME                                         
TADVRINF DS    0CL16               RECEIVER INFO                                
TADVRID  DS    H                   USERID                                       
TADVRST  DS    CL8                 STAFF                                        
TADVRDTE DS    XL3                 DATE                                         
TADVRTIM DS    XL3                 TIME                                         
TADVTYPE DS    CL1                 ADVICE TYPE                                  
TADVTYPA EQU   C'A'                ADDENDUM                                     
TADVTYPB EQU   C'B'                CABLE                                        
TADVTYPC EQU   C'C'                CLASS A                                      
TADVTYPD EQU   C'D'                RADIO                                        
TADVTYPI EQU   C'I'                INTERNET/NEWMEDIA                            
TADVTYPN EQU   C'N'                CANADIAN                                     
TADVTYPP EQU   C'P'                SPANISH                                      
TADVTYPR EQU   C'R'                REUSE                                        
TADVTYPS EQU   C'S'                SESSION                                      
TADVTYPT EQU   C'T'                TELEVISION                                   
TADVPINF DS    0CL6                PAID INFO                                    
TADVPDTE DS    XL3                 DATE                                         
TADVPTIM DS    XL3                 TIME                                         
TADVOFF2 DS    CL1                 OFFICE CODE OVERRIDE                         
TADVSEC  DS    XL1                 COMMERCIAL LENGTH IN SECONDS                 
TADVEXP  DS    XL3                 COMMERCIAL EXPIRATION DATE                   
TADVCLI  DS    CL6                 CLIENT CODE                                  
*##ASSOCIATED TADVLEN                                                           
TADVLNQ  EQU   *-TADVD                                                          
                                                                                
***********************************************************************         
*        <   > DUE COMPANY WITHHOLDING ELEMENT                        *         
***********************************************************************         
                                                                                
TADWD    DSECT                                                                  
TADWEL   DS    XL1                 ELEMENT CODE                                 
TADWELQ  EQU   X'C3'                                                            
TADWLEN  DS    XL1                 ELEMENT LENGTH                               
TADWDUC  DS    CL6                 DUE COMPANY CODE                             
TADWREC  DS    F                   AMOUNT RECOVERED                             
TADWBAL  DS    F                   BALANCE REMAINING                            
TADWSTAT DS    X                   STATUS                                       
TADWSTR  EQU   X'80'               TAXABLE REIMBURSEMENTS                       
TADWSNR  EQU   X'40'               NON TAXABLE REIMBURSEMENTS                   
*##ASSOCIATED TADWLEN                                                           
TADWLNQ  EQU   *-TADWD                                                          
                                                                                
***********************************************************************         
*        <   > DUMMY ELEMENT                                          *         
***********************************************************************         
                                                                                
TADYD    DSECT                                                                  
TADYEL   DS    XL1                 ELEMENT CODE                                 
TADYELQ  EQU   X'F6'                                                            
TADYLEN  DS    XL1                 ELEMENT LENGTH                               
TADYDAT  DS    CL248               DUMMY DATA                                   
*##ASSOCIATED TADYLEN                                                           
TADYLNQ  EQU   *-TADYD                                                          
                                                                                
***********************************************************************         
*        <   > ESTIMATE CAST ELEMENT                                  *         
***********************************************************************         
                                                                                
TAECD    DSECT                                                                  
TAECEL   DS    XL1                 ELEMENT CODE                                 
TAECELQ  EQU   X'EA'                                                            
TAECLEN  DS    XL1                 ELEMENT LENGTH                               
TAECTYPE DS    XL1                 TYPE                                         
TAECTYPO EQU   X'10'               ON CAMERA                                    
TAECTYPR EQU   X'16'               RADIO                                        
TAECTYPF EQU   X'20'               OFF CAMERA                                   
TAECTYPS EQU   X'30'               SINGERS                                      
TAECTYPT EQU   X'32'               RADIO SINGERS                                
TAECTYPX EQU   X'40'               EXTRAS                                       
TAECTYPU EQU   X'70'               MUSICIANS                                    
TAECTYPM EQU   X'90'               MISCELLANEOUS                                
TAECSEQ  DS    XL1                 SEQUENCE                                     
TAECSTAT DS    XL1                 STATUS                                       
TAECSNET EQU   X'80'               NET AMOUNT OVERRIDDEN                        
TAECSPNH EQU   X'40'               P&H OVERRIDDEN                               
TAECSTAX EQU   X'20'               TAX OVERRIDDEN                               
TAECSHND EQU   X'10'               HANDLING OVERRIDDEN                          
TAECSDEM EQU   X'08'               PAY DEMO RATES                               
TAECSONC EQU   X'04'               FORCE ON-CAMERA                              
TAECSHNW EQU   X'02'               H&W OVERRIDDEN                               
TAECSNON EQU   X'01'               FORCE NON-UNION                              
         DS    CL3                 N/D                                          
TAECCAT  DS    CL3                 CATEGORY CODE                                
TAECDBL  DS    CL1                 DOUBLES                                      
TAECDESC DS    CL16                DESCRIPTION (FOR TYPE TAECTYPM ONLY)         
         ORG   TAECDESC                                                         
TAECNUM  DS    XL1                 NUMBER                                       
TAECOV1  DS    H                   OVERSCALE PERCENT                            
TAECDTLS EQU   *                   START OF TIME DETAILS                        
TAECSP   DS    XL1                 SPOTS                                        
TAECDAY  DS    XL1                 DAYS                                         
TAECOT   DS    XL1                 OVERTIME                                     
TAECDT   DS    XL1                 DOUBLE TIME                                  
TAECTRV  DS    H                   TRAVEL TIME                                  
TAECPDW  DS    H                   PRIOR-DAY WARDROBE                           
         ORG   TAECPDW                                                          
TAECHRM  DS    H                   HOURS/MINUTES                                
TAECTAG  DS    XL1                 TAGS                                         
TAECCART DS    XL4                 CARTAGE                                      
TAECDTLQ EQU   *-TAECDTLS          L'TIME DETAILS                               
TAECAMTS DS    0F                                                               
TAECNET  DS    F                   NET                                          
TAECPNH  DS    F                   PENSION & HEALTH                             
TAECHNW  DS    F                   HEALTH & WELFARE                             
TAECTAX  DS    F                   TAX                                          
TAECHND  DS    F                   HANDLING                                     
TAECEMSF DS    F                   EMS FEE                                      
         DS    F                   SPARE                                        
TAECAMTL EQU   *-TAECAMTS                                                       
TAECLNQ  EQU   *-TAECD                                                          
TAECCMNT DS    0C                  VARIABLE LENGTH COMMENT                      
                                                                                
***********************************************************************         
*        <   > EMPLOYER DETAILS ELEMENT                               *         
***********************************************************************         
                                                                                
TAEDD    DSECT                                                                  
TAEDEL   DS    XL1                 ELEMENT CODE                                 
TAEDELQ  EQU   X'70'                                                            
TAEDLEN  DS    XL1                 ELEMENT LENGTH                               
TAEDDST  DS    CL2                 DEFAULT STATE                                
         DS    CL8                                                              
*##ASSOCIATED TAEDLEN                                                           
TAEDLNQ  EQU   *-TAEDD                                                          
                                                                                
***********************************************************************         
*        <   > EPISODE INFORMATION ELEMENT                            *         
***********************************************************************         
                                                                                
TAEID    DSECT                                                                  
TAEIEL   DS    XL1                 ELEMENT CODE                                 
TAEIELQ  EQU   X'6E'                                                            
TAEILEN  DS    XL1                 ELEMENT LENGTH                               
TAEIWDT  DS    XL3                 WORK DATE                                    
TAEIADT  DS    XL3                 AIR DATE                                     
         DS    CL6                                                              
*##ASSOCIATED TAEILEN                                                           
TAEILNQ  EQU   *-TAEID                                                          
                                                                                
***********************************************************************         
*        <   > ESTIMATE MISCELLANEOUS ADDITION ELEMENT                *         
***********************************************************************         
                                                                                
TAEMD    DSECT                                                                  
TAEMEL   DS    XL1                 ELEMENT CODE                                 
TAEMELQ  EQU   X'E3'                                                            
TAEMLEN  DS    XL1                 ELEMENT LENGTH                               
TAEMSEQ  DS    XL1                 SEQUENCE NUMBER TO MAINTAIN ORDER            
         DS    CL1                 SPARE                                        
TAEMAMT  DS    F                   AMOUNT                                       
TAEMTXT  DS    0C                  TEXT                                         
*##ASSOCIATED TAEMLEN                                                           
TAEMLNQ  EQU   *-TAEMD                                                          
                                                                                
***********************************************************************         
*        <   > ESTIMATE NARRATIVE ELEMENT (FOR COVER SHEETS)          *         
***********************************************************************         
                                                                                
TAEND    DSECT                                                                  
TAENEL   DS    XL1                 ELEMENT CODE                                 
TAENELQ  EQU   X'E4'                                                            
TAENLEN  DS    XL1                 ELEMENT LENGTH                               
TAENSEQ  DS    XL1                 SEQUENCE NUMBER TO MAINTAIN ORDER            
TAENNARR DS    0C                  TEXT                                         
*##ASSOCIATED TAENLEN                                                           
TAENLNQ  EQU   *-TAEND                                                          
                                                                                
***********************************************************************         
*        <   > ESTIMATE OPTIONS ELEMENT                               *         
***********************************************************************         
                                                                                
TAEOD    DSECT                                                                  
TAEOEL   DS    XL1                 ELEMENT CODE                                 
TAEOELQ  EQU   X'EC'                                                            
TAEOLEN  DS    XL1                 ELEMENT LENGTH                               
TAEOPNHR DS    H                   P&H RATE (2 DEC.)                            
TAEOTNHR DS    H                   T&H RATE (2 DEC.)                            
TAEOUSE  DS    CL3                 USE CODE                                     
TAEOUTYP DS    XL1                 USE TYPE                                     
TAEOMULT DS    H                   MULTIPLIER (2 DEC.)                          
TAEOYEAR DS    XL1                 CONTRACT YEAR                                
TAEOADST DS    CL2                 ADDENDUM STATE                               
TAEOAFM  DS    CL1                 AFM RATE                                     
TAEOTAXR DS    H                   TAX RATE (2 DEC.)                            
TAEOHNDR DS    H                   HANDLING RATE (2 DEC.)                       
         DS    CL3                                                              
*##ASSOCIATED TAEOLEN                                                           
TAEOLNQ  EQU   *-TAEOD                                                          
                                                                                
***********************************************************************         
*        <   > ESTIMATE PROFILE ELEMENT                               *         
***********************************************************************         
                                                                                
TAEPD    DSECT                                                                  
TAEPEL   DS    XL1                 ELEMENT CODE                                 
TAEPELQ  EQU   X'E0'                                                            
TAEPLEN  DS    XL1                 ELEMENT LENGTH                               
*                                  * REPORT GENERATION OPTIONS *                
TAEPFILT DS    CL1                 ACTUALS FILTER BASIS                         
TAEPFBIL EQU   C'B'                BILL DATE                                    
TAEPFBES EQU   C'E'                BILL DATE FOR Y/M/D, EST PD FOR Y/M          
TAEPFCYC EQU   C'C'                CYCLE START DATE                             
TAEPFCES EQU   C'F'                CYCLE DATE FOR Y/M/D, EST PD FOR Y/M         
TAEPCOMM DS    CL1                 COMMISSION CALCULATION BASIS                 
TAEPCYES EQU   C'Y'                ALL (NOT INCL. T&H)                          
TAEPCPAY EQU   C'P'                PAY + H&W ONLY                               
TAEPCTNH EQU   C'T'                ALL + T&H                                    
TAEPCHND EQU   C'H'                ALL + HANDLING                               
TAEPCNO  EQU   C'N'                DON'T CALCULATE COMMISSION                   
TAEPCCLI EQU   C'C'                DON'T CALC AT THIS LEVEL (OK ON CLI)         
TAEPMTH  DS    XL1                 BINARY START MONTH OF FISCAL YEAR            
TAEPPAGE DS    CL1                 Y=SEPARATE PAGE FOR EACH COMMERCIAL          
TAEPEXP  DS    CL1                 Y=ESTIMATE BEYOND EXPIRY                     
TAEPMUS  DS    CL1                 Y=SEPARATE MUSIC FEES/P&H                    
TAEPEST  DS    CL1                 Y=FILTER ACTUALS BY ESTIMATE CODE            
*                                  P=FILTER BY PARTIAL EST CODE (JOB)           
TAEPFREE DS    CL1                 Y=FIRST MUS PAYMENT FREE                     
TAEPDLR  DS    CL1                 Y=PAY HLDS IN DEALER CYCLE                   
*                                  * REPORT PRINTING OPTIONS *                  
TAEPFMT  DS    CL1                 ESTIMATE FORMAT                              
TAEPFCOM EQU   C'C'                BY COML/CYC/USE                              
TAEPFUSE EQU   C'U'                BY USE/CYC/COML                              
TAEPFLB  EQU   C'L'                BY COML/USE/CYC                              
TAEPFQTR EQU   C'Q'                BY COML/USE/QTR                              
TAEPFCAT EQU   C'T'                BY COML/USE/CAT                              
TAEPFV1  EQU   C'1'                VARIANCE BY QUARTER                          
TAEPFV2  EQU   C'2'                VARIANCE BY COMMERCIAL/QUARTER/USE           
TAEPFA   EQU   C'A'                BY COML/USE/DET                              
TAEPFB   EQU   C'B'                BY USE/COML/DET                              
TAEPFW   EQU   C'W'                BY USE/COML/DET - MERGED WSP                 
TAEPFDWN EQU   C'D'                DOWNLOAD                                     
TAEPFNOW EQU   C'N'                NOW REPORT FORMAT                            
TAEPFRCD EQU   C'R'                RECAP AND DOWNLOAD                           
TAEPAUTO DS    CL1                 1=GENERATE ALL AUTO PAYMENTS                 
*                                  2=FORCE MUSIC SESSIONS AS WELL               
*                                  3=SESSION AND HLD ONLY                       
*                                  4=MUSIC REUSE ONLY                           
*                                  5=MUSIC REUSE AND SESSIONS ONLY              
*                                  6=HLD AND MUSIC REUSE ONLY                   
TAEPACTL DS    CL1                 Y=INCLUDE ACTUALS  (INVOICES)                
*                                  P=INCLUDE PAYMENTS (CHECKS)                  
*                                  X=IGNORE ACTUAL USAGE HISTORY                
*                                  O=INCLUDE ONLY ACTUALS                       
TAEPHORZ DS    CL1                 Y=DISPLAY DETAIL TOTALS HORIZONTALLY         
*                                  C=INCLUDE COMMISSION COLUMN                  
TAEPSACC DS    0CL1                                                             
TAEPRCAP DS    CL1                 RECAP OPTION                                 
TAEPRQTR EQU   C'Q'                QUARTERLY                                    
TAEPRMTH EQU   C'M'                MONTHLY                                      
TAEPRVQT EQU   C'V'                VERTICAL QUARTERLY                           
TAEPRUSE EQU   C'U'                USE BY QUARTER                               
TAEPRWC  EQU   C'W'                WORK-CODES                                   
TAEPRXCM EQU   C'X'                CROSS COMMERCIAL                             
TAEPRTTL EQU   C'T'                MEDIA/USE/TITLE                              
TAEPR1   EQU   C'1'                USE/COMMERCIAL                               
TAEPRCO  EQU   C'C'                BY COMMERCIAL                                
TAEPRCOG EQU   C'G'                BY COMMERCIAL WITH GROSS ONLY                
TAEPRPRJ EQU   C'P'                PROJECTED TOTAL BY USE                       
TAEPR2   EQU   C'2'                BY COML/USE WITH NET ONLY                    
TAEPCAST DS    CL1                 Y=INCLUDE CAST LISTS ON REPORT               
TAEPPBSS DS    CL1                 Y=PRINT SESSIONS ON REPORT                   
TAEPCOML DS    CL1                 Y=PRINT COMMERCIALS INCLUDED SUMMARY         
TAEPNOBX DS    CL1                 Y=SUPPRESS BOXES                             
TAEPLEFT DS    CL1                 Y=ALIGN LEFT                                 
TAEPSIG  DS    CL1                 Y=PRINT SIGNATURE LINES                      
TAEPRATE DS    H                   COMMISSION RATE                              
TAEPSUPP DS    CL1                 Y=SUPPRESS INACTIVE COMMERCIALS              
TAEPREL  DS    CL1                 N=DON'T ESTIMATE ON RELEASED COMMLS          
TAEPTNH  DS    CL1                 Y=TNH RATE OVERRIDES CORP RATE               
TAEPHNW  DS    CL1                 Y=INCLUDE H&W WITH TALENT NET                
TAEPTNHC DS    CL1                 Y=FORCE T&H COMBINED                         
TAEPCLA  DS    CL1                 Y=MERGE CLASS A PLAYMENTS                    
TAEPDET  DS    CL1                 Y=PRINT EST RECORD MAINTENANCE STYLE         
         DS    CL29                SPARE                                        
*##ASSOCIATED TAEPLEN                                                           
TAEPLNQ  EQU   *-TAEPD                                                          
                                                                                
***********************************************************************         
*        <   > ESTIMATE ELEMENT                                       *         
***********************************************************************         
                                                                                
TAESD    DSECT                                                                  
TAESEL   DS    XL1                 ELEMENT CODE                                 
TAESELQ  EQU   X'E1'                                                            
TAESLEN  DS    XL1                 ELEMENT LENGTH - VARIABLE                    
TAESSEQ  DS    XL1                 SEQUENCE NUMBER                              
TAESTYPE DS    XL1                 ELEMENT TYPE                                 
TAESTCLI EQU   X'01'               X'01'=CLIENT                                 
TAESTPRD EQU   X'02'               X'02'=PRODUCT                                
TAESTCOM EQU   X'04'               X'04'=COMMERCIAL                             
TAESTPER EQU   X'08'               X'08'=CAST                                   
TAESTHYP EQU   X'10'               X'10'=HYPOTHETICAL                           
TAESTHP  EQU   X'20'               X'20'=HYPOTHETICAL PACKED                    
TAESTHCO EQU   TAESTHYP+TAESTCOM   X'14'=HYPOTHETICAL COMMERCIAL                
TAESTHPE EQU   TAESTHYP+TAESTPER   X'18'=HYPOTHETICAL CAST                      
TAESTHPC EQU   TAESTHP+TAESTCOM    X'24'=HYPOTHETICAL PACKED COMMERCIAL         
TAESTHPP EQU   TAESTHP+TAESTPER    X'28'=HYPOTHETICAL PACKED CAST               
TAESDATA DS    CL12                DATA IDENTIFYING TYPE                        
         ORG   TAESDATA            *** TYPE 1 ELEMENTS ***                      
TAESCLI  DS    CL6                 CLIENT CODE                                  
         ORG   TAESDATA            *** TYPE 2 ELEMENTS ***                      
TAESPRD  DS    CL6                 PRODUCT CODE                                 
         ORG   TAESDATA            *** TYPE 4 ELEMENTS ***                      
TAESCID  DS    CL8                 COMMERCIAL ID (1ST 8 CHARS)                  
TAESCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         ORG   TAESDATA            *** TYPE 8 ELEMENTS ***                      
TAESSORT DS    XL6                 CAST SORT KEY                                
TAESSSN  DS    XL4                 S/S NUMBER                                   
         ORG   TAESDATA            *** TYPE 14 ELEMENTS ***                     
TAESHCOM DS    CL10                COMMERCIAL CODE                              
TAESHMED DS    CL1                 MEDIA CODE                                   
TAESHLEN DS    XL1                 LENGTH                                       
         ORG   TAESDATA            *** TYPE 18 ELEMENTS ***                     
TAESHSTA DS    XL1                 STATUS  X'80'=ON CAMERA                      
*                                          X'40'=CORP                           
TAESHUNI DS    XL1                 UNION EQUATE                                 
TAESHCAT DS    XL1                 CATEGORY CODE EQUATE                         
TAESHNPR DS    XL1                 N'CAST OF THIS TYPE                          
TAESHLFT DS    XL1                 ON/OFF/ONLY ON LIFT (Y/N/O)                  
TAESHDBL DS    CL1                 N'DOUBLES                                    
TAESHPG  DS    XL1                 PAGE NUMBER THIS PERF DISPLAYED ON           
         ORG                                                                    
TAESSBNO DS    XL1                 N'SUB-ELEMENTS                               
*##ASSOCIATED TAESLEN                                                           
TAESLNQ  EQU   *-TAESD             MINIMUM ELEMENT LENGTH                       
TAESSBCD DS    XL1                 SUB-ELEMENT CODE                             
TAESSBDT DS    0C                  SUB-ELEMENT DATA                             
                                                                                
***********************************************************************         
*        <   > ESTIMATE TOTAL ELEMENT                                 *         
***********************************************************************         
                                                                                
TAETD    DSECT                                                                  
TAETEL   DS    XL1                 ELEMENT CODE                                 
TAETELQ  EQU   X'EB'                                                            
TAETLEN  DS    XL1                 ELEMENT LENGTH                               
         DS    CL1                                                              
TAETSTAT DS    XL1                 STATUS                                       
TAETSNET EQU   X'80'               NET OVERRIDDEN                               
TAETSPNH EQU   X'40'               P&H OVERRIDDEN                               
TAETSTNH EQU   X'20'               T&H OVERRIDDEN                               
TAETSTOT EQU   X'10'               TOTAL OVERRIDDEN                             
TAETSHNW EQU   X'02'               H&W OVERRIDDEN                               
TAETNET  DS    F                   NET                                          
TAETPNH  DS    F                   PENSION & HEALTH                             
TAETHNW  DS    F                   HEALTH & WELFARE                             
TAETTAX  DS    F                   TAX                                          
TAETHND  DS    F                   HANDLING                                     
TAETEMSF DS    F                   EMS FEE                                      
         DS    F                   SPARE                                        
*##ASSOCIATED TAETLEN                                                           
TAETLNQ  EQU   *-TAETD                                                          
                                                                                
***********************************************************************         
*        <   > FIELD NUMBERS CHANGED ELEMENT                          *         
***********************************************************************         
                                                                                
TAFCD    DSECT                                                                  
TAFCEL   DS    XL1                 ELEMENT CODE                                 
TAFCELQ  EQU   X'F3'                                                            
TAFCLEN  DS    XL1                 ELEMENT LENGTH  (VARIABLE)                   
TAFCFLDS DS    0XL1                LIST OF FIELD NUMBERS CHANGED                
*##ASSOCIATED TAFCLEN                                                           
TAFCLNQ  EQU   *-TAFCD                                                          
                                                                                
***********************************************************************         
*        <   > FILENAME ELEMENT                                       *         
***********************************************************************         
                                                                                
TAFID    DSECT                                                                  
TAFIEL   DS    XL1                 ELEMENT CODE                                 
TAFIELQ  EQU   X'96'                                                            
TAFILEN  DS    XL1                 ELEMENT LENGTH                               
TAFIDATE DS    CL8                 DATE - YYYYMMDD                              
TAFITIME DS    CL8                 TIME - HH:MM:SS                              
TAFIFILE DS    0CL36               FILENAME                                     
*##ASSOCIATED TAFILEN                                                           
TAFILNQ  EQU   *-TAFID                                                          
                                                                                
***********************************************************************         
*        <   > FILTERS ELEMENT                                        *         
***********************************************************************         
                                                                                
TAFLD    DSECT                                                                  
TAFLEL   DS    XL1                 ELEMENT CODE                                 
TAFLELQ  EQU   X'30'                                                            
TAFLLEN  DS    XL1                 ELEMENT LENGTH                               
TAFLFLT1 DS    CL1                 FILTER 1                                     
TAFLFLT2 DS    CL3                 FILTER 2                                     
TAFLFLT3 DS    CL1                 FILTER 3                                     
TAFLFLT4 DS    CL1                 FILTER 4                                     
         DS    CL6                                                              
*##ASSOCIATED TAFLLEN                                                           
TAFLLNQ  EQU   *-TAFLD                                                          
                                                                                
***********************************************************************         
*        <   > FREE FORM NAME ELEMENT                                 *         
***********************************************************************         
                                                                                
TAFND    DSECT                                                                  
TAFNEL   DS    XL1                 ELEMENT CODE                                 
TAFNELQ  EQU   X'26'                                                            
TAFNLEN  DS    XL1                 ELEMENT LENGTH                               
TAFNTYPE DS    CL1                 NAME TYPE                                    
TAFNTATT EQU   C'A'                ATTENTION NAME                               
TAFNTVTL EQU   C'B'                VERSION TITLE                                
TAFNTCLI EQU   C'C'                CLIENT NAME                                  
TAFNTADV EQU   C'D'                ADVICE NUMBER PAID                           
TAFNTACE EQU   C'E'                ACCOUNT EQUIVALENT                           
TAFNTT10 EQU   C'F'                TYPE 10 INTERFACE VENDOR                     
TAFNTGCO EQU   C'G'                GUARANTEE CONTRACT                           
TAFNTTRK EQU   C'K'                TRACKS A CAST MEMBER IS ON                   
TAFNTWRI EQU   C'I'                WEB APPLICATION RECORD ID                    
TAFNTMUS EQU   C'M'                MUSIC TITLE                                  
TAFNTCON EQU   C'N'                CONTRACT                                     
TAFNTPHO EQU   C'O'                PHOTOGRAPHER NAME                            
TAFNTPRD EQU   C'P'                PRODUCT NAME                                 
TAFNTROL EQU   C'R'                ROLE                                         
TAFNTSVC EQU   C'S'                SERVICES FOR AGENCY NAME(PCOMML REC)         
TAFNTTTL EQU   C'T'                COMMERCIAL TITLE                             
TAFNTVER EQU   C'V'                VERSIONS A CAST MEMBER IS ON                 
TAFNTWEB EQU   C'W'                WEB APPLICATION ID                           
TAFNTAGY EQU   C'Y'                AGENCY NAME                                  
TAFNTOWB EQU   C'Z'                ORIGINAL WEB APPLICATION ID                  
TAFNTVRE EQU   C'1'                RENDERED VERSIONS PAID                       
TAFNTVNR EQU   C'2'                NON-RENDERED VERSIONS PAID                   
TAFNTVN1 EQU   C'3'                1ST NON-RENDERED VERSION                     
TAFNTVNM EQU   C'4'                NON-RENDERED VERSIONS PAID MANUALLY          
TAFNTSTU EQU   C'5'                STUDIO CODE                                  
TAFNTASC EQU   C'6'                PAY OPTION: AGENCY STUDIO CODE               
TAFNTMCN EQU   C'7'                MEDIA COMPANY NAME (NON-DS CLARUS)           
*##ASSOCIATED TAFNLEN                                                           
TAFNLNQ  EQU   *-TAFND                                                          
*##DATATYPE RESTOFEL                                                            
TAFNNAME DS    0CL36                                                            
                                                                                
***********************************************************************         
*        <   > FIXED CYCLE TRACKING REQUEST DETAILS ELEMENT           *         
***********************************************************************         
                                                                                
TAFQD    DSECT                                                                  
TAFQEL   DS    XL1                 ELEMENT CODE                                 
TAFQELQ  EQU   X'6B'                                                            
TAFQLEN  DS    XL1                 ELEMENT LENGTH                               
TAFQNUM  DS    XL1                 N'SUB-ELEMENTS  (OK-EXPAND)                  
*##ASSOCIATED TAFQLEN                                                           
TAFQLNQ  EQU   *-TAFQD                                                          
TAFQSBEL DS    0CL10                                                            
TAFQOFF  DS    CL1                 TP OFFICE                                    
TAFQSSN  DS    F                   SOCIAL SECURITY NUMBER                       
TAFQCAST DS    H                   CAST INPUT SEQUENCE NUMBER                   
TAFQSTRT DS    XL3                 CYCLE START DATE                             
TAFQXSUB DS    0C                  END OF SUB-ELEMENT                           
                                                                                
***********************************************************************         
*        <   > GUARANTEE CYCLE ELEMENT                                *         
***********************************************************************         
                                                                                
TAGCD    DSECT                                                                  
TAGCEL   DS    XL1                 ELEMENT CODE                                 
TAGCELQ  EQU   X'62'                                                            
TAGCLEN  DS    XL1                 ELEMENT LENGTH                               
TAGCPD   DS    0XL6                                                             
TAGCSTRT DS    XL3                 PERIOD START DATE                            
TAGCEND  DS    XL3                 PERIOD END DATE                              
TAGCAMT  DS    F                   TOTAL GUARANTEE AMOUNT/P&H LIMIT             
TAGCBAL  DS    F                   BALANCE                                      
TAGCUNI  DS    CL3                 UNION                                        
TAGCGRT  DS    CL4                 GUARANTEE CODE                               
         DS    CL1                                                              
         DS    F                                                                
TAGCUSE  DS    CL3                 USE                                          
TAGCCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
*##ASSOCIATED TAGCLEN                                                           
TAGCLNQ  EQU   *-TAGCD                                                          
                                                                                
***********************************************************************         
*        <   > GUARANTEE CONTRACT INFO ELEMENT                        *         
***********************************************************************         
                                                                                
TAGDD    DSECT                                                                  
TAGDEL   DS    XL1                 ELEMENT CODE                                 
TAGDELQ  EQU   X'63'                                                            
TAGDLEN  DS    XL1                 ELEMENT LENGTH                               
TAGDPD   DS    0XL6                                                             
TAGDSTRT DS    XL3                 TERM START DATE                              
TAGDEND  DS    XL3                 TERM END DATE                                
TAGDAGY  DS    CL6                 AGENCY                                       
TAGDPAGY DS    CL6                 PREVIOUS AGENCY                              
TAGDCLI  DS    CL6                 CLIENT                                       
TAGDPCLI DS    CL6                 PREVIOUS CLIENT                              
         DS    CL6                                                              
*##ASSOCIATED TAGDLEN                                                           
TAGDLNQ  EQU   *-TAGDD                                                          
                                                                                
***********************************************************************         
*        <   > GUARANTEE HANDLING ELEMENT                             *         
***********************************************************************         
                                                                                
TAGHD    DSECT                                                                  
TAGHEL   DS   XL1                  ELEMENT CODE                                 
TAGHELQ  EQU  X'FA'                                                             
TAGHLEN  DS   XL1                  ELEMENT LENGTH                               
TAGHHDL  DS   XL2                  GUARANTEE HANDLING RATE                      
TAGHLIM  DS   XL3                  GUARANTEE LIMIT                              
         DS   XL8                  SPARE                                        
*##ASSOCIATED TAGHLEN                                                           
TAGHLNQ  EQU  *-TAGHD                                                           
                                                                                
***********************************************************************         
*        <   > GENERAL LIST ELEMENT                                   *         
***********************************************************************         
                                                                                
TAGLD    DSECT                                                                  
TAGLEL   DS    XL1                 ELEMENT CODE                                 
TAGLELQ  EQU   X'2F'                                                            
TAGLLEN  DS    XL1                 ELEMENT LENGTH                               
         DS    XL1                                                              
TAGLDATA DS    0C                  DATA                                         
*##ASSOCIATED TAGLLEN                                                           
TAGLLNQ  EQU   *-TAGLD                                                          
                                                                                
***********************************************************************         
*        <   > GUARANTEE TRACKING REQUEST DETAILS ELEMENT             *         
***********************************************************************         
                                                                                
TAGQD    DSECT                                                                  
TAGQEL   DS    XL1                 ELEMENT CODE                                 
TAGQELQ  EQU   X'6A'                                                            
TAGQLEN  DS    XL1                 ELEMENT LENGTH                               
TAGQNUM  DS    XL1                 N'SUB-ELEMENTS  (OK-EXPAND)                  
*##ASSOCIATED TAGQLEN                                                           
TAGQLNQ  EQU   *-TAGQD                                                          
TAGQSBEL DS    0CL10                                                            
TAGQOFF  DS    CL1                 TP OFFICE                                    
TAGQSSN  DS    F                   SOCIAL SECURITY NUMBER                       
TAGQGUA  DS    H                   GUARANTEE CODE                               
TAGQSTRT DS    XL3                 PAYMENT CYCLE START DATE                     
TAGQXSUB DS    0C                  END OF SUB-ELEMENT                           
                                                                                
***********************************************************************         
*        <   > GUARANTEE TRACKING ELEMENT                             *         
***********************************************************************         
                                                                                
TAGTD    DSECT                                                                  
TAGTEL   DS    XL1                 ELEMENT CODE                                 
TAGTELQ  EQU   X'87'                                                            
TAGTLEN  DS    XL1                 ELEMENT LENGTH                               
TAGTCID  DS    CL12                COMMERCIAL ID                                
TAGTCAT  DS    CL3                 CATEGORY                                     
TAGTCAM  DS    CL3                 ON/OFF CAMERA                                
TAGTUNI  DS    CL3                 UNION                                        
TAGTYEAR DS    CL3                 CONTRACT YEAR                                
TAGTOV   DS    XL4                 OVERSCALE RATE                               
TAGTOV2  DS    XL4                 2ND OVERSCALE RATE                           
TAGTPG   DS    H                   PAGE NUMBER ON TRACKING REPORT               
TAGTINV  DS    XL6                 INVOICE NUMBER                               
TAGTUSE  DS    CL3                 USE CODE                                     
TAGTTYPE DS    CL1                 TYPE OF PAYMENT FOR USE                      
TAGTSTRT DS    XL3                 CYCLE START                                  
TAGTEND  DS    XL3                 CYCLE END                                    
TAGTPAY  DS    F                   PAYMENT AMOUNT                               
TAGTPNH  DS    F                   P&H AMOUNT                                   
TAGTCRD  DS    F                   GUARANTEE CREDITS                            
TAGTBAL  DS    F                   GUARANTEE BALANCE                            
TAGTAPPL DS    F                   APPLIED CREDITS                              
TAGTSTUS DS    H                   STARTING USE NUMBER                          
TAGTUSES DS    H                   NUMBER OF USES - TOTAL                       
TAGTUNIT DS    H                   NUMBER OF UNITS                              
TAGTMAJ  DS    XL1                 MAJOR CITIES                                 
TAGTSTAT DS    XL1                 STATUS BYTE                                  
TAGTSREF EQU   X'80'               UPDATED BY REFRESH                           
TAGTSGRR EQU   X'40'               APPLICATION TO GRR CYCLE                     
         DS    CL3                 SPARE                                        
TAGTPST1 DS    XL1                 PAYMENT STATUS (SEE TAPDPST1)                
         DS    CL4                 SPARE                                        
TAGTAGY  DS    CL6                 AGENCY                                       
*##ASSOCIATED TAGTLEN                                                           
TAGTLNQ  EQU   *-TAGTD                                                          
                                                                                
***********************************************************************         
*        <   > GUARANTEE DETAILS ELEMENT                              *         
***********************************************************************         
                                                                                
TAGUD    DSECT                                                                  
TAGUEL   DS    XL1                 ELEMENT CODE                                 
TAGUELQ  EQU   X'61'                                                            
TAGULEN  DS    XL1                 ELEMENT LENGTH                               
TAGUAGY  DS    CL6                 AGENCY                                       
TAGUCLI  DS    CL6                 CLIENT                                       
TAGUPD   DS    0XL6                                                             
TAGUSTRT DS    XL3                 PERIOD START DATE                            
TAGUEND  DS    XL3                 PERIOD END DATE                              
TAGUATT  DS    CL2                 ATTENTION CODE                               
TAGUCRP  DS    CL1                 CORP CODE                                    
TAGUSTAT DS    XL1                                                              
TAGUSDES EQU   X'80'               DESCENDING BALANCE                           
TAGUSPNH EQU   X'40'               PAY P&H                                      
TAGUSOVR EQU   X'20'               PAY OVERAGE                                  
TAGUSPAY EQU   X'10'               ADDED BY PAY PROGRAM                         
TAGUSINS EQU   X'08'               INSTALLMENT PAYMENT PAID                     
TAGUSNO  EQU   X'04'               DON'T APPLY - SET BY PAY, REMOVED            
*                                                        BY TAPPGUAR            
TAGUSREF EQU   X'02'               GRT BALANCE WAS REFRESHED                    
TAGUSLCK EQU   X'01'               GRT RECORD IS LOCKED                         
TAGUAMT  DS    F                   TOTAL GUARANTEE AMOUNT                       
TAGUBAL  DS    F                   BALANCE                                      
TAGUSTA2 DS    XL1                                                              
TAGUSIGP EQU   X'80'               IGNORE PAY OVERAGE NO ON ESTIMATING          
TAGUSNEW EQU   X'40'               ADDED VIA NEW GUARANTEE SYSTEM               
TAGUSMSC EQU   X'20'               MULTI-CONTRACT SERVICE                       
         DS    XL1                 SPARE                                        
TAGULPG  DS    H                   LAST PAGE NUMBER PRINTED                     
TAGUPAY  DS    F                   PAYMENT (INSTALMENT) AMOUNT                  
TAGUCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
         DS    F                   SPARE                                        
TAGUINV  DS    XL6                 INVOICE THAT ADDED GRT                       
TAGUIAY  DS    XL6                 AGENCY THAT ADDED GRT                        
TAGUGCNT DS    XL4                 GUARANTEE CONTRACT                           
         DS    XL6                                                              
*##ASSOCIATED TAGULEN                                                           
TAGULNQ  EQU   *-TAGUD                                                          
                                                                                
***********************************************************************         
*        <   > GUARANTEE EXCLUDED USES ELEMENT                        *         
***********************************************************************         
                                                                                
TAGXD    DSECT                                                                  
TAGXEL   DS    XL1                 ELEMENT CODE                                 
TAGXELQ  EQU   X'67'                                                            
TAGXLEN  DS    XL1                 ELEMENT LENGTH                               
*##ASSOCIATED TAGXLEN                                                           
TAGXLNQ  EQU   *-TAGXD                                                          
TAGXSBEL DS    0CL1                SUB-ELEMENTS                                 
TAGXUSE  DS    XL1                 USE CODE                                     
TAGXXSUB DS    0C                  END OF SUB-ELEMENT                           
                                                                                
***********************************************************************         
*        <   > HOLDING FEE NOTIFICATION DETAILS ELEMENT               *         
***********************************************************************         
                                                                                
TAHFD    DSECT                                                                  
TAHFEL   DS    XL1                 ELEMENT CODE                                 
TAHFELQ  EQU   X'58'                                                            
TAHFLEN  DS    XL1                 ELEMENT LENGTH                               
TAHFSTAT DS    XL1                 STATUS                                       
TAHFSNO  EQU   X'80'               DON'T SEND NOTICE FOR THIS CAST MEMB         
TAHFNXTS DS    XL3                 CYCLE START DATE OF LAST NOTICE SENT         
TAHFMDTE DS    XL3                 DATE FIRST NOTICE SENT                       
TAHF2DTE DS    XL3                 DATE SECOND NOTICE SENT                      
TAHFHDTE DS    CL3                 SEASONAL CYCLE START DATE                    
*##ASSOCIATED TAHFLEN                                                           
TAHFLNQ  EQU   *-TAHFD                                                          
                                                                                
***********************************************************************         
*        <   > PAYROLL HISTORY UPDATE ACTIVITY ELEMENT                *         
***********************************************************************         
                                                                                
TAHUD    DSECT                                                                  
TAHUEL   DS    XL1                 ELEMENT CODE                                 
TAHUELQ  EQU   X'F5'                                                            
TAHULEN  DS    XL1                 ELEMENT LENGTH                               
TAHUUDTE DS    XL3                 LAST CHANGE DATE - URGENT                    
TAHUODTE DS    XL3                 LAST CHANGE DATE - OVERNIGHT                 
         DS    CL6                 SPARE                                        
*##ASSOCIATED TAHULEN                                                           
TAHULNQ  EQU   *-TAHUD                                                          
                                                                                
***********************************************************************         
*        <   > INDUSTRIAL SUPPLEMENTAL DETAILS                        *         
***********************************************************************         
                                                                                
TAIDD    DSECT                                                                  
TAIDEL   DS    XL1                 ELEMENT CODE                                 
TAIDELQ  EQU   X'DC'                                                            
TAIDLEN  DS    XL1                 ELEMENT LENGTH                               
TAIDTY1  DS    XL1                 TYPE                                         
TAIDTBCA EQU   X'80'               BASIC CABLE- 3 YEARS                         
TAIDTNNW EQU   X'40'               NON-NETWORK US/CAN                           
TAIDTTEX EQU   X'20'               THEATRICAL EXHIB. WW                         
TAIDTFGR EQU   X'10'               FOREIGN TV                                   
TAIDTIN5 EQU   X'08'               INTERNET - 5 YEARS                           
TAIDTICU EQU   X'04'               INTEGRATION/CUSTOMIZATION                    
TAIDTSRI EQU   X'02'               SALE/RENTAL TO INDUSTRY                      
TAIDTPAG EQU   X'01'               PACKAGE A THRU G                             
TAIDTY2  DS    XL1                 TYPE                                         
TAIDTCT2 EQU   X'80'               CATEGORY 2                                   
TAIDTNWK EQU   X'40'               NETWORK TV                                   
TAIDTCAB EQU   X'20'               PAY CABLE                                    
TAIDTGPU EQU   X'10'               GENERAL PUBLIC SALE/RENTAL                   
TAIDTGOV EQU   X'08'               GOVERNMENT SERVICES                          
         DS    XL4                 SPARE                                        
*##ASSOCIATED TAIDLEN                                                           
TAIDLNQ  EQU   *-TAIDD                                                          
                                                                                
***********************************************************************         
*        <   > PRODUCTION INTERFACE ELEMENT                           *         
***********************************************************************         
                                                                                
TAIFD    DSECT                                                                  
TAIFEL   DS    XL1                 ELEMENT CODE                                 
TAIFELQ  EQU   X'B1'                                                            
TAIFLEN  DS    XL1                 ELEMENT LENGTH                               
TAIFAGY  DS    CL6                 PRODUCTION AGENCY USERID                     
TAIFVEND DS    CL14                VENDOR ACCOUNT                               
TAIFTV   DS    CL12                DEFAULT JOB FOR TV                           
TAIFRAD  DS    CL12                DEFAULT JOB FOR RADIO                        
TAIFSTAT DS    XL1                 STATUS                                       
TAIFSUSV EQU   X'80'               UPDATE SV POSTINGS                           
TAIFSOFS EQU   X'40'               SORT BY OFFICE CODE                          
TAIFSNIC EQU   X'20'               DON'T INTERFACE IF CLIENT NOT FND            
TAIFSNID EQU   X'10'               DON'T INTERFACE IF DEFAULT JOB NOT           
*                                        FOUND                                  
TAIFSPZR EQU   X'08'               POST ZERO AMOUNTS                            
TAIFSNAR EQU   X'04'               WANT NARRATIVE ON SJ POSTINGS                
TAIFSPPN EQU   X'02'               TPN PRINTS AT AGENCY                         
TAIFBDAY DS    XL1                 #OF BUS DAYS BEFORE EOM = NEXT MONTH         
         DS    CL6                                                              
TAIFNWCS DS    XL1                 N'WORK-CODE SUB-ELEMENTS                     
TAIFWCS  DS    0C                  WORK-CODE SUB-ELEMENT DEFINITIONS            
*##ASSOCIATED TAIFLEN                                                           
TAIFLNQ  EQU   *-TAIFD             MINIMUM L'ELEMENT (W/ ZERO SUB ELS.)         
                                                                                
***********************************************************************         
*        <   > INVOICE STATUS ELEMENT                                 *         
***********************************************************************         
                                                                                
TAIND    DSECT                                                                  
TAINEL   DS    XL1                 ELEMENT CODE                                 
TAINELQ  EQU   X'40'                                                            
TAINLEN  DS    XL1                 ELEMENT LENGTH                               
TAINIINF DS    0CL16               INVOICE ASSIGNMENT INFO                      
TAINIID  DS    XL2                 USERID                                       
TAINIST  DS    CL8                 STAFF                                        
TAINIDTE DS    XL3                 DATE                                         
TAINITIM DS    XL3                 TIME                                         
TAINPINF DS    0CL16               PAY INFO                                     
TAINPID  DS    XL2                 USERID                                       
TAINPST  DS    CL8                 STAFF                                        
TAINPDTE DS    XL3                 DATE                                         
TAINPTIM DS    XL3                 TIME                                         
TAINQINF DS    0CL16               QC INFO                                      
TAINQID  DS    XL2                 USERID                                       
TAINQST  DS    CL8                 STAFF                                        
TAINQDTE DS    XL3                 DATE                                         
TAINQTIM DS    XL3                 TIME                                         
TAINBDTE DS    XL3                 BILL DATE                                    
TAINCDTE DS    XL3                 CHECK DATE                                   
TAINSTAT DS    XL1                 STATUS  (SEE ALSO TLINBCDQ PASSIVE)          
TAINSPAY EQU   X'80'               PAID ONLINE                                  
TAINSAPR EQU   X'40'               APPROVED BY QC                               
TAINSBIL EQU   X'20'               BILLED                                       
TAINSCHK EQU   X'10'               CHECKS WRITTEN                               
TAINSERR EQU   X'08'               IN ERROR                                     
TAINSCIN EQU   X'04'               CANCEL INVOICE  (CANCELL'ER')                
TAINSHLD EQU   X'02'               HOLD (COD)                                   
TAINSCAN EQU   X'01'               CANCELLED       (CANCELL'EE')                
TAINSREO EQU   X'FF'               CLEAR THESE BITS DURING REOPEN               
TAINSCNL EQU   TAINSBIL+TAINSERR+TAINSCAN         CANCEL                        
TAINSTA2 DS    XL1                 2ND STATUS                                   
TAINSURG EQU   X'80'               URGENT                                       
TAINSHLR EQU   X'40'               HOLD (COD) INVOICE RELEASED                  
TAINSADJ EQU   X'20'               THIS INVOICE FOR PAYMENT ADJUSTMENTS         
TAINSSCR EQU   X'10'               INVOICE NUMBER FOR SCREEN RECORDS IS         
*                                  TAINIDTE & TAINITIM                          
TAINSHLP EQU   X'08'               HOLD (COD) INVOICE PRINTED                   
TAINSRTH EQU   X'04'               RETROACTIVE PAYMENT HOLD STATUS              
TAINSFRC EQU   X'02'               CHECK DATE FORCED TO 12/31/(YEAR-1)          
TAINSPRM EQU   X'01'               PRIMARY INVOICE                              
*                                                   CLEAR DURING REOPEN         
TAINS2RE EQU   TAINSURG+TAINSHLR+TAINSSCR+TAINSHLP+TAINSRTH                     
TAINS2CL EQU   TAINSHLR+TAINSHLP                    CLEAR DURING CANCEL         
TAINTERR DS    XL1                 ERROR TYPE                                   
TAINEINV EQU   1                   INVOICE IN ERROR                             
TAINEAGY EQU   3                   NO AGENCY RECORD                             
TAINEAYE EQU   4                   NO AGENCY ELEMENT                            
TAINEPDI EQU   5                   NO PAYMENT DETAIL ELEMENT/INVOICE            
TAINEBRE EQU   6                   NO BILLING RULES ELEMENT                     
TAINECOM EQU   7                   NO COMMERCIAL RECORD                         
TAINEINT EQU   8                   NO INTERFACE RECORD                          
TAINECLI EQU   9                   NO CLIENT RECORD                             
TAINEPRD EQU   10                  NO PRODUCT RECORD                            
TAINEATT EQU   11                  NO ATTENTION RECORD                          
TAINEEMP EQU   12                  NO EMP OF RECORD RECORD                      
TAINEAMT EQU   13                  AMOUNTS DON'T MATCH                          
TAINECST EQU   14                  NO CAST ELEMENT                              
TAINEPDC EQU   15                  NO PAYMENT DETAILS ELEMENT/CHECK             
TAINEW4  EQU   16                  NO W4 RECORD                                 
TAINEW4E EQU   17                  NO W4 ELEMENT                                
TAINETID EQU   18                  NO TAX ID ELEMENT IN CHECK RECORD            
TAINECTI EQU   19                  NO COMMERCIAL TITLE ELEMENT/INVOICE          
TAINECOI EQU   20                  NO COMMERCIAL DETAIL ELEMENT/INVOICE         
TAINEW4A EQU   21                  NO W4 ADDRESS ELEMENT                        
TAINETAX EQU   22                  INVALID TAX UNIT IN CAST ELEMENT             
TAINECRP EQU   23                  NO W4 RECORD FOR INDIV CORPORATION           
TAINEETI EQU   24                  NO TAX ID ELEMENT IN EMPLOYER RECORD         
TAINEAN  EQU   25                  NO AGENT RECORD                              
TAINEANA EQU   26                  NO AGENT ADDRESS ELEMENT                     
TAINEDUE EQU   27                  NO DUE COMPANY DETAILS ELEMENT               
TAINELNE EQU   28                  NO LIEN DETAILS ELEMENT                      
TAINENEG EQU   30                  CHECK AMOUNT NEGITIVE AFTER DUECOMP          
TAINELN  EQU   31                  NO LIEN RECORD                               
TAINECKY EQU   32                  NO CHECK YTD ELEMENT                         
TAINECRC EQU   33                  INVALID CREDIT PAYMENT CHECK                 
TAINEGCK EQU   34                  GUARANTEE APPLY - BAD CHECK RECORD           
TAINEGGU EQU   35                  GUARANTEE APPLY - BAD GUAR. RECORD           
TAINEGTB EQU   36                  GUARANTEE APPLY - NO ROOM IN GUARTAB         
TAINEGAP EQU   37                  GUARANTEE APPLY - APPLY ERROR                
TAINECAG EQU   40                  CH NO AGENCY RECORD                          
TAINECPI EQU   41                  CH NO PAYMENT DETAIL ELEMENT/INVOICE         
TAINECCL EQU   42                  CH NO CLIENT RECORD                          
TAINECPR EQU   43                  CH NO PRODUCT RECORD                         
TAINECEM EQU   44                  CH NO EMP OF RECORD RECORD                   
TAINECCA EQU   45                  CH NO CAST ELEMENT                           
TAINECPC EQU   46                  CH NO PAYMENT DETAILS ELEMENT/CHECK          
TAINECW4 EQU   47                  CH NO W4 RECORD                              
TAINECCO EQU   48                  CH NO CMCL DETAIL ELEMENT/INVOICE            
TAINECFD EQU   49                  CH NO FEDERAL WITHHOLDING ELEM IN W4         
TAINEDU  EQU   50                  CH NO DUE COMPANY RECORD                     
TAINEIOI EQU   51                  CH NO ORIGINAL AGY/INV ELEMENT               
TAINEMAT EQU   52                  CH W4 TYPE DOES NOT MATCH PAYMENT            
TAINECAN EQU   53                  BILL - CANADIAN PAYMENT                      
TAINEOFF EQU   54                  BILL - NO OFFICE RECORD                      
TAINEIFE EQU   55                  BILL - NO INTERFACE ELEMENT                  
TAINECKS EQU   56                  BILL - NO CHECK RECORDS                      
TAINEINE EQU   57                  BILL - NO INVOICE ELEMENT                    
TAINECNI EQU   58                  CH CANADIAN SET UP AS INDIVIDUAL             
TAINENDD EQU   59                  CH NO DUE DATE ELEMENT                       
TAINEBTY EQU   60                  BILL - UNKNOWN BILLING TYPE                  
TAINCAMT EQU   61                  GUAR CANCELL'EE <> -CANCELL'ER AMT           
TAINEDU2 EQU   62                  CH FLIST ON DUE COMPANY REC NOT FND          
TAINEMS  EQU   63                  BAD AGENCY 8800 RECORD (EMS)                 
TAINEGGC EQU   64                  GUARANTEE APPLY - BAD GCON RECORD            
TAINEBOM EQU   65                  BOVER BILING TYPE MISMATCH                   
TAINEME2 EQU   66                  MISSING EVTIME2 FOR CANADIAN                 
TAINECP  EQU   67                  MISSING CANADIAN PROVINCE                    
*                                  * WARNINGS *                                 
TAINWGCN EQU   128                 GUAR APPLY - CANCEL AND BAL IS ZERO          
TAINWGDU EQU   129                 GUAR APPLY - DUPLICATE CYCLE EXISTS          
TAINFPG  DS    XL1                 FIRST PG NO. OF NON-SEL SCREEN REC.          
TAINLPG  DS    XL1                 LAST PAGE NUMBER OF SCREEN RECORDS           
TAINCKID DS    CL1                 CHECK RUN ID - TYPICALLY VALUES ARE,         
*                                  C'U'=URGENT(DAILY), C'O'=OVERNIGHT           
TAINCKRN DS    XL3                 CHECK RUN DATE                               
TAINSEQ  DS    XL1                 USUALLY ZERO 1 UP FOR CONV T&R INVS          
TAINHDTE DS    XL3                 HLD (COD) - PRINT DATE                       
TAINLPGP DS    XL1                 LAST PG FROM PAY (SET IF PYMT CHGD)          
TAINTMCO DS    XL4                 TIMESHEET INTERNAL COMMERCIAL NUMBER         
TAINSTA3 DS    XL1                 3RD STATUS                                   
TAINSNI  EQU   X'80'               NO INTERFACE                                 
TAINSRSK EQU   X'40'               RETROS SKIP THIS INVOICE                     
TAINSRSD EQU   X'20'               RESEND (OMINTER)                             
*                                                                               
TAINPTPD DS    0XL6                ETIME PAY PERIOD                             
TAINPTPS DS    XL3                 ETIME PAY PERIOD START DATE                  
TAINPTPE DS    XL3                 ETIME PAY PERIOD END DATE                    
*##ASSOCIATED TAINLEN                                                           
TAINLNQ  EQU   *-TAIND                                                          
                                                                                
***********************************************************************         
*        <   > PRODUCTION INTERFACE OFFICE ELEMENT                    *         
***********************************************************************         
                                                                                
TAIOD    DSECT                                                                  
TAIOEL   DS    XL1                 ELEMENT CODE                                 
TAIOELQ  EQU   X'B3'                                                            
TAIOLEN  DS    XL1                 ELEMENT LENGTH                               
TAIOOFF  DS    CL2                 PRODUCTION OFFICE CODE                       
TAIOJOB  DS    CL12                DEFAULT JOB                                  
         DS    CL2                                                              
*##ASSOCIATED TAIOLEN                                                           
TAIOLNQ  EQU   *-TAIOD                                                          
                                                                                
***********************************************************************         
*        <   > PRODUCTION INTERFACE SUBSIDIARY ELEMENT                *         
***********************************************************************         
                                                                                
TAISD    DSECT                                                                  
TAISEL   DS    XL1                 ELEMENT CODE                                 
TAISELQ  EQU   X'B2'                                                            
TAISLEN  DS    XL1                 ELEMENT LENGTH                               
TAISTYPE DS    CL1                 TYPE                                         
TAISTYPC EQU   C'C'                CLIENT                                       
TAISTYPP EQU   C'P'                PRODUCT                                      
TAISCDE  DS    CL3                 CODE FOR TYPE                                
         DS    CL2                                                              
*##ASSOCIATED TAISLEN                                                           
TAISLNQ  EQU   *-TAISD                                                          
                                                                                
***********************************************************************         
*        <   > CHECK PULL ELEMENT                                     *         
***********************************************************************         
                                                                                
TAKLD    DSECT                                                                  
TAKLEL   DS    XL1                 ELEMENT CODE                                 
TAKLELQ  EQU   X'BB'                                                            
TAKLLEN  DS    XL1                                                              
TAKLSTAT DS    XL1                 CHECK PULL STATUS                            
TAKLSVOD EQU   X'80'               VOID                                         
TAKLSHLD EQU   X'40'               HOLD                                         
TAKLSWIR EQU   X'20'               WIRE                                         
TAKLSDRF EQU   X'10'               DRAFT                                        
TAKLSOVN EQU   X'08'               OVERNIGHT                                    
TAKLSOTH EQU   X'04'               OTHER                                        
TALKSG50 EQU   X'02'               GUARANTEE OVER 50K                           
TAKLSTA2 DS    XL1                 CHECK PULL STATUS 2                          
TAKLSCUR EQU   X'80'               PULL URGENT CHECK                            
TAKLSCOV EQU   X'40'               PULL OVERNIGHT CHECK                         
TAKLSVUP EQU   X'20'               VIA UPS                                      
TAKLSVPC EQU   X'10'               VIA POUCH                                    
TAKLSVLM EQU   X'08'               VIA LOCAL MESSENGER                          
TAKLOVCR EQU   X'04'               VIA OVERNIGHT CARRIER                        
TAKLSTA3 DS    XL1                 CHECK PULL STATUS 3                          
TAKLSTAY EQU   X'80'               TO AGENCY                                    
TAKLSTTA EQU   X'40'               TO TALENT                                    
TAKLSTAG EQU   X'20'               TO AGENT                                     
TAKLSTOT EQU   X'10'               TO OTHER                                     
TAKLRQBY DS    XL8                 PULL REQUEST MADE BY                         
TAKLRQDT DS    XL3                 PULL REQUEST MADE DATE                       
TAKLFXBY DS    XL8                 FAXED BY                                     
TAKLFXDT DS    XL3                 FAXED DATE                                   
TAKLCONT DS    CL25                AGENCY CONTACT                               
TAKLFAX# DS    CL14                AGENCY FAX NUMBER                            
TAKLPLDT DS    XL3                 PULL DATE                                    
TAKLGCDD DS    XL3                 GUARANTEE CHECK DUE DATE                     
TAKLDTRC DS    XL3                 RECEIVED BY CLIENT DATE                      
TAKLDTRT DS    XL3                 DATE RELEASED BY TP                          
         DS    CL10                                                             
*##ASSOCIATED TAKLLEN                                                           
TAKLLNQ  EQU   *-TAKLD                                                          
                                                                                
***********************************************************************         
*        <   > CHECK STOP ELEMENT                                     *         
***********************************************************************         
                                                                                
TAKPD    DSECT                                                                  
TAKPEL   DS    XL1                 ELEMENT CODE                                 
TAKPELQ  EQU   X'BA'                                                            
TAKPLEN  DS    XL1                                                              
TAKPCSST DS    XL1                 CHECK STOP STATUS                            
TAKPCSYS EQU   X'80'               CHECK STOP REISSUE CHECK                     
TAKPCSNO EQU   X'40'               CHECK STOP DO NOT REISSUE CHECK              
TAKPCSCL EQU   X'20'               CHECK STOP CLIENT REQUESTED                  
TAKPCSAG EQU   X'10'               CHECK STOP AGENT REQUESTED                   
TAKPCSTA EQU   X'08'               CHECK STOP TALENT REQUESTED                  
TAKPCSUN EQU   X'04'               CHECK STOP UNION REQUESTED                   
TAKPCBIN DS    XL6                 CR/BNP INVOICE                               
TAKPAPRB DS    CL8                 APPROVED FOR REISSUE BY                      
TAKPAPRD DS    XL3                 APPROVED FOR REISSUE ON                      
TAKPRECN DS    XL8                 REISSUED ON CHECK#                           
TAKPRECD DS    XL3                 REISSUED ON DATE                             
TAKPRECB DS    XL8                 REISSUED BY                                  
TAKPSRBY DS    XL8                 STOP REQUEST MADE BY                         
TAKPSRDT DS    XL3                 STOP REQUEST MADE DATE                       
TAKPSPBY DS    XL8                 STOP PLACED BY                               
TAKPSPDT DS    XL3                 STOP PLACED DATE                             
         DS    CL10                                                             
*##ASSOCIATED TAKPLEN                                                           
TAKPLNQ  EQU   *-TAKPD                                                          
                                                                                
***********************************************************************         
*        <   > LIFT DETAILS ELEMENT                                   *         
***********************************************************************         
                                                                                
TALFD    DSECT                                                                  
TALFEL   DS    XL1                 ELEMENT CODE                                 
TALFELQ  EQU   X'71'                                                            
TAL2ELQ  EQU   X'0E'               (FOR 2ND ALLOWABLE EDIT FOR ESTIMAT)         
TALFLEN  DS    XL1                 ELEMENT LENGTH                               
TALFLID  DS    CL12                LIFT ID                                      
TALFSEC  DS    XL1                 LENGTH IN SECONDS                            
         DS    CL2                                                              
*##ASSOCIATED TALFLEN                                                           
TALFLNQ  EQU   *-TALFD                                                          
                                                                                
***********************************************************************         
*        <   > LOCAL ELEMENT                                          *         
***********************************************************************         
                                                                                
TALOD    DSECT                                                                  
TALOEL   DS    XL1                 ELEMENT CODE                                 
TALOELQ  EQU   X'34'                                                            
TALOLEN  DS    XL1                 ELEMENT LENGTH                               
TALOSTAT DS    XL1                 STATUS                                       
TALOSHNW EQU   X'80'               HAS H&W FUND                                 
TALOSUCP EQU   X'40'               UNION COPIES REQUIRED WITH CHECKS            
TALOSSN  DS    CL9                 S/S NUMBER FOR LOCAL                         
TALONCPY DS    CL1                 N'UNION COPIES                               
         DS    CL1                                                              
*##ASSOCIATED TALOLEN                                                           
TALOLNQ  EQU   *-TALOD                                                          
                                                                                
***********************************************************************         
*        <   > LIEN DETAILS ELEMENT                                   *         
***********************************************************************         
                                                                                
TALND    DSECT                                                                  
TALNEL   DS    XL1                 ELEMENT CODE                                 
TALNELQ  EQU   X'52'                                                            
TALNLEN  DS    XL1                 ELEMENT LENGTH                               
TALNTYPE DS    CL2                 TYPE                                         
TALNTYCS EQU   C'CS'               CHILD SUPPORT                                
TALNTYFD EQU   C'FD'               FEDERAL TAX LIEN                             
TALNTYST EQU   C'ST'               STATE TAX LIEN                               
TALNTYWG EQU   C'WG'               WAGE GARNISHMENT                             
TALNTYGG EQU   C'GG'               WAGE GAR FROM GROSS (AFTER TAX CALC)         
TALNTYGT EQU   C'GT'               WAGE GAR FROM GROSS (AFTER TAX CALC)         
*                                  PAID TO A TRUSTEE (NO REM BALANCE)           
TALNRNK  DS    XL1                 RANK                                         
TALNR10  EQU   10                  CS - HIGHEST                                 
TALNR20  EQU   20                  FD -                                         
TALNR30  EQU   30                  ST -                                         
TALNR40  EQU   40                  WG -                                         
TALNR50  EQU   50                  GG -                                         
TALNR60  EQU   60                  GT - LOWEST                                  
TALNDUE  DS    XL4                 AMOUNT DUE                                   
TALNCOL  DS    XL4                 COLLECTED AMOUNT                             
TALNXMPT DS    XL4                 EXEMPT AMOUNT (LEAVE ON CHECK)               
TALNAMT  DS    XL4                 DEDUCTION AMOUNT                             
TALNPCT  DS    XL2                 DEDUCTION PERCENTAGE                         
TALNEXP  DS    XL3                 EXPIRATION DATE                              
TALNUNIT DS    CL3                 TAX UNIT                                     
TALNPAYE DS    CL9                 PAYEE - SS# OR FID                           
TALNEMP  DS    CL3                 EMPLOYER                                     
TALNSTAT DS    XL1                 STATUS                                       
TALNSCAN EQU   X'80'               CANADIAN DOLLARS                             
TALNSEUR EQU   X'40'               EUROS                                        
TALNSEFT EQU   X'20'               EFT                                          
TALNMADJ DS    F                   MONTHLY ADJUSTMENT AMOUNT                    
*##ASSOCIATED TALNLEN                                                           
TALNLNQ  EQU   *-TALND                                                          
                                                                                
***********************************************************************         
*        <   > LIEN WITHHOLDING ELEMENT                               *         
***********************************************************************         
                                                                                
TALWD    DSECT                                                                  
TALWEL   DS    XL1                 ELEMENT CODE                                 
TALWELQ  EQU   X'C4'                                                            
TALWLEN  DS    XL1                 ELEMENT LENGTH                               
TALWLIN  DS    CL6                 LIEN CODE                                    
TALWREC  DS    F                   AMOUNT RECOVERED                             
TALWBAL  DS    F                   BALANCE REMAINING                            
*##ASSOCIATED TALWLEN                                                           
TALWLNQ  EQU   *-TALWD                                                          
                                                                                
***********************************************************************         
*        <   > MISC AMOUNT ELEMENT                                    *         
***********************************************************************         
                                                                                
TAMAD    DSECT                                                                  
TAMAEL   DS    XL1                 ELEMENT CODE                                 
TAMAELQ  EQU   X'DB'                                                            
TAMALEN  DS    XL1                 ELEMENT LENGTH                               
TAMATYPE DS    CL1                 TYPE                                         
TAMATYPA EQU   C'A'                AOS AMOUNTS                                  
*##ASSOCIATED TAMDLEN                                                           
TAMALNQ  EQU   *-TAMAD                                                          
TAMADATA DS    0X                                                               
*                                                                               
TAMAASBS DS    XL4                 AOS BASE WAGE                                
TAMAASAM DS    XL4                 AOS AMOUNT                                   
TAMAASPR DS    XL4                 AOS PST RATE                                 
TAMAASPA DS    XL4                 AOS PST AMOUNT                               
*##ASSOCIATED TAMDLEN                                                           
TAMALN2Q EQU   *-TAMAD                                                          
                                                                                
***********************************************************************         
*        <   > MUSIC CONTRACT DETAILS ELEMENT                         *         
***********************************************************************         
                                                                                
TAMCD    DSECT                                                                  
TAMCEL   DS    XL1                 ELEMENT CODE                                 
TAMCELQ  EQU   X'43'                                                            
TAMCLEN  DS    XL1                 ELEMENT LENGTH                               
TAMCSEQ  DS    XL1                 SEQUENCE NUMBER                              
TAMCCON  DS    CL12                CONTRACT NUMBER                              
TAMCTRK  DS    CL1                 TRACK                                        
TAMCLFT  DS    CL1                 LIFT                                         
TAMCLLEN DS    XL2                 LENGTH                                       
TAMCBAS  DS    CL12                AFM BASIC                                    
TAMCTYP  DS    CL1                 MUSIC TYPE                                   
TAMCTYPA EQU   C'A'                ARRANGEMENT OF LICENSED                      
TAMCTYPC EQU   C'C'                ARRANGEMENT OF CLIENT OWNED                  
TAMCTYPL EQU   C'L'                LICENSED                                     
TAMCTYPO EQU   C'O'                ORIGINAL                                     
TAMCTYPP EQU   C'P'                PUBLIC DOMAIN                                
TAMCUNIT DS    XL3                 # OF UNITS FOR EACH TRACK                    
TAMCSTAT DS    XL1                 STATUS                                       
TAMCSNEW EQU   X'80'               CONFORMS TO NEW MUSIC RULES                  
         DS    XL2                 SPARE                                        
TAMCTRKT DS    0CL36               TRACK TITLE FIELD                            
*##ASSOCIATED TACMLEN                                                           
TAMCLNQ  EQU   *-TAMCD                                                          
                                                                                
***********************************************************************         
*        <   > MEDIA (INTERNET/NEW MEDIA) ELEMENT                     *         
***********************************************************************         
                                                                                
TAMDD    DSECT                                                                  
TAMDEL   DS    XL1                 ELEMENT CODE                                 
TAMDELQ  EQU   X'D9'                                                            
TAMDLEN  DS    XL1                 ELEMENT LENGTH                               
TAMDTYPE DS    CL1                 TYPE                                         
TAMDCODE DS    CL4                 CODE                                         
*##ASSOCIATED TAMDLEN                                                           
TAMDLNQ  EQU   *-TAMDD                                                          
                                                                                
***********************************************************************         
*        <   > MASTER WEIGHT DETAILS ELEMENT (VARIABLE LENGTH)        *         
***********************************************************************         
                                                                                
TAMSD    DSECT                                                                  
TAMSEL   DS    XL1                 ELEMENT CODE                                 
TAMSELQ  EQU   X'D8'                                                            
TAMSLEN  DS    XL1                 ELEMENT LENGTH                               
TAMSTYPE DS    XL1                                                              
TAMSTYSP EQU   C'S'                                                             
TAMSWGHT DS    F                   WEIGHT                                       
*##ASSOCIATED TAMSLEN                                                           
TAMSLNQ  EQU   *-TAMSD                                                          
                                                                                
***********************************************************************         
*        <   > CNET/CSYS/MARKET ELEMENT                               *         
***********************************************************************         
                                                                                
TAMTD    DSECT                                                                  
TAMTEL   DS    XL1                 ELEMENT CODE                                 
TAMTELQ  EQU   X'DA'                                                            
TAMTLEN  DS    XL1                 ELEMENT LENGTH                               
TAMTCODE DS    CL6                 CNET/CSYS/MARKET CODE                        
TAMTCYCS DS    XL3                 CYCLE START/EARLIEST USE DATE                
TAMTCYCE DS    XL3                 CYCLE END DATE                               
*##ASSOCIATED TAMTLEN                                                           
TAMTLNQ  EQU   *-TAMTD                                                          
TAMTINUM DS    XL4                 INTERNAL NUMBER (USAGE HISTORY RECS)         
*##ASSOCIATED TAMTLEN                                                           
TAMTULNQ EQU   *-TAMTD                                                          
                                                                                
***********************************************************************         
*        <   > MUSIC ELEMENT                                          *         
***********************************************************************         
                                                                                
TAMUD    DSECT                                                                  
TAMUEL   DS    XL1                 ELEMENT CODE                                 
TAMUELQ  EQU   X'42'                                                            
TAMULEN  DS    XL1                 ELEMENT LENGTH                               
TAMUTYPE DS    CL1                 ELEMENT TYPE                                 
TAMUTAUT EQU   C'A'                AUTHOR                                       
TAMUTCOM EQU   C'C'                COMPOSER                                     
TAMUTPUB EQU   C'P'                PUBLISHER                                    
TAMUTNUM DS    XL1                 TYPE NUMBER (1 FOR AUTHOR1, ETC.)            
TAMULIC  DS    CL1                 LICENSER                                     
         DS    CL1                                                              
TAMUNAME DS    0CL36               NAME                                         
*##ASSOCIATED TAMULEN                                                           
TAMULNQ  EQU   *-TAMUD                                                          
                                                                                
***********************************************************************         
*        <   > NAME ELEMENT                                           *         
***********************************************************************         
                                                                                
TANAD    DSECT                                                                  
TANAEL   DS    XL1                 ELEMENT CODE                                 
TANAELQ  EQU   X'20'                                                            
TANALEN  DS    XL1                 ELEMENT LENGTH                               
TANANAME DS    0CL36               NAME                                         
*##ASSOCIATED TANALEN                                                           
TANALNQ  EQU   *-TANAD                                                          
                                                                                
***********************************************************************         
*        <   > NETWORK/CLASS A DETAILS ELEMENT                        *         
***********************************************************************         
                                                                                
TANDD    DSECT                                                                  
TANDEL   DS    XL1                 ELEMENT CODE                                 
TANDELQ  EQU   X'89'                                                            
TANDLEN  DS    XL1                 ELEMENT LENGTH                               
TANDSTUS DS    H                   START USE NUMBER (NOT INCL. LIFT)            
TANDUSES DS    H                   N'USES TO MAIN COMM'L                        
TANDSTUL DS    H                   START USE NUMBER FOR LIFT ONLY               
TANDUSEL DS    H                   N'USES TO LIFT                               
*##ASSOCIATED TANDLEN                                                           
TANDLNQ  EQU   *-TANDD                                                          
                                                                                
***********************************************************************         
*        <   > NETWORK USERID LIMIT ELEMENT                           *         
***********************************************************************         
                                                                                
TANLD    DSECT                                                                  
TANLEL   DS    XL1                 ELEMENT CODE                                 
TANLELQ  EQU   X'16'                                                            
TANLLEN  DS    XL1                 ELEMENT LENGTH                               
TANLNUID DS    XL1                 N'LIMITED NETWORK USERIDS                    
TANLSPID EQU   X'80'               USES 10 CHAR USERIDS                         
TANLUID  DS    0CL6                LIMITED NETWORK USERIDS                      
TANLXID  DS    0CL10               LIMITED NETWORK USERIDS (10 CHAR)            
*##ASSOCIATED TANLLEN                                                           
TANLLNQ  EQU   *-TANLD                                                          
                                                                                
***********************************************************************         
*        <   > P+ EMPLOYEE NAME (EMPLOYEE AND TIMESHEETS) ELEMENT     *         
***********************************************************************         
                                                                                
TANMD    DSECT                                                                  
TANMEL   DS    XL1                 ELEMENT CODE                                 
TANMELQ  EQU   X'10'                                                            
TANMLEN  DS    XL1                 ELEMENT LENGTH                               
TANMNAM2 DS    CL16                LAST NAME                                    
TANMNAM1 DS    CL16                FIRST NAME                                   
         ORG   TANMNAM2                                                         
TANMCRPN DS    CL32                CORPORATION NAME                             
*##ASSOCIATED TANMLEN                                                           
TANMLNQ  EQU   *-TANMD                                                          
                                                                                
***********************************************************************         
*        <   > NETWORK/CLASS A PROGRAM DETAILS ELEMENT                *         
***********************************************************************         
                                                                                
TANPD    DSECT                                                                  
TANPEL   DS    XL1                 ELEMENT CODE                                 
TANPELQ  EQU   X'8A'                                                            
TANPLEN  DS    XL1                 ELEMENT LENGTH                               
TANPSEQ  DS    XL1                 SEQUENCE NUMBER                              
TANPDATE DS    XL3                 USE DATE                                     
TANPCYCS DS    XL3                 CYCLE START                                  
TANPCYCE DS    XL3                 CYCLE END                                    
TANPCLEN DS    CL5                 CYCLE LENGTH                                 
         ORG   TANPCYCS                                                         
TANPPNME DS    CL15                PROGRAM NAME                                 
TANPNWK  DS    CL1                 NETWORK                                      
         ORG   TANPNWK                                                          
TANPCNTR DS    XL1                 COUNTER FOR CABLE AND SPOT                   
TANPLFT  DS    CL1                 LIFT CODE                                    
TANPLNQ  EQU   *-TANPD                                                          
TANPUSEN DS    XL2                 USE NUMBER                                   
         ORG   TANPUSEN                                                         
TANPAIR  DS    CL1                 REASON NOT AIRED (HOLD RECS ONLY)            
TANPDEL  EQU   C'D'                DELETED                                      
TANPEMPT EQU   C'E'                PRE-EMPTED                                   
TANPMISD EQU   C'M'                MISSED                                       
TANPSTAT DS    XL1                 STATUS                                       
TANPFLAT EQU   X'80'               PGM GETS FLAT RATE- (ULNA,ULNB,ULNC)         
TANPMR   EQU   X'40'               MULITPLE RUN                                 
TANPPAX  EQU   X'20'               PAX NETWORK PROGRAM                          
TANPITN  EQU   X'10'               ITN NETWORK PROGRAM                          
         ORG                                                                    
*##ASSOCIATED TANPLEN                                                           
TANPLNQ2 EQU   *-TANPD                                                          
TANPFEED DS    XL4                 FEED CODE                                    
*##ASSOCIATED TANPLEN                                                           
TANPLNQ3 EQU   *-TANPD                                                          
TANPTYP  DS    XL1                 ELEMENT TYPE                                 
TANPNET  EQU   C'N'                NET CABLE                                    
TANPSPT  EQU   C'S'                SPOT                                         
TANPCSYS EQU   C'C'                CABLE                                        
TANPDATA DS    0X                                                               
*                                                                               
         ORG   TANPDATA            *** TYPE N (NET CABLE) ELEMENTS ***          
TANPNTI  DS    CL4                 NTI STATION CODE                             
         DS    CL1                 EXTRA BYTE FOR STATION CODE                  
*##ASSOCIATED TANPLEN                                                           
TANPLNQN EQU   *-TANPD                                                          
*                                                                               
         ORG   TANPDATA            *** TYPE S (SPOT) ELEMENTS ***               
TANPMKT  DS    CL4                 MARKET CODE (SPOT ONLY)                      
*##ASSOCIATED TANPLEN                                                           
TANPLNQS EQU   *-TANPD                                                          
*                                                                               
         ORG   TANPDATA            *** TYPE C (CABLE) ELEMENTS ***              
TANPSYS  DS    CL6                 SYSTEM CODE                                  
*##ASSOCIATED TANPLEN                                                           
TANPLNQC EQU   *-TANPD                                                          
*                                                                               
TANPMKTN DS    CL15                MARKET NAME                                  
*##ASSOCIATED TANPLEN                                                           
TANPLNQ4 EQU   *-TANPD                                                          
                                                                                
***********************************************************************         
*        <   > FREE FORM NUMBER ELEMENT                               *         
***********************************************************************         
                                                                                
TANUD    DSECT                                                                  
TANUEL   DS    XL1                 ELEMENT CODE                                 
TANUELQ  EQU   X'25'                                                            
TANULEN  DS    XL1                 ELEMENT LENGTH                               
TANUTYPE DS    CL1                 NUMBER TYPE                                  
TANUTAUT EQU   C'A'                AGENCY PO/AUTH                               
TANUTSIG EQU   C'B'                SIGNATORY                                    
TANUTCO  EQU   C'C'                COMPANY & OFFICE (CO= ON AGENCY REC)         
TANUTSVC EQU   C'D'                SERVICES FOR AGENCY CODE(PCOMML REC)         
TANUTEST EQU   C'E'                ESTIMATE NUMBER                              
TANUTFAX EQU   C'F'                FAX NUMBER                                   
TANUTGST EQU   C'G'                GST TAX NUMBER                               
TANUTPHN EQU   C'H'                PHONE NUMBER                                 
TANUTINV EQU   C'I'                ERROR INVOICE NUMBER                         
TANUTJOB EQU   C'J'                ESTIMATE SETUP LENGTHS                       
TANUTMKT EQU   C'K'                ALPHA MARKET                                 
TANUTLOC EQU   C'L'                LOCAL ACCOUNT NUMBER                         
TANUTMEM EQU   C'M'                ACTRA MEMBERSHIP NUMBER                      
TANUTNDV EQU   C'N'                NEW ADVICE NUMBER (ON LOCKED ADVICE)         
TANUTPHO EQU   C'O'                PHOTOGRAPHER SSN                             
TANUTISP EQU   C'P'                PREV. COMM ID (EXISTS AFTER 1ST CHG)         
TANUCPSQ EQU   C'Q'                TALDCPTR SEQ FOR TLSYTYPE=3 ONLY             
TANUTREV EQU   C'R'                ESTIMATE REVISION NUMBER                     
TANUTSPL EQU   C'S'                PRIMARY INVOICE FOR SPLIT BILLING            
TANUTCST EQU   C'T'                CAST SSN CONTRIB TO PRINT AGENT CHK          
TANUTUDA EQU   C'U'                UDA NUMBER                                   
TANUTVND EQU   C'V'                VENDOR NUMBER (ON AGENCY REC)                
TANUTMAT EQU   C'W'                MATERIAL CODE (ON PRODUCT REC)               
TANUTCTR EQU   C'X'                COST CENTER (ON PRODUCT REC)                 
TANUTLIN EQU   C'Y'                LIEN PAYER S/S NUMBER (ON LIEN CHKS)         
TANUTFEE EQU   C'Z'                # OF SESSION FEES (ADVICE)                   
TANUTSEQ EQU   C'1'                NEXT CAST SEQUENCE NUMBER                    
TANUT2ND EQU   C'2'                2ND SS NUMBER FOR UNION LCL RECORD           
TAUNTOVA EQU   C'3'                OVERSCALE AMOUNT                             
TANUTRST EQU   C'4'                W4 TRUSTEE (ON TRUSTEE CHECK)                
TANUEPID EQU   C'5'                W4 ASSOCIATED WITH BILL/CHK ERROR            
TANUTSGN EQU   C'6'                SIGNATORY FEE                                
TANUTSCP EQU   C'7'                SIGNATORY FEE CAP                            
TANUBUSI EQU   C'8'                BUSINESS UNIT                                
TANUPIDN EQU   C'9'                PID NUMBER                                   
TANUTDRT EQU   C'!'                DEFAULT RATE                                 
TANUTPAC EQU   C'@'                PRODUCTIONS PLUS AGY COMMISSION              
TANUTARE EQU   C'#'                ADVANCE RECONCILIATION AMOUNT                
TANURT4I EQU   C'<'                RETRO FOR INVOICE NUMBER                     
TANUTPHR EQU   C'>'                P&H RATE                                     
TANUTDJB EQU   C'$'                AGENCY DEFAULT JOB                           
*##ASSOCIATED TANULEN                                                           
TANULNQ  EQU   *-TANUD                                                          
*##DATATYPE RESTOFEL                                                            
TANUMBER DS    0C                                                               
         ORG   TANUMBER                                                         
TANUNXTC DS    XL2                 NEXT CAST SEQUENCE NUMBER                    
TANULNQ1 EQU   *-TANUD                                                          
         ORG   TANUMBER                                                         
TANUOVAM DS    XL4                 OVERSCALE AMOUNT/DEFAULT RATE                
TANULNQ2 EQU   *-TANUD                                                          
                                                                                
***********************************************************************         
*        <   > SPOT AND NETWORK TRANSFER DETAILSNT                    *         
***********************************************************************         
                                                                                
TANXD    DSECT                                                                  
TANXEL   DS    XL1                 ELEMENT CODE                                 
TANXELQ  EQU   X'D7'                                                            
TANXLEN  DS    XL1                 ELEMENT LENGTH                               
TANXAGY  DS    CL6                 TALENT AGENCY CODE                           
TANXUID  DS    CL8                 USER ID NUMBER OF WORKER FILE                
TANXNCID DS    CL8                 TRAFFIC COMMERCIAL ID                        
TANXSEC  DS    XL1                 LENGTH IN SECONDS                            
TANXMDTE DS    XL3                 DATE MATCHED                                 
TANXUDTE DS    XL3                 DATE USED                                    
TANXADTE DS    XL3                 DATE ADDED                                   
TANXCOM  DS    XL4                 INTERNAL COMMERCIAL # (MATCHED)              
TANXTYPE DS    CL1                 COMMERCIAL TYPE                              
TANXTAKA EQU   C'A'                MATCHED VIA ALIAS RECORD                     
TANXTCYC EQU   C'C'                NOT MATCHED B/C CYCLES DON'T COVER           
TANXTTAL EQU   C'E'                MATCHED EXACTLY                              
TANXTALF EQU   C'F'                MATCHED VIA ALIAS RECORD AS A LIFT           
TANXTLFT EQU   C'L'                MATCHED VIA LIFT ID                          
TANXTVER EQU   C'V'                MATCHED VIA VERSION ID                       
TANXTALV EQU   C'W'                MATCHED VIA ALIAS RECORD AS A VERS           
TANXCCDE DS    XL1                 CHANGED USE CODE (FROM NETWORK SIDE)         
TANXCVFY EQU   X'80'               VERIFY-MIGHT BE DUP (SET IN NINTER)          
**NXCMGD EQU   X'40'               MAKEGOOD - NOT USED ANYMORE                  
TANXCUNM EQU   X'20'               UNMARKED                                     
TANXCAIR EQU   X'10'               NOT AIRED (SEE TANPAIR FOR DETAILS)          
TANXCLEN EQU   X'08'               LENGTH CHANGE                                
TANXCPRD EQU   X'04'               PRODUCT CHANGE                               
TANXCDTE EQU   X'02'               DATE CHANGE                                  
TANXCCID EQU   X'01'               COMMERCIAL CHANGE                            
TANXSTAT DS    XL1                 STATUS                                       
TANXSAGY EQU   X'80'               AGENCY TRANSFER                              
TANXSCHG EQU   X'40'               CHANGED SINCE SENT STATUS                    
TANXPACK EQU   X'20'               PACKED COMMERCIAL                            
TANXNDDS EQU   X'10'               NON-DDS CLARUS                               
TANXVERS DS    CL1                 VERSION LETTER                               
TANXMED  DS    CL1                 MEDIA CODE                                   
TANXMTV  EQU   C'T'                TELEVISION                                   
TANXMRAD EQU   C'R'                RADIO                                        
         DS    CL1                 SPARE                                        
*##ASSOCIATED TANXLEN                                                           
TANXLNQ  EQU   *-TANXD                                                          
TANXADID DS    CL12                                                             
         DS    CL4                 SPARE                                        
*##ASSOCIATED TANXLEN                                                           
TANXLN2Q EQU   *-TANXD                                                          
         EJECT                                                                  
***********************************************************************         
*        <   > NR4 DETAILS ELEMENT                                    *         
***********************************************************************         
                                                                                
TAN4D    DSECT                                                                  
TAN4EL   DS    XL1                 ELEMENT CODE                                 
TAN4ELQ  EQU   X'49'                                                            
TAN4LEN  DS    XL1                 ELEMENT LENGTH                               
                                                                                
TAN4UNIT DS    CL3                 TAX UNIT                                     
TAN4RCPT DS    C                   RECIPIENT CODE                               
TAN4CTRY DS    CL3                 COUNTRY CODE                                 
TAN4FTI  DS    CL9                 FOREIGN TAX ID                               
TAN4INCC DS    CL2                 INCOME CODE                                  
TAN4CURR DS    XL3                 CURRENCY CODE                                
TAN4DPRT DS    XL3                 PWOS - DATE PRINTED                          
         DS    XL2                 SPARE                                        
TAN4AMTS DS    0XL16                                                            
TAN4EARN DS    F                   EMPLOYMENT INCOME                            
TAN4TAX  DS    F                   NR4 TAX DEDUCTED                             
         DS    2F                  SPARE                                        
*##ASSOCIATED TAN4LEN                                                           
TAN4LNQ  EQU   *-TAN4D                                                          
                                                                                
***********************************************************************         
*        <   > CAST OVERSCALE 2ND PERCENT ELEMENT                     *         
***********************************************************************         
                                                                                
TAO2D    DSECT                                                                  
TAO2EL   DS    XL1                 ELEMENT CODE                                 
TAO2ELQ  EQU   X'69'                                                            
TAO2LEN  DS    XL1                 ELEMENT LENGTH                               
TAO2NUM  DS    XL1                 N'SUB-ELEMENTS  (OK-EXPAND)                  
*##ASSOCIATED TAO2LEN                                                           
TAO2LNQ  EQU   *-TAO2D                                                          
TAO2SBEL DS    0CL7                SUB-ELEMENTS                                 
TAO2USE  DS    CL3                 USE CODE (SPACES=ALL)                        
TAO2PCT  DS    XL4                 OVERSCALE PERCENT (2 DEC. PLACES)            
TAO2XSUB DS    0C                  END OF SUB-ELEMENT                           
                                                                                
***********************************************************************         
*        <   > CAST OVERSCALE AMOUNT ELEMENT                          *         
***********************************************************************         
                                                                                
TAOAD    DSECT                                                                  
TAOAEL   DS    XL1                 ELEMENT CODE                                 
TAOAELQ  EQU   X'67'                                                            
TAOALEN  DS    XL1                 ELEMENT LENGTH                               
TAOANUM  DS    XL1                 N'SUB-ELEMENTS  (OK-EXPAND)                  
*##ASSOCIATED TAOALEN                                                           
TAOALNQ  EQU   *-TAOAD                                                          
TAOASBEL DS    0CL7                SUB-ELEMENTS                                 
TAOAUSE  DS    CL3                 USE CODE (SPACES=ALL)                        
TAOAAMT  DS    XL4                 OVERSCALE AMOUNT (2 DEC. PLACES)             
TAOAXSUB DS    0C                  END OF SUB-ELEMENT                           
                                                                                
***********************************************************************         
*        <   > ORIGINAL (CANCELLED INVOICE) BILL DATE ELEMENT         *         
***********************************************************************         
                                                                                
TAOBD    DSECT                                                                  
TAOBEL   DS    XL1                 ELEMENT CODE                                 
TAOBELQ  EQU   X'53'                                                            
TAOBLEN  DS    XL1                 ELEMENT LENGTH                               
TAOBBDTE DS    XL3                 PWOS ORIGINAL BILL DATE                      
         DS    CL3                                                              
*##ASSOCIATED TAOBLEN                                                           
TAOBLNQ  EQU   *-TAOBD                                                          
                                                                                
***********************************************************************         
*        <   > OLD AGENCY/CID/MKT ELEMENT                             *         
***********************************************************************         
                                                                                
TAOCD    DSECT                                                                  
TAOCEL   DS    XL1                 ELEMENT CODE                                 
TAOCELQ  EQU   X'24'                                                            
TAOCLEN  DS    XL1                 ELEMENT LENGTH                               
TAOCDTE  DS    XL3                 EFFECTIVE DATE (COMPLEMENTED)                
TAOCAGY  DS    CL6                 OLD/TO/FROM AGENCY                           
         ORG   TAOCAGY                                                          
TAOCCODE DS    CL6                 CNET/CSYS/MARKET CODE                        
TAOCCID  DS    CL12                OLD/TO/FROM COMM ID                          
TAOCCOM  DS    XL4                 TO/FROM INTERNAL COMMERCIAL NUMBER           
TAOCSTAT DS    XL1                 STATUS  (BLANK = CID/NEW)                    
TAOCSFRO EQU   X'80'               FROM                                         
TAOCSTO  EQU   X'40'               TO                                           
         DS    CL4                                                              
*##ASSOCIATED TAOCLEN                                                           
TAOCLNQ  EQU   *-TAOCD                                                          
                                                                                
***********************************************************************         
*        <   > OTHER DEDUCTION ELEMENT                                *         
***********************************************************************         
                                                                                
TAODD    DSECT                                                                  
TAODEL   DS    XL1                 ELEMENT CODE                                 
TAODELQ  EQU   X'C5'                                                            
TAODLEN  DS    XL1                 ELEMENT LENGTH                               
TAODTYPE DS    CL1                 DEDUCTION TYPE                               
TAODTYPF EQU   C'F'                          FEDERAL TAX                        
TAODTYPM EQU   C'M'                          MPR                                
TAODTYPP EQU   C'P'                          PERM CHARITIES                     
TAODTYPO EQU   C'O'                          OTHERS                             
TAODTYPD EQU   C'D'                          DIRECT DEPOSIT                     
TAODTYPW EQU   C'W'                          WIRE TRANSFER                      
TAODTYPT EQU   C'T'                          W4 TRUSTEE                         
         DS    CL1                                                              
TAODAMT  DS    F                   AMOUNT                                       
*##ASSOCIATED TAODLEN                                                           
TAODLNQ  EQU   *-TAODD                                                          
                                                                                
***********************************************************************         
*        <   > OFFICE DETAILS ELEMENT                                 *         
***********************************************************************         
                                                                                
TAOFD    DSECT                                                                  
TAOFEL   DS    XL1                 ELEMENT CODE                                 
TAOFELQ  EQU   X'08'                                                            
TAOFLEN  DS    XL1                 ELEMENT LENGTH                               
TAOFIDNO DS    H                   ID NUMBER                                    
TAOFIDCD DS    CL6                 ID CODE                                      
TAOFTEL  DS    CL12                TELEPHONE NUMBER                             
         DS    CL4                                                              
*##ASSOCIATED TAOFLEN                                                           
TAOFLNQ  EQU   *-TAOFD                                                          
                                                                                
***********************************************************************         
*        <   > OLD AGENCY/INVOICE ELEMENT                             *         
***********************************************************************         
                                                                                
TAOID    DSECT                                                                  
TAOIEL   DS    XL1                 ELEMENT CODE                                 
TAOIELQ  EQU   X'27'                                                            
TAOILEN  DS    XL1                 ELEMENT LENGTH                               
TAOIAGY  DS    CL6                 OLD AGENCY                                   
TAOIINV  DS    XL6                 OLD INVOICE NUMBER                           
*##ASSOCIATED TAOILEN                                                           
TAOILNQ  EQU   *-TAOID                                                          
                                                                                
***********************************************************************         
*        <   > OLD CHECK DATE/SEQUENCE NUMBER ELEMENT                 *         
***********************************************************************         
                                                                                
TAOKD    DSECT                                                                  
TAOKEL   DS    XL1                 ELEMENT CODE                                 
TAOKELQ  EQU   X'28'                                                            
TAOKLEN  DS    XL1                 ELEMENT LENGTH                               
TAOKDTE  DS    XL3                 OLD CHECK DATE                               
TAOKSEQ  DS    XL4                 OLD CHECK PROCESSED SEQUENCE NUMBER          
*##ASSOCIATED TAOKLEN                                                           
TAOKLNQ  EQU   *-TAOKD                                                          
                                                                                
***********************************************************************         
*        <   > OLD AGENCY/NETWORK ID ELEMENT                          *         
***********************************************************************         
                                                                                
TAOND    DSECT                                                                  
TAONEL   DS    XL1                 ELEMENT CODE                                 
TAONELQ  EQU   X'29'                                                            
TAONLEN  DS    XL1                 ELEMENT LENGTH                               
TAONDTE  DS    XL3                 EFFECTIVE DATE (COMPLEMENTED)                
TAONTIM  DS    XL3                 EFFECTIVE TIME (COMPLEMENTED)                
TAONAGY  DS    CL6                 OLD AGENCY CODE                              
TAONNID  DS    CL8                 OLD NETWORK ID                               
         DS    XL4                 SPARE                                        
*##ASSOCIATED TAONLEN                                                           
TAONLNQ  EQU   *-TAOND                                                          
                                                                                
***********************************************************************         
*        <   > CAST OVERSCALE PERCENT ELEMENT                         *         
***********************************************************************         
                                                                                
TAOPD    DSECT                                                                  
TAOPEL   DS    XL1                 ELEMENT CODE                                 
TAOPELQ  EQU   X'66'                                                            
TAOPLEN  DS    XL1                 ELEMENT LENGTH                               
TAOPNUM  DS    XL1                 N'SUB-ELEMENTS  (OK-EXPAND)                  
*##ASSOCIATED TAOPLEN                                                           
TAOPLNQ  EQU   *-TAOPD                                                          
TAOPSBEL DS    0CL7                SUB-ELEMENTS                                 
TAOPUSE  DS    CL3                 USE CODE (SPACES=ALL)                        
TAOPPCT  DS    XL4                 OVERSCALE PERCENT (2 DEC. PLACES)            
TAOPXSUB DS    0C                  END OF SUB-ELEMENT                           
                                                                                
***********************************************************************         
*        <   > OTHER WITHHOLDING ELEMENT                              *         
***********************************************************************         
                                                                                
TAOWD    DSECT                                                                  
TAOWEL   DS    XL1                 ELEMENT CODE                                 
TAOWELQ  EQU   X'7B'                                                            
TAOWLEN  DS    XL1                 ELEMENT LENGTH                               
TAOWTYPE DS    CL1                 OTHER TYPE                                   
TAOWTCHA EQU   C'C'                PERMANENT CHARITY                            
TAOWTMPF EQU   C'M'                MOTION PICTURE FUND                          
         DS    CL1                                                              
TAOWFLAT DS    F                   FLAT RATE (2 DEC.)                           
*##ASSOCIATED TAOWLEN                                                           
TAOWLNQ  EQU   *-TAOWD                                                          
                                                                                
***********************************************************************         
*        <   > PAY OPTIONS ELEMENT                                    *         
***********************************************************************         
                                                                                
TAPAD    DSECT                                                                  
TAPAEL   DS    XL1                 ELEMENT CODE                                 
TAPAELQ  EQU   X'82'                                                            
TAPALEN  DS    XL1                 ELEMENT LENGTH                               
TAPATYPE DS    CL1                 OPTION TYPE                                  
TAPATCHA EQU   C'A'                OVERRIDE CHLOE HANDLING AMOUNT               
TAPATCSF EQU   C'C'                OVERRIDE CONTRACT SERVICE FEE AMOUNT         
TAPATHND EQU   C'D'                OVERRIDE HANDLING AMOUNT                     
TAPATFEE EQU   C'E'                FEE                                          
TAPATFIC EQU   C'F'                OVERRIDE FICA AMOUNT                         
TAPATGST EQU   C'G'                OVERRIDE GST AMOUNT                          
TAPATHNW EQU   C'H'                H&W ADJUSTMENT AMOUNT                        
TAPATCHO EQU   C'O'                OVERRIDE CHLOE HANDLING PERCENTAGE           
TAPATPHR EQU   C'P'                P&H RATE                                     
TAPATSOC EQU   C'R'                SOC RATE                                     
TAPATTAX EQU   C'T'                OVERRIDE TAX AMOUNT                          
*                                  (INDICATES CSF=$$$ INSTEAD OF CSF=Y)         
TAPADATA DS    0C                                                               
*##ASSOCIATED TAPALEN                                                           
TAPALNQ  EQU   *-TAPAD                                                          
                                                                                
***********************************************************************         
*        <   > PROVINCES CANADIAN ELEMENT                             *         
***********************************************************************         
                                                                                
TAPCD    DSECT                                                                  
TAPCEL   DS    XL1                 ELEMENT CODE                                 
TAPCELQ  EQU   X'05'                                                            
TAPCLEN  DS    XL1                 ELEMENT LENGTH                               
TAPCGSTR DS    XL4                 GST RATE                                     
TAPCNSUB DS    XL1                 NUMBER OF SUB-ELEMENTS                       
TAPCDATA DS    0C                                                               
*##ASSOCIATED TAPCLEN                                                           
TAPCLNQ  EQU   *-TAPCD                                                          
                                                                                
TAPCPROV DS    CL3                 PROVINCE CODE                                
TAPCSTAT DS    XL1                 PROVINCE STATUS                              
TAPCSHST EQU   X'80'               PROVINCE WANTS HST                           
TAPCPSTR DS    XL4                 PROVINCE PST RATE                            
*##ASSOCIATED TAPCLEN                                                           
TAPCSLNQ EQU   *-TAPCPROV                                                       
                                                                                
***********************************************************************         
*        <   > PAYMENT DETAILS ELEMENT                                *         
***********************************************************************         
                                                                                
TAPDD    DSECT                                                                  
TAPDEL   DS    XL1                 ELEMENT CODE                                 
TAPDELQ  EQU   X'80'                                                            
TAEUELQ  EQU   X'91'               IN EUROS                                     
TAPPELQ  EQU   X'94'               PRE-PYMT/LIST                                
TAPDELQ4 EQU   X'EF'               IN CAN$                                      
TAPDLEN  DS    XL1                 ELEMENT LENGTH                               
TAPDCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TAPDINV  DS    XL6                 INVOICE NUMBER                               
TAPDUSE  DS    CL3                 USE CODE                                     
TAPDTYPE DS    CL1                 TYPE OF PAYMENT FOR USE                      
TAPDW4TY DS    CL1                 TAW4TYPE UNLESS PAYING INDIV AS CORP         
TAPDOFF  DS    CL1                 TP OFFICE                                    
TAPDTAGS DS    XL1                 NUMBER OF TAGS                               
TAPDCYCS DS    XL3                 CYCLE START DATE                             
TAPDCYCE DS    XL3                 CYCLE END DATE                               
TAPDACDE DS    CL1                 APPLIED CODE                                 
TAPDICDE DS    CL1                 INCLUDE CODE (REIMB. EXPENSES)               
TAPDESPD DS    XL1                 ESTIMATE PERIOD (1-13)                       
TAPDAMTS DS    0F                                                               
TAPDGRS  DS    F                   GROSS                                        
TAPDAPPL DS    F                   APPLIED CREDITS                              
TAPDGUAR DS    F                   GUARANTEE CREDITS                            
TAPDPAYI DS    F                   PAYMENT AMOUNT FOR INDIVIDUALS               
TAPDPAYC DS    F                   PAYMENT AMOUNT FOR CORPORATIONS              
TAPDREXP DS    F                   REIMBURSED EXPENSES                          
TAPDSPNH DS    F                   SUBJECT TO P&H                               
TAPDMDED DS    F                   MISCELLANEOUS DEDUCTION                      
TAPDPNH  DS    F                   PENSION & HEALTH                             
TAPDHNW  DS    F                   HEALTH & WELFARE                             
TAPDINR  DS    F                   INSURANCE & RETIREMENT                       
TAPDDUES DS    F                   UNION DUES (ANOTHER DEDUCTION)               
TAPDGCON DS    F                   GUARANTEE CONTRACT CREDITS                   
TAPDAMTL EQU   *-TAPDAMTS                                                       
TAPDINS  DS    H                   NUMBER OF INSERTS                            
TAPDSTUS DS    H                   STARTING USE NUMBER                          
TAPDUSES DS    H                   NUMBER OF USES - TOTAL                       
TAPDUNIT DS    H                   NUMBER OF UNITS                              
TAPDMAJ  DS    XL1                 MAJOR CITIES                                 
TAPDSTAT DS    XL1                 STATUS                                       
TAPDSMAN EQU   X'80'               MANUAL OVERRIDE                              
TAPDSCAN EQU   X'40'               CANADIAN DOLLAR PAYMENT                      
TAPDSLFT EQU   X'20'               PAYMENT MADE TO LIFT W/LFT=Y                 
TAPDSDDS EQU   X'10'               PAID ON A DDS TERMINAL                       
TAPDSGUP EQU   X'08'               GUARANTEE RECORD UPDATED                     
TAPDSGOF EQU   X'04'               GUARANTEE APPLIED OFFLINE                    
TAPDSCNL EQU   X'02'               CANCELLED                                    
TAPDSOVJ EQU   X'01'               OVERRODE JOB NUMBER ERROR                    
TAPDSTA2 DS    XL1                 STATUS                                       
TAPDSPRI EQU   X'80'               FIXED CYCLE PMT ON GUAR PRI COMML            
TAPDSLFA EQU   X'40'               PAYMENT MADE TO ALL ON COMM W/LFT=A          
TAPDSFUP EQU   X'20'               FORCED WSP UPGRADE                           
TAPDSPRM EQU   X'10'               PRIMARY INVOICE                              
TAPDSSUB EQU   X'08'               SUBSIDIARY INVOICE                           
TAPDSVER EQU   X'04'               PAYMENT MADE TO A VERSION                    
TAPDSCPO EQU   X'02'               PO VALID FOR CLOSE                           
TAPDAFTR EQU   X'01'               AFTRA CAST ON PAYMENT                        
TAPDADJS DS    XL1                 PAYROLL ADJUSTMENT INDICATORS                
TAPDADVD EQU   X'80'               VOID CHECK                                   
TAPDADRI EQU   X'40'               REISSUE CHECK                                
TAPDADIS EQU   X'20'               ISSUE CHECK                                  
TAPDADTR EQU   X'10'               TAX REFUND CHECK                             
TAPDADTT EQU   X'08'               TAX TRANSFER CHECK                           
TAPDADST EQU   X'04'               SSN TRANSFER CHECK                           
TAPDPSTS DS    0CL3                PAYMENT STATUS BYTES                         
TAPDPST1 DS    XL1                                                              
TAPDPSEL EQU   X'80'               CAST SELECTED                                
TAPDPCRD EQU   X'40'               CREDIT PAYMENT                               
TAPDPBNP EQU   X'20'               BILL-NO-PAYROLL PAYMENT                      
TAPDPDTL EQU   X'10'               DISPLAY DETAIL                               
TAPDPCHG EQU   X'08'               PAYMENT WAS CHANGED                          
TAPDOVER EQU   X'04'               MARKET INPUT OVERRIDDEN                      
TAPDELIM EQU   X'02'               DUPLICATE MARKETS OVERRIDDEN                 
TAPDDFUH EQU   X'01'               CAST HAS DIFFERING USAGE HISTORY             
TAPDPST2 DS    XL1                                                              
TAPDPCYC EQU   X'80'               PAYMENT TO PER CYCLE COMMERCIAL              
TAPDFWEB EQU   X'40'               PAYMENT FROM WEB APPLICATION                 
TAPDPEUR EQU   X'20'               EURO-BASED PAYMENT                           
TAPDPOPA EQU   X'10'               WEB APP OVERRIDE OF PAYMENT AMOUNT           
TAPDPOPH EQU   X'08'               WEB APP OVERRIDE OF SUBJECT TO P&H           
TAPDPITC EQU   X'04'               GRT INSTALLMENT APPLY AT BILL/CHKS           
TAPDPCIB EQU   X'02'               CREDITED INV HAS SAVED BILLING RATES         
TAPDPCAL EQU   X'01'               INVOICE INCLUDES WORK IN CALIFORNIA          
TAPDSTA3 DS    XL1                 STATUS                                       
TAPDSGCU EQU   X'80'               GCON RECORD UPDATED                          
TAPDSNR1 EQU   X'40'               PAID 1ST NON-RENDERED VERSION                
TAPDSC16 EQU   X'20'               CONTRACT YEAR 16 PERFORMERS PAID             
TAPDOPTS DS    0CL3                PAYMENT OPTIONS                              
TAPDOPT1 DS    XL1                                                              
TAPDOAPH EQU   X'80'               APPLY CREDITS (CODE=APPLHLD)                 
TAPDONAC EQU   X'40'               DON'T APPLY CREDITS                          
TAPDONGC EQU   X'20'               DON'T TAKE GUARANTEE CREDITS                 
TAPDOGST EQU   X'10'               GST AMOUNT OVERRIDE                          
TAPDOCAN EQU   X'08'               TAKE CANADIAN TAXES                          
TAPDOPHR EQU   X'04'               P&H RATE OVERRIDE                            
TAPDOTAX EQU   X'02'               TAX AMOUNT OVERRIDE                          
TAPDOHND EQU   X'01'               HANDLING AMT OVERRIDE (INDIV & CORP)         
TAPDOPT2 DS    XL1                                                              
TAPDOURG EQU   X'80'               URGENT PAYMENT - DUE TODAY                   
TAPDODCL EQU   X'40'               DUE COMPANY RECOVER FROM CLIENT ONLY         
TAPDODAY EQU   X'20'               DUE COMPANY RECOVER FROM AGENCY ONLY         
TAPDODAL EQU   X'10'               DUE COMPANY RECOVER FROM ALL                 
TAPDOFCR EQU   X'08'               FICA CREDITS OVERRIDE                        
TAPDOAPS EQU   X'04'               APPLY CREDITS (CODE=APPLSESS)                
TAPDOPTU EQU   X'02'               PREVIOUS TOTAL USES PAID OVERRIDE            
TAPDOPLU EQU   X'01'               PREVIOUS LIFT USES PAID OVERRIDE             
TAPDOPT3 DS    XL1                                                              
TAPDONUS EQU   X'80'               NUMBER OF USES TO PAY OVERRIDE               
TAPDOHNW EQU   X'40'               H&W AMOUNT ADJUSTMENT                        
TAPDOCCR EQU   X'20'               CANADIAN CONVERSION RATE                     
TAPDODUM EQU   X'10'               DUMMY PAYMENT                                
TAPDOGRY EQU   X'08'               GREY PAYMENT (FOR P&G)                       
TAPDORET EQU   X'04'               RETROACTIVE PAYMENT                          
TAPDOCOD EQU   X'02'               COD INVOICE                                  
TAPDOHNC EQU   X'01'               CORP HANDLING AMT OVERRIDE                   
TAPDEOR  DS    0CL3                                                             
TAPDEMP  DS    CL3                 EMPLOYER-OF-RECORD                           
TAPDCLI  DS    CL6                 CLIENT                                       
TAPDPRD  DS    CL6                 PRODUCT                                      
TAPDOV1  DS    XL4                 OVERSCALE RATE 1                             
TAPDAREA DS    CL3                 AREA FOR PRT PAYMENT                         
TAPDPUSE DS    CL3                 USE FOR PRT PAYMENT                          
TAPDDEMS DS    XL1                 NUMBER OF DEMOS                              
TAPDOPT4 DS    CL1                 PAYMENT OPTION 4                             
TAPDOCSF EQU   X'80'               GENERATED CONTRACT SERVICE FEE CHK           
TAPDOSOC EQU   X'40'               SOC RATE OVERRIDE                            
TAPDONOI EQU   X'20'               NO INTERFACE                                 
TAPDGRTE EQU   X'10'               APPLY TO GUARANTEE BASED ON END DATE         
TAPDOJPC EQU   X'08'               FORCE JPC CSF FEE (US$ INVOICES)             
TAPDOEUR EQU   X'04'               EURO-BASED PAYMENT                           
TAPDOHDA EQU   X'02'               CHLOE HANDLING AMOUNT OVERRIDE               
TAPDOHDP EQU   X'01'               CHLOE HANDLING PERCENTAGE OVERRIDE           
TAPDOPT5 DS    CL1                 PAYMENT OPTION 5                             
TAPDORG2 EQU   X'80'               PROCESS IN SECOND REGRESSION RUN             
TAPDONHW EQU   X'40'               DO NOT PRINT H&W COLUMN IN BILLING           
TAPDTXNW DS    XL4                 TAXABLE REIMBURSEMENTS                       
TAPDNTNW DS    XL4                 NON-TAXABLE REIMBURSEMENTS                   
*##ASSOCIATED TAPDLEN                                                           
TAPDLNQ  EQU   *-TAPDD                                                          
                                                                                
***********************************************************************         
*        <   > PAYEE ELEMENT                                          *         
***********************************************************************         
                                                                                
TAPED    DSECT                                                                  
TAPEEL   DS    XL1                 ELEMENT CODE                                 
TAPEELQ  EQU   X'7C'                                                            
TAPELEN  DS    XL1                 ELEMENT LENGTH                               
TAPENAME DS    CL36                PAYEE NAME                                   
TAPEADD1 DS    CL30                ADDRESS LINE 1                               
TAPEADD2 DS    CL30                             2                               
TAPEADD3 DS    CL30                             3                               
TAPEADD4 DS    CL30                             4                               
TAPEEXP  DS    XL3                 EXPIRY DATE                                  
TAPEACT  DS    XL3                 ACTIVE DATE                                  
TAPECITY DS    CL25                CITY                                         
TAPEST   DS    CL2                 STATE                                        
TAPEZIP  DS    CL10                ZIP                                          
TAPECTRY DS    CL2                 COUNTRY                                      
*##ASSOCIATED TAPELEN                                                           
TAPELNQ  EQU   *-TAPED                                                          
                                                                                
***********************************************************************         
*        <   > POSTING DETAILS ELEMENT                                *         
***********************************************************************         
                                                                                
TAPGD    DSECT                                                                  
TAPGEL   DS    XL1                 ELEMENT CODE                                 
TAPGELQ  EQU   X'90'               REGULAR BILL DETAILS ELEMENT CODE            
TAPGLEN  DS    XL1                 ELEMENT LENGTH                               
         DS    XL2                 SPARE                                        
                                                                                
TAPGHNDI DS    F                   HANDLING INDIVIDUAL BASIC                    
TAPGHPRI DS    F                   HANDLING INDIVIDUAL PREMIUM                  
TAPGHNDC DS    F                   HANDLING CORP BASIC                          
TAPGHPRC DS    F                   HANDLING CORP PREMIUM                        
TAPGHIAG DS    F                   HANDLING ON APPLIED GRT IND BASIC            
TAPGHIAP DS    F                   HANDLING ON APPLIED GRT IND PREM             
TAPGHCAG DS    F                   HANDLING ON APPLIED GRT CORP BASIC           
TAPGHCAP DS    F                   HANDLING ON APPLIED GRT CORP PREM            
                                                                                
TAPGFUTA DS    F                   FUTA                                         
TAPGSUTA DS    F                   SUTA                                         
TAPGFICA DS    F                   FICA                                         
TAPGMED  DS    F                   MEDICARE                                     
TAPGWCN  DS    F                   WORKMEN'S COMP FOR NON-CORPS                 
TAPGWCC  DS    F                   WORKMEN'S COMP FOR CORPS                     
                                                                                
TAPGWFEE DS    F                   WIRE FEE                                     
                                                                                
TAPGCGST DS    F                   CAN$ GST TAX                                 
TAPGUGST DS    F                   US$ GST TAX                                  
TAPGEND  EQU   *                                                                
*##ASSOCIATED TAPGLEN                                                           
TAPGLNQ  EQU   *-TAPGD                                                          
                                                                                
***********************************************************************         
*        <   > PRODUCT INFORMATION ELEMENT                            *         
***********************************************************************         
                                                                                
TAPID    DSECT                                                                  
TAPIEL   DS    XL1                 ELEMENT CODE                                 
TAPIELQ  EQU   X'2D'                                                            
TAPILEN  DS    XL1                 ELEMENT LENGTH                               
TAPICLG  DS    CL6                 CLIENT GROUP                                 
TAPIPRG  DS    CL6                 PRODUCT GROUP                                
TAPIAC   DS    CL2                 COMMISSION PCT.                              
TAPISTAT DS    XL1                 PRODUCT STATUS                               
TAPISLCK EQU   X'80'               LOCKED                                       
TAPIJPCN EQU   X'02'               DON'T CHARGE JPC CSF                         
TAPIJPCY EQU   X'01'               TAAYJPCY - CAN CHARGE JPC CSF                
         DS    CL1                 SPARE                                        
*##ASSOCIATED TAPILEN                                                           
TAPILNQ  EQU   *-TAPID                                                          
TAPIPTYP DS    CL6                 PRODUCT TYPE                                 
         DS    CL6                 SPARE                                        
*##ASSOCIATED TAPILEN                                                           
TAPILNQ2 EQU   *-TAPID                                                          
                                                                                
***********************************************************************         
*        <   > MUSIC INFO/HISTORY ELEMENT                             *         
***********************************************************************         
                                                                                
TAPMD    DSECT                                                                  
TAPMEL   DS    XL1                 ELEMENT CODE                                 
TAPMELQ  EQU   X'5A'                                                            
TAPMLEN  DS    XL1                 ELEMENT LENGTH                               
TAPMCAGY DS    CL6                 CURRENT AGENCY                               
TAPMPAGY DS    CL6                 PREVIOUS AGENCY                              
TAPMOAGY DS    CL6                 ORIGINAL AGENCY                              
TAPMOMUS DS    CL8                 ORIGINAL MUSIC CODE (CONVERSION)             
         DS    CL10                                                             
TAPMLNQ  EQU   *-TAPMD                                                          
                                                                                
***********************************************************************         
*        <   > EMPLOYEE'S POOLED EARNINGS ELEMENT                     *         
***********************************************************************         
                                                                                
TAPOD    DSECT                                                                  
TAPOEL   DS    XL1                 ELEMENT CODE                                 
TAPOELQ  EQU   X'7D'                                                            
TAPOLEN  DS    XL1                 ELEMENT LENGTH                               
TAPOYEAR DS    XL1                 YEAR (PWOS)                                  
TAPOTYPE DS    XL1                 POOL TYPE                                    
TAPOTY1  EQU   1                                                                
TAPOPYTD DS    F                   PREVIOUS Y-T-D EARNINGS                      
TAPOPYTS DS    F                   PREVIOUS Y-T-D SUI TAXABLE                   
TAPOYTDE DS    F                   LAST BILLED Y-T-D EARNINGS                   
TAPOYTDS DS    F                   LAST BILLED Y-T-D SUI TAXABLE                
*##DATATYPE DATCON1                                                             
TAPOBDTE DS    XL3                 PWOS DATE - LAST BILLED DATE                 
         DS    CL5                                                              
         ORG   TAPOTYPE            NEW ELEMENT DEFINITION                       
TAPOCUR  DS    CL1                 CURRENCY                                     
TAPOEMP  DS    CL3                 EMPLOYER                                     
         DS    CL1                                                              
TAPOEARN DS    F                   EARNINGS                                     
TAPOSUI  DS    F                   SUI TAXABLE EARNINGS                         
         ORG                                                                    
*##ASSOCIATED TAPOLEN                                                           
TAPOLNQ  EQU   *-TAPOD                                                          
                                                                                
***********************************************************************         
*        <   > PRODUCT ELEMENT                                        *         
***********************************************************************         
                                                                                
TAPRD    DSECT                                                                  
TAPREL   DS    XL1                 ELEMENT CODE                                 
TAPRELQ  EQU   X'38'                                                            
TAPRLEN  DS    XL1                 ELEMENT LENGTH                               
TAPRPRD  DS    CL6                 PRODUCT CODE                                 
*##ASSOCIATED TAPRLEN                                                           
TAPRLNQ  EQU   *-TAPRD                                                          
                                                                                
***********************************************************************         
*        <   > PRODUCT TYPE DETAILS ELEMENT                           *         
***********************************************************************         
                                                                                
TAPTD    DSECT                                                                  
TAPTEL   DS    XL1                 ELEMENT CODE                                 
TAPTELQ  EQU   X'F9'                                                            
TAPTLEN  DS    XL1                 ELEMENT LENGTH                               
TAPTODTE DS    XL3                 OBSOLETE DATE                                
         DS    CL12                SPARE                                        
*##ASSOCIATED TAPTLEN                                                           
TAPTLNQ  EQU   *-TAPTD                                                          
                                                                                
***********************************************************************         
*        <   > PURCHASE ORDER DETAILS ELEMENT                         *         
***********************************************************************         
                                                                                
TAPUD    DSECT                                                                  
TAPUEL   DS    XL1                 ELEMENT CODE                                 
TAPUELQ  EQU   X'44'                                                            
TAPULEN  DS    XL1                 ELEMENT LENGTH                               
TAPUTYPE DS    CL1                 TYPE                                         
TAPUTITM EQU   C'I'                ITEM                                         
TAPUTSUM EQU   C'S'                SUMMARY                                      
TAPUINUM DS    CL10                ITEM NUMBER                                  
TAPUICOD DS    CL10                ITEM CODE                                    
TAPUIDES DS    CL30                DESCRIPTION                                  
TAPUIAMT DS    F                   AMOUNT                                       
TAPUIQTY DS    H                   QTY                                          
TAPUILNQ EQU   *-TAPUD                                                          
TAPUITX  DS    0C                  ITEM TEXT (VARIABLE LENGTH)                  
         ORG   TAPUINUM                                                         
TAPUSCUR DS    CL1                 CURRENCY                                     
TAPUSCPY DS    CL4                 COMPANY CODE                                 
TAPUSCDT DS    XL3                 CREATION DATE                                
TAPUSAMT DS    F                   NET AMOUNT                                   
*##ASSOCIATED TAPULEN                                                           
TAPUSLNQ EQU   *-TAPUD                                                          
                                                                                
***********************************************************************         
*        <   > PASSWORD ELEMENT                                       *         
***********************************************************************         
                                                                                
TAPWD    DSECT                                                                  
TAPWEL   DS    XL1                 ELEMENT CODE                                 
TAPWELQ  EQU   X'13'                                                            
TAPWLEN  DS    XL1                 ELEMENT LENGTH                               
TAPWDTE  DS    XL3                 DATE OF PASSWORD (COMPLEMENTED)              
TAPWTIM  DS    XL3                 TIME OF PASSWORD (COMPLEMENTED)              
TAPWPWD  DS    CL8                 PASSWORD                                     
*##ASSOCIATED TAPWLEN                                                           
TAPWLNQ  EQU   *-TAPWD                                                          
                                                                                
***********************************************************************         
*        <   > CONTRACT DETAILS ELEMENT                               *         
***********************************************************************         
                                                                                
TARDD    DSECT                                                                  
TARDEL   DS    XL1                 ELEMENT CODE                                 
TARDELQ  EQU   X'BE'                                                            
TARDLEN  DS    XL1                 ELEMENT LENGTH                               
TARDDATE DS    XL3                 CONTRACT DATE                                
TARDTYP1 DS    XL1                 CONTRACT TYPE BYTE ONE                       
TARDTYCG EQU   C'C'                CELEBRITY/OVERSCALE GUARANTEE                
TARDTYCL EQU   C'L'                CHARACTER/NAME/LIKENESS                      
TARDTYML EQU   C'M'                MUSIC LICENSE                                
TARDTYNM EQU   C'N'                NEEDLEDROP MUSIC                             
TARDTYOT EQU   C'O'                OTHER                                        
TARDTYPR EQU   C'P'                PROPERTY RELEASE                             
TARDTYMR EQU   C'R'                MASTER RECORDING                             
TARDTYSF EQU   C'S'                STOCK FOOTAGE AGREEMENT                      
TARDTYNU EQU   C'U'                NON-UNION AGREEMENT                          
TARDTYP2 DS    XL1                 CONTRACT TYPE BYTE TWO                       
TARDSTAT DS    XL1                 CONTRACT STATUS                              
TARDSTAA EQU   X'80'               ACTIVE                                       
TARDSTAE EQU   X'40'               INACTIVE                                     
TARDCLI  DS    CL6                 CLIENT                                       
TARDPRD  DS    CL6                 PRODUCT                                      
TARDSSN  DS    CL9                 PERFOMER S/S                                 
TARDCFEE DS    F                   CONTRACT FEE                                 
*##ASSOCIATED TARDLEN                                                           
TARDLNQ  EQU   *-TARDD                                                          
                                                                                
***********************************************************************         
*        <   > CAST RELEASE STATUS ELEMENT                            *         
***********************************************************************         
                                                                                
TARLD    DSECT                                                                  
TARLEL   DS    XL1                 ELEMENT CODE                                 
TARLELQ  EQU   X'81'                                                            
TARLLEN  DS    XL1                 ELEMENT LENGTH                               
TARLSTAT DS    CL1                 RELEASE STATUS - NEW                         
TARLDATE DS    XL3                 RELEASE DATE   - NEW                         
TARLSTAP DS    CL1                 RELEASE STATUS - PREV                        
TARLDATP DS    XL3                 RELEASE DATE   - PREV                        
TARLEFDT DS    XL3                 EFFECTIVE DATE                               
         DS    CL6                 SPARE                                        
*##ASSOCIATED TARLLEN                                                           
TARLLNQ  EQU   *-TARLD                                                          
                                                                                
***********************************************************************         
*        <   > RETURNED CHECK ELEMENT                                 *         
***********************************************************************         
                                                                                
TARND    DSECT                                                                  
TARNEL   DS    XL1                 ELEMENT CODE                                 
TARNELQ  EQU   X'C9'                                                            
TARNLEN  DS    XL1                 ELEMENT LENGTH                               
TARNRDTE DS    XL3                 RETURNED CHECK DATE                          
TARNUID  DS    XL2                 USER ID                                      
TARNSTAF DS    CL8                 STAFF ID OF BILLER                           
TARNDDTE DS    XL3                 DISPOSITION DATE                             
TARNSTAT DS    XL1                 DISPOSITION INDICATOR                        
TARNFILE EQU   X'80'               FILED                                        
TARNMAIL EQU   X'40'               MAILED                                       
*##ASSOCIATED TARNLEN                                                           
TARNLNQ  EQU   *-TARND                                                          
                                                                                
***********************************************************************         
*        <   > RETRO PNH AMOUNT ELEMENT                               *         
***********************************************************************         
                                                                                
TARPD    DSECT                                                                  
TARPEL   DS    XL1                 ELEMENT CODE                                 
TARPELQ  EQU   X'0D'                                                            
TARPLEN  DS    XL1                 ELEMENT LENGTH                               
TARPBASE DS    XL4                 BASE AMOUNT FROM PREV CONTRACT               
TARPINC  DS    XL4                 P&H BASED ON INCREASE                        
TARPDIFF DS    XL4                 DIFF FROM P&H(BASE)-TARPINC                  
*##ASSOCIATED TARNLEN                                                           
TARPLNQ  EQU   *-TARPD                                                          
                                                                                
***********************************************************************         
*        <   > RL-1 DETAILS ELEMENT                                   *         
***********************************************************************         
                                                                                
TAR1D    DSECT                                                                  
TAR1EL   DS    XL1                 ELEMENT CODE                                 
TAR1ELQ  EQU   X'47'                                                            
TAR1LEN  DS    XL1                 ELEMENT LENGTH                               
TAR1UNIT DS    CL3                 TAX UNIT                                     
TAR1DPRT DS    XL3                 PWOS - DATE PRINTED                          
TAR1AMTS DS    0XL40                                                            
TAR1EARN DS    F                   EMPLOYMENT INCOME                            
TAR1QPPC DS    F                   QPP CONTRIBUTION                             
TAR1QEIP DS    F                   QEI PREMIUM                                  
TAR1TAX  DS    F                   QC TAX DEDUCTED                              
TAR1QPPE DS    F                   QPP PENS EARNINGS                            
TAR1PIPP DS    F                   QPIP PREMIUMS                                
TAR1PIPW DS    F                   QPIP WAGES                                   
TAR1QEIE DS    F                   QEI EARNINGS                                 
         DS    2F                  SPARE                                        
*##ASSOCIATED TAR1LEN                                                           
TAR1LNQ  EQU   *-TAR1D                                                          
                                                                                
***********************************************************************         
*        <   > SOAP CABLE ELEMENT                                     *         
***********************************************************************         
                                                                                
TASBD    DSECT                                                                  
TASBEL   DS    XL1                 ELEMENT CODE                                 
TASBELQ  EQU   X'6D'                                                            
TASBLEN  DS    XL1                 ELEMENT LENGTH                               
TASBGRSE DS    XL4                 GROSS/EPISODE                                
TASBCID2 DS    CL12                2ND COMM'L ID FOR SOC USE                    
         DS    CL4                 SPARE                                        
*##ASSOCIATED TASBLEN                                                           
TASBLNQ  EQU   *-TASBD                                                          
                                                                                
***********************************************************************         
*        <   > SCREEN ELEMENT                                         *         
***********************************************************************         
                                                                                
TASCD    DSECT                                                                  
TASCEL   DS    XL1                 ELEMENT CODE                                 
TASCELQ  EQU   X'32'                                                            
TASCLEN  DS    XL1                 ELEMENT LENGTH                               
TASCDISP DS    XL2                 DISPLACEMENT INTO SCREEN OF THIS EL.         
         DS    CL6                                                              
TASCDATA DS    0C                  SCREEN DATA BEGINS HERE                      
*##ASSOCIATED TASCLEN                                                           
TASCLNQ  EQU   *-TASCD                                                          
                                                                                
***********************************************************************         
*        <   > SESSION DETAILS ELEMENT                                *         
***********************************************************************         
                                                                                
TASDD    DSECT                                                                  
TASDEL   DS    XL1                 ELEMENT CODE                                 
TASDELQ  EQU   X'8B'                                                            
TAPSELQ  EQU   X'92'               PRE-PYMT/LIST                                
TASDLEN  DS    XL1                 ELEMENT LENGTH                               
TASDEQU  DS    XL1                 USE  EQUATE                                  
         DS    CL1                                                              
TASDFEE  DS    F                   SESSION FEE  (2 DEC.)                        
TASDHR   DS    F                   HOURLY RATE  (2 DEC.)                        
         DS    CL4                 SPARE                                        
                                                                                
*        THE FOLLOWING FIELDS HAVE CHARACTERSTICS AS FOLLOWS:                   
*              1.  A 1 OR 2-BYTE FIELD CONTAINING USER INPUT.  (OPT)            
*              2.  A 4-BYTE FIELD CONTAINING CALC. AMOUNT OF ABOVE.             
*              3.  A 1-BYTE STATUS FIELD DEFINED AS FOLLOWS:                    
*                                  X'80'=NO OVERSCALE                           
*                                  X'40'=NO P&W/I&R                             
*                                  X'20'=NO TAXES (ON CHECKS)                   
*                                  X'10'=TAKE HEALTH AND WELFARE (AFM)          
                                                                                
TASDBSS  EQU   *                   *** TELEVISION SESSION                       
TASDSP   DS    XL1                 N'SPOTS                                      
TASDSPA  DS    XL4                                                              
TASDSPS  DS    XL1                                                              
TASDDAY  DS    XL1                 N'DAYS                                       
TASDDAA  DS    XL4                                                              
TASDDAS  DS    XL1                                                              
TASDOT   DS    XL1                 N'OVERTIME HOURS                             
TASDOTA  DS    XL4                                                              
TASDOTS  DS    XL1                                                              
TASDDT   DS    XL1                 N'DOUBLE-TIME HOURS                          
TASDDTA  DS    XL4                                                              
TASDDTS  DS    XL1                                                              
TASDTRV  DS    XL2                 TRAVEL TIME               (2 DEC.)           
TASDTRA  DS    XL4                                                              
TASDTRS  DS    XL1                                                              
TASDPDW  DS    XL2                 PRIOR-DAY WARDROBE        (2 DEC.)           
TASDPDA  DS    XL4                                                              
TASDPDS  DS    XL1                                                              
TASDTAG  DS    XL1                 N'TAGS                                       
TASDTAA  DS    XL4                                                              
         DS    CL3                                                              
                                                                                
         ORG   TASDSP                                                           
TASDBSM  EQU   *                   *** MUSIC SESSION                            
TASDIMS  EQU   *                                                                
TASDMSP  DS    XL1                 N'SPOTS                                      
TASDMSPA DS    XL4                                                              
TASDMSPS DS    XL1                                                              
TASDMHM  DS    XL2                 HOURS/MINUTES             (2 DEC.)           
TASDMHMA DS    XL4                                                              
TASDMHMS DS    XL1                                                              
                                                                                
         ORG   TASDSP                                                           
TASDBSR  EQU   *                   *** RADIO SESSION                            
TASDRSP  DS    XL1                 N'SPOTS                                      
TASDRSPA DS    XL4                                                              
TASDRSPS DS    XL1                                                              
TASDRHM  DS    XL2                 HOURS/MINUTES             (2 DEC.)           
TASDRHMA DS    XL4                                                              
TASDRHMS DS    XL1                                                              
TASDRTG  DS    XL1                 N'TAGS                                       
TASDRTGA DS    XL4                                                              
TASDRTGS DS    XL1                                                              
                                                                                
         ORG   TASDSP                                                           
TASDRTK  EQU   *                   *** INDUSTRIAL RETAKE SESSION                
TASDIST  DS    XL1                 STATUS                                       
TASDIENQ EQU   X'80'                 ENTIRE SCRIPT                              
TASDIPTQ EQU   X'40'                 PARTIAL SCRIPT                             
TASDI60Q EQU   X'20'                 OVER 60 DAYS                               
TASDISTA DS    XL4                                                              
TASDISTS DS    XL1                                                              
TASDIHM  DS    XL2                 HOURS/MINUTES             (2 DEC.)           
TASDIHMA DS    XL4                                                              
TASDIHMS DS    XL1                                                              
TASDIOT  DS    XL1                 N'OVERTIME HOURS                             
TASDIOTA DS    XL4                                                              
TASDIOTS DS    XL1                                                              
TASDIDT  DS    XL1                 N'DOUBLE-TIME HOURS                          
TASDIDTA DS    XL4                                                              
TASDIDTS DS    XL1                                                              
TASDITR  DS    XL2                 TRAVEL TIME               (2 DEC.)           
TASDITRA DS    XL4                                                              
TASDITRS DS    XL1                                                              
                                                                                
         ORG   TASDSP                                                           
TASDDIO  EQU   *                   *** INDUSTRIAL RADIO SESSION                 
TASDIRP  DS    XL1                 NUMBER OF PROGRAMS                           
TASDIRPA DS    XL4                                                              
TASDIRPS DS    XL1                                                              
TASDIRH  DS    XL2                 HOURS/MINUTES             (2 DEC.)           
TASDIRHA DS    XL4                                                              
TASDIRHS DS    XL1                                                              
TASDIRR  DS    XL2                 RETAKES HOURS/MINUTES     (2 DEC.)           
TASDIRRA DS    XL4                                                              
TASDIRRS DS    XL1                                                              
                                                                                
         ORG   TASDSP                                                           
TASDIVR  EQU   *                   *** INTERACTIVE VOICE RECORDING              
TASDIVH  DS    XL2                 HOURS/MINUTES             (2 DEC.)           
TASDIVHA DS    XL4                                                              
TASDIVHS DS    XL1                                                              
TASDIVT  DS    XL2                 TRAVEL TIME               (2 DEC.)           
TASDIVTA DS    XL4                                                              
TASDIVTS DS    XL1                                                              
                                                                                
         ORG                                                                    
*##ASSOCIATED TASDLEN                                                           
TASDLNQ  EQU   *-TASDD                                                          
                                                                                
***********************************************************************         
*        <   > SECURITY ELEMENT                                       *         
***********************************************************************         
                                                                                
TASED    DSECT                                                                  
TASEEL   DS    XL1                 ELEMENT CODE                                 
TASEELQ  EQU   X'03'                                                            
TASELEN  DS    XL1                 ELEMENT LENGTH                               
TASEMASK DS    XL4                 SECURITY MASK FOR RECACT TABLE               
         DS    XL2                                                              
*##ASSOCIATED TASELEN                                                           
TASELNQ  EQU   *-TASED                                                          
                                                                                
***********************************************************************         
*        <   > SOAP GUARANTEE DETAILS ELEMENT                         *         
***********************************************************************         
                                                                                
TASGD    DSECT                                                                  
TASGEL   DS    XL1                 ELEMENT CODE                                 
TASGELQ  EQU   X'5C'                                                            
TASGLEN  DS    XL1                 ELEMENT LENGTH                               
TASGAGY  DS    CL6                 AGENCY                                       
TASGCAT  DS    CL3                 CATEGORY                                     
TASGCRP  DS    CL1                 CORPORATION NUMBER                           
TASGNCDE DS    XL2                 AGENT CODE                                   
TASGPYMT DS    XL1                 PAYMENT METHOD                               
TASGPWK  EQU   X'80'               WEEKLY AVERAGE                               
TASGPPER EQU   X'40'               PER PERFORMANCE                              
         DS    XL10                SPARE                                        
*##ASSOCIATED TASGLEN                                                           
TASGLNQ  EQU   *-TASGEL                                                         
                                                                                
***********************************************************************         
*        <   > SUBSIDIARY INVOICE ELEMENT                             *         
***********************************************************************         
                                                                                
TASID    DSECT                                                                  
TASIEL   DS    XL1                 ELEMENT CODE                                 
TASIELQ  EQU   X'95'                                                            
TASILEN  DS    XL1                 ELEMENT LENGTH                               
TASIINV  DS    XL6                 SUBSIDIARY INVOICE NUMBER                    
TASISTAT DS    XL1                 STATUS - SET FOR US/CAN COMBINED             
TASISTUS EQU   X'80'               US/CAN INVOICE - US CAST                     
TASISTCN EQU   X'40'               US/CAN INVOICE - CAN CAST                    
TASIPCT3 DS    XL3                 PERCENTAGE (4 DEC PLACES)                    
         ORG   TASISTAT                                                         
TASIPCT  DS    F                   PERCENTAGE (4 DEC PLACES)                    
TASIEST  DS    0C                  ESTIMATE NUMBER                              
*##ASSOCIATED TASILEN                                                           
TASILNQ  EQU   *-TASID                                                          
                                                                                
***********************************************************************         
*        <   > SOAP GUARANTEE CYCLE ELEMENT                           *         
***********************************************************************         
                                                                                
TASLD    DSECT                                                                  
TASLEL   DS    XL1                 ELEMENT CODE                                 
TASLELQ  EQU   X'5D'                                                            
TASLLEN  DS    XL1                 ELEMENT LENGTH                               
TASLSPD  DS    0XL6                AIR CYCLE PERIOD                             
TASLSSTR DS    XL3                 START                                        
TASLSEND DS    XL3                 END                                          
TASLNTCD DS    XL3                 NOTICE BY DATE                               
TASLWKS  DS    XL1                 WEEKS OF GUARANTEE                           
TASLGRT  DS    H                   EPISODES GUARANTEED (2 DEC.PLACES)           
TASLPERF DS    F                   PERFORMANCE RATE                             
TASLAVG  DS    F                   AVERAGE PAY                                  
         DS    XL6                 SPARE                                        
*##ASSOCIATED TASLLEN                                                           
TASLLNQ  EQU   *-TASLD                                                          
                                                                                
***********************************************************************         
*        <   > SHORT NAME ELEMENT                                     *         
***********************************************************************         
                                                                                
TASND    DSECT                                                                  
TASNEL   DS    XL1                 ELEMENT CODE                                 
TASNELQ  EQU   X'21'                                                            
TASNLEN  DS    XL1                 ELEMENT LENGTH                               
TASNAME  DS    CL16                SHORT NAME                                   
*##ASSOCIATED TASNLEN                                                           
TASNLNQ  EQU   *-TASND                                                          
                                                                                
***********************************************************************         
*        <   > EPISODE NUMBERS ELEMENT (FOR SOAPS)                    *         
***********************************************************************         
                                                                                
TASOD    DSECT                                                                  
TASOEL   DS    XL1                 ELEMENT CODE                                 
TASOELQ  EQU   X'6F'                                                            
TASOLEN  DS    XL1                 ELEMENT LENGTH                               
TASONUM  DS    XL1                 N'SUB-ELEMENTS  (OK-EXPAND)                  
*##ASSOCIATED TASOLEN                                                           
TASOLNQ  EQU   *-TASOD                                                          
TASOSEPI DS    0CL11               VARIABLE LENGTH EPISODE/STATUS               
TASOSTAT DS    XL1                 STATUS                                       
TASOSH   EQU   X'40'               HEAD WRITER                                  
TASOSS   EQU   X'20'               SCRIPT WRITER                                
TASOSB   EQU   X'10'               BREAKDOWN WRITER                             
TASOEPI  DS    H                   EPISODE NUMBER                               
TASOPNH  DS    H                   P&H AMOUNT PAID                              
TASOPAY  DS    XL3                 PAYMENT AMOUNT                               
TASOAPPL DS    XL3                 APPLIED CREDITS                              
TASOXSUB DS    0C                  END OF SUB-ELEMENT                           
                                                                                
***********************************************************************         
*        <   > SCREEN PAGE TABLE ELEMENT                              *         
***********************************************************************         
                                                                                
TASPD    DSECT                                                                  
TASPEL   DS    XL1                 ELEMENT CODE                                 
TASPELQ  EQU   X'31'                                                            
TASPLEN  DS    XL1                 ELEMENT LENGTH                               
TASPNUM  DS    XL1                 N'TABLE ENTRIES                              
TASPTBL  DS    0C                  VARIABLE LENGTH PAGE TABLE                   
*##ASSOCIATED TASPLEN                                                           
TASPLNQ  EQU   *-TASPD                                                          
                                                                                
***********************************************************************         
*        <   > CHANGE OF SOCIAL SECURITY NUMBER ELEMENT               *         
***********************************************************************         
                                                                                
TASSD    DSECT                                                                  
TASSEL   DS    XL1                 ELEMENT CODE                                 
TASSELQ  EQU   X'85'                                                            
TASSLEN  DS    XL1                 ELEMENT LENGTH                               
TASSDATE DS    XL3                 DATE OF CHANGE                               
TASSOLD  DS    CL9                 OLD S/S NUMBER                               
         DS    CL1                 SPARE                                        
*##ASSOCIATED TASSLEN                                                           
TASSLNQ  EQU   *-TASSD                                                          
                                                                                
***********************************************************************         
*        <   > STAFF ELEMENT                                          *         
***********************************************************************         
                                                                                
TASTD    DSECT                                                                  
TASTEL   DS    XL1                 ELEMENT CODE                                 
TASTELQ  EQU   X'12'                                                            
TASTLEN  DS    XL1                 ELEMENT LENGTH                               
TASTFST  DS    CL12                FIRST NAME                                   
TASTLST  DS    CL12                LAST NAME                                    
TASTPWD  DS    CL8                 PASSWORD                                     
TASTTYPE DS    CL1                 TYPE                                         
TASTTYPP EQU   C'P'                PROGRAMMER                                   
TASTTYP2 EQU   C'2'                SYSTEM MANAGER                               
TASTTYP3 EQU   C'3'                EXECUTIVE                                    
TASTTYPM EQU   C'M'                ADMINISTRATION                               
TASTTYP4 EQU   C'4'                MANAGER                                      
TASTTYP5 EQU   C'5'                SUPERVISOR                                   
TASTTYP6 EQU   C'6'                TALENT PAYMENT COORDINATOR 1                 
TASTTYP7 EQU   C'7'                TALENT PAYMENT COORDINATOR 2                 
TASTTYP8 EQU   C'8'                QUALITY CONTROL                              
TASTTYPA EQU   C'A'                ACCOUNTING                                   
TASTTYPB EQU   C'B'                ACCOUNTING MANAGER                           
TASTTYPC EQU   C'C'                CLIENT                                       
TASTTYPD EQU   C'D'                CLIENT (DRAFT PAYMENTS ONLY)                 
TASTTYPF EQU   C'F'                CLIENT (MUST APPROVE PAYMENTS)               
TASTTYPO EQU   C'O'                OPERATOR                                     
         DS    CL1                                                              
TASTMGR  DS    CL8                 MANAGER                                      
TASTTEL  DS    CL12                TELEPHONE                                    
TASTCLG  DS    CL6                 CLIENT GROUP ACCESS                          
TASTWBAC DS    XL1                 WEB ACCESS STATUS                            
TASTCIHR EQU   X'80'               ENABLED FOR CIHR                             
TASTACFM EQU   X'40'               ENABLED FOR ACTION FORMS                     
         DS    CL3                                                              
*##ASSOCIATED TASTLEN                                                           
TASTLNQ  EQU   *-TASTD                                                          
                                                                                
***********************************************************************         
*        <   > SYSTEM STALE DATED CHECKS                              *         
***********************************************************************         
                                                                                
TASUD    DSECT                                                                  
TASUEL   DS    XL1                 ELEMENT CODE                                 
TASUELQ  EQU   X'CB'                                                            
TASULEN  DS    XL1                 ELEMENT LENGTH                               
TASUUCSD DS    CL8                 US$, STARTING STALE CHECK NUMBER             
TASUCCSD DS    CL8                 CAN$, STARTING STALE CHECK NUMBER            
TASUPCSD DS    CL8                 PRINT, STARTING STALE CHECK NUMBER           
TASULCSD DS    CL8                 P+, STARTING STALE CHECK NUMBER              
*##ASSOCIATED TASPLEN                                                           
TASULNQ  EQU   *-TASUD                                                          
                                                                                
***********************************************************************         
*        <   > SYSTEM CONTROL ELEMENT                                 *         
***********************************************************************         
                                                                                
TASYD    DSECT                                                                  
TASYEL   DS    XL1                 ELEMENT CODE                                 
TASYELQ  EQU   X'02'                                                            
TASYLEN  DS    XL1                 ELEMENT LENGTH                               
TASYLCOM DS    XL4                 LAST COMMERCIAL NUMBER                       
TASYLAGT DS    XL2                 LAST AGENT NUMBER                            
TASYUSBK DS    CL6                 US$ BANK ACCOUNT                             
TASYUSST DS    CL8                 US$ STARTING CHECK NUMBER                    
TASYCNBK DS    CL6                 CAN$ BANK ACCOUNT                            
TASYCNST DS    CL8                 CAN$ STARTING CHECK NUMBER                   
TASYEMP  DS    CL3                 DEFAULT EMPLOYER                             
TASYIDCD DS    CL6                 CONTROL FILE ID                              
TASYDMBK DS    CL6                 DMB&B BANK ACCOUNT                           
         ORG   TASYDMBK                                                         
TASYJWTD DS    XL3                 JWT LAST INTERFACE DATE                      
TASYJWTS DS    XL2                 SEQUENCE NUMBER                              
         DS    X                                                                
*                                                                               
TASYDMST DS    CL8                 DMB&B STARTING CHECK NUMBER                  
TASYCCVT DS    PL3                 CANADIAN CONVERSION RATE                     
TASYLKDT DS    XL3                 URGENT CHECK RUN LOCKOUT DATE                
TASYLKST DS    XL3                                          START TIME          
TASYLKEN DS    XL3                                          END TIME            
TASYLKLQ EQU   *-TASYLKDT                                                       
TASYPLDT DS    XL3                 URGENT PRINT RUN LOCKOUT DATE                
TASYPLST DS    XL3                                          START TIME          
TASYPLEN DS    XL3                                          END TIME            
TASYPLLQ EQU   *-TASYPLDT                                                       
TASYSTAT DS    XL1                 STATUS                                       
TASYSLYR EQU   X'80'               OK TO POST ADJUSTMENTS TO LAST YEAR          
TASYSPID EQU   X'40'               OK TO USE PID# OVER SS#                      
TASYS3VR EQU   X'20'               USE 3 CHARACTER VERSION CODES                
TASYSBRT EQU   X'10'               BILLING LOOKS FOR BRATE ENABLED              
TASYSECL EQU   X'08'               ENFORCE LOCKING RULES AT CORP LEVEL          
TASYSFLT EQU   X'04'               NEW FLAT TAX RULES ENABLED                   
TASYSMUS EQU   X'02'               NEW MUSIC RULES ENABLED                      
TASYSCRD EQU   X'01'               NEW CREDITING RULES ENABLED                  
TASYPCBK DS    CL6                 PRINT BANK ACCOUNT                           
TASYPCST DS    CL8                 PRINT STARTING CHECK NUMBER                  
TASYLMKT DS    XL4                 LAST CNET/TMKT/RMKT/CSYS NUMBER              
TASYLWSU DS    XL3                 LAST WEB SUMMARY RUN DATE                    
TASYITCD DS    XL3                 INSTALLMENT TIMING CHANGE LIVE DATE          
TASYEUBK DS    CL6                 EURO BANK ACCOUNT                            
TASYEUST DS    CL8                 EURO STARTING CHECK NUMBER                   
TASYECVT DS    PL3                 EURO CONVERSION RATE                         
TASYLPMU DS    XL4                 LAST PMUSIC NUMBER                           
TASYLCBK DS    CL6                 PAYROLL PLUS BANK ACCOUNT                    
TASYLCST DS    CL8                 PAYROLL PLUS STARTING CHECK NUMBER           
TASYLLDT DS    XL3                 URGENT P+ RUN LOCKOUT DATE                   
TASYLLST DS    XL3                                          START TIME          
TASYLLEN DS    XL3                                          END TIME            
TASYLLLQ EQU   *-TASYLLDT                                                       
TASYSTA2 DS    XL1                 STATUS 2                                     
TASYSNCS EQU   X'80'               CHARGE NY/CA SURCHARGE                       
TASYSULA EQU   X'40'               PRINT URGENT CA CHECKS IN LA                 
TASYSROI EQU   X'20'               RETAIN ORDER OF EVTIME INPUT                 
TASYSPDJ EQU   X'10'               PROHIBIT DRAFT JOBS                          
TASYSEEN EQU   X'08'               SAVE NAMES ON EMPLOYEE/EVTIME RECS           
TASYSNDC EQU   X'04'               NEW DUE COMPANY RULES ENABLED                
TASYSMQR EQU   X'02'               MQ MESSAGE FOR HF REISSUE?                   
TASYSVHW EQU   X'01'               ALLOW HI/WA WITH OTHER STATES?               
TASYCLDT DS    XL3                 URGENT CAN RUN LOCKOUT DATE                  
TASYCLST DS    XL3                                          START TIME          
TASYCLEN DS    XL3                                          END TIME            
         DS    XL1                                                              
*##ASSOCIATED TASYLEN                                                           
TASYLNQ  EQU   *-TASYD                                                          
                                                                                
***********************************************************************         
*        <   > T4A-NR DETAILS ELEMENT                                 *         
***********************************************************************         
                                                                                
TATAD    DSECT                                                                  
TATAEL   DS    XL1                 ELEMENT CODE                                 
TATAELQ  EQU   X'48'                                                            
TATALEN  DS    XL1                 ELEMENT LENGTH                               
                                                                                
TATAUNIT DS    CL3                 TAX UNIT                                     
TATARCPT DS    C                   RECIPIENT CODE                               
TATAFTI  DS    CL9                 FOREIGN TAX ID                               
TATAREDA DS    C                   REDUCTION AUTH                               
TATADAYW DS    XL2                 NUM DAYS WORKED                              
TATACTRY DS    CL3                 COUNTRY CODE                                 
TATAINDS DS    CL2                 INDUSTRY TYPE                                
TATADPRT DS    XL3                 PWOS - DATE PRINTED                          
         DS    XL2                 SPARE                                        
TATAAMTS DS    0XL16                                                            
TATAEARN DS    F                   EMPLOYMENT INCOME                            
TATATAX  DS    F                   TAX DEDUCTED                                 
         DS    2F                  SPARE                                        
*##ASSOCIATED TATALEN                                                           
TATALNQ  EQU   *-TATAD                                                          
                                                                                
***********************************************************************         
*        <   > EVENT TIME TASK-PAY TYPE DETAILS ELEMENT               *         
***********************************************************************         
                                                                                
TATDD    DSECT                                                                  
TATDEL   DS    XL1                 ELEMENT CODE                                 
TATDELQ  EQU   X'0A'                                                            
TATDLEN  DS    XL1                 ELEMENT LENGTH                               
TATDTSQ  DS    XL1                 TAX UNIT SEQUENCE NUMBER                     
TATDUNIT DS    CL3                 TAX UNIT CODE                                
TATDSEQ  DS    XL1                 SEQUENCE NUMBER                              
TATDTASK DS    CL6                 TASK                                         
TATDPMTY DS    CL6                 PAYMENT TYPE                                 
TATDUNTS DS    XL4                 UNITS                                        
TATDRATE DS    XL4                 RATE                                         
TATDAMNT DS    XL4                 AMOUNT                                       
TATDSTAT DS    XL1                 STATUS                                       
TATDSOVR EQU   X'80'               TPROFILE OVERRIDE                            
TATDSTAX EQU   X'40'               TAXABLE?                                     
TATDSWAG EQU   X'20'               WAGE?                                        
TATDSACO EQU   X'10'               AGENCY COMMISSION?                           
TATDSSTX EQU   X'08'               POSSIBLY TAXABLE FOR NON-INDS?               
*##ASSOCIATED TATDLEN                                                           
TATDLNQ  EQU   *-TATDD                                                          
                                                                                
***********************************************************************         
*        <   > TAX ID ELEMENT                                         *         
***********************************************************************         
                                                                                
TATID    DSECT                                                                  
TATIEL   DS    XL1                 ELEMENT CODE                                 
TATIELQ  EQU   X'76'                                                            
TATILEN  DS    XL1                 ELEMENT LENGTH                               
TATITYPE DS    CL1                 ID TYPE                                      
TATITYCO EQU   C'C'                CORPORATION                                  
TATITYTX EQU   C'T'                TAX                                          
TATITYUN EQU   C'U'                UNEMPLOYMENT                                 
TATIUNIT DS    CL3                 TAX UNIT (FOR TATITYUN, TATITYTX)            
         ORG   TATIUNIT                                                         
TATICRPN DS    CL1                 CORPORATION NUMBER (FOR TATITYCO)            
         DS    CL2                                                              
TATIID   DS    CL14                ID NUMBER                                    
         DS    CL2                                                              
*##ASSOCIATED TATILEN                                                           
TATILNQ  EQU   *-TATID                                                          
                                                                                
***********************************************************************         
*        <   > TIMESHEET ELEMENT                                      *         
***********************************************************************         
                                                                                
TATMD    DSECT                                                                  
TATMEL   DS    XL1                 ELEMENT CODE                                 
TATMELQ  EQU   X'B8'                                                            
TATMLEN  DS    XL1                 ELEMENT LENGTH                               
TATMDATE DS    XL3                 TIMESHEET DATE                               
TATMWTST DS    XL2                 WORK TIME START TIME                         
TATMWTNT DS    XL2                 WORK TIME END TIME                           
TATMM1ST DS    XL2                 MEAL 1 START TIME                            
TATMM1NT DS    XL2                 MEAL 1 END TIME                              
TATMM2ST DS    XL2                 MEAL 2 START TIME                            
TATMM2NT DS    XL2                 MEAL 2 END TIME                              
TATMPDST DS    XL2                 PRIOR DAY WARDROBE START TIME                
TATMPDNT DS    XL2                 PRIOR DAY WARDROBE END TIME                  
TATMSTAT DS    XL1                 STATUS                                       
TATMSNPY EQU   X'80'               NIGHT PREMIUM - YES                          
TATMSNPN EQU   X'40'               NIGHT PREMIUM - NO                           
TATMS16Y EQU   X'20'               16 HOURS - YES                               
TATMS16N EQU   X'10'               16 HOURS - NO                                
TATMSMPY EQU   X'08'               MEAL PENALTY 1 - YES                         
TATMSMPN EQU   X'04'               MEAL PENALTY 1 - NO                          
TATMSM2Y EQU   X'02'               MEAL PENALTY 2 - YES                         
TATMSM2N EQU   X'01'               MEAL PENALTY 2 - NO                          
TATMTTDP DS    XL2                 TRAVEL TO DEPART                             
TATMTTAR DS    XL2                 TRAVEL TO ARRIVE                             
TATMTFDP DS    XL2                 TRAVEL FROM DEPART                           
TATMTFAR DS    XL2                 TRAVEL FROM ARRIVE                           
TATMTIDP DS    XL2                 TRAVEL INTERVENING DEPART                    
TATMTIAR DS    XL2                 TRAVEL INTERVENING ARRIVE                    
TATMSTA2 DS    XL1                 STATUS 2                                     
TATMS2SP EQU   X'80'               SMOKE PAY                                    
TATMS2NM EQU   X'40'               NON-DEDUCTIBLE MEAL                          
TATMS2RD EQU   X'20'               REHEARSAL DAY                                
TATMS2WC EQU   X'10'               WEATHER CANCELLATION                         
TATMS2DL EQU   X'08'               DISTANT LOCATION                             
TATMS2NC EQU   X'04'               NON-CONSECUTIVE WORK DAY                     
TATMOTHR DS    XL4                 OTHER                                        
TATMWANE DS    XL1                 WARDROBE ALLOTMENTS NON-EVENING              
TATMWAEV DS    XL1                 WARDROBE ALLOTMENTS EVENING                  
TATMNP10 DS    XL2                 NUMBER OF NIGHT PREMIUM HRS AT 10%           
TATMNP20 DS    XL2                 NUMBER OF NIGHT PREMIUM HRS AT 20%           
         ORG   TATMNP10                                                         
TATMNPAC DS    XL2                 NUMBER OF ACTRA NGHT PREM HRS AT 25%         
TATMNPSG DS    XL2                 NUMBER OF SAG NGHT PREM HRS AT 25%           
TATMPWDT DS    XL3                 PRIOR DAY WARDROBE DATE                      
TATM16HR DS    XL1                 16HR RULE - # OF HOURS OVER                  
TATMSTA3 DS    XL1                 STATUS 3                                     
TATMSM3Y EQU   X'80'               MEAL PENALTY 3 - YES                         
TATMSM3N EQU   X'40'               MEAL PENALTY 3 - NO                          
TATMSRPY EQU   X'20'               REST PERIOD VIOLATION - YES                  
TATMSRPN EQU   X'10'               REST PERIOD VIOLATION - NO                   
TATMM3ST DS    XL2                 MEAL 3 START TIME                            
TATMM3NT DS    XL2                 MEAL 3 END TIME                              
         DS    XL1                 SPARE                                        
*##ASSOCIATED TATMLEN                                                           
TATMLNQ  EQU   *-TATMD                                                          
                                                                                
***********************************************************************         
*        <   > MUSIC CONTRACT/TRACK ELEMENT                           *         
***********************************************************************         
                                                                                
TATRD    DSECT                                                                  
TATREL   DS    XL1                 ELEMENT CODE                                 
TATRELQ  EQU   X'45'                                                            
TATRLEN  DS    XL1                 ELEMENT LENGTH                               
TATRSEQ  DS    XL1                 DISPLAY SEQUENCE NUMBER (FOR COM2)           
TATRCOM  DS    XL4                 TYPE M INTERNAL COMMERCIAL NUMBER            
TATRCSQ  DS    XL2                 CAST SEQUENCE NUMBER (FOR CAST)              
TATRTRK  DS    CL1                 TRACK                                        
*##ASSOCIATED TATRLEN                                                           
TATRLNQ  EQU   *-TATRD                                                          
                                                                                
***********************************************************************         
*        <   > TIMESHEET TOTAL ELEMENT                                *         
***********************************************************************         
                                                                                
TATTD    DSECT                                                                  
TATTEL   DS    XL1                 ELEMENT CODE                                 
TATTELQ  EQU   X'B9'                                                            
TATTLEN  DS    XL1                 ELEMENT LENGTH                               
TATTDATE DS    XL3                 TIMESHEET DATE                               
*                                  X'FFFFFF' = ALL                              
*                                  X'FFFFFE' = ALL REGULAR DAYS                 
*                                  X'FFFFFD' = ALL HOLIDAYS                     
*                                  X'FFFFFC' = ALL SATURDAYS                    
*                                  X'FFFFFB' = ALL SUNDAYS                      
*                                  X'FFFFFA' = ALL SAG (2404A)                  
*                                  X'FFFFF9' = ALL ACTRA                        
*                                  X'FFFFF8' = ALL WTHR CXL 1/2 REG             
*                                  X'FFFFF7' = ALL WTHR CXL 1/2 HOLIDY          
*                                  X'FFFFF6' = ALL WTHR CXL 1/2 SAT             
*                                  X'FFFFF5' = ALL WTHR CXL 1/2 SUN             
*                                  X'FFFFF4' = ALL WTHR CXL 3/4 REG             
*                                  X'FFFFF3' = ALL WTHR CXL 3/4 HOLIDY          
*                                  X'FFFFF2' = ALL WTHR CXL 3/4 SAT             
*                                  X'FFFFF1' = ALL WTHR CXL 3/4 SUN             
*                                  X'FFFFF0' = ALL DIS-LOC SATURDAYS            
TATTSTAT DS    XL1                 STATUS                                       
TATTSTHP EQU   X'80'               HOLIDAY PAY                                  
TATTSTST EQU   X'40'               SATURDAY PAY                                 
TATTSTSU EQU   X'20'               SUNDAY PAY                                   
TATTSART EQU   X'10'               ACTRA RATES                                  
TATTSSRT EQU   X'08'               SAG RATES (2404A ONLY)                       
TATTSWCH EQU   X'04'               WEATHER CANCELLATION (1/2 PAYCHECK)          
TATTSW3Q EQU   X'02'               WEATHER CANCELLATION (3/4 PAYCHECK)          
TATTSTDL EQU   X'01'               TRAVEL TO DISTANT LOCATION                   
TATTSPOT DS    XL1                 SPOTS                                        
TATTDAYS DS    XL1                 DAYS                                         
TATTOVTM DS    XL1                 OVERTIME HOURS                               
TATTDBTM DS    XL1                 DOUBLE TIME HOURS                            
TATTTRVL DS    XL2                 TRAVEL HOURS.MINUTES                         
TATTPDWD DS    XL2                 PRIOR DAY WARDROBE HOURS.MINUTES             
TATTTAG  DS    XL1                 TAGS                                         
TATTNP10 DS    XL2                 NIGHT PREMIUM HOURS - 10% (ADJUSTED)         
TATTNP20 DS    XL2                 NIGHT PREMIUM HOURS - 20% (ADJUSTED)         
         ORG   TATTNP10                                                         
TATTNPST DS    XL2                 ACTRA NP STRAIGHT HRS                        
TATTNPOT DS    XL2                 ACTRA NP OVERTIME HRS                        
TATT16HR DS    XL1                 16 HOUR RULE - # OF HRS OVER (ADJ)           
TATTINCL DS    XL1                 INCLUDE CODE                                 
TATTREIM DS    XL4                 REIMBURSED EXPENSES                          
TATTNSPH DS    XL4                 AMOUNT NOT SUBJECT TO P&H (MEAL PEN)         
TATTPYMT DS    XL4                 ADDITION TO PAYMENT AMT. (SMOKE PAY)         
TATTADJ  DS    XL4                 ADJUSTMENT AMOUNT                            
TATTXSAT DS    XL2                 EXTRAS SATURDAY PAY ON FRIDAYS               
         ORG   TATTXSAT                                                         
TATTNPDT DS    XL2                 ACTRA NP DOUBLETIME HRS                      
TATTRPVL DS    XL1                 REST PERIOD VIOLATIONS                       
         DS    XL3                 SPARE                                        
TATTEND  DS    0X                                                               
*##ASSOCIATED TATTLEN                                                           
TATTLNQ  EQU   *-TATTD                                                          
                                                                                
***********************************************************************         
*        <   > TIMESHEET PRIOR DAY WARDROBE ELEMENT                   *         
***********************************************************************         
                                                                                
TATPD    DSECT                                                                  
TATPEL   DS    XL1                 ELEMENT CODE                                 
TATPELQ  EQU   X'BC'                                                            
TATPLEN  DS    XL1                 ELEMENT LENGTH                               
TATPREG  DS    XL2                 REGULAR HRS TOTAL                            
TATPHOL  DS    XL2                 HOLIDAY HRS TOTAL                            
TATPSAT  DS    XL2                 SATURDAY HRS TOTAL                           
TATPSUN  DS    XL2                 SUNDAY HRS TOTAL                             
         DS    XL4                 SPARE                                        
*##ASSOCIATED TATPLEN                                                           
TATPLNQ  EQU   *-TATPD                                                          
                                                                                
***********************************************************************         
*        <   > TAX UNIT ELEMENT                                       *         
***********************************************************************         
                                                                                
TATUD    DSECT                                                                  
TATUEL   DS    XL1                 ELEMENT CODE                                 
TATUELQ  EQU   X'07'                                                            
TATULEN  DS    XL1                 ELEMENT LENGTH                               
TATUUNIT DS    CL3                 TAX UNIT CODE                                
TATUSTAT DS    XL1                 STATUS                                       
TATUSPRO EQU   X'80'               PROCESSED                                    
TATUSRES EQU   X'40'               RESIDENCE ONLY, NOT WORKING (CHECKS)         
TATUSCAN EQU   X'20'               CANADIAN PROVINCE                            
TATUWAGE DS    XL4                 WAGES                                        
TATUTNWA DS    XL4                 TAXABLE REIMBURSEMENTS                       
TATUNNWA DS    XL4                 NON-TAXABLE REIMBURSEMENTS                   
TATUSTRE DS    XL4                 TAXABLE REIMBS (FOR NON-INDS)                
TATUWAAD DS    XL4                 WAGES AFTER DUE COMPANY                      
TATUTNAD DS    XL4                 TAXABLE REIMB AFTER DUE COMP                 
TATUNNAD DS    XL4                 NON- TAXABLE REIMB AFTER DUE COMP            
*##ASSOCIATED TATULEN                                                           
TATULNQ  EQU   *-TATUD                                                          
                                                                                
***********************************************************************         
*        <   > T4 DETAILS ELEMENT                                     *         
***********************************************************************         
                                                                                
TAT4D    DSECT                                                                  
TAT4EL   DS    XL1                 ELEMENT CODE                                 
TAT4ELQ  EQU   X'46'                                                            
TAT4LEN  DS    XL1                 ELEMENT LENGTH                               
TAT4UNIT DS    CL3                 TAX UNIT                                     
TAT4DPRT DS    XL3                 PWOS - DATE PRINTED                          
TAT4AMTS DS    0XL40                                                            
TAT4EARN DS    F                   EMPLOYMENT INCOME                            
TAT4PPER DS    F                   CPP/QPP PENS EARN                            
TAT4EINE DS    F                   EI INSUR EARNINGS                            
TAT4QPIE DS    F                   QPIP INS EARNINGS                            
TAT4TAX  DS    F                   INCOME TAX DEDUCTED                          
TAT4CPPC DS    F                   CPP CONTRIBUTION                             
TAT4EPRM DS    F                   EI PREMIUM                                   
TAT4QPPR DS    F                   QPIP PREMIUMS                                
         DS    2F                  SPARE                                        
*##ASSOCIATED TAT4LEN                                                           
TAT4LNQ  EQU   *-TAT4D                                                          
                                                                                
***********************************************************************         
*        <   > US/CANADIAN INVOICE ELEMENT                            *         
***********************************************************************         
                                                                                
TAUCD    DSECT                                                                  
TAUCEL   DS    XL1                 ELEMENT CODE                                 
TAUCELQ  EQU   X'41'                                                            
TAUCLEN  DS    XL1                 ELEMENT LENGTH                               
         DS    XL1                 SPARE                                        
TAUCINU  DS    XL6                 US INVOICE NUMBER (COMPLEMENT)               
TAUCINC  DS    XL6                 CANADIAN INVOICE NUMBER (COMPLEMENT)         
*##ASSOCIATED TAUCLEN                                                           
TAUCLNQ  EQU   *-TAUCD                                                          
                                                                                
***********************************************************************         
*        <   > USAGE HISTORY ELEMENT                                  *         
***********************************************************************         
                                                                                
TAUHD    DSECT                                                                  
TAUHEL   DS    XL1                 ELEMENT CODE                                 
TAUHELQ  EQU   X'9C'                                                            
TAUHLEN  DS    XL1                 ELEMENT LENGTH                               
TAUHTYPE DS    XL1                 USE TYPE                                     
TAUHSTRT DS    XL3                 START DATE                                   
TAUHEND  DS    XL3                 END DATE                                     
TAUHLFT  DS    C                   LFT INPUT ON PAY SCREEN                      
         DS    XL2                                                              
TAUHDATA DS    CL16                DATA VARIES FOR USES                         
*##ASSOCIATED TAUHLEN                                                           
TAUHLNQ  EQU   *-TAUHD                                                          
                                                                                
         ORG   TAUHDATA            CLASS A                                      
TAUHUSN  DS    H                   LAST USE NUMBER (INCL. LIFT)                 
TAUHUSNL DS    H                   LAST USE NUMBER LIFT                         
TAUHUSNP DS    H                   # OF PAX PROGRAMS EXCLUDED FROM CLA          
TAUHLUSP DS    H                   # OF PAX LFT PROS EXLLUDED FROM CLA          
                                                                                
         ORG   TAUHDATA            WILDSPOT AND NETWORK/WILDSPOT COMB           
         DS    H                                                                
TAUHWAUT DS    H                   AUTOMATIC UNITS CALCULATION                  
TAUHUNT  DS    H                   UNITS                                        
TAUHIUNT DS    H                   INITIAL UNITS                                
TAUHMAJ  DS    XL1                 MAJORS (N/D FOR SPANISH)                     
TAUHIMAJ DS    XL1                 INITIAL MAJORS                               
TAUHSTAT DS    XL1                                                              
TAUHSFUP EQU   X'80'               FORCED UPGRADE                               
TAUHSUPN EQU   X'40'               UPGRADED FROM NETWORK (SNW ONLY)             
TAUHSUPW EQU   X'20'               UPGRADED FROM WILDSPOT(SNW ONLY)             
TAUHSUPC EQU   X'10'               UPGRADED COMBINED (SNW ONLY)                 
TAUHWCRD EQU   X'08'               CREDIT PAYMENT OR CANCELLED                  
TAUHSFIN EQU   X'04'               FORCED INITIAL PAYMENT                       
                                                                                
         ORG   TAUHDATA            RADIO REGIONAL NETWORK                       
TAUHRMAJ DS    XL1                 MAJORS                                       
                                                                                
         ORG   TAUHDATA            FOREIGN REUSE                                
TAUHFMAJ DS    XL1                 MAJORS/LOCATIONS                             
                                                                                
         ORG   TAUHDATA            CABLE - 91 CONTRACT                          
TAUHCBUN DS    H                   UNITS                                        
TAUHICBU DS    H                   INITIAL UNITS                                
TAUHCAUT DS    H                   AUTOMATIC UNITS CALCULATION                  
TAUHLCBU DS    XL1                 LCB UPGRADE TYPE                             
TAUHCSTA DS    XL1                                                              
TAUHCCRD EQU   X'08'               CREDIT PAYMENT OR CANCELLED                  
         DS    XL4                 SPARE                                        
TAUHCSUB DS    F                   SUBSCRIBER COUNT                             
                                                                                
         ORG   TAUHDATA            LOCAL CABLE/ADDENDUM CABLE                   
TAUHCSYS DS    H                   NUMBER OF CSYS PAID                          
TAUHFRTY DS    XL1                 UPGRADE FROM TYPE                            
TAUHLCST DS    XL1                                                              
TAUHLSFU EQU   X'80'               FORCED UPGRADE                               
TAUHFMIL EQU   X'40'               ADDED 1MIL RATE TO FROM RATE (UACB)          
TAUHTMIL EQU   X'20'               ADDED 1MIL RATE TO UPGRADE (UACB)            
TAUHLCRD EQU   X'08'               CREDIT PAYMENT OR CANCELLED                  
TAUHLSFI EQU   X'04'               FORCED INITIAL                               
TAUHSUBS DS    F                   SUBSCRIBERS                                  
TAUHISUB DS    F                   INITIAL SUBSCRIBERS                          
TAUHASUB DS    F                   AUTOMATIC SUBSCRIBERS CALCULATION            
                                                                                
         ORG   TAUHDATA            INSERTS FOR BOOKENDS                         
TAUHINS  DS    H                   INSERTS                                      
TAUHIINS DS    H                   INITIAL INSERTS                              
                                                                                
         ORG   TAUHDATA            TAGS                                         
TAUHTAGS DS    XL1                 NUMBER OF TAGS                               
                                                                                
         ORG   TAUHDATA            DEMOS                                        
TAUHDEMS DS    XL1                 NUMBER OF DEMOS                              
                                                                                
         ORG   TAUHDATA            PENALTY                                      
TAUHPCDY DS    XL1                 COMPANY DAYS                                 
TAUHPCPC DS    XL1                         PERCENT                              
TAUHPCAD DS    XL1                         ADDITIONAL DAYS                      
TAUHPADY DS    XL1                 AGENCY  DAYS                                 
TAUHPAPC DS    XL1                         PERCENT                              
TAUHPAAD DS    XL1                         ADDITIONAL DAYS                      
                                                                                
         ORG   TAUHDATA            FOREIGN MUSIC                                
TAUHFMUL DS    CL1                 USAGE LANGUAGE W=WORLD E=EUROPE              
*                                  N=NONEUROPE B=UK ONLY                        
                                                                                
         ORG   TAUHDATA            FOREIGN TV                                   
TAUHFTC1 DS    CL1                 CAMERA 1 (Y/N)                               
TAUHFTA1 DS    CL1                 ANNOUNCER 1 (Y/N)                            
TAUHFTS1 DS    CL1                 SINGER 1 (Y/N)                               
TAUHFTC2 DS    CL1                 CAMERA 2 (Y/N)                               
TAUHFTA2 DS    CL1                 ANNOUNCER 2 (Y/N)                            
TAUHFTS2 DS    CL1                 SINGER 2 (Y/N)                               
TAUHFTC3 DS    CL1                 CAMERA 3 (Y/N)                               
TAUHFTA3 DS    CL1                 ANNOUNCER 3 (Y/N)                            
TAUHFTS3 DS    CL1                 SINGER 3 (Y/N)                               
                                                                                
         ORG   TAUHDATA            ADDENDUM                                     
TAUHADST DS    XL1                 ADDENDUM STATUS                              
TAUHASMK EQU   X'80'               SINGLE MARKET                                
TAUHAUNL EQU   X'40'               ONE YEAR UNLIMITED USE                       
                                                                                
         ORG   TAUHDATA            ITN                                          
TAUHIFUS DS    H                   FIRST USE NUMBER PAID                        
TAUHINUS DS    H                   NUMBER OF USE NUMBERS PAID                   
                                                                                
         ORG   TAUHDATA            DEALER                                       
TAUHDLST DS    XL1                 DEALER STATUS                                
TAUHDLCR EQU   X'80'               CREDIT PAYMENT                               
                                                                                
         ORG   TAUHDATA            INDUSTRIAL SUPPLMENT                         
TAUHISU1 DS    XL1                 TYPE 1 (SEE TAIDTY1 FOR EQUATES)             
TAUHISU2 DS    XL1                 TYPE 2 (SEE TAIDTY2 FOR EQUATES)             
         EJECT                                                                  
                                                                                
***********************************************************************         
*        <   > UNION/LOCAL LIST ELEMENT                               *         
***********************************************************************         
                                                                                
TAULD    DSECT                                                                  
TAULEL   DS    XL1                 ELEMENT CODE                                 
TAULELQ  EQU   X'36'                                                            
TAULLEN  DS    XL1                 ELEMENT LENGTH                               
TAULNULS DS    XL1                 N'UNION/LOCAL SUB ELEMENTS                   
TAULULS  DS    0CL6                UNION/LOCAL                                  
*##ASSOCIATED TAULLEN                                                           
TAULLNQ  EQU   *-TAULD                                                          
                                                                                
***********************************************************************         
*        <   > UNIT TOTALS FOR BASED ON CONTRACT YEARS ELEMEMT        *         
***********************************************************************         
                                                                                
TAUND    DSECT                                                                  
TAUNEL   DS    XL1                 ELEMENT CODE                                 
TAUNELQ  EQU   X'8F'                                                            
TAUNLEN  DS    XL1                 ELEMENT LENGTH                               
TAUNCNT  DS    XL1                 NUMBER OF CONTRACT YEARS                     
*##ASSOCIATED TAUNLEN                                                           
TAUNLNQ  EQU   *-TAUND                                                          
TAUNDATA DS    0CL3                                                             
         ORG   TAUNDATA                                                         
TAUNYR   DS    XL1                 CONTRACT YEAR                                
TAUNUNT  DS    H                   TOTAL UNITS                                  
                                                                                
***********************************************************************         
*        <   > UPGRADE DETAILS ELEMENT                                *         
***********************************************************************         
                                                                                
TAUPD    DSECT                                                                  
TAUPEL   DS    XL1                 ELEMENT CODE                                 
TAUPELQ  EQU   X'88'                                                            
TAUPLEN  DS    XL1                 ELEMENT LENGTH                               
TAUPDATA DS    CL5                 DATA VARIES FOR USES                         
*##ASSOCIATED TAUPLEN                                                           
TAUPLNQ  EQU   *-TAUPD                                                          
                                                                                
         ORG   TAUPDATA            WILDSPOT                                     
TAUPIUNT DS    H                   INITIAL UNITS                                
         DS    CL2                                                              
TAUPIMAJ DS    CL1                 INITIAL MAJORS                               
                                                                                
         ORG   TAUPDATA            INSERTS FOR BOOKENDS                         
TAUPIINS DS    H                   INITIAL INSERTS                              
                                                                                
         ORG   TAUPDATA            CBL - CABLE FOR BROADCAST TV                 
TAUPICBU DS    H                   INITIAL UNITS                                
                                                                                
         ORG   TAUPDATA            LCB - LOCAL CABLE                            
TAUPILCM DS    CL1                 INITIAL MAJORS                               
TAUPISUB DS    CL4                 INITIAL SUBSCRIBERS                          
         EJECT                                                                  
                                                                                
***********************************************************************         
*        <   > VALID AGENCY/CLIENT ELEMENT                            *         
***********************************************************************         
                                                                                
TAVAD    DSECT                                                                  
TAVAEL   DS    XL1                 ELEMENT CODE                                 
TAVAELQ  EQU   X'FC'                                                            
TAVALEN  DS    XL1                 ELEMENT LENGTH                               
TAVASTAT DS    XL1                 STATUS                                       
TAVANDEF EQU   X'80'               NOT THE DEFAULT AGENCY                       
TAVAAGY  DS    XL6                 VALID AGENCY                                 
*##ASSOCIATED TAVALEN                                                           
TAVALNQ  EQU   *-TAVAD                                                          
TAVACLI  DS    0XL6                VALID CLIENT                                 
                                                                                
***********************************************************************         
*        <   > TALENT ADVICE CAST DETAILS ELEMENT                     *         
***********************************************************************         
                                                                                
TAVCD    DSECT                                                                  
TAVCEL   DS    XL1                 ELEMENT CODE                                 
TAVCELQ  EQU   X'D3'                                                            
TAVCLEN  DS    XL1                 ELEMENT LENGTH                               
TAVCSEQ  DS    XL1                 SEQUENCE NUMBER (MAINTAIN ORDER I/P)         
         DS    CL1                                                              
TAVCSSN  DS    F                   S/S NUMBER                                   
TAVCCAT  DS    XL1                 CATEGORY EQUATE                              
TAVCUNI  DS    XL1                 UNION EQUATE                                 
TAVCDBL  DS    CL1                 N'DOUBLES                                    
TAVCSTAT DS    XL1                 STATUS - SEE EQUATES                         
TAVCSON  EQU   X'80'               ON-CAMERA                                    
TAVCLFT  EQU   X'40'               ON LIFT                                      
TAVCOLFT EQU   X'20'               ONLY ON LIFT                                 
TAVCACTL EQU   X'10'               ACTUAL CAST MEMBER                           
TAVCDEL  EQU   X'08'               DELETED ACTUAL CAST MEMBER                   
TAVCNEWS EQU   X'04'               NEW STYLE TAVCD ELEMENT                      
TAVCOV1  DS    F                   OVERSCALE RATE 1                             
TAVCOV2  DS    F                   OVERSCALE RATE 2                             
TAVCNAME DS    CL26                PERFORMER NAME                               
TAVCUNI3 DS    CL3                 UNION                                        
TAVCCMT  DS    0CL30               VARIABLE LENGTH COMMENT                      
*##ASSOCIATED TAVCLEN                                                           
TAVCLNQ  EQU   *-TAVCD                                                          
                                                                                
***********************************************************************         
*        <   > WEB TRANSACTION ELEMENT                                *         
***********************************************************************         
                                                                                
TAWTD    DSECT                                                                  
TAWTEL   DS    XL1                 ELEMENT CODE                                 
TAWTELQ  EQU   X'FD'                                                            
TAWTLEN  DS    XL1                 ELEMENT LENGTH                               
TAWTSTAF DS    CL8                 STAFF ID                                     
*##ASSOCIATED TAWTLEN                                                           
TAWTLNQ  EQU  *-TAWTD                                                           
                                                                                
TAWTDATA DS    0C                  HOLD COMMERCIAL                              
TAWTHCIN DS    CL6                 INVOICE                                      
TAWTHCDO DS    CL10                TOTAL DOLLARS                                
*##ASSOCIATED TAWTLEN                                                           
TAWT2LNQ EQU  *-TAWTD                                                           
                                                                                
         ORG   TAWTDATA            RELEASE CAST                                 
TAWTRCSQ DS    CL4                 CAST SEQUENCE NUMBER                         
*##ASSOCIATED TAWTLEN                                                           
TAWT3LNQ EQU  *-TAWTD                                                           
                                                                                
         ORG   TAWTDATA            ADD/CHANGE COMMERCIAL                        
TAWTCOAY DS    CL6                 AGENCY                                       
TAWTCOID DS    CL12                COMMERCIAL ID                                
TAWTCOTI DS    CL36                COMMERCIAL TITLE                             
*##ASSOCIATED TAWTLEN                                                           
TAWT5LNQ EQU  *-TAWTD                                                           
                                                                                
*                                  ADD/CHANGE/DELETE CAST                       
TAWTCASS DS    CL9                 SSN                                          
TAWTCANM DS    CL32                NAME                                         
TAWTCACA DS    CL3                 CATEGORY                                     
*##ASSOCIATED TAWTLEN                                                           
TAWT6LNQ EQU  *-TAWTD                                                           
                                                                                
         ORG   TAWTCASS            PAYMENT                                      
TAWTPYUS DS    CL3                 USE CODE                                     
TAWTPYDO DS    CL10                TOTAL DOLLARS                                
*##ASSOCIATED TAWTLEN                                                           
TAWT7LNQ EQU  *-TAWTD                                                           
                                                                                
         ORG   TAWTCOTI            ADD/CHANGE/DELETE VERSION                    
TAWTVRID DS    CL12                VERSION ID                                   
TAWTVRTI DS    CL36                VERSION TITLE                                
*##ASSOCIATED TAWTLEN                                                           
TAWT8LNQ EQU  *-TAWTD                                                           
                                                                                
         ORG   TAWTDATA            ADD INTERNET/NEW MEDIA                       
TAWTNINM DS    CL30                NAME                                         
*##ASSOCIATED TAWTLEN                                                           
TAWT9LNQ EQU  *-TAWTD                                                           
                                                                                
***********************************************************************         
*        <   > TALENT ADVICE USE DETAILS ELEMENT                      *         
***********************************************************************         
                                                                                
TAVUD    DSECT                                                                  
TAVUEL   DS    XL1                 ELEMENT CODE                                 
TAVUELQ  EQU   X'D2'                                                            
TAVULEN  DS    XL1                 ELEMENT LENGTH                               
TAVUMED  DS    CL1                 MEDIA                                        
TAVUUSE  DS    XL1                 USE EQUATE                                   
TAVUTYPE DS    XL1                 USE TYPE EQUATE                              
TAVUCYC  DS    0XL6                                                             
TAVUCYCS DS    XL3                 CYCLE START                                  
TAVUCYCE DS    XL3                 CYCLE END                                    
TAVUESPD DS    XL1                 ESTIMATE PERIOD                              
TAVUUSES DS    H                   USES                                         
TAVUUNT  DS    H                   UNITS                                        
TAVUMAJ  DS    XL1                 MAJORS                                       
TAVUABSS DS    CL1                 APPLY SESSION (Y OR N)                       
TAVUAHLD DS    CL1                 APPLY HOLDING FEE (Y OR N)                   
TAVUWKS  DS    CL2                 CYCLE WEEKS (MONTHS)                         
TAVUUSE2 DS    XL1                 2ND USE EQUATE                               
TAVUTYP2 DS    XL1                 2ND USE TYPE EQUATE                          
         DS    XL1                                                              
TAVUMCYS DS    XL3                 MUSIC CYCLE START                            
TAVUMCYE DS    XL3                 MUSIC CYCLE END                              
TAVUMWKS DS    CL2                 MUSIC CYCLE WEEKS (MONTHS)                   
         DS    CL10                                                             
*##ASSOCIATED TAVULEN                                                           
TAVULNQ  EQU   *-TAVUD                                                          
                                                                                
***********************************************************************         
*        <   > VERSIONS ELEMENT                                       *         
***********************************************************************         
                                                                                
TAVRD    DSECT                                                                  
TAVREL   DS    XL1                 ELEMENT CODE                                 
TAVRELQ  EQU   X'7F'                                                            
TAVRLEN  DS    XL1                 ELEMENT LENGTH                               
TAVRVERS DS    XL1                 VERSION NUMBER                               
TAVRCID  DS    CL12                COMM ID                                      
TAVRSEC  DS    XL1                 LENGTH IN SECONDS                            
         DS    CL3                                                              
*##ASSOCIATED TAVRLEN                                                           
TAVRLNQ  EQU   *-TAVRD                                                          
                                                                                
***********************************************************************         
*        <   > WORK-CODE SUMMARY ELEMENT                              *         
***********************************************************************         
                                                                                
TAWCD    DSECT                                                                  
TAWCEL   DS    XL1                 ELEMENT CODE                                 
TAWCELQ  EQU   X'B4'                                                            
TAWCLEN  DS    XL1                 ELEMENT LENGTH                               
         DS    CL1                                                              
TAWCNSUB DS    XL1                 N'SUB-ELEMENTS  (OK-EXPAND)                  
*##ASSOCIATED TAWCLEN                                                           
TAWCLNQ  EQU   *-TAWCD                                                          
TAWCSBEL DS    0CL6                                                             
TAWCAMT  DS    F                   AMOUNT                                       
TAWCWC   DS    CL2                 WORK-CODE                                    
TAWCXSUB DS    0C                  END OF SUB-ELEMENT                           
                                                                                
***********************************************************************         
*        <   > EMPLOYEE WITHHOLDING DETAILS ELEMENT                   *         
***********************************************************************         
                                                                                
TAWHD    DSECT                                                                  
TAWHEL   DS    XL1                 ELEMENT CODE                                 
TAWHELQ  EQU   X'7A'                                                            
TAWHLEN  DS    XL1                 ELEMENT LENGTH                               
TAWHEMP  DS    CL3                 EMPLOYER                                     
TAWHUNIT DS    CL3                 TAX UNIT CODE                                
TAWHSTAT DS    CL1                 MARITAL STATUS (S/M/H)                       
TAWHEXS  DS    XL1                 EXEMPTIONS                                   
TAWHFLAT DS    XL4                 FLAT TAX RATE (2 DEC.)                       
         DS    CL4                                                              
*##ASSOCIATED TAWHLEN                                                           
TAWHLNQ  EQU   *-TAWHD                                                          
                                                                                
***********************************************************************         
*        <   > W2 SUBSIDARY ELEMENT                                   *         
***********************************************************************         
                                                                                
TAWSD    DSECT                                                                  
TAWSEL   DS    XL1                 ELEMENT CODE                                 
TAWSELQ  EQU   X'B6'                                                            
TAWSLEN  DS    XL1                 ELEMENT LENGTH                               
TAWSDPRT DS    XL3                 PWOS - DATE PRINTED                          
TAWSNHA  DS    XL4                 NEW HIRE ACT - EXEMPT WAGES (2010)           
         DS    CL7                 SPARE                                        
*##ASSOCIATED TAWSLEN                                                           
TAWSLNQ  EQU   *-TAWSD                                                          
                                                                                
***********************************************************************         
*        <   > EMPLOYEE W4 EXTRA DETAILS ELEMENT                      *         
***********************************************************************         
                                                                                
TAWXD    DSECT                                                                  
TAWXEL   DS    XL1                 ELEMENT CODE                                 
TAWXELQ  EQU   X'F8'                                                            
TAWXLEN  DS    XL1                 ELEMENT LENGTH                               
TAWXDOB  DS    XL3                 DATE OF BIRTH                                
TAWXPCT  DS    XL4                 DEDUCTION PERCENTAGE                         
TAWXTSSN DS    CL9                 TRUSTEE S/S NUMBER                           
TAWXHTP  DS    XL4                 AMT COLLECTED & W/HELD FOR TP                
TAWXHPPL DS    XL4                 AMT COLLECTED & W/HELD FOR P+                
TAWXHPP  DS    XL4                 AMT COLLECTED & W/HELD FOR PP                
TAWXMERN DS    XL4                 MINOR LIFETIME EARNINGS                      
         DS    XL16                SPARE                                        
*##ASSOCIATED TAWXLEN                                                           
TAWXLNQ  EQU   *-TAWXD                                                          
                                                                                
***********************************************************************         
*        <   > W2 DETAILS ELEMENT                                     *         
***********************************************************************         
                                                                                
TAW2D    DSECT                                                                  
TAW2EL   DS    XL1                 ELEMENT CODE                                 
TAW2ELQ  EQU   X'B5'                                                            
TAW2LEN  DS    XL1                 ELEMENT LENGTH                               
TAW2UNIT DS    CL3                 TAX UNIT                                     
         DS    CL3                                                              
TAW2AMTS DS    0CL20                                                            
TAW2EARN DS    F                   EARNINGS                                     
TAW2TAX  DS    F                   TAX                                          
TAW2SFLI DS    F                   FLI FOR STATES                               
         DS    0F                  * FEDERAL FIELDS                             
TAW2FICA DS    F                   FICA                                         
TAW2REXP DS    F                   REIMBURSED EXPENSES                          
         ORG   *-8                 * STATE FIELDS                               
TAW2SUI  DS    F                   UNEMPLOYMENT                                 
TAW2SDI  DS    F                   DISABILITY                                   
*##ASSOCIATED TAW2LEN                                                           
TAW2LNQ  EQU   *-TAW2D                                                          
TAW2TXRE DS    F                   TAXABLE REIMBURSEMENTS                       
TAW2LNQ2 EQU   *-TAW2D                                                          
                                                                                
***********************************************************************         
*        <   > EMPLOYEE W4 DETAILS ELEMENT                            *         
***********************************************************************         
                                                                                
TAW4D    DSECT                                                                  
TAW4EL   DS    XL1                 ELEMENT CODE                                 
TAW4ELQ  EQU   X'78'                                                            
TAW4LEN  DS    XL1                 ELEMENT LENGTH                               
TAW4TYPE DS    CL1                 TYPE                                         
TAW4TYCA EQU   C'A'                CANADIAN                                     
TAW4TYIN EQU   C'I'                INDIVIDUAL                                   
TAW4TYCO EQU   C'C'                CORPORATION                                  
TAW4TYES EQU   C'E'                ESTATE                                       
TAW4TYFO EQU   C'F'                FOREIGNER                                    
TAW4TYTR EQU   C'T'                TRUSTEE                                      
TAW4NAM2 DS    CL16                LAST NAME                                    
TAW4NAM1 DS    CL16                FIRST NAME                                   
         ORG   TAW4NAM2                                                         
TAW4CRPN DS    CL32                CORPORATION NAME                             
TAW4SEX  DS    CL1                 SEX CODE                                     
         DS    CL1                                                              
TAW4RECP DS    CL2                 RECIPROCAL STATE                             
TAW4LOCL DS    CL3                 AFM LOCAL                                    
TAW4RACE DS    CL2                 RACE                                         
TAW4FREQ DS    CL1                 FREQUENCY CODE                               
TAW4STAT DS    XL1                 STATUS                                       
TAW4STNY EQU   X'80'               DON'T PRINT Y-T-D DATA ON CHECKS             
TAW4STDU EQU   X'40'               DUE-COMPANY RECORD(S) PRESENT                
TAW4STLN EQU   X'20'               LIEN RECORD(S) PRESENT                       
TAW4STIR EQU   X'10'               SENT TO IRS (FOR >10 EXEMPTS.)               
TAW4STMX EQU   X'08'               CANT CHG N'EXEMP (RARE IRS RESTRICT)         
TAW4STNW EQU   X'04'               NO WITHHOLDING YET (INDIVIDUALS)             
TAW4STGU EQU   X'02'               GUARANTEES PRESENT                           
TAW4SCKF EQU   X'01'               SORT THIS PERSON'S CHECKS FIRST              
*##DATATYPE DATCON1                                                             
TAW4INDT DS    XL3                 INDEMNIFICATION DATE                         
TAW4STA2 DS    XL1                 STATUS                                       
TAW4SIRS EQU   X'80'               IRS RESTRICTION ON FED TAXES                 
TAW4SLCK EQU   X'40'               LOCKED RECORD                                
TAW4SNFI EQU   X'20'               NO FICA                                      
TAW4SNDU EQU   X'10'               NO DUE COMPANY                               
TAW4SNPE EQU   X'08'               NO PENSION                                   
TAW4SFGN EQU   X'04'               FOREIGN ADDRESS                              
TAW4SDD  EQU   X'02'               DIRECT DEPOSIT OF CHECKS                     
TAW4SWIR EQU   X'01'               WIRE TRANSFER CHECKS                         
TAW4STA3 DS    XL1                 STATUS                                       
TAW4SSPL EQU   X'80'               SPECIAL LETTER ON FILE                       
TAW4SNTX EQU   X'40'               NON-TAXABLE CANADIAN/FOREIGNER               
TAW4SNHA EQU   X'20'               ELIGIBLE FOR NEW HIRE ACT                    
TAW4SNHP EQU   X'10'               NEW HIRE ACT ELIGIBILITY PENDING             
TAW4SEFT EQU   X'08'               EFT OF CHECKS                                
TAW4SREG EQU   X'04'               REGRESSION TESTING W4                        
TAW4NHAD DS    XL3                 NEW HIRE DATE                                
TAW4CP   DS    CL2                 CANADIAN PROVINCE                            
*##ASSOCIATED TAW4LEN                                                           
TAW4LNQ  EQU   *-TAW4D                                                          
TAW4MIDN DS    CL16                MIDDLE NAME                                  
TAW4SUFF DS    CL4                 SUFFIX                                       
*##ASSOCIATED TAW4LEN                                                           
TAW4LN2Q EQU   *-TAW4D                                                          
                                                                                
***********************************************************************         
*        <   > EXTENDED COMMENT ELEMENT                               *         
***********************************************************************         
                                                                                
TAXCD    DSECT                                                                  
TAXCEL   DS    XL1                 ELEMENT CODE                                 
TAXCELQ  EQU   X'8C'                                                            
TAXCLEN  DS    XL1                 ELEMENT LENGTH                               
TAXCTYPE DS    XL1                 TYPE                                         
TAXCSEQ  DS    XL1                 SEQUENCE NUMBER                              
TAXCCMNT DS    0C                  COMMENT                                      
*##ASSOCIATED TAXCLEN                                                           
TAXCLNQ  EQU   *-TAXCD                                                          
                                                                                
***********************************************************************         
*        <   > EXTENDED TAXES ELEMENT                                 *         
***********************************************************************         
                                                                                
TAXTD    DSECT                                                                  
TAXTEL   DS    XL1                 ELEMENT CODE                                 
TAXTELQ  EQU   X'E5'                                                            
TAXTLEN  DS    XL1                 ELEMENT LENGTH                               
TAXTUNIT DS    CL3                 TAX UNIT                                     
TAXTTAXS DS    XL4                 TAX AMOUNT                                   
*##ASSOCIATED TAXTLEN                                                           
TAXTLNQ  EQU   *-TAXTD                                                          
                                                                                
***********************************************************************         
*        <   > PAYMENT TYPE DETAILS                                   *         
***********************************************************************         
                                                                                
TAYDD    DSECT                                                                  
TAYDEL   DS    XL1                 ELEMENT CODE                                 
TAYDELQ  EQU   X'09'                                                            
TAYDLEN  DS    XL1                 ELEMENT LENGTH                               
TAYDSTAT DS    XL1                 STATUS                                       
TAYDSUNT EQU   X'80'               UNIT BASED?                                  
TAYDSTAX EQU   X'40'               TAXABLE?                                     
TAYDSWAG EQU   X'20'               WAGE?                                        
TAYDSSUP EQU   X'10'               SUPPLEMENTAL?                                
TAYDSACO EQU   X'08'               AGENCY COMMISSION?                           
TAYDSDED EQU   X'04'               DEDUCTION?                                   
*##ASSOCIATED TAYDLEN                                                           
TAYDLNQ  EQU   *-TAYDD                                                          
                                                                                
***********************************************************************         
*        <   > YTD EARNINGS ELEMENT                                   *         
***********************************************************************         
                                                                                
TAYED    DSECT                                                                  
TAYEEL   DS    XL1                 ELEMENT CODE                                 
TAYEELQ  EQU   X'C7'                                                            
TAYELEN  DS    XL1                 ELEMENT LENGTH                               
TAYETYPE DS    CL1                 YTD TYPE                                     
TAYETBIL EQU   C'B'                BILLING YTD ELEMENT                          
TAYETCHK EQU   C'C'                CHECK YTD ELEMENT                            
         DS    CL1                                                              
TAYENYTD DS    0F                  NEW YTD AMOUNTS INCLUDING THIS CHK           
TAYEEARN DS    F                   EARNINGS                                     
TAYEFUI  DS    F                   FUI                                          
TAYESUI  DS    F                   SUI                                          
TAYEFICA DS    F                   FICA                                         
TAYEMED  DS    F                   MEDICARE                                     
TAYENTAX DS    F                   NON TAXABLE EARNINGS                         
TAYENLN  EQU   *-TAYENYTD                                                       
TAYETXBL DS    0F                  TAXABLE AMOUNT AT EACH LEVEL                 
TAYETERN DS    F                   EARNINGS                                     
TAYETFUI DS    F                   FUI                                          
TAYETSUI DS    F                   SUI                                          
TAYETFIC DS    F                   FICA                                         
TAYETMED DS    F                   MEDICARE                                     
TAYETOMD DS    F                   OVER MEDICARE                                
TAYETLN  EQU   *-TAYETXBL                                                       
TAYELNQ  EQU   *-TAYED                                                          
*                                                                               
TAYECYTD DS    0F                  NEW YTD AMOUNTS P+ CANADIAN                  
TAYEUTAX DS    F                   TAX EARNINGS                                 
TAYEUPP  DS    F                   PENSION PLAN EARNINGS                        
TAYEUEI  DS    F                   EMP INSURANCE EARNINGS                       
TAYEUPIP DS    F                   PARENTAL PLAN EARNINGS                       
TAYECTAX DS    F                   TAX EARNINGS CAD                             
TAYECPP  DS    F                   PENSION PLAN EARNINGS CAD                    
TAYECEI  DS    F                   EMP INSURANCE EARNINGS CAD                   
TAYECPIP DS    F                   PARENTAL PLAN EARNINGS CAD                   
TAYECLN  EQU   *-TAYECYTD                                                       
TAYECTXB DS    0F                  TAXABLE AMOUNT AT EACH LEVEL                 
TAYETUTA DS    F                   TAX EARNINGS                                 
TAYETUPP DS    F                   PENSION PLAN EARNINGS                        
TAYETUEI DS    F                   EMP INSURANCE EARNINGS                       
TAYETUPI DS    F                   PARENTAL PLAN EARNINGS                       
TAYETCTA DS    F                   TAX EARNINGS CAD                             
TAYETCPP DS    F                   PENSION PLAN EARNINGS CAD                    
TAYETCEI DS    F                   EMP INSURANCE EARNINGS CAD                   
TAYETCPI DS    F                   PARENTAL PLAN EARNINGS CAD                   
TAYETCLN EQU   *-TAYECTXB                                                       
*##ASSOCIATED TAYELEN                                                           
TAYELN2Q EQU   *-TAYED                                                          
                                                                                
***********************************************************************         
*        <   > YTD SUBJ-P&H ELEMENT                                   *         
***********************************************************************         
                                                                                
TAYSD    DSECT                                                                  
TAYSEL   DS    XL1                 ELEMENT CODE                                 
TAYSELQ  EQU   X'7F'                                                            
TAYSLEN  DS    XL1                 ELEMENT LENGTH                               
TAYSYEAR DS    CL4                 YEAR                                         
         DS    CL2                 SPARE - TO ALLIGN FULLWORD                   
TAYSSSPH DS    F                   SOAP YTD SUBJ-P&H FOR AFT                    
TAYSWSPH DS    F                   SOAP YTD SUBJ-P&H FOR WRITERS                
*##ASSOCIATED TAYSLEN                                                           
TAYSLNQ  EQU   *-TAYSD                                                          
                                                                                
***********************************************************************         
*        <   > 1099 DETAILS ELEMENT                                   *         
***********************************************************************         
                                                                                
TA99D    DSECT                                                                  
TA99EL   DS    XL1                 ELEMENT CODE                                 
TA99ELQ  EQU   X'0E'                                                            
TA99LEN  DS    XL1                 ELEMENT LENGTH                               
TA99TY   DS    CL1                 TYPE                                         
TA99TYB  EQU   C'B'                BENEFICIARY                                  
TA99TYC  EQU   C'C'                CONTRACTOR                                   
TA99TYE  EQU   C'E'                ASSOCIATED ESTATE                            
TA99TYF  EQU   C'F'                FOREIGN CORPORATION                          
TA99TYL  EQU   C'L'                LLC                                          
TA99TYP  EQU   C'P'                PARTNERSHIP                                  
TA99PSSN DS    CL9                 PERFORMER SSN                                
TA99AMTS DS    0XL8                                                             
TA99EARN DS    F                   EARNINGS                                     
TA99REXP DS    F                   REIMBURSED EXPENSES                          
*##ASSOCIATED TA99LEN                                                           
TA99LNQ  EQU   *-TA99D                                                          
                                                                                
***********************************************************************         
*##PROCESS OFF                                                        *         
***********************************************************************         
