*          DATA SET TALDRECTB  AT LEVEL 085 AS OF 02/20/15                      
*                                                                               
*  *** MUST RE-ASSEMBLE TALDBALC, TALDDCNT & TADFAR AFTER CHANGES ***           
*                                                                               
*              TABLE OF DIRECTORY RECORD TYPES                                  
         SPACE 3                                                                
         DS    0F                                                               
RECTBL   DS    0XL36                                                            
         DC    AL1(0),AL3(0),CL16'HEADER          ',4F'0'                       
         DC    AL1(TLSYCDQ),AL3(0),CL16'SYSTEM CONTROL  ',4F'0'                 
         DC    AL1(TLSTCDQ),AL3(0),CL16'STAFF RECORD    ',4F'0'                 
         DC    AL1(TLSTNCDQ),AL3(0),CL16'STAFF NAME      ',4F'0'                
         DC    AL1(TLSTCCDQ),AL3(0),CL16'STAFF CLI GRP   ',4F'0'                
         DC    AL1(TLOFCDQ),AL3(0),CL16'OFFICE RECORD   ',4F'0'                 
         DC    AL1(TLAYCDQ),AL3(0),CL16'AGENCY RECORD   ',4F'0'                 
         DC    AL1(TLAYNCDQ),AL3(0),CL16'AGENCY NAME     ',4F'0'                
         DC    AL1(TLAYGCDQ),AL3(0),CL16'AGENCY GROUP    ',4F'0'                
         DC    AL1(TLJBCDQ),AL3(0),CL16'JOB RECORD      ',4F'0'                 
         DC    AL1(TLAGCDQ),AL3(0),CL16'AGROUP RECORD   ',4F'0'                 
         DC    AL1(TLAGNCDQ),AL3(0),CL16'AGROUP NAME     ',4F'0'                
         DC    AL1(TLATCDQ),AL3(0),CL16'ATTENTION       ',4F'0'                 
         DC    AL1(TLCLCDQ),AL3(0),CL16'CLIENT RECORD   ',4F'0'                 
         DC    AL1(TLCLNCDQ),AL3(0),CL16'CLIENT NAME     ',4F'0'                
         DC    AL1(TLCLGCDQ),AL3(0),CL16'CLIENT GROUP    ',4F'0'                
         DC    AL1(TLCGCDQ),AL3(0),CL16'CGROUP RECORD   ',4F'0'                 
         DC    AL1(TLCGNCDQ),AL3(0),CL16'CGROUP NAME     ',4F'0'                
         DC    AL1(TLDLCDQ),AL3(0),CL16'DEAL RECORD     ',4F'0'                 
         DC    AL1(TLOTCDQ),AL3(0),CL16'GRT CON TRK REC ',4F'0'                 
         DC    AL1(TLPRCDQ),AL3(0),CL16'PRODUCT RECORD  ',4F'0'                 
         DC    AL1(TLPRNCDQ),AL3(0),CL16'PRODUCT NAME    ',4F'0'                
         DC    AL1(TLPRGCDQ),AL3(0),CL16'PRODUCT GROUP   ',4F'0'                
         DC    AL1(TLPGCDQ),AL3(0),CL16'PGROUP RECORD   ',4F'0'                 
         DC    AL1(TLPGNCDQ),AL3(0),CL16'PGROUP NAME     ',4F'0'                
         DC    AL1(TLCTCDQ),AL3(0),CL16'CONTROL RECORD  ',4F'0'                 
         DC    AL1(TLCOCDQ),AL3(0),CL16'COMMERCIAL RECRD',4F'0'                 
         DC    AL1(TLCONCDQ),AL3(0),CL16'COMMERCIAL NAME ',4F'0'                
         DC    AL1(TLCOICDQ),AL3(0),CL16'COMMERCIAL ID   ',4F'0'                
         DC    AL1(TLCOCCDQ),AL3(0),CL16'COMMERCIAL NO.  ',4F'0'                
         DC    AL1(TLCOMCDQ),AL3(0),CL16'COMMERCIAL MUSIC',4F'0'                
         DC    AL1(TLCOPCDQ),AL3(0),CL16'COMMERCIAL PRINT',4F'0'                
         DC    AL1(TLCOACDQ),AL3(0),CL16'COMML. CONTRACTS',4F'0'                
         DC    AL1(TLCOKCDQ),AL3(0),CL16'COMMERCIAL AKA  ',4F'0'                
         DC    AL1(TLCOGCDQ),AL3(0),CL16'COMML CLIENT GRP',4F'0'                
         DC    AL1(TLCOLCDQ),AL3(0),CL16'COMML NAME CGRP ',4F'0'                
         DC    AL1(TLMUCDQ),AL3(0),CL16'MUSIC RECORD    ',4F'0'                 
         DC    AL1(TLANCDQ),AL3(0),CL16'AGENT RECORD    ',4F'0'                 
         DC    AL1(TLANNCDQ),AL3(0),CL16'AGENT NAME      ',4F'0'                
         DC    AL1(TLANCCDQ),AL3(0),CL16'AGENT DPS/TNR   ',4F'0'                
         DC    AL1(TLANBCDQ),AL3(0),CL16'AGENT BREAK NAME',4F'0'                
         DC    AL1(TLIFCDQ),AL3(0),CL16'INTERFACE RECORD',4F'0'                 
         DC    AL1(TLEMCDQ),AL3(0),CL16'EMPLOYER RECORD ',4F'0'                 
         DC    AL1(TLECCDQ),AL3(0),CL16'ECAST RECORDS   ',4F'0'                 
         DC    AL1(TLECCCDQ),AL3(0),CL16'ECAST EPISODES  ',4F'0'                
         DC    AL1(TLEPCDQ),AL3(0),CL16'EPISODE RECORDS ',4F'0'                 
         DC    AL1(TLEXCDQ),AL3(0),CL16'EMPLOYER TAX REC',4F'0'                 
         DC    AL1(TLW4CDQ),AL3(0),CL16'W4 RECORD       ',4F'0'                 
         DC    AL1(TLW4NCDQ),AL3(0),CL16'W4 NAME         ',4F'0'                
         DC    AL1(TLW4NCDQ),AL3(0),CL16'AKA NAME        ',4F'0'                
         DC    AL1(TLW4CCDQ),AL3(0),CL16'W4 CORP         ',4F'0'                
         DC    AL1(TLW4OCDQ),AL3(0),CL16'W4 OLD CONVERT  ',4F'0'                
         DC    AL1(TLGUCDQ),AL3(0),CL16'GUARANTEE RECORD',4F'0'                 
         DC    AL1(TLGCCDQ),AL3(0),CL16'GRT CONTRACT REC',4F'0'                 
         DC    AL1(TLGLCDQ),AL3(0),CL16'GENERAL LISTS   ',4F'0'                 
         DC    AL1(TLDUCDQ),AL3(0),CL16'DUE COMPANY REC.',4F'0'                 
         DC    AL1(TLLNCDQ),AL3(0),CL16'LIEN RECORD     ',4F'0'                 
         DC    AL1(TLLNRCDQ),AL3(0),CL16'LIEN RANK       ',4F'0'                
         DC    AL1(TLCACDQ),AL3(0),CL16'CAST RECORD     ',4F'0'                 
         DC    AL1(TLCACCDQ),AL3(0),CL16'CAST COMMERCIALS',4F'0'                
         DC    AL1(TLCAACDQ),AL3(0),CL16'CAST AGENT      ',4F'0'                
         DC    AL1(TLCAGCDQ),AL3(0),CL16'CAST GUARANTEE  ',4F'0'                
         DC    AL1(TLCAHCDQ),AL3(0),CL16'CAST HOLDING FEE',4F'0'                
         DC    AL1(TLARCDQ),AL3(0),CL16'AREA RECORD     ',4F'0'                 
         DC    AL1(TLUSCDQ),AL3(0),CL16'USE RECORD      ',4F'0'                 
         DC    AL1(TLINCDQ),AL3(0),CL16'INVOICE RECORD  ',4F'0'                 
         DC    AL1(TLINHCDQ),AL3(0),CL16'INVOICE HISTORY ',4F'0'                
         DC    AL1(TLINBCDQ),AL3(0),CL16'INVOICE BILLING ',4F'0'                
         DC    AL1(TLINCCDQ),AL3(0),CL16'INVOICE DUE DATE',4F'0'                
         DC    AL1(TLINDCDQ),AL3(0),CL16'INVOICE BILL DTE',4F'0'                
         DC    AL1(TLINKCDQ),AL3(0),CL16'INVOICE CHECK DT',4F'0'                
         DC    AL1(TLINPCDQ),AL3(0),CL16'INVOICE PAY DATE',4F'0'                
         DC    AL1(TLUHCDQ),AL3(0),CL16'USAGE HISTORY   ',4F'0'                 
         DC    AL1(TLUHMTDQ),AL3(0),CL16'UH CNET/MKT/CSYS',4F'0'                
         DC    AL1(TLHCCDQ),AL3(0),CL16'HISTORY COMMENT ',4F'0'                 
         DC    AL1(TLCKCDQ),AL3(0),CL16'CHECK RECORD    ',4F'0'                 
         DC    AL1(TLCKHCDQ),AL3(0),CL16'CHECK CAST PYMNT',4F'0'                
         DC    AL1(TLCKECDQ),AL3(0),CL16'CHECK EMPLOYEE  ',4F'0'                
         DC    AL1(TLCKDCDQ),AL3(0),CL16'CHECK DUE COMP  ',4F'0'                
         DC    AL1(TLCKLCDQ),AL3(0),CL16'CHECK LIEN TRACK',4F'0'                
         DC    AL1(TLCKCCDQ),AL3(0),CL16'CHECK BANK      ',4F'0'                
         DC    AL1(TLCKYCDQ),AL3(0),CL16'CHECK EMP. YTD  ',4F'0'                
         DC    AL1(TLCKBCDQ),AL3(0),CL16'CHECK BILL YTD  ',4F'0'                
         DC    AL1(TLCKRCDQ),AL3(0),CL16'CHECK CREDIT INV',4F'0'                
         DC    AL1(TLFTCDQ),AL3(0),CL16'FIXED CYC TRACK ',4F'0'                 
         DC    AL1(TLGTCDQ),AL3(0),CL16'GUARANTEE TRACK ',4F'0'                 
         DC    AL1(TLDTCDQ),AL3(0),CL16'DUE COMP. TRACK ',4F'0'                 
         DC    AL1(TLSGCDQ),AL3(0),CL16'SOAP GUARANTEE  ',4F'0'                 
         DC    AL1(TLLOCDQ),AL3(0),CL16'UNION LOCAL REC.',4F'0'                 
         DC    AL1(TLW2CDQ),AL3(0),CL16'W2 RECORD       ',4F'0'                 
         DC    AL1(TLTMCDQ),AL3(0),CL16'TIMESHEET RECORD',4F'0'                 
         DC    AL1(TLETCDQ),AL3(0),CL16'ECAST TRACKING  ',4F'0'                 
         DC    AL1(TLBACDQ),AL3(0),CL16'BALANCE RECORD  ',4F'0'                 
         DC    AL1(TLDVCDQ),AL3(0),CL16'ADVICE RECORD   ',4F'0'                 
         DC    AL1(TLDVOCDQ),AL3(0),CL16'ADVICE OFFICE   ',4F'0'                
         DC    AL1(TLDVEDDQ),AL3(0),CL16'ADVICE DUE DATE ',4F'0'                
         DC    AL1(TLDVRDDQ),AL3(0),CL16'ADVICE REG DUE  ',4F'0'                
         DC    AL1(TLDVMDDQ),AL3(0),CL16'ADVICE MUS DUE  ',4F'0'                
         DC    AL1(TLDCCDQ),AL3(0),CL16'ADVICE CAST REC.',4F'0'                 
         DC    AL1(TLNXCDQ),AL3(0),CL16'NETWORK XFER    ',4F'0'                 
         DC    AL1(TLNXNCDQ),AL3(0),CL16'NWK XFER NAME   ',4F'0'                
         DC    AL1(TLMTCDQ),AL3(0),CL16'MARKET RECORD   ',4F'0'                 
         DC    AL1(TLMTNMDQ),AL3(0),CL16'MARKET BY NAME  ',4F'0'                
         DC    AL1(TLMTALDQ),AL3(0),CL16'MARKET BY ALPHA ',4F'0'                
         DC    AL1(TLMTICDQ),AL3(0),CL16'MARKET BY INCODE',4F'0'                
         DC    AL1(TLAKCDQ),AL3(0),CL16'ALIAS RECORD    ',4F'0'                 
         DC    AL1(TLESCDQ),AL3(0),CL16'ESTIMATE RECORD ',4F'0'                 
         DC    AL1(TLSSCDQ),AL3(0),CL16'SESSION ESTIMATE',4F'0'                 
         DC    AL1(TLSCCDQ),AL3(0),CL16'SCREEN RECORD   ',4F'0'                 
         DC    AL1(TLSECDQ),AL3(0),CL16'SECURITY RECORD ',4F'0'                 
         DC    AL1(TLCMCDQ),AL3(0),CL16'COMMENT RECORD  ',4F'0'                 
         DC    AL1(TLVRCDQ),AL3(0),CL16'VERSION RECORD  ',4F'0'                 
         DC    AL1(TLCNCDQ),AL3(0),CL16'CONTRACT RECORD ',4F'0'                 
         DC    AL1(TLOGCDQ),AL3(0),CL16'COM GROUP RECORD',4F'0'                 
         DC    AL1(TLPTCDQ),AL3(0),CL16'PRODUCT TYPE REC',4F'0'                 
         DC    AL1(TLMDCDQ),AL3(0),CL16'MEDIA RECORD    ',4F'0'                 
         DC    AL1(TLWTCDQ),AL3(0),CL16'WEB TRANS RECORD',4F'0'                 
                                                                                
         DC    AL1(TLPUCDQ),AL1(TLPUSCDQ),AL2(0)                                
         DC    CL16'PURCH ORDER REC ',4F'0'                                     
         DC    AL1(TLPMCDQ),AL1(TLPMSCDQ),AL2(0)                                
         DC    CL16'PYMNT TYPE REC  ',4F'0'                                     
         DC    AL1(TLTKCDQ),AL1(TLTKSCDQ),AL2(0)                                
         DC    CL16'TASK RECORD     ',4F'0'                                     
         DC    AL1(TLTRCDQ),AL1(TLTRSCDQ),AL2(0)                                
         DC    CL16'TPROFILE RECORD ',4F'0'                                     
         DC    AL1(TL99CDQ),AL1(TL99SCDQ),AL2(0)                                
         DC    CL16'1099 RECORD     ',4F'0'                                     
                                                                                
         DC    AL1(TLT4CDQ),AL1(TLT4SCDQ),AL2(0)                                
         DC    CL16'T4 RECORD       ',4F'0'                                     
         DC    AL1(TLR1CDQ),AL1(TLR1SCDQ),AL2(0)                                
         DC    CL16'RL-1 RECORD     ',4F'0'                                     
         DC    AL1(TLTACDQ),AL1(TLTASCDQ),AL2(0)                                
         DC    CL16'T4A-NR RECORD   ',4F'0'                                     
         DC    AL1(TLN4CDQ),AL1(TLN4SCDQ),AL2(0)                                
         DC    CL16'NR4 RECORD      ',4F'0'                                     
         DC    AL1(TLPVCDQ),AL1(TLPVSCDQ),AL2(0)                                
         DC    CL16'ARCHIVE ADVICE  ',4F'0'                                     
                                                                                
         DC    X'FF',AL3(0),CL16'TRAILER RECORD  ',4F'0'                        
                                                                                
RECTBLX  DC    X'FFFF0000',CL16'MISCELLANEOUS   ',4F'0'                         
RECTBTAL DC    X'FFFF0000',CL16'TOTAL TALFILE   ',4F'0'                         
RECTBCHK DC    X'FFFF0000',CL16'TOTAL CHKFILE   ',4F'0'                         
RECTBLTT DC    X'FFFFFFFF',CL16'TOTAL RECORDS   ',4F'0'                         
         DC    F'0'                                                             
