*          DATA SET TALNKFCYD  AT LEVEL 002 AS OF 04/27/12                      
***********************************************************************         
*        DSECT FOR TALNKFCY ROUTINES                                  *         
***********************************************************************         
*                                                                               
TALKFCYD DSECT                                                                  
TLFCSTF  DS    CL8                 STAFF CODE                                   
TLFCCOM  DS    XL4                 INTERNAL COMMERCIAL NUMBER                   
TLFCSEQ  DS    XL2                 CAST SEQUENCE NUMBER                         
TLFCCYS  DS    XL3                 CYCLE START DATE                             
TLFCCYE  DS    XL3                 CYCLE END DATE                               
TLFCBAL  DS    XL4                 BALANCE                                      
TLFCGRR  DS    CL(L'TACRTYPE)      GRR COVERED USE                              
TLFCACS  DS    XL3                 APPLICATION CYCLE START DATE                 
TLFCACE  DS    XL3                 APPLICATION CYCLE END DATE                   
TLFCPNH  DS    XL4                 P&H AMOUNT                                   
TLFCAAM  DS    XL4                 APPLICATION AMOUNT                           
TLFCCMT  DS    CL40                COMMENT                                      
                                                                                
TLFCSSN  DS    CL(L'TLCASSN)       SOCIAL SECURITY NUMBER                       
TLFCTIME DS    XL3                 TIME                                         
TLFCLNQ  EQU   *-TALKFCYD                                                       
         EJECT                                                                  
