*          DATA SET TAPAYBRKT  AT LEVEL 078 AS OF 05/13/13                      
                                                                                
*              EQUATES                                                          
                                                                                
BROVRSCL EQU   1                   OVERSCALE                                    
BRPRVAPP EQU   2                   PREVIOUSLY APPLIED                           
BRADJITN EQU   3                   ADJUST ITN                                   
*                                                                               
BRKTABL  DS    0CL26                                                            
         DC    AL1(1),CL25'Overscale'                                           
         DC    AL1(2),CL25'Cable'                                               
         DC    AL1(3),CL25'Adjust ITN'                                          
         DC    AL1(4),CL25'Applied'                                             
         DC    AL1(5),CL25'Payment'                                             
         DC    AL1(6),CL25'Penalty'                                             
         DC    AL1(7),CL25'Doubling'                                            
         DC    AL1(8),CL25'Sweeten/Multitrack'                                  
*                                                                               
         DC    AL1(51),CL25'Spot (Days=  )'                                     
         DC    AL1(52),CL25'Days (Spot=  )'                                     
         DC    AL1(53),CL25'Overtime 1.5x'                                      
         DC    AL1(54),CL25'Overtime 2.0x'                                      
         DC    AL1(55),CL25'Travel Time'                                        
         DC    AL1(56),CL25'Prior Day Wardrobe'                                 
         DC    AL1(57),CL25'Tags'                                               
         DC    AL1(58),CL25'Night Premium'                                      
         DC    AL1(59),CL25'Meal Penalty'                                       
         DC    AL1(60),CL25'16-Hour Rule'                                       
         DC    AL1(61),CL25'Smoke Pay'                                          
         DC    AL1(62),CL25'Adjustment'                                         
         DC    AL1(63),CL25'Fri/Sat Hrs'                                        
         DC    AL1(64),CL25'Spots'                                              
         DC    AL1(65),CL25'1st Tag @ Session'                                  
         DC    AL1(66),CL25'Music'                  Music (special)             
         DC    AL1(67),CL25'H&&W Contribution'                                  
         DC    AL1(68),CL25'Rest Period Violation'                              
         DC    AL1(69),CL25'Industrials'                                        
         DC    AL1(70),CL25'Variations'                                         
         DC    AL1(71),CL25'1st Variation'                                      
         DC    AL1(72),CL25'Every 4 Variations'                                 
*                                                                               
         DC    X'00'                                                            
         EJECT                                                                  
