*          DATA SET TAPYS91D   AT LEVEL 001 AS OF 11/02/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F391D      DATE 11/02/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
PAYAGYH  DS    XL8                                                              
PAYAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
PAYAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
PAYINVH  DS    XL8                                                              
PAYINV   DS    CL6      5   28    6  A  U N             T        Y  144         
PAYINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
PAYCIDH  DS    XL8                                                              
PAYCID   DS    CL12     5   46   12  A  U N             T        Y   64         
PAYCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   59    3  A  P N             T        Y              
PAYLFTH  DS    XL8                                                              
PAYLFT   DS    CL3      5   63    3  A  U N             T        Y   65         
PAYLFTX  DS    XL8                                                              
PAYLIDH  DS    XL8                                                              
PAYLID   DS    CL12     5   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
PAYAGYNH DS    XL8                                                              
PAYAGYN  DS    CL16     6    2   16  A  P N             T        Y              
PAYCLINH DS    XL8                                                              
PAYCLIN  DS    CL16     6   20   16  A  P N             T        Y              
PAYCOMNH DS    XL8                                                              
PAYCOMN  DS    CL19     6   38   19  A  P N             T        Y              
PAYSECH  DS    XL8                                                              
PAYSEC   DS    CL4      6   58    4  A  P N             T        Y              
PAYCLPRH DS    XL8                                                              
PAYCLPR  DS    CL13     6   63   13  A  P N             T        Y              
PAYMEDNH DS    XL8                                                              
PAYMEDN  DS    CL3      6   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30     8   24   30  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25    10    2   25  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25    10   28   25  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25    10   54   25  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25    11    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    11   28   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    11   54   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    12    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    12   28   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    12   54   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    13    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    13   28   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    13   54   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    14    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    14   28   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    14   54   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    15    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    15   28   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    15   54   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    16    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    16   28   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    16   54   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    17    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    17   28   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    17   54   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    18    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    18   28   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    18   54   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    19    2   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    19   28   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    19   54   25  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    23    2   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    23   19   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     23   37    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    23   54   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12    24    2   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   19   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15    24   37   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    24   54   10  A  P H             T        Y              
PAYLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
PAYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1488 BYTES                            
