*          DATA SET TAPYS76D   AT LEVEL 011 AS OF 05/04/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F376D      DATE 05/04/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
NBMAGYH  DS    XL8                                                              
NBMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
NBMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
NBMINVH  DS    XL8                                                              
NBMINV   DS    CL6      4   28    6  A  U N             T        Y  144         
NBMINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
NBMCIDH  DS    XL8                                                              
NBMCID   DS    CL12     4   46   12  A  U N             T        Y   64         
NBMCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
NBMLFTH  DS    XL8                                                              
NBMLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
NBMLFTX  DS    XL8                                                              
NBMLIDH  DS    XL8                                                              
NBMLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
NBMAGYNH DS    XL8                                                              
NBMAGYN  DS    CL16     5    2   16  A  P N             T        Y              
NBMCLINH DS    XL8                                                              
NBMCLIN  DS    CL16     5   20   16  A  P N             T        Y              
NBMCOMNH DS    XL8                                                              
NBMCOMN  DS    CL19     5   38   19  A  P N             T        Y              
NBMSECH  DS    XL8                                                              
NBMSEC   DS    CL4      5   58    4  A  P N             T        Y              
NBMCLPRH DS    XL8                                                              
NBMCLPR  DS    CL13     5   63   13  A  P N             T        Y              
NBMMEDNH DS    XL8                                                              
NBMMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
NBMAUTHH DS    XL8                                                              
NBMAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
NBMAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
NBMESTH  DS    XL8                                                              
NBMEST   DS    CL16     6   46   16  A  U N             T        Y   13         
NBMESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
NBMPDH   DS    XL8                                                              
NBMPD    DS    CL2      6   74    2  N  U N             T        Y   15         
NBMPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
NBMCYCH  DS    XL8                                                              
NBMCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
NBMCYCX  DS    XL8                                                              
NBMLCYCH DS    XL8                                                              
NBMLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
NBMDTLH  DS    XL8                                                              
NBMDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
NBMDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
NBMBNPH  DS    XL8                                                              
NBMBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
NBMBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
NBMEINVH DS    XL8                                                              
NBMEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
NBMEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
NBMHCOMH DS    XL8                                                              
NBMHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
NBMHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
NBMICOMH DS    XL8                                                              
NBMICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
NBMICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
NBMOPTH  DS    XL8                                                              
NBMOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
NBMOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
NBMOVLYH DS    XL8                                                              
NBMOVLY  DS    CL1     11    2    1  A  P N             T        Y              
NBMUSNMH DS    XL8                                                              
NBMUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL43    13    9   43  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     13   58    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
NBMLPAYH DS    XL8                                                              
NBMLPAY  DS    CL69    14    8   69  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
NBM8WKH  DS    XL8                                                              
NBM8WK   DS    CL1     15   36    1  A  U N             T        Y  101         
NBM8WKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   38    1  N  P N             T        Y              
NBM1YRH  DS    XL8                                                              
NBM1YR   DS    CL1     15   48    1  A  U N             T        Y  102         
NBM1YRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   50    1  N  P N             T        Y              
NBM2YRH  DS    XL8                                                              
NBM2YR   DS    CL1     15   61    1  A  U N             T        Y  103         
NBM2YRX  DS    XL8                                                              
NBMTOTSH DS    XL8                                                              
NBMTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
NBMCMNTH DS    XL8                                                              
NBMCMNT  DS    CL60    24    2   60  A  P H             T        Y              
NBMDUEH  DS    XL8                                                              
NBMDUE   DS    CL14    24   67   14  A  P Z             T        Y              
NBMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
NBMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1280 BYTES                            
