*          DATA SET TAPYS63D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F363D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SNWAGYH  DS    XL8                                                              
SNWAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SNWAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
SNWINVH  DS    XL8                                                              
SNWINV   DS    CL6      4   28    6  A  U N             T        Y  144         
SNWINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
SNWCIDH  DS    XL8                                                              
SNWCID   DS    CL12     4   46   12  A  U N             T        Y   64         
SNWCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
SNWLFTH  DS    XL8                                                              
SNWLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
SNWLFTX  DS    XL8                                                              
SNWLIDH  DS    XL8                                                              
SNWLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
SNWAGYNH DS    XL8                                                              
SNWAGYN  DS    CL16     5    2   16  A  P N             T        Y              
SNWCLINH DS    XL8                                                              
SNWCLIN  DS    CL16     5   20   16  A  P N             T        Y              
SNWCOMNH DS    XL8                                                              
SNWCOMN  DS    CL19     5   38   19  A  P N             T        Y              
SNWSECH  DS    XL8                                                              
SNWSEC   DS    CL4      5   58    4  A  P N             T        Y              
SNWCLPRH DS    XL8                                                              
SNWCLPR  DS    CL13     5   63   13  A  P N             T        Y              
SNWMEDNH DS    XL8                                                              
SNWMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SNWAUTHH DS    XL8                                                              
SNWAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
SNWAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
SNWESTH  DS    XL8                                                              
SNWEST   DS    CL16     6   46   16  A  U N             T        Y   13         
SNWESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
SNWPDH   DS    XL8                                                              
SNWPD    DS    CL2      6   74    2  N  U N             T        Y   15         
SNWPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SNWCYCH  DS    XL8                                                              
SNWCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
SNWCYCX  DS    XL8                                                              
SNWLCYCH DS    XL8                                                              
SNWLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
SNWDTLH  DS    XL8                                                              
SNWDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
SNWDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
SNWBNPH  DS    XL8                                                              
SNWBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
SNWBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
SNWEINVH DS    XL8                                                              
SNWEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
SNWEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SNWHCOMH DS    XL8                                                              
SNWHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
SNWHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SNWICOMH DS    XL8                                                              
SNWICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
SNWICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SNWOPTH  DS    XL8                                                              
SNWOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
SNWOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
SNWOVLYH DS    XL8                                                              
SNWOVLY  DS    CL1     11    2    1  A  P N             T        Y              
SNWUSNMH DS    XL8                                                              
SNWUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL29    13   46   29  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL66    14   11   66  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
SNWLPAYH DS    XL8                                                              
SNWLPAY  DS    CL24    15   10   24  A  P N             T        Y              
SNWLUNTH DS    XL8                                                              
SNWLUNT  DS    CL4     15   38    4  N  U N             T        Y  113         
SNWLUNTX DS    XL8                                                              
SNWLUPNH DS    XL8                                                              
SNWLUPN  DS    CL1     15   49    1  A  P N             T        Y              
SNWLUPWH DS    XL8                                                              
SNWLUPW  DS    CL1     15   60    1  A  P N             T        Y              
SNWLUPCH DS    XL8                                                              
SNWLUPC  DS    CL1     15   71    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
SNWUNITH DS    XL8                                                              
SNWUNIT  DS    CL4     16   38    4  N  U N             T        Y  106         
SNWUNITX DS    XL8                                                              
SNWUPGNH DS    XL8                                                              
SNWUPGN  DS    CL1     16   49    1  A  U N             T        Y  107         
SNWUPGNX DS    XL8                                                              
SNWUPGWH DS    XL8                                                              
SNWUPGW  DS    CL1     16   60    1  A  U N             T        Y  109         
SNWUPGWX DS    XL8                                                              
SNWUPGCH DS    XL8                                                              
SNWUPGC  DS    CL1     16   71    1  A  U N             T        Y  110         
SNWUPGCX DS    XL8                                                              
SNWTOTSH DS    XL8                                                              
SNWTOTS  DS    CL53    18    2   53  A  P Z             T        Y              
SNWCMNTH DS    XL8                                                              
SNWCMNT  DS    CL60    24    2   60  A  P H             T        Y              
SNWDUEH  DS    XL8                                                              
SNWDUE   DS    CL14    24   67   14  A  P Z             T        Y              
SNWLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SNWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1328 BYTES                            
