*          DATA SET TAPYS66D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F366D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ADWTAGH  DS    XL8                                                              
ADWTAG   DS    CL6      4    2    6  A  P H             T        Y              
ADWAGYH  DS    XL8                                                              
ADWAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
ADWAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
ADWINVH  DS    XL8                                                              
ADWINV   DS    CL6      4   28    6  A  U N             T        Y  144         
ADWINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
ADWCIDH  DS    XL8                                                              
ADWCID   DS    CL12     4   46   12  A  U N             T        Y   64         
ADWCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
ADWLFTH  DS    XL8                                                              
ADWLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
ADWLFTX  DS    XL8                                                              
ADWLIDH  DS    XL8                                                              
ADWLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
ADWAGYNH DS    XL8                                                              
ADWAGYN  DS    CL16     5    2   16  A  P N             T        Y              
ADWCLINH DS    XL8                                                              
ADWCLIN  DS    CL16     5   20   16  A  P N             T        Y              
ADWCOMNH DS    XL8                                                              
ADWCOMN  DS    CL19     5   38   19  A  P N             T        Y              
ADWSECH  DS    XL8                                                              
ADWSEC   DS    CL4      5   58    4  A  P N             T        Y              
ADWCLPRH DS    XL8                                                              
ADWCLPR  DS    CL13     5   63   13  A  P N             T        Y              
ADWMEDNH DS    XL8                                                              
ADWMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
ADWAUTHH DS    XL8                                                              
ADWAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
ADWAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
ADWESTH  DS    XL8                                                              
ADWEST   DS    CL16     6   46   16  A  U N             T        Y   13         
ADWESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
ADWPDH   DS    XL8                                                              
ADWPD    DS    CL2      6   74    2  N  U N             T        Y   15         
ADWPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
ADWCYCH  DS    XL8                                                              
ADWCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
ADWCYCX  DS    XL8                                                              
ADWLCYCH DS    XL8                                                              
ADWLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
ADWDTLH  DS    XL8                                                              
ADWDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
ADWDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
ADWBNPH  DS    XL8                                                              
ADWBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
ADWBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
ADWEINVH DS    XL8                                                              
ADWEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
ADWEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
ADWHCOMH DS    XL8                                                              
ADWHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
ADWHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
ADWICOMH DS    XL8                                                              
ADWICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
ADWICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
ADWOPTH  DS    XL8                                                              
ADWOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
ADWOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
ADWOVLYH DS    XL8                                                              
ADWOVLY  DS    CL1     10   80    1  A  P N             T        Y              
ADWUSNMH DS    XL8                                                              
ADWUSNM  DS    CL16    11   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL17    12    9   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    12   33   16  A  P H             T        Y              
ADWHTY1H DS    XL8                                                              
ADWHTY1  DS    CL5     12   50    5  A  P H             T        Y              
ADWHTY2H DS    XL8                                                              
ADWHTY2  DS    CL5     12   56    5  A  P H             T        Y              
ADWHTY3H DS    XL8                                                              
ADWHTY3  DS    CL5     12   62    5  A  P H             T        Y              
ADWHTY4H DS    XL8                                                              
ADWHTY4  DS    CL5     12   68    5  A  P H             T        Y              
ADWHTY5H DS    XL8                                                              
ADWHTY5  DS    CL5     12   74    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P H             T        Y              
ADWLPAYH DS    XL8                                                              
ADWLPAY  DS    CL24    13    8   24  A  P N             T        Y              
ADWLUNTH DS    XL8                                                              
ADWLUNT  DS    CL4     13   33    4  A  U N             T        Y  109         
ADWLUNTX DS    XL8                                                              
ADWLAUTH DS    XL8                                                              
ADWLAUT  DS    CL4     13   39    4  A  P N             T        Y              
ADWLUPGH DS    XL8                                                              
ADWLUPG  DS    CL1     13   46    1  A  P N             T        Y              
ADWLTY1H DS    XL8                                                              
ADWLTY1  DS    CL1     13   52    1  A  P N             T        Y              
ADWLTY2H DS    XL8                                                              
ADWLTY2  DS    CL1     13   58    1  A  P N             T        Y              
ADWLTY3H DS    XL8                                                              
ADWLTY3  DS    CL1     13   64    1  A  P N             T        Y              
ADWLTY4H DS    XL8                                                              
ADWLTY4  DS    CL1     13   70    1  A  P N             T        Y              
ADWLTY5H DS    XL8                                                              
ADWLTY5  DS    CL1     13   76    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
ADWUNITH DS    XL8                                                              
ADWUNIT  DS    CL4     14   33    4  A  U N             T        Y  106         
ADWUNITX DS    XL8                                                              
ADWAUNTH DS    XL8                                                              
ADWAUNT  DS    CL4     14   39    4  A  P N             T        Y              
ADWUPGRH DS    XL8                                                              
ADWUPGR  DS    CL1     14   46    1  A  U N             T        Y  107         
ADWUPGRX DS    XL8                                                              
ADWTTY1H DS    XL8                                                              
ADWTTY1  DS    CL1     14   52    1  A  U N             T        Y  101         
ADWTTY1X DS    XL8                                                              
ADWTTY2H DS    XL8                                                              
ADWTTY2  DS    CL1     14   58    1  A  U N             T        Y  102         
ADWTTY2X DS    XL8                                                              
ADWTTY3H DS    XL8                                                              
ADWTTY3  DS    CL1     14   64    1  A  U N             T        Y  103         
ADWTTY3X DS    XL8                                                              
ADWTTY4H DS    XL8                                                              
ADWTTY4  DS    CL1     14   70    1  A  U N             T        Y  105         
ADWTTY4X DS    XL8                                                              
ADWTTY5H DS    XL8                                                              
ADWTTY5  DS    CL1     14   76    1  A  U N             T        Y  104         
ADWTTY5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15    4    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   13    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   24    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   33    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   44    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   53    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   64    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   73    3  A  P H             T        Y              
ADWFRSTH DS    XL8                                                              
ADWFRST  DS    CL1     16    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   53    6  A  U N             T        Y              
ADWLSTH  DS    XL8                                                              
ADWLST   DS    CL1     22   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   73    6  A  U N             T        Y              
ADWTOTSH DS    XL8                                                              
ADWTOTS  DS    CL53    23    2   53  A  P Z             T        Y              
ADWCMNTH DS    XL8                                                              
ADWCMNT  DS    CL60    24    2   60  A  P H             T        Y              
ADWDUEH  DS    XL8                                                              
ADWDUE   DS    CL14    24   67   14  A  P Z             T        Y              
ADWLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ADWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2616 BYTES                            
