*          DATA SET TAPYS12D   AT LEVEL 001 AS OF 06/20/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F312D      DATE 06/20/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MOVTAGH  DS    XL8                                                              
MOVTAG   DS    CL6      4    2    6  A  P H             T        Y              
MOVAGYH  DS    XL8                                                              
MOVAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
MOVAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
MOVINVH  DS    XL8                                                              
MOVINV   DS    CL6      4   28    6  A  U N             T        Y  144         
MOVINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
MOVCIDH  DS    XL8                                                              
MOVCID   DS    CL12     4   46   12  A  U N             T        Y   64         
MOVCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
MOVLFTH  DS    XL8                                                              
MOVLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
MOVLFTX  DS    XL8                                                              
MOVLIDH  DS    XL8                                                              
MOVLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
MOVAGYNH DS    XL8                                                              
MOVAGYN  DS    CL16     5    2   16  A  P N             T        Y              
MOVCLINH DS    XL8                                                              
MOVCLIN  DS    CL16     5   20   16  A  P N             T        Y              
MOVCOMNH DS    XL8                                                              
MOVCOMN  DS    CL19     5   38   19  A  P N             T        Y              
MOVSECH  DS    XL8                                                              
MOVSEC   DS    CL4      5   58    4  A  P N             T        Y              
MOVCLPRH DS    XL8                                                              
MOVCLPR  DS    CL13     5   63   13  A  P N             T        Y              
MOVMEDNH DS    XL8                                                              
MOVMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
MOVAUTHH DS    XL8                                                              
MOVAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
MOVAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
MOVESTH  DS    XL8                                                              
MOVEST   DS    CL16     6   46   16  A  U N             T        Y   13         
MOVESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
MOVPDH   DS    XL8                                                              
MOVPD    DS    CL2      6   74    2  N  U N             T        Y   15         
MOVPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
MOVCYCH  DS    XL8                                                              
MOVCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
MOVCYCX  DS    XL8                                                              
MOVLCYCH DS    XL8                                                              
MOVLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
MOVDTLH  DS    XL8                                                              
MOVDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
MOVDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
MOVBNPH  DS    XL8                                                              
MOVBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
MOVBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
MOVEINVH DS    XL8                                                              
MOVEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
MOVEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
MOVHCOMH DS    XL8                                                              
MOVHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
MOVHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
MOVICOMH DS    XL8                                                              
MOVICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
MOVICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
MOVOPTH  DS    XL8                                                              
MOVOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
MOVOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
MOVOVLYH DS    XL8                                                              
MOVOVLY  DS    CL1     11    2    1  A  P N             T        Y              
MOVUSNMH DS    XL8                                                              
MOVUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL28    13   37   28  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL17    14   11   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL29    14   37   29  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
MOVLPAYH DS    XL8                                                              
MOVLPAY  DS    CL24    15   10   24  A  P N             T        Y              
MOVLI4WH DS    XL8                                                              
MOVLI4W  DS    CL1     15   38    1  A  P N             T        Y              
MOVLI8WH DS    XL8                                                              
MOVLI8W  DS    CL1     15   45    1  A  P N             T        Y              
MOVLI1YH DS    XL8                                                              
MOVLI1Y  DS    CL1     15   52    1  A  P N             T        Y              
MOVLE1YH DS    XL8                                                              
MOVLE1Y  DS    CL1     15   61    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
MOVI4WH  DS    XL8                                                              
MOVI4W   DS    CL1     16   38    1  A  U N             T        Y              
MOVI8WH  DS    XL8                                                              
MOVI8W   DS    CL1     16   45    1  A  U N             T        Y              
MOVI1YH  DS    XL8                                                              
MOVI1Y   DS    CL1     16   52    1  A  U N             T        Y              
MOVE1YH  DS    XL8                                                              
MOVE1Y   DS    CL1     16   61    1  A  U N             T        Y              
MOVFHEDH DS    XL8                                                              
MOVFHED  DS    CL9     17    4    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     17   24    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     17   44    9  A  P H             T        Y              
MOVLHEDH DS    XL8                                                              
MOVLHED  DS    CL9     17   64    9  A  P H             T        Y              
MOVFRSTH DS    XL8                                                              
MOVFRST  DS    CL1     18    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     18    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     18   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     18   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     18   64    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     19    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     19   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     19   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     19   64    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     20    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     20   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     20   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     20   64    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21   64    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     22    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     22   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     22   44    4  A  U N             T        Y              
MOVLSTH  DS    XL8                                                              
MOVLST   DS    CL1     22   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     22   64    4  A  U N             T        Y              
MOVTOTSH DS    XL8                                                              
MOVTOTS  DS    CL53    23    2   53  A  P Z             T        Y              
MOVCMNTH DS    XL8                                                              
MOVCMNT  DS    CL60    24    2   60  A  P H             T        Y              
MOVDUEH  DS    XL8                                                              
MOVDUE   DS    CL14    24   67   14  A  P Z             T        Y              
MOVLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
MOVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1752 BYTES                            
