*          DATA SET TAPYS71D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F371D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
LCBAGYH  DS    XL8                                                              
LCBAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
LCBAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
LCBINVH  DS    XL8                                                              
LCBINV   DS    CL6      4   28    6  A  U N             T        Y  144         
LCBINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
LCBCIDH  DS    XL8                                                              
LCBCID   DS    CL12     4   46   12  A  U N             T        Y   64         
LCBCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
LCBLFTH  DS    XL8                                                              
LCBLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
LCBLFTX  DS    XL8                                                              
LCBLIDH  DS    XL8                                                              
LCBLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
LCBAGYNH DS    XL8                                                              
LCBAGYN  DS    CL16     5    2   16  A  P N             T        Y              
LCBCLINH DS    XL8                                                              
LCBCLIN  DS    CL16     5   20   16  A  P N             T        Y              
LCBCOMNH DS    XL8                                                              
LCBCOMN  DS    CL19     5   38   19  A  P N             T        Y              
LCBSECH  DS    XL8                                                              
LCBSEC   DS    CL4      5   58    4  A  P N             T        Y              
LCBCLPRH DS    XL8                                                              
LCBCLPR  DS    CL13     5   63   13  A  P N             T        Y              
LCBMEDNH DS    XL8                                                              
LCBMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
LCBAUTHH DS    XL8                                                              
LCBAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
LCBAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
LCBESTH  DS    XL8                                                              
LCBEST   DS    CL16     6   46   16  A  U N             T        Y   13         
LCBESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
LCBPDH   DS    XL8                                                              
LCBPD    DS    CL2      6   74    2  N  U N             T        Y   15         
LCBPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
LCBCYCH  DS    XL8                                                              
LCBCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
LCBCYCX  DS    XL8                                                              
LCBLCYCH DS    XL8                                                              
LCBLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
LCBDTLH  DS    XL8                                                              
LCBDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
LCBDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
LCBBNPH  DS    XL8                                                              
LCBBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
LCBBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
LCBEINVH DS    XL8                                                              
LCBEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
LCBEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
LCBHCOMH DS    XL8                                                              
LCBHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
LCBHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
LCBICOMH DS    XL8                                                              
LCBICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
LCBICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
LCBOPTH  DS    XL8                                                              
LCBOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
LCBOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
LCBOVLYH DS    XL8                                                              
LCBOVLY  DS    CL1     11    2    1  A  P N             T        Y              
LCBUSNMH DS    XL8                                                              
LCBUSNM  DS    CL16    11   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL67    12   11   67  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P H             T        Y              
LCBLPAYH DS    XL8                                                              
LCBLPAY  DS    CL24    13   10   24  A  P N             T        Y              
LCBLUPGH DS    XL8                                                              
LCBLUPG  DS    CL1     13   41    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   49   15  A  P H             T        Y              
LCBL50H  DS    XL8                                                              
LCBL50   DS    CL1     13   69    1  A  U N             T        Y   31         
LCBL50X  DS    XL8                                                              
LCB50H   DS    XL8                                                              
LCB50    DS    CL1     13   75    1  A  U N             T        Y   33         
LCB50X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
LCBUPGRH DS    XL8                                                              
LCBUPGR  DS    CL1     14   41    1  A  U N             T        Y  107         
LCBUPGRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    14   49   15  A  P H             T        Y              
LCBL100H DS    XL8                                                              
LCBL100  DS    CL1     14   69    1  A  U N             T        Y   35         
LCBL100X DS    XL8                                                              
LCB100H  DS    XL8                                                              
LCB100   DS    CL1     14   75    1  A  U N             T        Y   37         
LCB100X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    15   49   15  A  P H             T        Y              
LCBL150H DS    XL8                                                              
LCBL150  DS    CL1     15   69    1  A  U N             T        Y   39         
LCBL150X DS    XL8                                                              
LCB150H  DS    XL8                                                              
LCB150   DS    CL1     15   75    1  A  U N             T        Y   41         
LCB150X  DS    XL8                                                              
LCBTOTIH DS    XL8                                                              
LCBTOTI  DS    CL26    16    2   26  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL15    16   49   15  A  P H             T        Y              
LCBL200H DS    XL8                                                              
LCBL200  DS    CL1     16   69    1  A  U N             T        Y   43         
LCBL200X DS    XL8                                                              
LCB200H  DS    XL8                                                              
LCB200   DS    CL1     16   75    1  A  U N             T        Y   45         
LCB200X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    17   49   15  A  P H             T        Y              
LCBL250H DS    XL8                                                              
LCBL250  DS    CL1     17   69    1  A  U N             T        Y   47         
LCBL250X DS    XL8                                                              
LCB250H  DS    XL8                                                              
LCB250   DS    CL1     17   75    1  A  U N             T        Y   49         
LCB250X  DS    XL8                                                              
LCBTOTCH DS    XL8                                                              
LCBTOTC  DS    CL25    18    2   25  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL15    18   49   15  A  P H             T        Y              
LCBL500H DS    XL8                                                              
LCBL500  DS    CL1     18   69    1  A  U N             T        Y   51         
LCBL500X DS    XL8                                                              
LCB500H  DS    XL8                                                              
LCB500   DS    CL1     18   75    1  A  U N             T        Y   53         
LCB500X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    19   49   15  A  P H             T        Y              
LCBL750H DS    XL8                                                              
LCBL750  DS    CL1     19   69    1  A  U N             T        Y   55         
LCBL750X DS    XL8                                                              
LCB750H  DS    XL8                                                              
LCB750   DS    CL1     19   75    1  A  U N             T        Y   57         
LCB750X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    20   47   17  A  P H             T        Y              
LCBL1MIH DS    XL8                                                              
LCBL1MI  DS    CL1     20   69    1  A  U N             T        Y   59         
LCBL1MIX DS    XL8                                                              
LCB1MILH DS    XL8                                                              
LCB1MIL  DS    CL1     20   75    1  A  U N             T        Y   61         
LCB1MILX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    21   45   19  A  P H             T        Y              
LCBLMAXH DS    XL8                                                              
LCBLMAX  DS    CL1     21   69    1  A  U N             T        Y   71         
LCBLMAXX DS    XL8                                                              
LCBMAXH  DS    XL8                                                              
LCBMAX   DS    CL1     21   75    1  A  U N             T        Y   73         
LCBMAXX  DS    XL8                                                              
LCBCMNTH DS    XL8                                                              
LCBCMNT  DS    CL60    24    2   60  A  P H             T        Y              
LCBDUEH  DS    XL8                                                              
LCBDUE   DS    CL14    24   67   14  A  P Z             T        Y              
LCBLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
LCBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
