*          DATA SET TAPYS1AD   AT LEVEL 003 AS OF 03/04/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F31AD      DATE 03/04/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
MVMAGYH  DS    XL8                                                              
MVMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
MVMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
MVMINVH  DS    XL8                                                              
MVMINV   DS    CL6      4   28    6  A  U N             T        Y  144         
MVMINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
MVMCIDH  DS    XL8                                                              
MVMCID   DS    CL12     4   46   12  A  U N             T        Y   64         
MVMCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
MVMLFTH  DS    XL8                                                              
MVMLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
MVMLFTX  DS    XL8                                                              
MVMLIDH  DS    XL8                                                              
MVMLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
MVMAGYNH DS    XL8                                                              
MVMAGYN  DS    CL16     5    2   16  A  P N             T        Y              
MVMCLINH DS    XL8                                                              
MVMCLIN  DS    CL16     5   20   16  A  P N             T        Y              
MVMCOMNH DS    XL8                                                              
MVMCOMN  DS    CL19     5   38   19  A  P N             T        Y              
MVMSECH  DS    XL8                                                              
MVMSEC   DS    CL4      5   58    4  A  P N             T        Y              
MVMCLPRH DS    XL8                                                              
MVMCLPR  DS    CL13     5   63   13  A  P N             T        Y              
MVMMEDNH DS    XL8                                                              
MVMMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
MVMAUTHH DS    XL8                                                              
MVMAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
MVMAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
MVMESTH  DS    XL8                                                              
MVMEST   DS    CL16     6   46   16  A  U N             T        Y   13         
MVMESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
MVMPDH   DS    XL8                                                              
MVMPD    DS    CL2      6   74    2  N  U N             T        Y   15         
MVMPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
MVMCYCH  DS    XL8                                                              
MVMCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
MVMCYCX  DS    XL8                                                              
MVMLCYCH DS    XL8                                                              
MVMLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
MVMDTLH  DS    XL8                                                              
MVMDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
MVMDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
MVMBNPH  DS    XL8                                                              
MVMBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
MVMBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
MVMEINVH DS    XL8                                                              
MVMEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
MVMEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
MVMHCOMH DS    XL8                                                              
MVMHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
MVMHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
MVMICOMH DS    XL8                                                              
MVMICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
MVMICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
MVMOPTH  DS    XL8                                                              
MVMOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
MVMOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
MVMOVLYH DS    XL8                                                              
MVMOVLY  DS    CL1     11    2    1  A  P N             T        Y              
MVMUSNMH DS    XL8                                                              
MVMUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    13    9   18  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    13   34   18  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
MVMLPAYH DS    XL8                                                              
MVMLPAY  DS    CL73    14    8   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
MVM8WKH  DS    XL8                                                              
MVM8WK   DS    CL1     15   35    1  A  U N             T        Y  101         
MVM8WKX  DS    XL8                                                              
MVM6MOH  DS    XL8                                                              
MVM6MO   DS    CL1     15   42    1  A  U N             T        Y  102         
MVM6MOX  DS    XL8                                                              
MVM1YRH  DS    XL8                                                              
MVM1YR   DS    CL1     15   49    1  A  U N             T        Y  103         
MVM1YRX  DS    XL8                                                              
MVMTOTSH DS    XL8                                                              
MVMTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
MVMCMNTH DS    XL8                                                              
MVMCMNT  DS    CL60    24    2   60  A  P H             T        Y              
MVMDUEH  DS    XL8                                                              
MVMDUE   DS    CL14    24   67   14  A  P Z             T        Y              
MVMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
MVMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1248 BYTES                            
