*          DATA SET TAPYS6FD   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F36FD      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SDCAGYH  DS    XL8                                                              
SDCAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SDCAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
SDCINVH  DS    XL8                                                              
SDCINV   DS    CL6      4   28    6  A  U N             T        Y  144         
SDCINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
SDCCIDH  DS    XL8                                                              
SDCCID   DS    CL12     4   46   12  A  U N             T        Y   64         
SDCCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
SDCLFTH  DS    XL8                                                              
SDCLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
SDCLFTX  DS    XL8                                                              
SDCLIDH  DS    XL8                                                              
SDCLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
SDCAGYNH DS    XL8                                                              
SDCAGYN  DS    CL16     5    2   16  A  P N             T        Y              
SDCCLINH DS    XL8                                                              
SDCCLIN  DS    CL16     5   20   16  A  P N             T        Y              
SDCCOMNH DS    XL8                                                              
SDCCOMN  DS    CL19     5   38   19  A  P N             T        Y              
SDCSECH  DS    XL8                                                              
SDCSEC   DS    CL4      5   58    4  A  P N             T        Y              
SDCCLPRH DS    XL8                                                              
SDCCLPR  DS    CL13     5   63   13  A  P N             T        Y              
SDCMEDNH DS    XL8                                                              
SDCMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SDCGRSH  DS    XL8                                                              
SDCGRS   DS    CL8      6   10    8  A  U N             T        Y   31         
SDCGRSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   20    4  A  P H             T        Y              
SDCEPISH DS    XL8                                                              
SDCEPIS  DS    CL52     6   28   52  A  U N             T        Y   29         
SDCEPISX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SDCAUTHH DS    XL8                                                              
SDCAUTH  DS    CL16     7   10   16  A  U N             T        Y   11         
SDCAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   38    4  A  P N             T        Y              
SDCESTH  DS    XL8                                                              
SDCEST   DS    CL16     7   46   16  A  U N             T        Y   13         
SDCESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   63    6  A  P N             T        Y              
SDCPDH   DS    XL8                                                              
SDCPD    DS    CL2      7   74    2  N  U N             T        Y   15         
SDCPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
SDCCYCH  DS    XL8                                                              
SDCCYC   DS    CL17     8   10   17  A  U N             T        Y   17         
SDCCYCX  DS    XL8                                                              
SDCLCYCH DS    XL8                                                              
SDCLCYC  DS    CL6      8   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   52    6  A  P N             T        Y              
SDCBNPH  DS    XL8                                                              
SDCBNP   DS    CL1      8   59    1  A  U N             T        Y   19         
SDCBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   63   10  A  P N             T        Y              
SDCEINVH DS    XL8                                                              
SDCEINV  DS    CL6      8   74    6  A  U N             T        Y   21         
SDCEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SDCHCOMH DS    XL8                                                              
SDCHCOM  DS    CL40     9   10   40  A  U N             T        Y   23         
SDCHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SDCICOMH DS    XL8                                                              
SDCICOM  DS    CL60    10   10   60  A  U N             T        Y   27         
SDCICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SDCOPTH  DS    XL8                                                              
SDCOPT   DS    CL60    11   10   60  A  U N             T        Y   25         
SDCOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    12    2   77  A  P H             T        Y              
SDCFRSTH DS    XL8                                                              
SDCFRST  DS    CL1     13   10    1  A  U N             T        Y   41         
SDCFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   14    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   16   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   28    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   30   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   41   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   52   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   63   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     13   75    4  N  U N             T        Y   73         
         DS    XL8                                                              
SDCDATAH DS    XL8                                                              
SDCDATA  DS    CL34    14    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   37    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL40    14   41   40  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   10    1  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   14    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   16   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   28    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   30   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   41   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   52   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   63   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   75    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    16    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   37    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL40    16   41   40  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   10    1  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   14    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   16   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   28    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   30   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   41   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   52   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   63   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17   75    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    18    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   37    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL40    18   41   40  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   10    1  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   14    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   16   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   28    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   30   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   41   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   52   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   63   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19   75    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    20    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   37    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL40    20   41   40  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   10    1  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   14    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   16   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   28    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   30   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   41   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   52   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   63   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     21   75    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    22    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   37    3  A  P H             T        Y              
SDCLSTH  DS    XL8                                                              
SDCLST   DS    CL40    22   41   40  A  U N             T        Y   75         
SDCLSTX  DS    XL8                                                              
SDCCMNTH DS    XL8                                                              
SDCCMNT  DS    CL60    24    2   60  A  P H             T        Y              
SDCDUEH  DS    XL8                                                              
SDCDUE   DS    CL14    24   67   14  A  P H             T        Y              
SDCLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SDCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2664 BYTES                            
