*          DATA SET TAPYS56D   AT LEVEL 016 AS OF 03/23/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F356D      DATE 03/23/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
MUSAGYH  DS    XL8                                                              
MUSAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
MUSAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
MUSINVH  DS    XL8                                                              
MUSINV   DS    CL6      4   28    6  A  U N             T        Y  144         
MUSINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
MUSCIDH  DS    XL8                                                              
MUSCID   DS    CL12     4   46   12  A  U N             T        Y   64         
MUSCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
MUSLFTH  DS    XL8                                                              
MUSLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
MUSLFTX  DS    XL8                                                              
MUSLIDH  DS    XL8                                                              
MUSLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
MUSAGYNH DS    XL8                                                              
MUSAGYN  DS    CL16     5    2   16  A  P N             T        Y              
MUSCLINH DS    XL8                                                              
MUSCLIN  DS    CL16     5   20   16  A  P N             T        Y              
MUSCOMNH DS    XL8                                                              
MUSCOMN  DS    CL19     5   38   19  A  P N             T        Y              
MUSSECH  DS    XL8                                                              
MUSSEC   DS    CL4      5   58    4  A  P N             T        Y              
MUSCLPRH DS    XL8                                                              
MUSCLPR  DS    CL13     5   63   13  A  P N             T        Y              
MUSMEDNH DS    XL8                                                              
MUSMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
MUSAUTHH DS    XL8                                                              
MUSAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
MUSAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
MUSESTH  DS    XL8                                                              
MUSEST   DS    CL16     6   46   16  A  U N             T        Y   13         
MUSESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
MUSPDH   DS    XL8                                                              
MUSPD    DS    CL2      6   74    2  N  U N             T        Y   15         
MUSPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
MUSCYCH  DS    XL8                                                              
MUSCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
MUSCYCX  DS    XL8                                                              
MUSLCYCH DS    XL8                                                              
MUSLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
MUSDTLH  DS    XL8                                                              
MUSDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
MUSDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
MUSBNPH  DS    XL8                                                              
MUSBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
MUSBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
MUSEINVH DS    XL8                                                              
MUSEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
MUSEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
MUSHCOMH DS    XL8                                                              
MUSHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
MUSHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
MUSICOMH DS    XL8                                                              
MUSICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
MUSICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
MUSOPTH  DS    XL8                                                              
MUSOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
MUSOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
MUSOVLYH DS    XL8                                                              
MUSOVLY  DS    CL1     11    2    1  A  P N             T        Y              
MUSUSNMH DS    XL8                                                              
MUSUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL48    13   33   48  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    14    9   18  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL33    14   47   33  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
MUSLPAYH DS    XL8                                                              
MUSLPAY  DS    CL73    15    8   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
MUSREUH  DS    XL8                                                              
MUSREU   DS    CL1     16   35    1  A  U N             T        Y  101         
MUSREUX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   37    1  N  P N             T        Y              
MUSNEWH  DS    XL8                                                              
MUSNEW   DS    CL1     16   40    1  A  U N             T        Y  102         
MUSNEWX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   42    1  N  P N             T        Y              
MUSDUBH  DS    XL8                                                              
MUSDUB   DS    CL1     16   45    1  A  U N             T        Y  105         
MUSDUBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   47    1  N  P N             T        Y              
MUSLTSH  DS    XL8                                                              
MUSLTS   DS    CL1     16   50    1  A  U N             T        Y  106         
MUSLTSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   53    1  N  P N             T        Y              
MUSLTS2H DS    XL8                                                              
MUSLTS2  DS    CL1     16   56    1  A  U N             T        Y  108         
MUSLTS2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   58    1  N  P N             T        Y              
MUS8WH   DS    XL8                                                              
MUS8W    DS    CL1     16   63    1  A  U N             T        Y  103         
MUS8WX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   65    1  N  P N             T        Y              
MUS13WH  DS    XL8                                                              
MUS13W   DS    CL1     16   67    1  A  U N             T        Y  104         
MUS13WX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   69    1  N  P N             T        Y              
MUS6MH   DS    XL8                                                              
MUS6M    DS    CL1     16   72    1  A  U N             T        Y  107         
MUS6MX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   74    1  N  P N             T        Y              
MUS1YH   DS    XL8                                                              
MUS1Y    DS    CL1     16   77    1  A  U N             T        Y              
MUSTOTSH DS    XL8                                                              
MUSTOTS  DS    CL53    18    2   53  A  P Z             T        Y              
MUSCMNTH DS    XL8                                                              
MUSCMNT  DS    CL60    24    2   60  A  P H             T        Y              
MUSDUEH  DS    XL8                                                              
MUSDUE   DS    CL14    24   67   14  A  P Z             T        Y              
MUSLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
MUSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1488 BYTES                            
