*          DATA SET TAPYS11D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F311D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
IRNTAGH  DS    XL8                                                              
IRNTAG   DS    CL6      4    2    6  A  P H             T        Y              
IRNAGYH  DS    XL8                                                              
IRNAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
IRNAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
IRNINVH  DS    XL8                                                              
IRNINV   DS    CL6      4   28    6  A  U N             T        Y  144         
IRNINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
IRNCIDH  DS    XL8                                                              
IRNCID   DS    CL12     4   46   12  A  U N             T        Y   64         
IRNCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
IRNLFTH  DS    XL8                                                              
IRNLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
IRNLFTX  DS    XL8                                                              
IRNLIDH  DS    XL8                                                              
IRNLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
IRNAGYNH DS    XL8                                                              
IRNAGYN  DS    CL16     5    2   16  A  P N             T        Y              
IRNCLINH DS    XL8                                                              
IRNCLIN  DS    CL16     5   20   16  A  P N             T        Y              
IRNCOMNH DS    XL8                                                              
IRNCOMN  DS    CL19     5   38   19  A  P N             T        Y              
IRNSECH  DS    XL8                                                              
IRNSEC   DS    CL4      5   58    4  A  P N             T        Y              
IRNCLPRH DS    XL8                                                              
IRNCLPR  DS    CL13     5   63   13  A  P N             T        Y              
IRNMEDNH DS    XL8                                                              
IRNMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
IRNAUTHH DS    XL8                                                              
IRNAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
IRNAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
IRNESTH  DS    XL8                                                              
IRNEST   DS    CL16     6   46   16  A  U N             T        Y   13         
IRNESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
IRNPDH   DS    XL8                                                              
IRNPD    DS    CL2      6   74    2  N  U N             T        Y   15         
IRNPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
IRNCYCH  DS    XL8                                                              
IRNCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
IRNCYCX  DS    XL8                                                              
IRNLCYCH DS    XL8                                                              
IRNLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
IRNDTLH  DS    XL8                                                              
IRNDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
IRNDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
IRNBNPH  DS    XL8                                                              
IRNBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
IRNBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
IRNEINVH DS    XL8                                                              
IRNEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
IRNEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
IRNHCOMH DS    XL8                                                              
IRNHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
IRNHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
IRNICOMH DS    XL8                                                              
IRNICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
IRNICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
IRNOPTH  DS    XL8                                                              
IRNOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
IRNOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
IRNOVLYH DS    XL8                                                              
IRNOVLY  DS    CL1     11    2    1  A  P N             T        Y              
IRNUSNMH DS    XL8                                                              
IRNUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL26    13    3   26  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P H             T        Y              
IRNLPAYH DS    XL8                                                              
IRNLPAY  DS    CL24    14   10   24  A  P N             T        Y              
IRNFHEDH DS    XL8                                                              
IRNFHED  DS    CL9     16    4    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     16   24    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     16   44    9  A  P H             T        Y              
IRNLHEDH DS    XL8                                                              
IRNLHED  DS    CL9     16   64    9  A  P H             T        Y              
IRNFRSTH DS    XL8                                                              
IRNFRST  DS    CL1     17    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     17    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     17   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     17   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     17   64    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     18    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     18   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     18   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     18   64    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     19    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     19   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     19   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     19   64    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     20    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     20   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     20   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     20   64    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21   24    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21   44    4  A  U N             T        Y              
IRNLSTH  DS    XL8                                                              
IRNLST   DS    CL1     21   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21   64    4  A  U N             T        Y              
IRNTOTSH DS    XL8                                                              
IRNTOTS  DS    CL53    22    2   53  A  P Z             T        Y              
IRNCMNTH DS    XL8                                                              
IRNCMNT  DS    CL60    24    2   60  A  P H             T        Y              
IRNDUEH  DS    XL8                                                              
IRNDUE   DS    CL14    24   67   14  A  P Z             T        Y              
IRNLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
IRNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1608 BYTES                            
