*          DATA SET TAPYS96D   AT LEVEL 002 AS OF 09/27/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F396D      DATE 09/27/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SELAGYH  DS    XL8                                                              
SELAGY   DS    CL6      4   10    6  A  P N             T        Y   10         
SELAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
SELINVH  DS    XL8                                                              
SELINV   DS    CL6      4   28    6  A  P N             T        Y   12         
SELINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
SELCIDH  DS    XL8                                                              
SELCID   DS    CL12     4   46   12  A  P N             T        Y   14         
SELCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
SELLFTH  DS    XL8                                                              
SELLFT   DS    CL3      4   63    3  A  P N             T        Y   16         
SELLFTX  DS    XL8                                                              
SELLIDH  DS    XL8                                                              
SELLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
SELAGYNH DS    XL8                                                              
SELAGYN  DS    CL16     5    2   16  A  P N             T        Y              
SELCLINH DS    XL8                                                              
SELCLIN  DS    CL16     5   20   16  A  P N             T        Y              
SELCOMNH DS    XL8                                                              
SELCOMN  DS    CL19     5   38   19  A  P N             T        Y              
SELSECH  DS    XL8                                                              
SELSEC   DS    CL4      5   58    4  A  P N             T        Y              
SELCLPRH DS    XL8                                                              
SELCLPR  DS    CL13     5   63   13  A  P N             T        Y              
SELMEDNH DS    XL8                                                              
SELMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20     7    2   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL34     7   35   34  A  P H             T        Y              
SELFRSTH DS    XL8                                                              
SELFRST  DS    CL1      8    3    1  A  U N             T        Y   18         
SELFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8    5    1  N  P N             T        Y              
SELRHSH  DS    XL8                                                              
SELRHS   DS    CL66     8    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1      9    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66     9    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     10    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    10    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     11    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    11    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     12    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    12    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     13    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    13    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     14    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    14    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     15    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    15    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     16    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    16    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     17    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    17    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     18    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    18    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     19    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    19    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     20    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    20    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     21    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    21    6   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   75    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     22    3    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    22    6   66  A  P N             T        Y              
SELLSTH  DS    XL8                                                              
SELLST   DS    CL4     22   75    4  A  P Z             T        Y              
SELCMNTH DS    XL8                                                              
SELCMNT  DS    CL60    24    2   60  A  P H             T        Y              
SELLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2120 BYTES                            
