*          DATA SET TAPYS15D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F315D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
GT2AGYH  DS    XL8                                                              
GT2AGY   DS    CL6      4   10    6  A  U N             T        Y   16         
GT2AGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
GT2INVH  DS    XL8                                                              
GT2INV   DS    CL6      4   28    6  A  U N             T        Y  144         
GT2INVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
GT2CIDH  DS    XL8                                                              
GT2CID   DS    CL12     4   46   12  A  U N             T        Y   64         
GT2CIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
GT2LFTH  DS    XL8                                                              
GT2LFT   DS    CL3      4   63    3  A  U N             T        Y   65         
GT2LFTX  DS    XL8                                                              
GT2LIDH  DS    XL8                                                              
GT2LID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
GT2AGYNH DS    XL8                                                              
GT2AGYN  DS    CL16     5    2   16  A  P N             T        Y              
GT2CLINH DS    XL8                                                              
GT2CLIN  DS    CL16     5   20   16  A  P N             T        Y              
GT2COMNH DS    XL8                                                              
GT2COMN  DS    CL19     5   38   19  A  P N             T        Y              
GT2SECH  DS    XL8                                                              
GT2SEC   DS    CL4      5   58    4  A  P N             T        Y              
GT2CLPRH DS    XL8                                                              
GT2CLPR  DS    CL13     5   63   13  A  P N             T        Y              
GT2MEDNH DS    XL8                                                              
GT2MEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
GT2AUTHH DS    XL8                                                              
GT2AUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
GT2AUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
GT2ESTH  DS    XL8                                                              
GT2EST   DS    CL16     6   46   16  A  U N             T        Y   13         
GT2ESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
GT2PDH   DS    XL8                                                              
GT2PD    DS    CL2      6   74    2  N  U N             T        Y   15         
GT2PDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
GT2CYCH  DS    XL8                                                              
GT2CYC   DS    CL17     7   10   17  A  U N             T        Y   17         
GT2CYCX  DS    XL8                                                              
GT2LCYCH DS    XL8                                                              
GT2LCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
GT2DTLH  DS    XL8                                                              
GT2DTL   DS    CL1      7   46    1  A  U N             T        Y   18         
GT2DTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
GT2BNPH  DS    XL8                                                              
GT2BNP   DS    CL1      7   59    1  A  U N             T        Y   19         
GT2BNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
GT2EINVH DS    XL8                                                              
GT2EINV  DS    CL6      7   74    6  A  U N             T        Y   21         
GT2EINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
GT2HCOMH DS    XL8                                                              
GT2HCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
GT2HCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
GT2ICOMH DS    XL8                                                              
GT2ICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
GT2ICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
GT2OPTH  DS    XL8                                                              
GT2OPT   DS    CL60    10   10   60  A  U N             T        Y   25         
GT2OPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
GT2OVLYH DS    XL8                                                              
GT2OVLY  DS    CL1     11    2    1  A  P N             T        Y              
GT2USNMH DS    XL8                                                              
GT2USNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    13    2   13  A  P H             T        Y              
GT2OVERH DS    XL8                                                              
GT2OVER  DS    CL1     13   20    1  A  U N             T        Y   33         
GT2OVERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     13   38    4  A  P H             T        Y              
GT2MSCH  DS    XL8                                                              
GT2MSC   DS    CL1     13   46    1  A  U N             T        Y   34         
GT2MSCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14    2    4  A  P H             T        Y              
GT2GCONH DS    XL8                                                              
GT2GCON  DS    CL6     14   10    6  A  U N             T        Y  109         
GT2GCONX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL26    15    3   26  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P H             T        Y              
GT2LPAYH DS    XL8                                                              
GT2LPAY  DS    CL24    16   10   24  A  P N             T        Y              
GT2TOTSH DS    XL8                                                              
GT2TOTS  DS    CL53    18    2   53  A  P Z             T        Y              
GT2CMNTH DS    XL8                                                              
GT2CMNT  DS    CL60    24    2   60  A  P H             T        Y              
GT2DUEH  DS    XL8                                                              
GT2DUE   DS    CL14    24   67   14  A  P Z             T        Y              
GT2LAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
GT2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1224 BYTES                            
