*          DATA SET TAPYS79D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F379D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SFRAGYH  DS    XL8                                                              
SFRAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SFRAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
SFRINVH  DS    XL8                                                              
SFRINV   DS    CL6      4   28    6  A  U N             T        Y  144         
SFRINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
SFRCIDH  DS    XL8                                                              
SFRCID   DS    CL12     4   46   12  A  U N             T        Y   64         
SFRCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
SFRLFTH  DS    XL8                                                              
SFRLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
SFRLFTX  DS    XL8                                                              
SFRLIDH  DS    XL8                                                              
SFRLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
SFRAGYNH DS    XL8                                                              
SFRAGYN  DS    CL16     5    2   16  A  P N             T        Y              
SFRCLINH DS    XL8                                                              
SFRCLIN  DS    CL16     5   20   16  A  P N             T        Y              
SFRCOMNH DS    XL8                                                              
SFRCOMN  DS    CL19     5   38   19  A  P N             T        Y              
SFRSECH  DS    XL8                                                              
SFRSEC   DS    CL4      5   58    4  A  P N             T        Y              
SFRCLPRH DS    XL8                                                              
SFRCLPR  DS    CL13     5   63   13  A  P N             T        Y              
SFRMEDNH DS    XL8                                                              
SFRMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SFRAUTHH DS    XL8                                                              
SFRAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
SFRAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
SFRESTH  DS    XL8                                                              
SFREST   DS    CL16     6   46   16  A  U N             T        Y   13         
SFRESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
SFRPDH   DS    XL8                                                              
SFRPD    DS    CL2      6   74    2  N  U N             T        Y   15         
SFRPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SFRCYCH  DS    XL8                                                              
SFRCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
SFRCYCX  DS    XL8                                                              
SFRLCYCH DS    XL8                                                              
SFRLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
SFRDTLH  DS    XL8                                                              
SFRDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
SFRDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
SFRBNPH  DS    XL8                                                              
SFRBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
SFRBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
SFREINVH DS    XL8                                                              
SFREINV  DS    CL6      7   74    6  A  U N             T        Y   21         
SFREINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SFRHCOMH DS    XL8                                                              
SFRHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
SFRHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SFRICOMH DS    XL8                                                              
SFRICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
SFRICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SFROPTH  DS    XL8                                                              
SFROPT   DS    CL60    10   10   60  A  U N             T        Y   25         
SFROPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
SFROVLYH DS    XL8                                                              
SFROVLY  DS    CL1     11    2    1  A  P N             T        Y              
SFRUSNMH DS    XL8                                                              
SFRUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL71    13    9   71  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
SFRLPAYH DS    XL8                                                              
SFRLPAY  DS    CL71    14    8   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
SFRSFAH  DS    XL8                                                              
SFRSFA   DS    CL1     15   35    1  A  U N             T        Y  101         
SFRSFAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   37    1  N  P N             T        Y              
SFRSFBH  DS    XL8                                                              
SFRSFB   DS    CL1     15   49    1  A  U N             T        Y  102         
SFRSFBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   51    1  N  P N             T        Y              
SFRSFCH  DS    XL8                                                              
SFRSFC   DS    CL1     15   63    1  A  U N             T        Y  103         
SFRSFCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   65    1  N  P N             T        Y              
SFRTOTSH DS    XL8                                                              
SFRTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
SFRCMNTH DS    XL8                                                              
SFRCMNT  DS    CL60    24    2   60  A  P H             T        Y              
SFRDUEH  DS    XL8                                                              
SFRDUE   DS    CL14    24   67   14  A  P Z             T        Y              
SFRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
