*          DATA SET TAPYS57D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F357D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
CABAGYH  DS    XL8                                                              
CABAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
CABAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
CABINVH  DS    XL8                                                              
CABINV   DS    CL6      4   28    6  A  U N             T        Y  144         
CABINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
CABCIDH  DS    XL8                                                              
CABCID   DS    CL12     4   46   12  A  U N             T        Y   64         
CABCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
CABLFTH  DS    XL8                                                              
CABLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
CABLFTX  DS    XL8                                                              
CABLIDH  DS    XL8                                                              
CABLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
CABAGYNH DS    XL8                                                              
CABAGYN  DS    CL16     5    2   16  A  P N             T        Y              
CABCLINH DS    XL8                                                              
CABCLIN  DS    CL16     5   20   16  A  P N             T        Y              
CABCOMNH DS    XL8                                                              
CABCOMN  DS    CL19     5   38   19  A  P N             T        Y              
CABSECH  DS    XL8                                                              
CABSEC   DS    CL4      5   58    4  A  P N             T        Y              
CABCLPRH DS    XL8                                                              
CABCLPR  DS    CL13     5   63   13  A  P N             T        Y              
CABMEDNH DS    XL8                                                              
CABMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
CABAUTHH DS    XL8                                                              
CABAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
CABAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
CABESTH  DS    XL8                                                              
CABEST   DS    CL16     6   46   16  A  U N             T        Y   13         
CABESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
CABPDH   DS    XL8                                                              
CABPD    DS    CL2      6   74    2  N  U N             T        Y   15         
CABPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
CABCYCH  DS    XL8                                                              
CABCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
CABCYCX  DS    XL8                                                              
CABLCYCH DS    XL8                                                              
CABLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
CABDTLH  DS    XL8                                                              
CABDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
CABDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
CABBNPH  DS    XL8                                                              
CABBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
CABBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
CABEINVH DS    XL8                                                              
CABEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
CABEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
CABHCOMH DS    XL8                                                              
CABHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
CABHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
CABICOMH DS    XL8                                                              
CABICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
CABICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
CABOPTH  DS    XL8                                                              
CABOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
CABOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
CABOVLYH DS    XL8                                                              
CABOVLY  DS    CL1     11    2    1  A  P N             T        Y              
CABUSNMH DS    XL8                                                              
CABUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL23    13   58   23  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL72    14    9   72  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
CABLPAYH DS    XL8                                                              
CABLPAY  DS    CL70    15    8   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
CAB4WH   DS    XL8                                                              
CAB4W    DS    CL1     16   40    1  A  U N             T        Y  102         
CAB4WX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   42    1  N  P N             T        Y              
CAB13WH  DS    XL8                                                              
CAB13W   DS    CL1     16   46    1  A  U N             T        Y  103         
CAB13WX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   48    1  N  P N             T        Y              
CAB52WH  DS    XL8                                                              
CAB52W   DS    CL1     16   53    1  A  U N             T        Y  104         
CAB52WX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   55    1  N  P N             T        Y              
CAB413H  DS    XL8                                                              
CAB413   DS    CL1     16   60    1  A  U N             T        Y  105         
CAB413X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   62    1  N  P N             T        Y              
CAB1352H DS    XL8                                                              
CAB1352  DS    CL1     16   68    1  A  U N             T        Y  106         
CAB1352X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   70    1  N  P N             T        Y              
CAB452H  DS    XL8                                                              
CAB452   DS    CL1     16   77    1  A  U N             T        Y  107         
CAB452X  DS    XL8                                                              
CABTOTSH DS    XL8                                                              
CABTOTS  DS    CL53    18    2   53  A  P Z             T        Y              
CABCMNTH DS    XL8                                                              
CABCMNT  DS    CL60    24    2   60  A  P H             T        Y              
CABDUEH  DS    XL8                                                              
CABDUE   DS    CL14    24   67   14  A  P Z             T        Y              
CABLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CABWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1400 BYTES                            
