*          DATA SET TAPYS77D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F377D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ITNAGYH  DS    XL8                                                              
ITNAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
ITNAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
ITNINVH  DS    XL8                                                              
ITNINV   DS    CL6      4   28    6  A  U N             T        Y  144         
ITNINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
ITNCIDH  DS    XL8                                                              
ITNCID   DS    CL12     4   46   12  A  U N             T        Y   64         
ITNCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
ITNLFTH  DS    XL8                                                              
ITNLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
ITNLFTX  DS    XL8                                                              
ITNLIDH  DS    XL8                                                              
ITNLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
ITNAGYNH DS    XL8                                                              
ITNAGYN  DS    CL16     5    2   16  A  P N             T        Y              
ITNCLINH DS    XL8                                                              
ITNCLIN  DS    CL16     5   20   16  A  P N             T        Y              
ITNCOMNH DS    XL8                                                              
ITNCOMN  DS    CL19     5   38   19  A  P N             T        Y              
ITNSECH  DS    XL8                                                              
ITNSEC   DS    CL4      5   58    4  A  P N             T        Y              
ITNCLPRH DS    XL8                                                              
ITNCLPR  DS    CL13     5   63   13  A  P N             T        Y              
ITNMEDNH DS    XL8                                                              
ITNMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
ITNAUTHH DS    XL8                                                              
ITNAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
ITNAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
ITNESTH  DS    XL8                                                              
ITNEST   DS    CL16     6   46   16  A  U N             T        Y   13         
ITNESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
ITNPDH   DS    XL8                                                              
ITNPD    DS    CL2      6   74    2  N  U N             T        Y   15         
ITNPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
ITNCYCH  DS    XL8                                                              
ITNCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
ITNCYCX  DS    XL8                                                              
ITNLCYCH DS    XL8                                                              
ITNLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
ITNDTLH  DS    XL8                                                              
ITNDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
ITNDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
ITNBNPH  DS    XL8                                                              
ITNBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
ITNBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
ITNEINVH DS    XL8                                                              
ITNEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
ITNEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
ITNHCOMH DS    XL8                                                              
ITNHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
ITNHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
ITNICOMH DS    XL8                                                              
ITNICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
ITNICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
ITNOPTH  DS    XL8                                                              
ITNOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
ITNOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
ITNOVLYH DS    XL8                                                              
ITNOVLY  DS    CL1     11    2    1  A  P N             T        Y              
ITNUSNMH DS    XL8                                                              
ITNUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL47    13    9   47  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
ITNLPAYH DS    XL8                                                              
ITNLPAY  DS    CL47    14    8   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
ITNAUTOH DS    XL8                                                              
ITNAUTO  DS    CL1     15   35    1  A  U N             T        Y  101         
ITNAUTOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   40    1  N  P N             T        Y              
ITNEUSEH DS    XL8                                                              
ITNEUSE  DS    CL3     15   43    3  A  U N             T        Y  102         
ITNEUSEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   48    1  N  P N             T        Y              
ITNNUSEH DS    XL8                                                              
ITNNUSE  DS    CL3     15   52    3  A  U N             T        Y  103         
ITNNUSEX DS    XL8                                                              
ITNTOTSH DS    XL8                                                              
ITNTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
ITNCMNTH DS    XL8                                                              
ITNCMNT  DS    CL60    24    2   60  A  P H             T        Y              
ITNDUEH  DS    XL8                                                              
ITNDUE   DS    CL14    24   67   14  A  P Z             T        Y              
ITNLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ITNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1248 BYTES                            
