*          DATA SET TAPYS7AD   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F37AD      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ISUAGYH  DS    XL8                                                              
ISUAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
ISUAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
ISUINVH  DS    XL8                                                              
ISUINV   DS    CL6      4   28    6  A  U N             T        Y  144         
ISUINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
ISUCIDH  DS    XL8                                                              
ISUCID   DS    CL12     4   46   12  A  U N             T        Y   64         
ISUCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
ISULFTH  DS    XL8                                                              
ISULFT   DS    CL3      4   63    3  A  U N             T        Y   65         
ISULFTX  DS    XL8                                                              
ISULIDH  DS    XL8                                                              
ISULID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
ISUAGYNH DS    XL8                                                              
ISUAGYN  DS    CL16     5    2   16  A  P N             T        Y              
ISUCLINH DS    XL8                                                              
ISUCLIN  DS    CL16     5   20   16  A  P N             T        Y              
ISUCOMNH DS    XL8                                                              
ISUCOMN  DS    CL19     5   38   19  A  P N             T        Y              
ISUSECH  DS    XL8                                                              
ISUSEC   DS    CL4      5   58    4  A  P N             T        Y              
ISUCLPRH DS    XL8                                                              
ISUCLPR  DS    CL13     5   63   13  A  P N             T        Y              
ISUMEDNH DS    XL8                                                              
ISUMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
ISUAUTHH DS    XL8                                                              
ISUAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
ISUAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
ISUESTH  DS    XL8                                                              
ISUEST   DS    CL16     6   46   16  A  U N             T        Y   13         
ISUESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
ISUPDH   DS    XL8                                                              
ISUPD    DS    CL2      6   74    2  N  U N             T        Y   15         
ISUPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
ISUCYCH  DS    XL8                                                              
ISUCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
ISUCYCX  DS    XL8                                                              
ISULCYCH DS    XL8                                                              
ISULCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
ISUDTLH  DS    XL8                                                              
ISUDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
ISUDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
ISUBNPH  DS    XL8                                                              
ISUBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
ISUBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
ISUEINVH DS    XL8                                                              
ISUEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
ISUEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
ISUHCOMH DS    XL8                                                              
ISUHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
ISUHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
ISUICOMH DS    XL8                                                              
ISUICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
ISUICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
ISUOPTH  DS    XL8                                                              
ISUOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
ISUOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
ISUOVLYH DS    XL8                                                              
ISUOVLY  DS    CL1     10   80    1  A  P N             T        Y              
ISUUSNMH DS    XL8                                                              
ISUUSNM  DS    CL48    11   32   48  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL64    12    9   64  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P H             T        Y              
ISULPAYH DS    XL8                                                              
ISULPAY  DS    CL68    13    8   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
ISUW90H  DS    XL8                                                              
ISUW90   DS    CL1     14   38    1  A  U N             T        Y  101         
ISUW90X  DS    XL8                                                              
ISUB90H  DS    XL8                                                              
ISUB90   DS    CL1     14   65    1  A  U N             T        Y  103         
ISUB90X  DS    XL8                                                              
ISUBCAH  DS    XL8                                                              
ISUBCA   DS    CL1     15   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   32   20  A  P N             T        Y              
ISUNNWH  DS    XL8                                                              
ISUNNW   DS    CL1     15   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    15   59   21  A  P N             T        Y              
ISUTEXH  DS    XL8                                                              
ISUTEX   DS    CL1     16   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL23    16   32   23  A  P N             T        Y              
ISUFGRH  DS    XL8                                                              
ISUFGR   DS    CL1     16   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   59   13  A  P N             T        Y              
ISUIN5H  DS    XL8                                                              
ISUIN5   DS    CL1     17   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   32   17  A  P N             T        Y              
ISUICUH  DS    XL8                                                              
ISUICU   DS    CL1     17   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    17   59   16  A  P N             T        Y              
ISUSRIH  DS    XL8                                                              
ISUSRI   DS    CL1     18   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL22    18   32   22  A  P N             T        Y              
ISUPAGH  DS    XL8                                                              
ISUPAG   DS    CL1     18   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    18   59   19  A  P N             T        Y              
ISUCT2H  DS    XL8                                                              
ISUCT2   DS    CL1     19   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   32   13  A  P N             T        Y              
ISUNWKH  DS    XL8                                                              
ISUNWK   DS    CL1     19   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   59   13  A  P N             T        Y              
ISUCABH  DS    XL8                                                              
ISUCAB   DS    CL1     20   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   32   12  A  P N             T        Y              
ISUGPUH  DS    XL8                                                              
ISUGPU   DS    CL1     20   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   59   20  A  P N             T        Y              
ISUGOVH  DS    XL8                                                              
ISUGOV   DS    CL1     21   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   32   17  A  P N             T        Y              
ISUTOTSH DS    XL8                                                              
ISUTOTS  DS    CL53    22    2   53  A  P Z             T        Y              
ISUCMNTH DS    XL8                                                              
ISUCMNT  DS    CL60    24    2   60  A  P H             T        Y              
ISUDUEH  DS    XL8                                                              
ISUDUE   DS    CL14    24   67   14  A  P Z             T        Y              
ISULAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ISUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1728 BYTES                            
