*          DATA SET TAPYS69D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F369D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
PRTAGYH  DS    XL8                                                              
PRTAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
PRTAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
PRTINVH  DS    XL8                                                              
PRTINV   DS    CL6      4   28    6  A  U N             T        Y  144         
PRTINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
PRTCIDH  DS    XL8                                                              
PRTCID   DS    CL12     4   46   12  A  U N             T        Y   64         
PRTCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
PRTLFTH  DS    XL8                                                              
PRTLFT   DS    CL3      4   63    3  A  U N             T        Y   39         
PRTLFTX  DS    XL8                                                              
PRTLIDH  DS    XL8                                                              
PRTLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
PRTAGYNH DS    XL8                                                              
PRTAGYN  DS    CL16     5    2   16  A  P N             T        Y              
PRTCLINH DS    XL8                                                              
PRTCLIN  DS    CL16     5   20   16  A  P N             T        Y              
PRTCOMNH DS    XL8                                                              
PRTCOMN  DS    CL19     5   38   19  A  P N             T        Y              
PRTSECH  DS    XL8                                                              
PRTSEC   DS    CL4      5   58    4  A  P N             T        Y              
PRTCLPRH DS    XL8                                                              
PRTCLPR  DS    CL13     5   63   13  A  P N             T        Y              
PRTMEDNH DS    XL8                                                              
PRTMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
PRTPRDH  DS    XL8                                                              
PRTPRD   DS    CL6      6   10    6  A  U N             T        Y   48         
PRTPRDX  DS    XL8                                                              
PRTPRDNH DS    XL8                                                              
PRTPRDN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P H             T        Y              
PRTAREAH DS    XL8                                                              
PRTAREA  DS    CL3      6   43    3  A  U N             T        Y  136         
PRTAREAX DS    XL8                                                              
PRTARENH DS    XL8                                                              
PRTAREN  DS    CL13     6   47   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   61    3  A  P H             T        Y              
PRTUSEH  DS    XL8                                                              
PRTUSE   DS    CL3      6   65    3  A  U N             T        Y  140         
PRTUSEX  DS    XL8                                                              
PRTUSENH DS    XL8                                                              
PRTUSEN  DS    CL12     6   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PRTAUTHH DS    XL8                                                              
PRTAUTH  DS    CL16     7   10   16  A  U N             T        Y   11         
PRTAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   38    4  A  P N             T        Y              
PRTESTH  DS    XL8                                                              
PRTEST   DS    CL16     7   43   16  A  U N             T        Y   13         
PRTESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   61    6  A  P N             T        Y              
PRTPDH   DS    XL8                                                              
PRTPD    DS    CL2      7   68    2  N  U N             T        Y   15         
PRTPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
PRTCYCH  DS    XL8                                                              
PRTCYC   DS    CL17     8   10   17  A  U N             T        Y   17         
PRTCYCX  DS    XL8                                                              
PRTLCYCH DS    XL8                                                              
PRTLCYC  DS    CL6      8   30    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   38    6  A  P N             T        Y              
PRTBNPH  DS    XL8                                                              
PRTBNP   DS    CL1      8   45    1  A  U N             T        Y   19         
PRTBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   61   10  A  P N             T        Y              
PRTEINVH DS    XL8                                                              
PRTEINV  DS    CL6      8   72    6  A  U N             T        Y   21         
PRTEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
PRTHCOMH DS    XL8                                                              
PRTHCOM  DS    CL40     9   10   40  A  U N             T        Y   23         
PRTHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PRTICOMH DS    XL8                                                              
PRTICOM  DS    CL60    10   10   60  A  U N             T        Y   27         
PRTICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
PRTOPT2H DS    XL8                                                              
PRTOPT2  DS    CL60    11   10   60  A  U N             T        Y   25         
PRTOPT2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL62    12   18   62  A  P H             T        Y              
PRTFRSTH DS    XL8                                                              
PRTFRST  DS    CL1     13   18    1  N  U N             T        Y   63         
PRTFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   20   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   31   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   43   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13   57    8  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     13   68    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   76    4  A  P N             T        Y              
PRTDATAH DS    XL8                                                              
PRTDATA  DS    CL47    14    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    14   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   18    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   20   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   31   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   43   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15   57    8  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     15   68    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   76    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL47    16    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    16   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   18    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   20   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   31   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   43   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17   57    8  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     17   68    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   76    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL47    18    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    18   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   18    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   20   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   31   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   43   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     19   57    8  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19   68    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   76    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL47    20    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    20   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   18    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   20   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   31   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   43   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     21   57    8  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     21   68    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   76    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL47    22    2   47  A  P N             T        Y              
PRTLSTH  DS    XL8                                                              
PRTLST   DS    CL30    22   50   30  A  U N             T        Y   73         
PRTLSTX  DS    XL8                                                              
PRTCMNTH DS    XL8                                                              
PRTCMNT  DS    CL60    24    2   60  A  P H             T        Y              
PRTDUEH  DS    XL8                                                              
PRTDUE   DS    CL14    24   67   14  A  P Z             T        Y              
PRTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
PRTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2368 BYTES                            
