*          DATA SET TAPYS22D   AT LEVEL 004 AS OF 08/21/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F322D      DATE 08/21/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
NMCAGYH  DS    XL8                                                              
NMCAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
NMCAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
NMCINVH  DS    XL8                                                              
NMCINV   DS    CL6      4   28    6  A  U N             T        Y  144         
NMCINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
NMCCIDH  DS    XL8                                                              
NMCCID   DS    CL12     4   46   12  A  U N             T        Y   64         
NMCCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
NMCLFTH  DS    XL8                                                              
NMCLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
NMCLFTX  DS    XL8                                                              
NMCLIDH  DS    XL8                                                              
NMCLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
NMCAGYNH DS    XL8                                                              
NMCAGYN  DS    CL16     5    2   16  A  P N             T        Y              
NMCCLINH DS    XL8                                                              
NMCCLIN  DS    CL16     5   20   16  A  P N             T        Y              
NMCCOMNH DS    XL8                                                              
NMCCOMN  DS    CL19     5   38   19  A  P N             T        Y              
NMCSECH  DS    XL8                                                              
NMCSEC   DS    CL4      5   58    4  A  P N             T        Y              
NMCCLPRH DS    XL8                                                              
NMCCLPR  DS    CL13     5   63   13  A  P N             T        Y              
NMCMEDNH DS    XL8                                                              
NMCMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
NMCAUTHH DS    XL8                                                              
NMCAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
NMCAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
NMCESTH  DS    XL8                                                              
NMCEST   DS    CL16     6   46   16  A  U N             T        Y   13         
NMCESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
NMCPDH   DS    XL8                                                              
NMCPD    DS    CL2      6   74    2  N  U N             T        Y   15         
NMCPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
NMCCYCH  DS    XL8                                                              
NMCCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
NMCCYCX  DS    XL8                                                              
NMCLCYCH DS    XL8                                                              
NMCLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
NMCDTLH  DS    XL8                                                              
NMCDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
NMCDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
NMCBNPH  DS    XL8                                                              
NMCBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
NMCBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
NMCEINVH DS    XL8                                                              
NMCEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
NMCEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
NMCHCOMH DS    XL8                                                              
NMCHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
NMCHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
NMCICOMH DS    XL8                                                              
NMCICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
NMCICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
NMCOPTH  DS    XL8                                                              
NMCOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
NMCOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
NMCOVLYH DS    XL8                                                              
NMCOVLY  DS    CL1     11    2    1  A  P N             T        Y              
NMCUSNMH DS    XL8                                                              
NMCUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    14    9   18  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     14   33    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14   44    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     14   56    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
NMCLPAYH DS    XL8                                                              
NMCLPAY  DS    CL57    15    8   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
NMC3MH   DS    XL8                                                              
NMC3M    DS    CL1     16   34    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   37    1  N  P N             T        Y              
NMC6MH   DS    XL8                                                              
NMC6M    DS    CL1     16   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   49    1  N  P N             T        Y              
NMC12MH  DS    XL8                                                              
NMC12M   DS    CL1     16   58    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   61    1  N  P N             T        Y              
NMCTOTSH DS    XL8                                                              
NMCTOTS  DS    CL53    18    2   53  A  P Z             T        Y              
NMCCMNTH DS    XL8                                                              
NMCCMNT  DS    CL60    24    2   60  A  P H             T        Y              
NMCDUEH  DS    XL8                                                              
NMCDUE   DS    CL14    24   67   14  A  P Z             T        Y              
NMCLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
NMCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1248 BYTES                            
