*          DATA SET TAPYS59D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F359D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
RRNAGYH  DS    XL8                                                              
RRNAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
RRNAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
RRNINVH  DS    XL8                                                              
RRNINV   DS    CL6      4   28    6  A  U N             T        Y  144         
RRNINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
RRNCIDH  DS    XL8                                                              
RRNCID   DS    CL12     4   46   12  A  U N             T        Y   64         
RRNCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
RRNLFTH  DS    XL8                                                              
RRNLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
RRNLFTX  DS    XL8                                                              
RRNLIDH  DS    XL8                                                              
RRNLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
RRNAGYNH DS    XL8                                                              
RRNAGYN  DS    CL16     5    2   16  A  P N             T        Y              
RRNCLINH DS    XL8                                                              
RRNCLIN  DS    CL16     5   20   16  A  P N             T        Y              
RRNCOMNH DS    XL8                                                              
RRNCOMN  DS    CL19     5   38   19  A  P N             T        Y              
RRNSECH  DS    XL8                                                              
RRNSEC   DS    CL4      5   58    4  A  P N             T        Y              
RRNCLPRH DS    XL8                                                              
RRNCLPR  DS    CL13     5   63   13  A  P N             T        Y              
RRNMEDNH DS    XL8                                                              
RRNMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
RRNAUTHH DS    XL8                                                              
RRNAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
RRNAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
RRNESTH  DS    XL8                                                              
RRNEST   DS    CL16     6   46   16  A  U N             T        Y   13         
RRNESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
RRNPDH   DS    XL8                                                              
RRNPD    DS    CL2      6   74    2  N  U N             T        Y   15         
RRNPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
RRNCYCH  DS    XL8                                                              
RRNCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
RRNCYCX  DS    XL8                                                              
RRNLCYCH DS    XL8                                                              
RRNLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
RRNDTLH  DS    XL8                                                              
RRNDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
RRNDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
RRNBNPH  DS    XL8                                                              
RRNBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
RRNBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
RRNEINVH DS    XL8                                                              
RRNEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
RRNEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
RRNHCOMH DS    XL8                                                              
RRNHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
RRNHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
RRNICOMH DS    XL8                                                              
RRNICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
RRNICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
RRNOPTH  DS    XL8                                                              
RRNOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
RRNOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
RRNOVLYH DS    XL8                                                              
RRNOVLY  DS    CL1     11    2    1  A  P N             T        Y              
RRNUSNMH DS    XL8                                                              
RRNUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL47    13   11   47  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
RRNLPAYH DS    XL8                                                              
RRNLPAY  DS    CL47    14   10   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
RRNNONEH DS    XL8                                                              
RRNNONE  DS    CL1     15   39    1  A  U N             T        Y  106         
RRNNONEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   43    1  N  P N             T        Y              
RRNNYH   DS    XL8                                                              
RRNNY    DS    CL1     15   45    1  A  U N             T        Y  103         
RRNNYX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   48    1  N  P N             T        Y              
RRNLAH   DS    XL8                                                              
RRNLA    DS    CL1     15   50    1  A  U N             T        Y  104         
RRNLAX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   53    1  N  P N             T        Y              
RRNCHIH  DS    XL8                                                              
RRNCHI   DS    CL1     15   56    1  A  U N             T        Y  105         
RRNCHIX  DS    XL8                                                              
RRNTOTSH DS    XL8                                                              
RRNTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
RRNCMNTH DS    XL8                                                              
RRNCMNT  DS    CL60    24    2   60  A  P H             T        Y              
RRNDUEH  DS    XL8                                                              
RRNDUE   DS    CL14    24   67   14  A  P Z             T        Y              
RRNLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
RRNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1272 BYTES                            
