*          DATA SET TAPYS75D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F375D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
MRRAGYH  DS    XL8                                                              
MRRAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
MRRAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
MRRINVH  DS    XL8                                                              
MRRINV   DS    CL6      4   28    6  A  U N             T        Y  144         
MRRINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
MRRCIDH  DS    XL8                                                              
MRRCID   DS    CL12     4   46   12  A  U N             T        Y   64         
MRRCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
MRRLFTH  DS    XL8                                                              
MRRLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
MRRLFTX  DS    XL8                                                              
MRRLIDH  DS    XL8                                                              
MRRLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
MRRAGYNH DS    XL8                                                              
MRRAGYN  DS    CL16     5    2   16  A  P N             T        Y              
MRRCLINH DS    XL8                                                              
MRRCLIN  DS    CL16     5   20   16  A  P N             T        Y              
MRRCOMNH DS    XL8                                                              
MRRCOMN  DS    CL19     5   38   19  A  P N             T        Y              
MRRSECH  DS    XL8                                                              
MRRSEC   DS    CL4      5   58    4  A  P N             T        Y              
MRRCLPRH DS    XL8                                                              
MRRCLPR  DS    CL13     5   63   13  A  P N             T        Y              
MRRMEDNH DS    XL8                                                              
MRRMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
MRRAUTHH DS    XL8                                                              
MRRAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
MRRAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
MRRESTH  DS    XL8                                                              
MRREST   DS    CL16     6   46   16  A  U N             T        Y   13         
MRRESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
MRRPDH   DS    XL8                                                              
MRRPD    DS    CL2      6   74    2  N  U N             T        Y   15         
MRRPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
MRRCYCH  DS    XL8                                                              
MRRCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
MRRCYCX  DS    XL8                                                              
MRRLCYCH DS    XL8                                                              
MRRLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
MRRDTLH  DS    XL8                                                              
MRRDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
MRRDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
MRRBNPH  DS    XL8                                                              
MRRBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
MRRBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
MRREINVH DS    XL8                                                              
MRREINV  DS    CL6      7   74    6  A  U N             T        Y   21         
MRREINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
MRRHCOMH DS    XL8                                                              
MRRHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
MRRHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
MRRICOMH DS    XL8                                                              
MRRICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
MRRICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
MRROPTH  DS    XL8                                                              
MRROPT   DS    CL60    10   10   60  A  U N             T        Y   25         
MRROPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
MRROVLYH DS    XL8                                                              
MRROVLY  DS    CL1     11    2    1  A  P N             T        Y              
MRRUSNMH DS    XL8                                                              
MRRUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    13   33   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL33    14   33   33  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
MRRLPAYH DS    XL8                                                              
MRRLPAY  DS    CL68    15    8   68  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
MRR2YRH  DS    XL8                                                              
MRR2YR   DS    CL1     16   34    1  A  U N             T        Y  101         
MRR2YRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   37    1  A  P N             T        Y              
MRRFONH  DS    XL8                                                              
MRRFON   DS    CL1     16   48    1  A  U N             T        Y  102         
MRRFONX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   51    1  A  P N             T        Y              
MRRVIDH  DS    XL8                                                              
MRRVID   DS    CL1     16   62    1  A  U N             T        Y  105         
MRRVIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   65    1  A  P N             T        Y              
MRRTOTSH DS    XL8                                                              
MRRTOTS  DS    CL53    18    2   53  A  P Z             T        Y              
MRRCMNTH DS    XL8                                                              
MRRCMNT  DS    CL60    24    2   60  A  P H             T        Y              
MRRDUEH  DS    XL8                                                              
MRRDUE   DS    CL14    24   67   14  A  P Z             T        Y              
MRRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
MRRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
