*          DATA SET TAPYS5AD   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F35AD      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
BSMAGYH  DS    XL8                                                              
BSMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
BSMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
BSMINVH  DS    XL8                                                              
BSMINV   DS    CL6      4   28    6  A  U N             T        Y  144         
BSMINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
BSMCIDH  DS    XL8                                                              
BSMCID   DS    CL12     4   46   12  A  U N             T        Y   64         
BSMCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
BSMLFTH  DS    XL8                                                              
BSMLFT   DS    CL3      4   63    3  A  U N             T        Y   66         
BSMLFTX  DS    XL8                                                              
BSMLIDH  DS    XL8                                                              
BSMLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
BSMAGYNH DS    XL8                                                              
BSMAGYN  DS    CL16     5    2   16  A  P N             T        Y              
BSMCLINH DS    XL8                                                              
BSMCLIN  DS    CL16     5   20   16  A  P N             T        Y              
BSMCOMNH DS    XL8                                                              
BSMCOMN  DS    CL19     5   38   19  A  P N             T        Y              
BSMSECH  DS    XL8                                                              
BSMSEC   DS    CL4      5   58    4  A  P N             T        Y              
BSMCLPRH DS    XL8                                                              
BSMCLPR  DS    CL13     5   63   13  A  P N             T        Y              
BSMMEDNH DS    XL8                                                              
BSMMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
BSMAUTHH DS    XL8                                                              
BSMAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
BSMAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
BSMESTH  DS    XL8                                                              
BSMEST   DS    CL16     6   46   16  A  U N             T        Y   13         
BSMESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
BSMPDH   DS    XL8                                                              
BSMPD    DS    CL2      6   74    2  N  U N             T        Y   15         
BSMPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
BSMCYCH  DS    XL8                                                              
BSMCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
BSMCYCX  DS    XL8                                                              
BSMLCYCH DS    XL8                                                              
BSMLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
BSMBNPH  DS    XL8                                                              
BSMBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
BSMBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
BSMEINVH DS    XL8                                                              
BSMEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
BSMEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
BSMHCOMH DS    XL8                                                              
BSMHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
BSMHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
BSMICOMH DS    XL8                                                              
BSMICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
BSMICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
BSMOPTH  DS    XL8                                                              
BSMOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
BSMOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL76    11    2   76  A  P H             T        Y              
BSMFRSTH DS    XL8                                                              
BSMFRST  DS    CL2     12    2    2  N  U N             T        Y   51         
BSMFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     12    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   12    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   14   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   28   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
BSMDATAH DS    XL8                                                              
BSMDATA  DS    CL42    13    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    13   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14    2    2  N  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   12    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   14   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   28   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    15    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    15   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    2    2  N  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   12    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   14   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   28   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    17    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    17   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    2    2  N  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   12    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   14   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   28   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    19    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    19   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    2    2  N  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   12    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   14   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   28   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    21    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    21   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22    2    2  N  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     22    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   12    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   14   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   28   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    23    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   45    4  A  P H             T        Y              
BSMLSTH  DS    XL8                                                              
BSMLST   DS    CL30    23   50   30  A  U N             T        Y   75         
BSMLSTX  DS    XL8                                                              
BSMCMNTH DS    XL8                                                              
BSMCMNT  DS    CL60    24    2   60  A  P H             T        Y              
BSMDUEH  DS    XL8                                                              
BSMDUE   DS    CL14    24   67   14  A  P Z             T        Y              
BSMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
BSMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2984 BYTES                            
