*          DATA SET TAPYS5DD   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F35DD      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SOPAGYH  DS    XL8                                                              
SOPAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SOPAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
SOPINVH  DS    XL8                                                              
SOPINV   DS    CL6      4   28    6  A  U N             T        Y  144         
SOPINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
SOPCIDH  DS    XL8                                                              
SOPCID   DS    CL12     4   46   12  A  U N             T        Y   64         
SOPCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
SOPLFTH  DS    XL8                                                              
SOPLFT   DS    CL3      4   63    3  A  U N             T        Y   66         
SOPLFTX  DS    XL8                                                              
SOPLIDH  DS    XL8                                                              
SOPLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
SOPAGYNH DS    XL8                                                              
SOPAGYN  DS    CL16     5    2   16  A  P N             T        Y              
SOPCLINH DS    XL8                                                              
SOPCLIN  DS    CL16     5   20   16  A  P N             T        Y              
SOPCOMNH DS    XL8                                                              
SOPCOMN  DS    CL19     5   38   19  A  P N             T        Y              
SOPSECH  DS    XL8                                                              
SOPSEC   DS    CL4      5   58    4  A  P N             T        Y              
SOPCLPRH DS    XL8                                                              
SOPCLPR  DS    CL13     5   63   13  A  P N             T        Y              
SOPMEDNH DS    XL8                                                              
SOPMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SOPAUTHH DS    XL8                                                              
SOPAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
SOPAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
SOPESTH  DS    XL8                                                              
SOPEST   DS    CL16     6   46   16  A  U N             T        Y   13         
SOPESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
SOPPDH   DS    XL8                                                              
SOPPD    DS    CL2      6   74    2  N  U N             T        Y   15         
SOPPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SOPCYCH  DS    XL8                                                              
SOPCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
SOPCYCX  DS    XL8                                                              
SOPLCYCH DS    XL8                                                              
SOPLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
SOPBNPH  DS    XL8                                                              
SOPBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
SOPBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
SOPEINVH DS    XL8                                                              
SOPEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
SOPEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SOPHCOMH DS    XL8                                                              
SOPHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
SOPHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SOPICOMH DS    XL8                                                              
SOPICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
SOPICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SOPOPTH  DS    XL8                                                              
SOPOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
SOPOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P H             T        Y              
SOPDAT1H DS    XL8                                                              
SOPDAT1  DS    CL26    12    2   26  A  P N             T        Y              
SOPFRSTH DS    XL8                                                              
SOPFRST  DS    CL1     12   29    1  N  U N             T        Y   63         
SOPFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
SOPEPISH DS    XL8                                                              
SOPEPIS  DS    CL34    13    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL40    13   41   40  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL26    14    2   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   29    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    15    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL40    15   41   40  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL26    16    2   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   29    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    17    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL40    17   41   40  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL26    18    2   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   29    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    19    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL40    19   41   40  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL26    20    2   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   29    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    21    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   37    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL40    21   41   40  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL26    22    2   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   29    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL34    23    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   37    3  A  P N             T        Y              
SOPLSTH  DS    XL8                                                              
SOPLST   DS    CL40    23   41   40  A  U N             T        Y   75         
SOPLSTX  DS    XL8                                                              
SOPCMNTH DS    XL8                                                              
SOPCMNT  DS    CL60    24    2   60  A  P H             T        Y              
SOPDUEH  DS    XL8                                                              
SOPDUE   DS    CL14    24   67   14  A  P Z             T        Y              
SOPLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SOPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2704 BYTES                            
