*          DATA SET TAPYS16D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F316D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
RTKAGYH  DS    XL8                                                              
RTKAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
RTKAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
RTKINVH  DS    XL8                                                              
RTKINV   DS    CL6      4   28    6  A  U N             T        Y  144         
RTKINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
RTKCIDH  DS    XL8                                                              
RTKCID   DS    CL12     4   46   12  A  U N             T        Y   64         
RTKCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
RTKLFTH  DS    XL8                                                              
RTKLFT   DS    CL3      4   63    3  A  U N             T        Y   66         
RTKLFTX  DS    XL8                                                              
RTKLIDH  DS    XL8                                                              
RTKLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
RTKAGYNH DS    XL8                                                              
RTKAGYN  DS    CL16     5    2   16  A  P N             T        Y              
RTKCLINH DS    XL8                                                              
RTKCLIN  DS    CL16     5   20   16  A  P N             T        Y              
RTKCOMNH DS    XL8                                                              
RTKCOMN  DS    CL19     5   38   19  A  P N             T        Y              
RTKSECH  DS    XL8                                                              
RTKSEC   DS    CL4      5   58    4  A  P N             T        Y              
RTKCLPRH DS    XL8                                                              
RTKCLPR  DS    CL13     5   63   13  A  P N             T        Y              
RTKMEDNH DS    XL8                                                              
RTKMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
RTKAUTHH DS    XL8                                                              
RTKAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
RTKAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
RTKESTH  DS    XL8                                                              
RTKEST   DS    CL16     6   46   16  A  U N             T        Y   13         
RTKESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
RTKPDH   DS    XL8                                                              
RTKPD    DS    CL2      6   74    2  N  U N             T        Y   15         
RTKPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
RTKCYCH  DS    XL8                                                              
RTKCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
RTKCYCX  DS    XL8                                                              
RTKLCYCH DS    XL8                                                              
RTKLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
RTKBNPH  DS    XL8                                                              
RTKBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
RTKBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
RTKEINVH DS    XL8                                                              
RTKEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
RTKEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
RTKHCOMH DS    XL8                                                              
RTKHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
RTKHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
RTKICOMH DS    XL8                                                              
RTKICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
RTKICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
RTKOPTH  DS    XL8                                                              
RTKOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
RTKOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P H             T        Y              
RTKFRSTH DS    XL8                                                              
RTKFRST  DS    CL5     12    2    5  A  U N             T        Y   51         
RTKFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     12    8    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   16    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   20    1  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   25    1  A  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
RTKDATAH DS    XL8                                                              
RTKDATA  DS    CL42    13    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    13   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14    8    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   16    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   20    1  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   25    1  A  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    15    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    15   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16    8    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   16    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   20    1  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   25    1  A  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    17    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    17   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    8    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   16    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   20    1  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   25    1  A  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    19    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    19   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    8    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   16    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   20    1  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   25    1  A  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    21    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    21   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     22    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     22    8    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   16    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   20    1  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   25    1  A  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    23    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   45    4  A  P H             T        Y              
RTKLSTH  DS    XL8                                                              
RTKLST   DS    CL30    23   50   30  A  U N             T        Y   73         
RTKLSTX  DS    XL8                                                              
RTKCMNTH DS    XL8                                                              
RTKCMNT  DS    CL60    24    2   60  A  P H             T        Y              
RTKDUEH  DS    XL8                                                              
RTKDUE   DS    CL14    24   67   14  A  P Z             T        Y              
RTKLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
RTKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 3048 BYTES                            
