*          DATA SET TAPYS74D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F374D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
VNWAGYH  DS    XL8                                                              
VNWAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
VNWAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
VNWINVH  DS    XL8                                                              
VNWINV   DS    CL6      4   28    6  A  U N             T        Y  144         
VNWINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
VNWCIDH  DS    XL8                                                              
VNWCID   DS    CL12     4   46   12  A  U N             T        Y   64         
VNWCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
VNWLFTH  DS    XL8                                                              
VNWLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
VNWLFTX  DS    XL8                                                              
VNWLIDH  DS    XL8                                                              
VNWLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
VNWAGYNH DS    XL8                                                              
VNWAGYN  DS    CL16     5    2   16  A  P N             T        Y              
VNWCLINH DS    XL8                                                              
VNWCLIN  DS    CL16     5   20   16  A  P N             T        Y              
VNWCOMNH DS    XL8                                                              
VNWCOMN  DS    CL19     5   38   19  A  P N             T        Y              
VNWSECH  DS    XL8                                                              
VNWSEC   DS    CL4      5   58    4  A  P N             T        Y              
VNWCLPRH DS    XL8                                                              
VNWCLPR  DS    CL13     5   63   13  A  P N             T        Y              
VNWMEDNH DS    XL8                                                              
VNWMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
VNWAUTHH DS    XL8                                                              
VNWAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
VNWAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
VNWESTH  DS    XL8                                                              
VNWEST   DS    CL16     6   46   16  A  U N             T        Y   13         
VNWESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
VNWPDH   DS    XL8                                                              
VNWPD    DS    CL2      6   74    2  N  U N             T        Y   15         
VNWPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
VNWCYCH  DS    XL8                                                              
VNWCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
VNWCYCX  DS    XL8                                                              
VNWLCYCH DS    XL8                                                              
VNWLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
VNWDTLH  DS    XL8                                                              
VNWDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
VNWDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
VNWBNPH  DS    XL8                                                              
VNWBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
VNWBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
VNWEINVH DS    XL8                                                              
VNWEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
VNWEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
VNWHCOMH DS    XL8                                                              
VNWHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
VNWHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
VNWICOMH DS    XL8                                                              
VNWICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
VNWICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
VNWOPTH  DS    XL8                                                              
VNWOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
VNWOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
VNWOVLYH DS    XL8                                                              
VNWOVLY  DS    CL1     11    2    1  A  P N             T        Y              
VNWUSNMH DS    XL8                                                              
VNWUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    13   38   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL49    14   11   49  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
VNWLPAYH DS    XL8                                                              
VNWLPAY  DS    CL24    15   10   24  A  P N             T        Y              
VNWLSESH DS    XL8                                                              
VNWLSES  DS    CL1     15   42    1  A  P N             T        Y              
VNWLVNWH DS    XL8                                                              
VNWLVNW  DS    CL3     15   55    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
VNWSESSH DS    XL8                                                              
VNWSESS  DS    CL1     16   42    1  N  U N             T        Y  106         
VNWSESSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   44    1  N  P N             T        Y              
VNWVNWH  DS    XL8                                                              
VNWVNW   DS    CL3     16   55    3  A  U N             T        Y  107         
VNWVNWX  DS    XL8                                                              
VNWTOTSH DS    XL8                                                              
VNWTOTS  DS    CL53    18    2   53  A  P Z             T        Y              
VNWCMNTH DS    XL8                                                              
VNWCMNT  DS    CL60    24    2   60  A  P H             T        Y              
VNWDUEH  DS    XL8                                                              
VNWDUE   DS    CL14    24   67   14  A  P Z             T        Y              
VNWLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
VNWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1240 BYTES                            
