*          DATA SET TAPYS5FD   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F35FD      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CBLTAGH  DS    XL8                                                              
CBLTAG   DS    CL6      4    2    6  A  P H             T        Y              
CBLAGYH  DS    XL8                                                              
CBLAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
CBLAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
CBLINVH  DS    XL8                                                              
CBLINV   DS    CL6      4   28    6  A  U N             T        Y  144         
CBLINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
CBLCIDH  DS    XL8                                                              
CBLCID   DS    CL12     4   46   12  A  U N             T        Y   64         
CBLCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
CBLLFTH  DS    XL8                                                              
CBLLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
CBLLFTX  DS    XL8                                                              
CBLLIDH  DS    XL8                                                              
CBLLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
CBLAGYNH DS    XL8                                                              
CBLAGYN  DS    CL16     5    2   16  A  P N             T        Y              
CBLCLINH DS    XL8                                                              
CBLCLIN  DS    CL16     5   20   16  A  P N             T        Y              
CBLCOMNH DS    XL8                                                              
CBLCOMN  DS    CL19     5   38   19  A  P N             T        Y              
CBLSECH  DS    XL8                                                              
CBLSEC   DS    CL4      5   58    4  A  P N             T        Y              
CBLCLPRH DS    XL8                                                              
CBLCLPR  DS    CL13     5   63   13  A  P N             T        Y              
CBLMEDNH DS    XL8                                                              
CBLMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
CBLAUTHH DS    XL8                                                              
CBLAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
CBLAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
CBLESTH  DS    XL8                                                              
CBLEST   DS    CL16     6   46   16  A  U N             T        Y   13         
CBLESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
CBLPDH   DS    XL8                                                              
CBLPD    DS    CL2      6   74    2  N  U N             T        Y   15         
CBLPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
CBLCYCH  DS    XL8                                                              
CBLCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
CBLCYCX  DS    XL8                                                              
CBLLCYCH DS    XL8                                                              
CBLLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
CBLDTLH  DS    XL8                                                              
CBLDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
CBLDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
CBLBNPH  DS    XL8                                                              
CBLBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
CBLBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
CBLEINVH DS    XL8                                                              
CBLEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
CBLEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
CBLHCOMH DS    XL8                                                              
CBLHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
CBLHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
CBLICOMH DS    XL8                                                              
CBLICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
CBLICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
CBLOPTH  DS    XL8                                                              
CBLOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
CBLOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
CBLOVLYH DS    XL8                                                              
CBLOVLY  DS    CL1     10   80    1  A  P N             T        Y              
CBLUSNMH DS    XL8                                                              
CBLUSNM  DS    CL16    11   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     12    9    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   20    7  A  P H             T        Y              
CBLUNSH  DS    XL8                                                              
CBLUNS   DS    CL7     12   38    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    12   48   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    12   60   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P H             T        Y              
CBLLPAYH DS    XL8                                                              
CBLLPAY  DS    CL24    13    8   24  A  P N             T        Y              
CBLLUNTH DS    XL8                                                              
CBLLUNT  DS    CL7     13   39    7  A  U N             T        Y  103         
CBLLUNTX DS    XL8                                                              
CBLLAUTH DS    XL8                                                              
CBLLAUT  DS    CL7     13   50    7  A  P N             T        Y  104         
CBLLAUTX DS    XL8                                                              
CBLLUPGH DS    XL8                                                              
CBLLUPG  DS    CL1     13   64    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
CBLUNITH DS    XL8                                                              
CBLUNIT  DS    CL7     14   39    7  A  U N             T        Y  101         
CBLUNITX DS    XL8                                                              
CBLAUNTH DS    XL8                                                              
CBLAUNT  DS    CL7     14   50    7  A  P N             T        Y  105         
CBLAUNTX DS    XL8                                                              
CBLUPGRH DS    XL8                                                              
CBLUPGR  DS    CL1     14   64    1  A  U N             T        Y  102         
CBLUPGRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15    4    4  A  P H             T        Y              
CBLHD1H  DS    XL8                                                              
CBLHD1   DS    CL4     15   13    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   24    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   33    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   44    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   53    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   64    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   73    4  A  P H             T        Y              
CBLFRSTH DS    XL8                                                              
CBLFRST  DS    CL1     16    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   53    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   73    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   13    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   22    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22   24    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   33    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22   44    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   53    6  A  U N             T        Y              
CBLLSTH  DS    XL8                                                              
CBLLST   DS    CL1     22   62    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     22   64    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   73    6  A  U N             T        Y              
CBLTOTSH DS    XL8                                                              
CBLTOTS  DS    CL53    23    2   53  A  P Z             T        Y              
CBLCMNTH DS    XL8                                                              
CBLCMNT  DS    CL60    24    2   60  A  P H             T        Y              
CBLDUEH  DS    XL8                                                              
CBLDUE   DS    CL14    24   67   14  A  P Z             T        Y              
CBLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CBLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2480 BYTES                            
