*          DATA SET TAPYS67D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F367D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ADCAGYH  DS    XL8                                                              
ADCAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
ADCAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
ADCINVH  DS    XL8                                                              
ADCINV   DS    CL6      4   28    6  A  U N             T        Y  144         
ADCINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
ADCCIDH  DS    XL8                                                              
ADCCID   DS    CL12     4   46   12  A  U N             T        Y   64         
ADCCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
ADCLFTH  DS    XL8                                                              
ADCLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
ADCLFTX  DS    XL8                                                              
ADCLIDH  DS    XL8                                                              
ADCLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
ADCAGYNH DS    XL8                                                              
ADCAGYN  DS    CL16     5    2   16  A  P N             T        Y              
ADCCLINH DS    XL8                                                              
ADCCLIN  DS    CL16     5   20   16  A  P N             T        Y              
ADCCOMNH DS    XL8                                                              
ADCCOMN  DS    CL19     5   38   19  A  P N             T        Y              
ADCSECH  DS    XL8                                                              
ADCSEC   DS    CL4      5   58    4  A  P N             T        Y              
ADCCLPRH DS    XL8                                                              
ADCCLPR  DS    CL13     5   63   13  A  P N             T        Y              
ADCMEDNH DS    XL8                                                              
ADCMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
ADCAUTHH DS    XL8                                                              
ADCAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
ADCAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
ADCESTH  DS    XL8                                                              
ADCEST   DS    CL16     6   46   16  A  U N             T        Y   13         
ADCESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
ADCPDH   DS    XL8                                                              
ADCPD    DS    CL2      6   74    2  N  U N             T        Y   15         
ADCPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
ADCCYCH  DS    XL8                                                              
ADCCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
ADCCYCX  DS    XL8                                                              
ADCLCYCH DS    XL8                                                              
ADCLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
ADCDTLH  DS    XL8                                                              
ADCDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
ADCDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
ADCBNPH  DS    XL8                                                              
ADCBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
ADCBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
ADCEINVH DS    XL8                                                              
ADCEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
ADCEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
ADCHCOMH DS    XL8                                                              
ADCHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
ADCHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
ADCICOMH DS    XL8                                                              
ADCICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
ADCICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
ADCOPTH  DS    XL8                                                              
ADCOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
ADCOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
ADCOVLYH DS    XL8                                                              
ADCOVLY  DS    CL1     11    2    1  A  P N             T        Y              
ADCUSNMH DS    XL8                                                              
ADCUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL17    13    9   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13   33    5  A  P H             T        Y              
ADCHTY1H DS    XL8                                                              
ADCHTY1  DS    CL5     13   40    5  A  P H             T        Y              
ADCHTY2H DS    XL8                                                              
ADCHTY2  DS    CL5     13   47    5  A  P H             T        Y              
ADCHTY3H DS    XL8                                                              
ADCHTY3  DS    CL5     13   54    5  A  P H             T        Y              
ADCHTY4H DS    XL8                                                              
ADCHTY4  DS    CL5     13   61    5  A  P H             T        Y              
ADCHTY5H DS    XL8                                                              
ADCHTY5  DS    CL5     13   68    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
ADCLPAYH DS    XL8                                                              
ADCLPAY  DS    CL24    14    8   24  A  P N             T        Y              
ADCLUNTH DS    XL8                                                              
ADCLUNT  DS    CL4     14   34    4  A  P N             T        Y              
ADCLTY1H DS    XL8                                                              
ADCLTY1  DS    CL1     14   42    1  A  P N             T        Y              
ADCLTY2H DS    XL8                                                              
ADCLTY2  DS    CL1     14   49    1  A  P N             T        Y              
ADCLTY3H DS    XL8                                                              
ADCLTY3  DS    CL1     14   56    1  A  P N             T        Y              
ADCLTY4H DS    XL8                                                              
ADCLTY4  DS    CL1     14   63    1  A  P N             T        Y              
ADCLTY5H DS    XL8                                                              
ADCLTY5  DS    CL1     14   70    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
ADCUNITH DS    XL8                                                              
ADCUNIT  DS    CL4     15   34    4  N  U N             T        Y  106         
ADCUNITX DS    XL8                                                              
ADCTTY1H DS    XL8                                                              
ADCTTY1  DS    CL1     15   42    1  A  U N             T        Y  101         
ADCTTY1X DS    XL8                                                              
ADCTTY2H DS    XL8                                                              
ADCTTY2  DS    CL1     15   49    1  A  U N             T        Y  102         
ADCTTY2X DS    XL8                                                              
ADCTTY3H DS    XL8                                                              
ADCTTY3  DS    CL1     15   56    1  A  U N             T        Y  103         
ADCTTY3X DS    XL8                                                              
ADCTTY4H DS    XL8                                                              
ADCTTY4  DS    CL1     15   63    1  A  U N             T        Y  105         
ADCTTY4X DS    XL8                                                              
ADCTTY5H DS    XL8                                                              
ADCTTY5  DS    CL1     15   70    1  A  U N             T        Y  107         
ADCTTY5X DS    XL8                                                              
ADCTOTSH DS    XL8                                                              
ADCTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
ADCCMNTH DS    XL8                                                              
ADCCMNT  DS    CL60    24    2   60  A  P H             T        Y              
ADCDUEH  DS    XL8                                                              
ADCDUE   DS    CL14    24   67   14  A  P Z             T        Y              
ADCLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ADCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
