*          DATA SET TAPYS1BD   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F31BD      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
IHMAGYH  DS    XL8                                                              
IHMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
IHMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
IHMINVH  DS    XL8                                                              
IHMINV   DS    CL6      4   28    6  A  U N             T        Y  144         
IHMINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
IHMCIDH  DS    XL8                                                              
IHMCID   DS    CL12     4   46   12  A  U N             T        Y   64         
IHMCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
IHMLFTH  DS    XL8                                                              
IHMLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
IHMLFTX  DS    XL8                                                              
IHMLIDH  DS    XL8                                                              
IHMLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
IHMAGYNH DS    XL8                                                              
IHMAGYN  DS    CL16     5    2   16  A  P N             T        Y              
IHMCLINH DS    XL8                                                              
IHMCLIN  DS    CL16     5   20   16  A  P N             T        Y              
IHMCOMNH DS    XL8                                                              
IHMCOMN  DS    CL19     5   38   19  A  P N             T        Y              
IHMSECH  DS    XL8                                                              
IHMSEC   DS    CL4      5   58    4  A  P N             T        Y              
IHMCLPRH DS    XL8                                                              
IHMCLPR  DS    CL13     5   63   13  A  P N             T        Y              
IHMMEDNH DS    XL8                                                              
IHMMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
IHMAUTHH DS    XL8                                                              
IHMAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
IHMAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
IHMESTH  DS    XL8                                                              
IHMEST   DS    CL16     6   46   16  A  U N             T        Y   13         
IHMESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
IHMPDH   DS    XL8                                                              
IHMPD    DS    CL2      6   74    2  N  U N             T        Y   15         
IHMPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
IHMCYCH  DS    XL8                                                              
IHMCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
IHMCYCX  DS    XL8                                                              
IHMLCYCH DS    XL8                                                              
IHMLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
IHMDTLH  DS    XL8                                                              
IHMDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
IHMDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
IHMBNPH  DS    XL8                                                              
IHMBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
IHMBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
IHMEINVH DS    XL8                                                              
IHMEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
IHMEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
IHMHCOMH DS    XL8                                                              
IHMHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
IHMHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
IHMICOMH DS    XL8                                                              
IHMICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
IHMICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
IHMOPTH  DS    XL8                                                              
IHMOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
IHMOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
IHMOVLYH DS    XL8                                                              
IHMOVLY  DS    CL1     11    2    1  A  P N             T        Y              
IHMUSNMH DS    XL8                                                              
IHMUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL41    13   33   41  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    14    9   18  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL46    14   33   46  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
IHMLPAYH DS    XL8                                                              
IHMLPAY  DS    CL73    15    8   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
IHMU1MH  DS    XL8                                                              
IHMU1M   DS    CL1     16   37    1  A  U N             T        Y  101         
IHMU1MX  DS    XL8                                                              
IHM1MOH  DS    XL8                                                              
IHM1MO   DS    CL1     16   51    1  A  U N             T        Y  102         
IHM1MOX  DS    XL8                                                              
IHMONTH  DS    XL8                                                              
IHMONT   DS    CL1     16   71    1  A  U N             T        Y  105         
IHMONTX  DS    XL8                                                              
IHMTOTSH DS    XL8                                                              
IHMTOTS  DS    CL53    18    2   53  A  P Z             T        Y              
IHMCMNTH DS    XL8                                                              
IHMCMNT  DS    CL60    24    2   60  A  P H             T        Y              
IHMDUEH  DS    XL8                                                              
IHMDUE   DS    CL14    24   67   14  A  P Z             T        Y              
IHMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
IHMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1328 BYTES                            
