*          DATA SET TAPYS54D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F354D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
RNTAGYH  DS    XL8                                                              
RNTAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
RNTAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
RNTINVH  DS    XL8                                                              
RNTINV   DS    CL6      4   28    6  A  U N             T        Y  144         
RNTINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
RNTCIDH  DS    XL8                                                              
RNTCID   DS    CL12     4   46   12  A  U N             T        Y   64         
RNTCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
RNTLFTH  DS    XL8                                                              
RNTLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
RNTLFTX  DS    XL8                                                              
RNTLIDH  DS    XL8                                                              
RNTLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
RNTAGYNH DS    XL8                                                              
RNTAGYN  DS    CL16     5    2   16  A  P N             T        Y              
RNTCLINH DS    XL8                                                              
RNTCLIN  DS    CL16     5   20   16  A  P N             T        Y              
RNTCOMNH DS    XL8                                                              
RNTCOMN  DS    CL19     5   38   19  A  P N             T        Y              
RNTSECH  DS    XL8                                                              
RNTSEC   DS    CL4      5   58    4  A  P N             T        Y              
RNTCLPRH DS    XL8                                                              
RNTCLPR  DS    CL13     5   63   13  A  P N             T        Y              
RNTMEDNH DS    XL8                                                              
RNTMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
RNTAUTHH DS    XL8                                                              
RNTAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
RNTAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
RNTESTH  DS    XL8                                                              
RNTEST   DS    CL16     6   46   16  A  U N             T        Y   13         
RNTESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
RNTPDH   DS    XL8                                                              
RNTPD    DS    CL2      6   74    2  N  U N             T        Y   15         
RNTPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
RNTCYCH  DS    XL8                                                              
RNTCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
RNTCYCX  DS    XL8                                                              
RNTLCYCH DS    XL8                                                              
RNTLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
RNTDTLH  DS    XL8                                                              
RNTDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
RNTDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
RNTBNPH  DS    XL8                                                              
RNTBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
RNTBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
RNTEINVH DS    XL8                                                              
RNTEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
RNTEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
RNTHCOMH DS    XL8                                                              
RNTHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
RNTHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
RNTICOMH DS    XL8                                                              
RNTICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
RNTICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
RNTOPTH  DS    XL8                                                              
RNTOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
RNTOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
RNTOVLYH DS    XL8                                                              
RNTOVLY  DS    CL1     11    2    1  A  P N             T        Y              
RNTUSNMH DS    XL8                                                              
RNTUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL22    13   58   22  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    14    9   70  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
RNTLPAYH DS    XL8                                                              
RNTLPAY  DS    CL69    15    8   69  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
RNT1WH   DS    XL8                                                              
RNT1W    DS    CL1     16   34    1  A  U N             T        Y  101         
RNT1WX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   36    1  N  P N             T        Y              
RNT4WH   DS    XL8                                                              
RNT4W    DS    CL1     16   40    1  A  U N             T        Y  102         
RNT4WX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   42    1  N  P N             T        Y              
RNT8WH   DS    XL8                                                              
RNT8W    DS    CL1     16   46    1  A  U N             T        Y  103         
RNT8WX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   48    1  N  P N             T        Y              
RNT13WH  DS    XL8                                                              
RNT13W   DS    CL1     16   53    1  A  U N             T        Y  104         
RNT13WX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   55    1  N  P N             T        Y              
RNT26UH  DS    XL8                                                              
RNT26U   DS    CL1     16   60    1  A  U N             T        Y  105         
RNT26UX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   62    1  N  P N             T        Y              
RNT39UH  DS    XL8                                                              
RNT39U   DS    CL1     16   68    1  A  U N             T        Y  106         
RNT39UX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   70    1  N  P N             T        Y              
RNTABH   DS    XL8                                                              
RNTAB    DS    CL1     16   76    1  A  U N             T        Y  107         
RNTABX   DS    XL8                                                              
RNTTOTSH DS    XL8                                                              
RNTTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
RNTCMNTH DS    XL8                                                              
RNTCMNT  DS    CL60    24    2   60  A  P H             T        Y              
RNTDUEH  DS    XL8                                                              
RNTDUE   DS    CL14    24   67   14  A  P Z             T        Y              
RNTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
RNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1424 BYTES                            
