*          DATA SET TAPYS5ED   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F35ED      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
FGRAGYH  DS    XL8                                                              
FGRAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
FGRAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
FGRINVH  DS    XL8                                                              
FGRINV   DS    CL6      4   28    6  A  U N             T        Y  144         
FGRINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
FGRCIDH  DS    XL8                                                              
FGRCID   DS    CL12     4   46   12  A  U N             T        Y   64         
FGRCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
FGRLFTH  DS    XL8                                                              
FGRLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
FGRLFTX  DS    XL8                                                              
FGRLIDH  DS    XL8                                                              
FGRLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
FGRAGYNH DS    XL8                                                              
FGRAGYN  DS    CL16     5    2   16  A  P N             T        Y              
FGRCLINH DS    XL8                                                              
FGRCLIN  DS    CL16     5   20   16  A  P N             T        Y              
FGRCOMNH DS    XL8                                                              
FGRCOMN  DS    CL19     5   38   19  A  P N             T        Y              
FGRSECH  DS    XL8                                                              
FGRSEC   DS    CL4      5   58    4  A  P N             T        Y              
FGRCLPRH DS    XL8                                                              
FGRCLPR  DS    CL13     5   63   13  A  P N             T        Y              
FGRMEDNH DS    XL8                                                              
FGRMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
FGRAUTHH DS    XL8                                                              
FGRAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
FGRAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
FGRESTH  DS    XL8                                                              
FGREST   DS    CL16     6   46   16  A  U N             T        Y   13         
FGRESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
FGRPDH   DS    XL8                                                              
FGRPD    DS    CL2      6   74    2  N  U N             T        Y   15         
FGRPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
FGRCYCH  DS    XL8                                                              
FGRCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
FGRCYCX  DS    XL8                                                              
FGRLCYCH DS    XL8                                                              
FGRLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
FGRDTLH  DS    XL8                                                              
FGRDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
FGRDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
FGRBNPH  DS    XL8                                                              
FGRBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
FGRBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
FGREINVH DS    XL8                                                              
FGREINV  DS    CL6      7   74    6  A  U N             T        Y   21         
FGREINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
FGRHCOMH DS    XL8                                                              
FGRHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
FGRHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
FGRICOMH DS    XL8                                                              
FGRICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
FGRICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
FGROPTH  DS    XL8                                                              
FGROPT   DS    CL60    10   10   60  A  U N             T        Y   25         
FGROPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
FGROVLYH DS    XL8                                                              
FGROVLY  DS    CL1     11    2    1  A  P N             T        Y              
FGRUSNMH DS    XL8                                                              
FGRUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL71    13    9   71  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
FGRLPAYH DS    XL8                                                              
FGRLPAY  DS    CL71    14    8   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
FGRUKH   DS    XL8                                                              
FGRUK    DS    CL1     15   35    1  A  U N             T        Y  101         
FGRUKX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   37    1  N  P N             T        Y              
FGREURH  DS    XL8                                                              
FGREUR   DS    CL1     15   40    1  A  U N             T        Y  102         
FGREURX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   42    1  N  P N             T        Y              
FGRJAPH  DS    XL8                                                              
FGRJAP   DS    CL1     15   46    1  A  U N             T        Y  107         
FGRJAPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   48    1  N  P N             T        Y              
FGRAPH   DS    XL8                                                              
FGRAP    DS    CL1     15   51    1  A  U N             T        Y  105         
FGRAPX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   53    1  N  P N             T        Y              
FGRWORH  DS    XL8                                                              
FGRWOR   DS    CL1     15   56    1  A  U N             T        Y  103         
FGRWORX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   58    1  N  P N             T        Y              
FGRWIDEH DS    XL8                                                              
FGRWIDE  DS    CL1     15   63    1  A  U N             T        Y  109         
FGRWIDEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   65    1  N  P N             T        Y              
FGRRADH  DS    XL8                                                              
FGRRAD   DS    CL1     15   72    1  A  U N             T        Y  106         
FGRRADX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   74    1  N  P N             T        Y              
FGREXTH  DS    XL8                                                              
FGREXT   DS    CL1     15   78    1  A  U N             T        Y  113         
FGREXTX  DS    XL8                                                              
FGRCEDLH DS    XL8                                                              
FGRCEDL  DS    CL24    17    1   24  A  P Z             T        Y              
FGRCEDH  DS    XL8                                                              
FGRCED   DS    CL8     17   30    8  A  P N             T        Y  114         
FGRCEDX  DS    XL8                                                              
FGRTOTSH DS    XL8                                                              
FGRTOTS  DS    CL53    19    2   53  A  P Z             T        Y              
FGRCMNTH DS    XL8                                                              
FGRCMNT  DS    CL60    24    2   60  A  P H             T        Y              
FGRDUEH  DS    XL8                                                              
FGRDUE   DS    CL14    24   67   14  A  P Z             T        Y              
FGRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
FGRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1480 BYTES                            
