*          DATA SET TAPYS21D   AT LEVEL 001 AS OF 02/23/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F321D      DATE 02/23/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
MBOAGYH  DS    XL8                                                              
MBOAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
MBOAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
MBOINVH  DS    XL8                                                              
MBOINV   DS    CL6      4   28    6  A  U N             T        Y  144         
MBOINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
MBOCIDH  DS    XL8                                                              
MBOCID   DS    CL12     4   46   12  A  U N             T        Y   64         
MBOCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
MBOLFTH  DS    XL8                                                              
MBOLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
MBOLFTX  DS    XL8                                                              
MBOLIDH  DS    XL8                                                              
MBOLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
MBOAGYNH DS    XL8                                                              
MBOAGYN  DS    CL16     5    2   16  A  P N             T        Y              
MBOCLINH DS    XL8                                                              
MBOCLIN  DS    CL16     5   20   16  A  P N             T        Y              
MBOCOMNH DS    XL8                                                              
MBOCOMN  DS    CL19     5   38   19  A  P N             T        Y              
MBOSECH  DS    XL8                                                              
MBOSEC   DS    CL4      5   58    4  A  P N             T        Y              
MBOCLPRH DS    XL8                                                              
MBOCLPR  DS    CL13     5   63   13  A  P N             T        Y              
MBOMEDNH DS    XL8                                                              
MBOMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
MBOAUTHH DS    XL8                                                              
MBOAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
MBOAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
MBOESTH  DS    XL8                                                              
MBOEST   DS    CL16     6   46   16  A  U N             T        Y   13         
MBOESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
MBOPDH   DS    XL8                                                              
MBOPD    DS    CL2      6   74    2  N  U N             T        Y   15         
MBOPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
MBOCYCH  DS    XL8                                                              
MBOCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
MBOCYCX  DS    XL8                                                              
MBOLCYCH DS    XL8                                                              
MBOLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
MBODTLH  DS    XL8                                                              
MBODTL   DS    CL1      7   46    1  A  U N             T        Y   18         
MBODTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
MBOBNPH  DS    XL8                                                              
MBOBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
MBOBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
MBOEINVH DS    XL8                                                              
MBOEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
MBOEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
MBOHCOMH DS    XL8                                                              
MBOHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
MBOHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
MBOICOMH DS    XL8                                                              
MBOICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
MBOICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
MBOOPTH  DS    XL8                                                              
MBOOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
MBOOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
MBOOVLYH DS    XL8                                                              
MBOOVLY  DS    CL1     11    2    1  A  P N             T        Y              
MBOUSNMH DS    XL8                                                              
MBOUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   32    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13   45    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    14    9   18  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     14   32    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     14   44    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
MBOLPAYH DS    XL8                                                              
MBOLPAY  DS    CL57    15    8   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
MBOINIH  DS    XL8                                                              
MBOINI   DS    CL1     16   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   38    1  N  P N             T        Y              
MBOREUH  DS    XL8                                                              
MBOREU   DS    CL1     16   47    1  A  U N             T        Y              
MBOTOTSH DS    XL8                                                              
MBOTOTS  DS    CL53    18    2   53  A  P Z             T        Y              
MBOCMNTH DS    XL8                                                              
MBOCMNT  DS    CL60    24    2   60  A  P H             T        Y              
MBODUEH  DS    XL8                                                              
MBODUE   DS    CL14    24   67   14  A  P Z             T        Y              
MBOLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
MBOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1240 BYTES                            
