*          DATA SET TAPYS50D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F350D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
BSSAGYH  DS    XL8                                                              
BSSAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
BSSAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
BSSINVH  DS    XL8                                                              
BSSINV   DS    CL6      4   28    6  A  U N             T        Y  144         
BSSINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
BSSCIDH  DS    XL8                                                              
BSSCID   DS    CL12     4   46   12  A  U N             T        Y   64         
BSSCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
BSSLFTH  DS    XL8                                                              
BSSLFT   DS    CL3      4   63    3  A  U N             T        Y   66         
BSSLFTX  DS    XL8                                                              
BSSLIDH  DS    XL8                                                              
BSSLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
BSSAGYNH DS    XL8                                                              
BSSAGYN  DS    CL16     5    2   16  A  P N             T        Y              
BSSCLINH DS    XL8                                                              
BSSCLIN  DS    CL16     5   20   16  A  P N             T        Y              
BSSCOMNH DS    XL8                                                              
BSSCOMN  DS    CL19     5   38   19  A  P N             T        Y              
BSSSECH  DS    XL8                                                              
BSSSEC   DS    CL4      5   58    4  A  P N             T        Y              
BSSCLPRH DS    XL8                                                              
BSSCLPR  DS    CL13     5   63   13  A  P N             T        Y              
BSSMEDNH DS    XL8                                                              
BSSMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
BSSAUTHH DS    XL8                                                              
BSSAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
BSSAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
BSSESTH  DS    XL8                                                              
BSSEST   DS    CL16     6   46   16  A  U N             T        Y   13         
BSSESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
BSSPDH   DS    XL8                                                              
BSSPD    DS    CL2      6   74    2  N  U N             T        Y   15         
BSSPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
BSSCYCH  DS    XL8                                                              
BSSCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
BSSCYCX  DS    XL8                                                              
BSSLCYCH DS    XL8                                                              
BSSLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
BSSBNPH  DS    XL8                                                              
BSSBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
BSSBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
BSSEINVH DS    XL8                                                              
BSSEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
BSSEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
BSSHCOMH DS    XL8                                                              
BSSHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
BSSHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
BSSICOMH DS    XL8                                                              
BSSICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
BSSICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
BSSOPT2H DS    XL8                                                              
BSSOPT2  DS    CL60    10   10   60  A  U N             T        Y   25         
BSSOPT2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P H             T        Y              
BSSFRSTH DS    XL8                                                              
BSSFRST  DS    CL2     12    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    8    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   11    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   76    4  A  U N             T        Y              
BSSDATAH DS    XL8                                                              
BSSDATA  DS    CL47    13    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    13   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    8    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   11    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   76    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    15    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    15   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    8    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   11    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   76    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    17    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    8    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   11    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   76    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    19    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    19   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    8    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   11    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   76    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    21    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    21   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    5    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    8    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   11    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   26    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   76    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    23    2   47  A  P N             T        Y              
BSSLSTH  DS    XL8                                                              
BSSLST   DS    CL30    23   50   30  A  U N             T        Y              
BSSCMNTH DS    XL8                                                              
BSSCMNT  DS    CL60    24    2   60  A  P H             T        Y              
BSSDUEH  DS    XL8                                                              
BSSDUE   DS    CL14    24   67   14  A  P Z             T        Y              
BSSLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
BSSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2568 BYTES                            
