*          DATA SET TAPYS85D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F385D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
CNMAGYH  DS    XL8                                                              
CNMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
CNMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
CNMINVH  DS    XL8                                                              
CNMINV   DS    CL6      4   28    6  A  U N             T        Y  144         
CNMINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
CNMCIDH  DS    XL8                                                              
CNMCID   DS    CL12     4   46   12  A  U N             T        Y   64         
CNMCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
CNMLFTH  DS    XL8                                                              
CNMLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
CNMLFTX  DS    XL8                                                              
CNMLIDH  DS    XL8                                                              
CNMLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
CNMAGYNH DS    XL8                                                              
CNMAGYN  DS    CL16     5    2   16  A  P N             T        Y              
CNMCLINH DS    XL8                                                              
CNMCLIN  DS    CL16     5   20   16  A  P N             T        Y              
CNMCOMNH DS    XL8                                                              
CNMCOMN  DS    CL19     5   38   19  A  P N             T        Y              
CNMSECH  DS    XL8                                                              
CNMSEC   DS    CL4      5   58    4  A  P N             T        Y              
CNMCLPRH DS    XL8                                                              
CNMCLPR  DS    CL13     5   63   13  A  P N             T        Y              
CNMMEDNH DS    XL8                                                              
CNMMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
CNMAUTHH DS    XL8                                                              
CNMAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
CNMAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
CNMESTH  DS    XL8                                                              
CNMEST   DS    CL16     6   46   16  A  U N             T        Y   13         
CNMESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
CNMPDH   DS    XL8                                                              
CNMPD    DS    CL2      6   74    2  N  U N             T        Y   15         
CNMPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
CNMCYCH  DS    XL8                                                              
CNMCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
CNMCYCX  DS    XL8                                                              
CNMLCYCH DS    XL8                                                              
CNMLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
CNMDTLH  DS    XL8                                                              
CNMDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
CNMDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
CNMBNPH  DS    XL8                                                              
CNMBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
CNMBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
CNMEINVH DS    XL8                                                              
CNMEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
CNMEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
CNMHCOMH DS    XL8                                                              
CNMHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
CNMHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
CNMICOMH DS    XL8                                                              
CNMICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
CNMICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
CNMOPTH  DS    XL8                                                              
CNMOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
CNMOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
CNMOVLYH DS    XL8                                                              
CNMOVLY  DS    CL1     11    2    1  A  P N             T        Y              
CNMUSNMH DS    XL8                                                              
CNMUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL60    13    9   60  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
CNMLPAYH DS    XL8                                                              
CNMLPAY  DS    CL55    14    8   55  A  P N             T        Y              
CNMLCUTH DS    XL8                                                              
CNMLCUT  DS    CL3     14   66    3  A  P N             T        Y  106         
CNMLCUTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
CNM4WKH  DS    XL8                                                              
CNM4WK   DS    CL1     15   38    1  A  U N             T        Y  101         
CNM4WKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   40    1  N  P N             T        Y              
CNM8WKH  DS    XL8                                                              
CNM8WK   DS    CL1     15   45    1  A  U N             T        Y  102         
CNM8WKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   47    1  N  P N             T        Y              
CNM26WKH DS    XL8                                                              
CNM26WK  DS    CL1     15   53    1  A  U N             T        Y  103         
CNM26WKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   55    1  N  P N             T        Y              
CNM1YRH  DS    XL8                                                              
CNM1YR   DS    CL1     15   60    1  A  U N             T        Y  104         
CNM1YRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   62    1  N  P N             T        Y              
CNMCUTSH DS    XL8                                                              
CNMCUTS  DS    CL3     15   66    3  A  U N             T        Y  105         
CNMCUTSX DS    XL8                                                              
CNMTOTSH DS    XL8                                                              
CNMTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
CNMCMNTH DS    XL8                                                              
CNMCMNT  DS    CL60    24    2   60  A  P H             T        Y              
CNMDUEH  DS    XL8                                                              
CNMDUE   DS    CL14    24   67   14  A  P Z             T        Y              
CNMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CNMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1336 BYTES                            
