*          DATA SET TAPYS20D   AT LEVEL 002 AS OF 05/22/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F320D      DATE 05/22/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
EQYAGYH  DS    XL8                                                              
EQYAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
EQYAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
EQYINVH  DS    XL8                                                              
EQYINV   DS    CL6      4   28    6  A  U N             T        Y  144         
EQYINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
EQYCIDH  DS    XL8                                                              
EQYCID   DS    CL12     4   46   12  A  U N             T        Y   64         
EQYCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
EQYLFTH  DS    XL8                                                              
EQYLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
EQYLFTX  DS    XL8                                                              
EQYLIDH  DS    XL8                                                              
EQYLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
EQYAGYNH DS    XL8                                                              
EQYAGYN  DS    CL16     5    2   16  A  P N             T        Y              
EQYCLINH DS    XL8                                                              
EQYCLIN  DS    CL16     5   20   16  A  P N             T        Y              
EQYCOMNH DS    XL8                                                              
EQYCOMN  DS    CL19     5   38   19  A  P N             T        Y              
EQYSECH  DS    XL8                                                              
EQYSEC   DS    CL4      5   58    4  A  P N             T        Y              
EQYCLPRH DS    XL8                                                              
EQYCLPR  DS    CL13     5   63   13  A  P N             T        Y              
EQYMEDNH DS    XL8                                                              
EQYMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
EQYAUTHH DS    XL8                                                              
EQYAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
EQYAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
EQYESTH  DS    XL8                                                              
EQYEST   DS    CL16     6   46   16  A  U N             T        Y   13         
EQYESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
EQYPDH   DS    XL8                                                              
EQYPD    DS    CL2      6   74    2  N  U N             T        Y   15         
EQYPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
EQYCYCH  DS    XL8                                                              
EQYCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
EQYCYCX  DS    XL8                                                              
EQYLCYCH DS    XL8                                                              
EQYLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
EQYDTLH  DS    XL8                                                              
EQYDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
EQYDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
EQYBNPH  DS    XL8                                                              
EQYBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
EQYBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
EQYEINVH DS    XL8                                                              
EQYEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
EQYEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
EQYHCOMH DS    XL8                                                              
EQYHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
EQYHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
EQYICOMH DS    XL8                                                              
EQYICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
EQYICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
EQYOPTH  DS    XL8                                                              
EQYOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
EQYOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
EQYOVLYH DS    XL8                                                              
EQYOVLY  DS    CL1     11    2    1  A  P N             T        Y              
EQYUSNMH DS    XL8                                                              
EQYUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL32    13    9   32  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
EQYLPAYH DS    XL8                                                              
EQYLPAY  DS    CL57    14    8   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
EQY6MH   DS    XL8                                                              
EQY6M    DS    CL1     15   33    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   35    1  N  P N             T        Y              
EQY1YH   DS    XL8                                                              
EQY1Y    DS    CL1     15   38    1  A  U N             T        Y              
EQYTOTSH DS    XL8                                                              
EQYTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
EQYCMNTH DS    XL8                                                              
EQYCMNT  DS    CL60    24    2   60  A  P H             T        Y              
EQYDUEH  DS    XL8                                                              
EQYDUE   DS    CL14    24   67   14  A  P Z             T        Y              
EQYLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
EQYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1200 BYTES                            
