*          DATA SET TAPYS95D   AT LEVEL 001 AS OF 03/07/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F395D      DATE 03/07/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL76    11    2   76  A  P H             T        Y              
DTLFRSTH DS    XL8                                                              
DTLFRST  DS    CL1     12    8    1  A  U N             T        Y   41         
DTLFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   12    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   14   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   28   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
DTLDATAH DS    XL8                                                              
DTLDATA  DS    CL42    13    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    13   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14    8    1  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   12    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   14   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   28   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    15    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    15   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16    8    1  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   12    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   14   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   28   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    17    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    17   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18    8    1  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   12    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   14   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   28   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    19    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    19   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20    8    1  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   12    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   14   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   28   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    21    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    21   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22    8    1  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   12    1  N  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   14   10  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   26    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   28   10  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   39   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   50   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   61   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   74    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    23    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   45    4  A  P H             T        Y              
DTLLSTH  DS    XL8                                                              
DTLLST   DS    CL30    23   50   30  A  U N             T        Y   75         
DTLLSTX  DS    XL8                                                              
DTLCMNTH DS    XL8                                                              
DTLCMNT  DS    CL60    24    2   60  A  P H             T        Y              
DTLDUEH  DS    XL8                                                              
DTLDUE   DS    CL14    24   67   14  A  P H             T        Y              
DTLLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
DTLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
