*          DATA SET TAPYS5BD   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F35BD      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
CLAAGYH  DS    XL8                                                              
CLAAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
CLAAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
CLAINVH  DS    XL8                                                              
CLAINV   DS    CL6      4   28    6  A  U N             T        Y  144         
CLAINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
CLACIDH  DS    XL8                                                              
CLACID   DS    CL12     4   46   12  A  U N             T        Y   64         
CLACIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
CLALFTH  DS    XL8                                                              
CLALFT   DS    CL3      4   63    3  A  U N             T        Y   65         
CLALFTX  DS    XL8                                                              
CLALIDH  DS    XL8                                                              
CLALID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
CLAAGYNH DS    XL8                                                              
CLAAGYN  DS    CL16     5    2   16  A  P N             T        Y              
CLACLINH DS    XL8                                                              
CLACLIN  DS    CL16     5   20   16  A  P N             T        Y              
CLACOMNH DS    XL8                                                              
CLACOMN  DS    CL19     5   38   19  A  P N             T        Y              
CLASECH  DS    XL8                                                              
CLASEC   DS    CL4      5   58    4  A  P N             T        Y              
CLACLPRH DS    XL8                                                              
CLACLPR  DS    CL13     5   63   13  A  P N             T        Y              
CLAMEDNH DS    XL8                                                              
CLAMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
CLAAUTHH DS    XL8                                                              
CLAAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
CLAAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
CLAESTH  DS    XL8                                                              
CLAEST   DS    CL16     6   46   16  A  U N             T        Y   13         
CLAESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
CLAPDH   DS    XL8                                                              
CLAPD    DS    CL2      6   74    2  N  U N             T        Y   15         
CLAPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
CLACYCH  DS    XL8                                                              
CLACYC   DS    CL17     7   10   17  A  U N             T        Y   17         
CLACYCX  DS    XL8                                                              
CLALCYCH DS    XL8                                                              
CLALCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
CLADTLH  DS    XL8                                                              
CLADTL   DS    CL1      7   46    1  A  U N             T        Y   18         
CLADTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
CLABNPH  DS    XL8                                                              
CLABNP   DS    CL1      7   59    1  A  U N             T        Y   19         
CLABNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
CLAEINVH DS    XL8                                                              
CLAEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
CLAEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
CLAHCOMH DS    XL8                                                              
CLAHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
CLAHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
CLAICOMH DS    XL8                                                              
CLAICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
CLAICOMX DS    XL8                                                              
CLAHG13H DS    XL8                                                              
CLAHG13  DS    CL7      9   71    7  A  P N             T        Y              
CLAG13H  DS    XL8                                                              
CLAG13   DS    CL1      9   79    1  A  U N             T        Y   29         
CLAG13X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
CLAOPTH  DS    XL8                                                              
CLAOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
CLAOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
CLAOVLYH DS    XL8                                                              
CLAOVLY  DS    CL1     10   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    11    4   34  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL34    11   45   34  A  P H             T        Y              
CLAFRSTH DS    XL8                                                              
CLAFRST  DS    CL1     12    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     12    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     12   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     13    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     13   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     14    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     14   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     15    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     15   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     16   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    17   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    17   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     18   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     19   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     20   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21    4    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    21   14   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   36    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   43    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21   45    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    21   55   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   73    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   77    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22    2    9  A  P H             T        Y              
CLALSTIH DS    XL8                                                              
CLALSTI  DS    CL6     22   12    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   19    5  A  P H             T        Y              
CLALSTCH DS    XL8                                                              
CLALSTC  DS    CL17    22   25   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   43    9  A  P H             T        Y              
CLALSTUH DS    XL8                                                              
CLALSTU  DS    CL3     22   53    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   57    8  A  P H             T        Y              
CLALSTLH DS    XL8                                                              
CLALSTL  DS    CL3     22   66    3  A  P N             T        Y              
CLAHLSGH DS    XL8                                                              
CLAHLSG  DS    CL7     22   70    7  A  P H             T        Y              
CLALSTGH DS    XL8                                                              
CLALSTG  DS    CL1     22   78    1  A  P N             T        Y              
CLATOTSH DS    XL8                                                              
CLATOTS  DS    CL53    23    2   53  A  P Z             T        Y              
CLACMNTH DS    XL8                                                              
CLACMNT  DS    CL60    24    2   60  A  P H             T        Y              
CLADUEH  DS    XL8                                                              
CLADUE   DS    CL14    24   67   14  A  P Z             T        Y              
CLALAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CLAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2600 BYTES                            
