*          DATA SET TAPYS17D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F317D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
DIOAGYH  DS    XL8                                                              
DIOAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
DIOAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
DIOINVH  DS    XL8                                                              
DIOINV   DS    CL6      4   28    6  A  U N             T        Y  144         
DIOINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
DIOCIDH  DS    XL8                                                              
DIOCID   DS    CL12     4   46   12  A  U N             T        Y   64         
DIOCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
DIOLFTH  DS    XL8                                                              
DIOLFT   DS    CL3      4   63    3  A  U N             T        Y   66         
DIOLFTX  DS    XL8                                                              
DIOLIDH  DS    XL8                                                              
DIOLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
DIOAGYNH DS    XL8                                                              
DIOAGYN  DS    CL16     5    2   16  A  P N             T        Y              
DIOCLINH DS    XL8                                                              
DIOCLIN  DS    CL16     5   20   16  A  P N             T        Y              
DIOCOMNH DS    XL8                                                              
DIOCOMN  DS    CL19     5   38   19  A  P N             T        Y              
DIOSECH  DS    XL8                                                              
DIOSEC   DS    CL4      5   58    4  A  P N             T        Y              
DIOCLPRH DS    XL8                                                              
DIOCLPR  DS    CL13     5   63   13  A  P N             T        Y              
DIOMEDNH DS    XL8                                                              
DIOMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DIOAUTHH DS    XL8                                                              
DIOAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
DIOAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
DIOESTH  DS    XL8                                                              
DIOEST   DS    CL16     6   46   16  A  U N             T        Y   13         
DIOESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
DIOPDH   DS    XL8                                                              
DIOPD    DS    CL2      6   74    2  N  U N             T        Y   15         
DIOPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
DIOCYCH  DS    XL8                                                              
DIOCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
DIOCYCX  DS    XL8                                                              
DIOLCYCH DS    XL8                                                              
DIOLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
DIOBNPH  DS    XL8                                                              
DIOBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
DIOBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
DIOEINVH DS    XL8                                                              
DIOEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
DIOEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
DIOHCOMH DS    XL8                                                              
DIOHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
DIOHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
DIOICOMH DS    XL8                                                              
DIOICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
DIOICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
DIOOPTH  DS    XL8                                                              
DIOOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
DIOOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P H             T        Y              
DIOFRSTH DS    XL8                                                              
DIOFRST  DS    CL2     12    3    2  A  U N             T        Y   49         
DIOFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     12    9    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     12   18    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   29    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
DIODATAH DS    XL8                                                              
DIODATA  DS    CL47    13    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    13   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14    3    2  A  U N             T        Y   49         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14    9    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14   18    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   29    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    15    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    15   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    3    2  A  U N             T        Y   49         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16    9    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16   18    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   29    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    17    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    3    2  A  U N             T        Y   49         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    9    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18   18    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   29    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    19    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    19   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    3    2  A  U N             T        Y   49         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    9    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20   18    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   29    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    21    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    21   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22    3    2  A  U N             T        Y   49         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     22    9    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     22   18    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   29    1  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    23    2   47  A  P N             T        Y              
DIOLSTH  DS    XL8                                                              
DIOLST   DS    CL30    23   50   30  A  U N             T        Y   73         
DIOLSTX  DS    XL8                                                              
DIOCMNTH DS    XL8                                                              
DIOCMNT  DS    CL60    24    2   60  A  P H             T        Y              
DIODUEH  DS    XL8                                                              
DIODUE   DS    CL14    24   67   14  A  P Z             T        Y              
DIOLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
DIOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2808 BYTES                            
