*          DATA SET TAPYS64D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F364D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ADTAGYH  DS    XL8                                                              
ADTAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
ADTAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
ADTINVH  DS    XL8                                                              
ADTINV   DS    CL6      4   28    6  A  U N             T        Y  144         
ADTINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
ADTCIDH  DS    XL8                                                              
ADTCID   DS    CL12     4   46   12  A  U N             T        Y   64         
ADTCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
ADTLFTH  DS    XL8                                                              
ADTLFT   DS    CL3      4   63    3  A  U N             T        Y   66         
ADTLFTX  DS    XL8                                                              
ADTLIDH  DS    XL8                                                              
ADTLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
ADTAGYNH DS    XL8                                                              
ADTAGYN  DS    CL16     5    2   16  A  P N             T        Y              
ADTCLINH DS    XL8                                                              
ADTCLIN  DS    CL16     5   20   16  A  P N             T        Y              
ADTCOMNH DS    XL8                                                              
ADTCOMN  DS    CL19     5   38   19  A  P N             T        Y              
ADTSECH  DS    XL8                                                              
ADTSEC   DS    CL4      5   58    4  A  P N             T        Y              
ADTCLPRH DS    XL8                                                              
ADTCLPR  DS    CL13     5   63   13  A  P N             T        Y              
ADTMEDNH DS    XL8                                                              
ADTMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
ADTAUTHH DS    XL8                                                              
ADTAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
ADTAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
ADTESTH  DS    XL8                                                              
ADTEST   DS    CL16     6   46   16  A  U N             T        Y   13         
ADTESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
ADTPDH   DS    XL8                                                              
ADTPD    DS    CL2      6   74    2  N  U N             T        Y   15         
ADTPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
ADTCYCH  DS    XL8                                                              
ADTCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
ADTCYCX  DS    XL8                                                              
ADTLCYCH DS    XL8                                                              
ADTLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
ADTBNPH  DS    XL8                                                              
ADTBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
ADTBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
ADTEINVH DS    XL8                                                              
ADTEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
ADTEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
ADTHCOMH DS    XL8                                                              
ADTHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
ADTHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
ADTICOMH DS    XL8                                                              
ADTICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
ADTICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
ADTOPTH  DS    XL8                                                              
ADTOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
ADTOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   11   17  A  P H             T        Y              
ADTHTY1H DS    XL8                                                              
ADTHTY1  DS    CL5     11   38    5  A  P H             T        Y              
ADTHTY2H DS    XL8                                                              
ADTHTY2  DS    CL5     11   45    5  A  P H             T        Y              
ADTHTY3H DS    XL8                                                              
ADTHTY3  DS    CL5     11   52    5  A  P H             T        Y              
ADTHTY4H DS    XL8                                                              
ADTHTY4  DS    CL5     11   59    5  A  P H             T        Y              
ADTHTY5H DS    XL8                                                              
ADTHTY5  DS    CL5     11   66    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     12    2    5  A  P H             T        Y              
ADTLPAYH DS    XL8                                                              
ADTLPAY  DS    CL24    12   10   24  A  P N             T        Y              
ADTLTY1H DS    XL8                                                              
ADTLTY1  DS    CL1     12   40    1  A  P N             T        Y              
ADTLTY2H DS    XL8                                                              
ADTLTY2  DS    CL1     12   47    1  A  P N             T        Y              
ADTLTY3H DS    XL8                                                              
ADTLTY3  DS    CL1     12   54    1  A  P N             T        Y              
ADTLTY4H DS    XL8                                                              
ADTLTY4  DS    CL1     12   61    1  A  P N             T        Y              
ADTLTY5H DS    XL8                                                              
ADTLTY5  DS    CL1     12   68    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P H             T        Y              
ADTTTY1H DS    XL8                                                              
ADTTTY1  DS    CL1     13   40    1  A  P N             T        Y  101         
ADTTTY1X DS    XL8                                                              
ADTTTY2H DS    XL8                                                              
ADTTTY2  DS    CL1     13   47    1  A  P N             T        Y  102         
ADTTTY2X DS    XL8                                                              
ADTTTY3H DS    XL8                                                              
ADTTTY3  DS    CL1     13   54    1  A  P N             T        Y  103         
ADTTTY3X DS    XL8                                                              
ADTTTY4H DS    XL8                                                              
ADTTTY4  DS    CL1     13   61    1  A  P N             T        Y  105         
ADTTTY4X DS    XL8                                                              
ADTTTY5H DS    XL8                                                              
ADTTTY5  DS    CL1     13   68    1  A  P N             T        Y  104         
ADTTTY5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P H             T        Y              
ADTFRSTH DS    XL8                                                              
ADTFRST  DS    CL2     16    2    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    5    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    8    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   11    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   26    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   29    1  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   76    4  N  U N             T        Y              
ADTDATAH DS    XL8                                                              
ADTDATA  DS    CL47    17    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    5    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    8    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   11    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   26    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   29    1  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   76    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    19    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    19   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    5    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    8    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   11    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   26    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   29    1  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   76    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    21    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    21   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    2    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    5    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    8    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   11    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   14    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   20    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   26    2  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   29    1  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   76    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL47    23    2   47  A  P N             T        Y              
ADTLSTH  DS    XL8                                                              
ADTLST   DS    CL30    23   50   30  A  U N             T        Y              
ADTCMNTH DS    XL8                                                              
ADTCMNT  DS    CL60    24    2   60  A  P H             T        Y              
ADTDUEH  DS    XL8                                                              
ADTDUE   DS    CL14    24   67   14  A  P Z             T        Y              
ADTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ADTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2328 BYTES                            
