*          DATA SET TAPYS70D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F370D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
DEMAGYH  DS    XL8                                                              
DEMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
DEMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
DEMINVH  DS    XL8                                                              
DEMINV   DS    CL6      4   28    6  A  U N             T        Y  144         
DEMINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
DEMCIDH  DS    XL8                                                              
DEMCID   DS    CL12     4   46   12  A  U N             T        Y   64         
DEMCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
DEMLFTH  DS    XL8                                                              
DEMLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
DEMLFTX  DS    XL8                                                              
DEMLIDH  DS    XL8                                                              
DEMLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
DEMAGYNH DS    XL8                                                              
DEMAGYN  DS    CL16     5    2   16  A  P N             T        Y              
DEMCLINH DS    XL8                                                              
DEMCLIN  DS    CL16     5   20   16  A  P N             T        Y              
DEMCOMNH DS    XL8                                                              
DEMCOMN  DS    CL19     5   38   19  A  P N             T        Y              
DEMSECH  DS    XL8                                                              
DEMSEC   DS    CL4      5   58    4  A  P N             T        Y              
DEMCLPRH DS    XL8                                                              
DEMCLPR  DS    CL13     5   63   13  A  P N             T        Y              
DEMMEDNH DS    XL8                                                              
DEMMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DEMAUTHH DS    XL8                                                              
DEMAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
DEMAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
DEMESTH  DS    XL8                                                              
DEMEST   DS    CL16     6   46   16  A  U N             T        Y   13         
DEMESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
DEMPDH   DS    XL8                                                              
DEMPD    DS    CL2      6   74    2  N  U N             T        Y   15         
DEMPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
DEMCYCH  DS    XL8                                                              
DEMCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
DEMCYCX  DS    XL8                                                              
DEMLCYCH DS    XL8                                                              
DEMLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
DEMDTLH  DS    XL8                                                              
DEMDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
DEMDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
DEMBNPH  DS    XL8                                                              
DEMBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
DEMBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
DEMEINVH DS    XL8                                                              
DEMEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
DEMEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
DEMHCOMH DS    XL8                                                              
DEMHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
DEMHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
DEMICOMH DS    XL8                                                              
DEMICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
DEMICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
DEMOPTH  DS    XL8                                                              
DEMOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
DEMOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
DEMOVLYH DS    XL8                                                              
DEMOVLY  DS    CL1     11    2    1  A  P N             T        Y              
DEMUSNMH DS    XL8                                                              
DEMUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL32    13   11   32  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
DEMLPAYH DS    XL8                                                              
DEMLPAY  DS    CL24    14   10   24  A  P N             T        Y              
DEMLDEMH DS    XL8                                                              
DEMLDEM  DS    CL3     14   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
DEMDEMOH DS    XL8                                                              
DEMDEMO  DS    CL3     15   39    3  N  U N             T        Y  106         
DEMDEMOX DS    XL8                                                              
DEMTOTSH DS    XL8                                                              
DEMTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
DEMCMNTH DS    XL8                                                              
DEMCMNT  DS    CL60    24    2   60  A  P H             T        Y              
DEMDUEH  DS    XL8                                                              
DEMDUE   DS    CL14    24   67   14  A  P Z             T        Y              
DEMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1168 BYTES                            
