*          DATA SET TAPYS1FD   AT LEVEL 002 AS OF 05/16/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F31FD      DATE 05/16/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
VRETAGH  DS    XL8                                                              
VRETAG   DS    CL6      4    2    6  A  P H             T        Y              
VREAGYH  DS    XL8                                                              
VREAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
VREAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
VREINVH  DS    XL8                                                              
VREINV   DS    CL6      4   28    6  A  U N             T        Y  144         
VREINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
VRECIDH  DS    XL8                                                              
VRECID   DS    CL12     4   46   12  A  U N             T        Y   64         
VRECIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
VRELFTH  DS    XL8                                                              
VRELFT   DS    CL3      4   63    3  A  U N             T        Y   65         
VRELFTX  DS    XL8                                                              
VRELIDH  DS    XL8                                                              
VRELID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
VREAGYNH DS    XL8                                                              
VREAGYN  DS    CL16     5    2   16  A  P N             T        Y              
VRECLINH DS    XL8                                                              
VRECLIN  DS    CL16     5   20   16  A  P N             T        Y              
VRECOMNH DS    XL8                                                              
VRECOMN  DS    CL19     5   38   19  A  P N             T        Y              
VRESECH  DS    XL8                                                              
VRESEC   DS    CL4      5   58    4  A  P N             T        Y              
VRECLPRH DS    XL8                                                              
VRECLPR  DS    CL13     5   63   13  A  P N             T        Y              
VREMEDNH DS    XL8                                                              
VREMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
VREAUTHH DS    XL8                                                              
VREAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
VREAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
VREESTH  DS    XL8                                                              
VREEST   DS    CL16     6   46   16  A  U N             T        Y   13         
VREESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
VREPDH   DS    XL8                                                              
VREPD    DS    CL2      6   74    2  N  U N             T        Y   15         
VREPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
VRECYCH  DS    XL8                                                              
VRECYC   DS    CL17     7   10   17  A  U N             T        Y   17         
VRECYCX  DS    XL8                                                              
VRELCYCH DS    XL8                                                              
VRELCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
VREDTLH  DS    XL8                                                              
VREDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
VREDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
VREBNPH  DS    XL8                                                              
VREBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
VREBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
VREEINVH DS    XL8                                                              
VREEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
VREEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
VREHCOMH DS    XL8                                                              
VREHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
VREHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
VREICOMH DS    XL8                                                              
VREICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
VREICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
VREOPTH  DS    XL8                                                              
VREOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
VREOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
VREOVLYH DS    XL8                                                              
VREOVLY  DS    CL1     10   80    1  A  P N             T        Y              
VREUSNMH DS    XL8                                                              
VREUSNM  DS    CL16    11   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P H             T        Y              
VREVERH  DS    XL8                                                              
VREVER   DS    CL66    12   14   66  A  U N             T        Y  101         
VREVERX  DS    XL8                                                              
VRETOTSH DS    XL8                                                              
VRETOTS  DS    CL53    13    2   53  A  P Z             T        Y              
VRECMNTH DS    XL8                                                              
VRECMNT  DS    CL60    24    2   60  A  P H             T        Y              
VREDUEH  DS    XL8                                                              
VREDUE   DS    CL14    24   67   14  A  P Z             T        Y              
VRELAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
VREWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1136 BYTES                            
