*          DATA SET TAPYS62D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F362D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
FGMAGYH  DS    XL8                                                              
FGMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
FGMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
FGMINVH  DS    XL8                                                              
FGMINV   DS    CL6      4   28    6  A  U N             T        Y  144         
FGMINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
FGMCIDH  DS    XL8                                                              
FGMCID   DS    CL12     4   46   12  A  U N             T        Y   64         
FGMCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
FGMLFTH  DS    XL8                                                              
FGMLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
FGMLFTX  DS    XL8                                                              
FGMLIDH  DS    XL8                                                              
FGMLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
FGMAGYNH DS    XL8                                                              
FGMAGYN  DS    CL16     5    2   16  A  P N             T        Y              
FGMCLINH DS    XL8                                                              
FGMCLIN  DS    CL16     5   20   16  A  P N             T        Y              
FGMCOMNH DS    XL8                                                              
FGMCOMN  DS    CL19     5   38   19  A  P N             T        Y              
FGMSECH  DS    XL8                                                              
FGMSEC   DS    CL4      5   58    4  A  P N             T        Y              
FGMCLPRH DS    XL8                                                              
FGMCLPR  DS    CL13     5   63   13  A  P N             T        Y              
FGMMEDNH DS    XL8                                                              
FGMMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
FGMAUTHH DS    XL8                                                              
FGMAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
FGMAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
FGMESTH  DS    XL8                                                              
FGMEST   DS    CL16     6   46   16  A  U N             T        Y   13         
FGMESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
FGMPDH   DS    XL8                                                              
FGMPD    DS    CL2      6   74    2  N  U N             T        Y   15         
FGMPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
FGMCYCH  DS    XL8                                                              
FGMCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
FGMCYCX  DS    XL8                                                              
FGMLCYCH DS    XL8                                                              
FGMLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
FGMDTLH  DS    XL8                                                              
FGMDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
FGMDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
FGMBNPH  DS    XL8                                                              
FGMBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
FGMBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
FGMEINVH DS    XL8                                                              
FGMEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
FGMEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
FGMHCOMH DS    XL8                                                              
FGMHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
FGMHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
FGMICOMH DS    XL8                                                              
FGMICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
FGMICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
FGMOPTH  DS    XL8                                                              
FGMOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
FGMOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
FGMOVLYH DS    XL8                                                              
FGMOVLY  DS    CL1     11    2    1  A  P N             T        Y              
FGMUSNMH DS    XL8                                                              
FGMUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL47    13   33   47  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL70    14    9   70  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
FGMLPAYH DS    XL8                                                              
FGMLPAY  DS    CL70    15    8   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  P H             T        Y              
FGMUK12H DS    XL8                                                              
FGMUK12  DS    CL1     16   35    1  A  U N             T        Y  101         
FGMUK12X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   37    1  N  P N             T        Y              
FGMUK24H DS    XL8                                                              
FGMUK24  DS    CL1     16   43    1  A  U N             T        Y  102         
FGMUK24X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   45    1  N  P N             T        Y              
FGMNE12H DS    XL8                                                              
FGMNE12  DS    CL1     16   52    1  A  U N             T        Y  103         
FGMNE12X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   54    1  N  P N             T        Y              
FGMNE24H DS    XL8                                                              
FGMNE24  DS    CL1     16   60    1  A  U N             T        Y  104         
FGMNE24X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   62    1  N  P N             T        Y              
FGMWO12H DS    XL8                                                              
FGMWO12  DS    CL1     16   69    1  A  U N             T        Y  105         
FGMWO12X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   71    1  N  P N             T        Y              
FGMWO24H DS    XL8                                                              
FGMWO24  DS    CL1     16   77    1  A  U N             T        Y  106         
FGMWO24X DS    XL8                                                              
FGMTOTSH DS    XL8                                                              
FGMTOTS  DS    CL53    18    2   53  A  P Z             T        Y              
FGMCMNTH DS    XL8                                                              
FGMCMNT  DS    CL60    24    2   60  A  P H             T        Y              
FGMDUEH  DS    XL8                                                              
FGMDUE   DS    CL14    24   67   14  A  P Z             T        Y              
FGMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
FGMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1424 BYTES                            
