*          DATA SET TAPYS65D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F365D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ADOAGYH  DS    XL8                                                              
ADOAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
ADOAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
ADOINVH  DS    XL8                                                              
ADOINV   DS    CL6      4   28    6  A  U N             T        Y  144         
ADOINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
ADOCIDH  DS    XL8                                                              
ADOCID   DS    CL12     4   46   12  A  U N             T        Y   64         
ADOCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
ADOLFTH  DS    XL8                                                              
ADOLFT   DS    CL3      4   63    3  A  U N             T        Y   66         
ADOLFTX  DS    XL8                                                              
ADOLIDH  DS    XL8                                                              
ADOLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
ADOAGYNH DS    XL8                                                              
ADOAGYN  DS    CL16     5    2   16  A  P N             T        Y              
ADOCLINH DS    XL8                                                              
ADOCLIN  DS    CL16     5   20   16  A  P N             T        Y              
ADOCOMNH DS    XL8                                                              
ADOCOMN  DS    CL19     5   38   19  A  P N             T        Y              
ADOSECH  DS    XL8                                                              
ADOSEC   DS    CL4      5   58    4  A  P N             T        Y              
ADOCLPRH DS    XL8                                                              
ADOCLPR  DS    CL13     5   63   13  A  P N             T        Y              
ADOMEDNH DS    XL8                                                              
ADOMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
ADOAUTHH DS    XL8                                                              
ADOAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
ADOAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
ADOESTH  DS    XL8                                                              
ADOEST   DS    CL16     6   46   16  A  U N             T        Y   13         
ADOESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
ADOPDH   DS    XL8                                                              
ADOPD    DS    CL2      6   74    2  N  U N             T        Y   15         
ADOPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
ADOCYCH  DS    XL8                                                              
ADOCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
ADOCYCX  DS    XL8                                                              
ADOLCYCH DS    XL8                                                              
ADOLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
ADOBNPH  DS    XL8                                                              
ADOBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
ADOBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
ADOEINVH DS    XL8                                                              
ADOEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
ADOEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
ADOHCOMH DS    XL8                                                              
ADOHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
ADOHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
ADOICOMH DS    XL8                                                              
ADOICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
ADOICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
ADOOPTH  DS    XL8                                                              
ADOOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
ADOOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   11   17  A  P H             T        Y              
ADOHTY1H DS    XL8                                                              
ADOHTY1  DS    CL5     11   38    5  A  P H             T        Y              
ADOHTY2H DS    XL8                                                              
ADOHTY2  DS    CL5     11   45    5  A  P H             T        Y              
ADOHTY3H DS    XL8                                                              
ADOHTY3  DS    CL5     11   52    5  A  P H             T        Y              
ADOHTY4H DS    XL8                                                              
ADOHTY4  DS    CL5     11   59    5  A  P H             T        Y              
ADOHTY5H DS    XL8                                                              
ADOHTY5  DS    CL5     11   66    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     12    2    5  A  P H             T        Y              
ADOLPAYH DS    XL8                                                              
ADOLPAY  DS    CL24    12   10   24  A  P N             T        Y              
ADOLTY1H DS    XL8                                                              
ADOLTY1  DS    CL1     12   40    1  A  P N             T        Y              
ADOLTY2H DS    XL8                                                              
ADOLTY2  DS    CL1     12   47    1  A  P N             T        Y              
ADOLTY3H DS    XL8                                                              
ADOLTY3  DS    CL1     12   54    1  A  P N             T        Y              
ADOLTY4H DS    XL8                                                              
ADOLTY4  DS    CL1     12   61    1  A  P N             T        Y              
ADOLTY5H DS    XL8                                                              
ADOLTY5  DS    CL1     12   68    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P H             T        Y              
ADOTTY1H DS    XL8                                                              
ADOTTY1  DS    CL1     13   40    1  A  P N             T        Y  101         
ADOTTY1X DS    XL8                                                              
ADOTTY2H DS    XL8                                                              
ADOTTY2  DS    CL1     13   47    1  A  P N             T        Y  102         
ADOTTY2X DS    XL8                                                              
ADOTTY3H DS    XL8                                                              
ADOTTY3  DS    CL1     13   54    1  A  P N             T        Y  103         
ADOTTY3X DS    XL8                                                              
ADOTTY4H DS    XL8                                                              
ADOTTY4  DS    CL1     13   61    1  A  P N             T        Y  105         
ADOTTY4X DS    XL8                                                              
ADOTTY5H DS    XL8                                                              
ADOTTY5  DS    CL1     13   68    1  A  P N             T        Y  104         
ADOTTY5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P H             T        Y              
ADOFRSTH DS    XL8                                                              
ADOFRST  DS    CL2     16    2    2  N  U N             T        Y   51         
ADOFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16   11    2  N  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   15    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   17   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   29    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
ADODATAH DS    XL8                                                              
ADODATA  DS    CL42    17    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    17   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    2    2  N  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   11    2  N  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   15    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   17   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   29    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    19    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    19   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    2    2  N  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   11    2  N  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   15    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   17   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   29    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    21    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   45    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30    21   50   30  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22    2    2  N  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     22    5    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   11    2  N  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   15    1  N  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   17   10  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   29    1  N  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   31   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   42   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   53   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   64   10  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   76    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    23    2   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   45    4  A  P H             T        Y              
ADOLSTH  DS    XL8                                                              
ADOLST   DS    CL30    23   50   30  A  U N             T        Y   75         
ADOLSTX  DS    XL8                                                              
ADOCMNTH DS    XL8                                                              
ADOCMNT  DS    CL60    24    2   60  A  P H             T        Y              
ADODUEH  DS    XL8                                                              
ADODUE   DS    CL14    24   67   14  A  P Z             T        Y              
ADOLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ADOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2672 BYTES                            
