*          DATA SET TAPYS13D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F313D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
LFTAGYH  DS    XL8                                                              
LFTAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
LFTAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
LFTINVH  DS    XL8                                                              
LFTINV   DS    CL6      4   28    6  A  U N             T        Y  144         
LFTINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
LFTCIDH  DS    XL8                                                              
LFTCID   DS    CL12     4   46   12  A  U N             T        Y   64         
LFTCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
LFTLFTH  DS    XL8                                                              
LFTLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
LFTLFTX  DS    XL8                                                              
LFTLIDH  DS    XL8                                                              
LFTLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
LFTAGYNH DS    XL8                                                              
LFTAGYN  DS    CL16     5    2   16  A  P N             T        Y              
LFTCLINH DS    XL8                                                              
LFTCLIN  DS    CL16     5   20   16  A  P N             T        Y              
LFTCOMNH DS    XL8                                                              
LFTCOMN  DS    CL19     5   38   19  A  P N             T        Y              
LFTSECH  DS    XL8                                                              
LFTSEC   DS    CL4      5   58    4  A  P N             T        Y              
LFTCLPRH DS    XL8                                                              
LFTCLPR  DS    CL13     5   63   13  A  P N             T        Y              
LFTMEDNH DS    XL8                                                              
LFTMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
LFTAUTHH DS    XL8                                                              
LFTAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
LFTAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
LFTESTH  DS    XL8                                                              
LFTEST   DS    CL16     6   46   16  A  U N             T        Y   13         
LFTESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
LFTPDH   DS    XL8                                                              
LFTPD    DS    CL2      6   74    2  N  U N             T        Y   15         
LFTPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
LFTCYCH  DS    XL8                                                              
LFTCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
LFTCYCX  DS    XL8                                                              
LFTLCYCH DS    XL8                                                              
LFTLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
LFTDTLH  DS    XL8                                                              
LFTDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
LFTDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
LFTBNPH  DS    XL8                                                              
LFTBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
LFTBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
LFTEINVH DS    XL8                                                              
LFTEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
LFTEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
LFTHCOMH DS    XL8                                                              
LFTHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
LFTHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
LFTICOMH DS    XL8                                                              
LFTICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
LFTICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
LFTOPTH  DS    XL8                                                              
LFTOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
LFTOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
LFTOVLYH DS    XL8                                                              
LFTOVLY  DS    CL1     11    2    1  A  P N             T        Y              
LFTUSNMH DS    XL8                                                              
LFTUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL55    13    9   55  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
LFTLPAYH DS    XL8                                                              
LFTLPAY  DS    CL26    14    8   26  A  P N             T        Y              
LFTLFFCH DS    XL8                                                              
LFTLFFC  DS    CL1     14   40    1  A  U N             T        Y              
LFTLNFFH DS    XL8                                                              
LFTLNFF  DS    CL1     14   55    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
LFTFFCH  DS    XL8                                                              
LFTFFC   DS    CL1     15   40    1  A  U N             T        Y  101         
LFTFFCX  DS    XL8                                                              
LFTNFFCH DS    XL8                                                              
LFTNFFC  DS    CL1     15   55    1  A  U N             T        Y  102         
LFTNFFCX DS    XL8                                                              
LFTTOTSH DS    XL8                                                              
LFTTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
LFTCMNTH DS    XL8                                                              
LFTCMNT  DS    CL60    24    2   60  A  P H             T        Y              
LFTDUEH  DS    XL8                                                              
LFTDUE   DS    CL14    24   67   14  A  P Z             T        Y              
LFTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
LFTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1216 BYTES                            
