*          DATA SET TAPYS5CD   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F35CD      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
LOCAGYH  DS    XL8                                                              
LOCAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
LOCAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
LOCINVH  DS    XL8                                                              
LOCINV   DS    CL6      4   28    6  A  U N             T        Y  144         
LOCINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
LOCCIDH  DS    XL8                                                              
LOCCID   DS    CL12     4   46   12  A  U N             T        Y   64         
LOCCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
LOCLFTH  DS    XL8                                                              
LOCLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
LOCLFTX  DS    XL8                                                              
LOCLIDH  DS    XL8                                                              
LOCLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
LOCAGYNH DS    XL8                                                              
LOCAGYN  DS    CL16     5    2   16  A  P N             T        Y              
LOCCLINH DS    XL8                                                              
LOCCLIN  DS    CL16     5   20   16  A  P N             T        Y              
LOCCOMNH DS    XL8                                                              
LOCCOMN  DS    CL19     5   38   19  A  P N             T        Y              
LOCSECH  DS    XL8                                                              
LOCSEC   DS    CL4      5   58    4  A  P N             T        Y              
LOCCLPRH DS    XL8                                                              
LOCCLPR  DS    CL13     5   63   13  A  P N             T        Y              
LOCMEDNH DS    XL8                                                              
LOCMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
LOCAUTHH DS    XL8                                                              
LOCAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
LOCAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
LOCESTH  DS    XL8                                                              
LOCEST   DS    CL16     6   46   16  A  U N             T        Y   13         
LOCESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
LOCPDH   DS    XL8                                                              
LOCPD    DS    CL2      6   74    2  N  U N             T        Y   15         
LOCPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
LOCCYCH  DS    XL8                                                              
LOCCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
LOCCYCX  DS    XL8                                                              
LOCLCYCH DS    XL8                                                              
LOCLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
LOCDTLH  DS    XL8                                                              
LOCDTL   DS    CL1      7   46    1  A  U N             T        Y   18         
LOCDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
LOCBNPH  DS    XL8                                                              
LOCBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
LOCBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
LOCEINVH DS    XL8                                                              
LOCEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
LOCEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
LOCHCOMH DS    XL8                                                              
LOCHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
LOCHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
LOCICOMH DS    XL8                                                              
LOCICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
LOCICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
LOCOPTH  DS    XL8                                                              
LOCOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
LOCOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
LOCOVLYH DS    XL8                                                              
LOCOVLY  DS    CL1     11    2    1  A  P N             T        Y              
LOCUSNMH DS    XL8                                                              
LOCUSNM  DS    CL16    12   32   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL41    13    9   41  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P H             T        Y              
LOCLPAYH DS    XL8                                                              
LOCLPAY  DS    CL42    14    8   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15    2    5  A  P H             T        Y              
LOCBH    DS    XL8                                                              
LOCB     DS    CL1     15   36    1  A  U N             T        Y  101         
LOCBX    DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   38    1  N  P N             T        Y              
LOCBNYH  DS    XL8                                                              
LOCBNY   DS    CL1     15   42    1  A  U N             T        Y  102         
LOCBNYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   44    1  N  P N             T        Y              
LOCCH    DS    XL8                                                              
LOCC     DS    CL1     15   49    1  A  U N             T        Y  103         
LOCCX    DS    XL8                                                              
LOCTOTSH DS    XL8                                                              
LOCTOTS  DS    CL53    17    2   53  A  P Z             T        Y              
LOCCMNTH DS    XL8                                                              
LOCCMNT  DS    CL60    24    2   60  A  P H             T        Y              
LOCDUEH  DS    XL8                                                              
LOCDUE   DS    CL14    24   67   14  A  P Z             T        Y              
LOCLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
LOCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1232 BYTES                            
