*          DATA SET TAPYS72D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F372D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
PNHAGYH  DS    XL8                                                              
PNHAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
PNHAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
PNHINVH  DS    XL8                                                              
PNHINV   DS    CL6      4   28    6  A  U N             T        Y  144         
PNHINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
PNHCIDH  DS    XL8                                                              
PNHCID   DS    CL12     4   46   12  A  U N             T        Y   64         
PNHCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
PNHLFTH  DS    XL8                                                              
PNHLFT   DS    CL3      4   63    3  A  U N             T        Y   66         
PNHLFTX  DS    XL8                                                              
PNHLIDH  DS    XL8                                                              
PNHLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
PNHAGYNH DS    XL8                                                              
PNHAGYN  DS    CL16     5    2   16  A  P N             T        Y              
PNHCLINH DS    XL8                                                              
PNHCLIN  DS    CL16     5   20   16  A  P N             T        Y              
PNHCOMNH DS    XL8                                                              
PNHCOMN  DS    CL19     5   38   19  A  P N             T        Y              
PNHSECH  DS    XL8                                                              
PNHSEC   DS    CL4      5   58    4  A  P N             T        Y              
PNHCLPRH DS    XL8                                                              
PNHCLPR  DS    CL13     5   63   13  A  P N             T        Y              
PNHMEDNH DS    XL8                                                              
PNHMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PNHAUTHH DS    XL8                                                              
PNHAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
PNHAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
PNHESTH  DS    XL8                                                              
PNHEST   DS    CL16     6   46   16  A  U N             T        Y   13         
PNHESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
PNHPDH   DS    XL8                                                              
PNHPD    DS    CL2      6   74    2  N  U N             T        Y   15         
PNHPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
PNHCYCH  DS    XL8                                                              
PNHCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
PNHCYCX  DS    XL8                                                              
PNHLCYCH DS    XL8                                                              
PNHLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
PNHBNPH  DS    XL8                                                              
PNHBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
PNHBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
PNHEINVH DS    XL8                                                              
PNHEINV  DS    CL6      7   74    6  A  U N             T        Y   21         
PNHEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
PNHHCOMH DS    XL8                                                              
PNHHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
PNHHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
PNHICOMH DS    XL8                                                              
PNHICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
PNHICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PNHOPTH  DS    XL8                                                              
PNHOPT   DS    CL60    10   10   60  A  U N             T        Y   25         
PNHOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL29    11   38   29  A  P H             T        Y              
PNHFRSTH DS    XL8                                                              
PNHFRST  DS    CL1     12   38    1  A  U N             T        Y   65         
PNHFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   50   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   63    4  N  U N             T        Y   73         
         DS    XL8                                                              
PNHDATAH DS    XL8                                                              
PNHDATA  DS    CL47    13    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    13   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   38    1  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   50   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   63    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    15    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    15   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   38    1  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   50   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   63    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    17    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   38    1  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   50   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   63    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    19    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    19   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   38    1  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   50   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   63    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    21    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    21   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   38    1  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   50   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   63    4  N  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    23    2   47  A  P N             T        Y              
PNHLSTH  DS    XL8                                                              
PNHLST   DS    CL30    23   50   30  A  U N             T        Y              
PNHCMNTH DS    XL8                                                              
PNHCMNT  DS    CL60    24    2   60  A  P H             T        Y              
PNHDUEH  DS    XL8                                                              
PNHDUE   DS    CL14    24   67   14  A  P Z             T        Y              
PNHLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
PNHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1888 BYTES                            
