*          DATA SET TAPYS18D   AT LEVEL 003 AS OF 04/10/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F318D      DATE 04/10/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
IVRAGYH  DS    XL8                                                              
IVRAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
IVRAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
IVRINVH  DS    XL8                                                              
IVRINV   DS    CL6      4   28    6  A  U N             T        Y  144         
IVRINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
IVRCIDH  DS    XL8                                                              
IVRCID   DS    CL12     4   46   12  A  U N             T        Y   64         
IVRCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
IVRLFTH  DS    XL8                                                              
IVRLFT   DS    CL3      4   63    3  A  U N             T        Y   66         
IVRLFTX  DS    XL8                                                              
IVRLIDH  DS    XL8                                                              
IVRLID   DS    CL12     4   67   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
IVRAGYNH DS    XL8                                                              
IVRAGYN  DS    CL16     5    2   16  A  P N             T        Y              
IVRCLINH DS    XL8                                                              
IVRCLIN  DS    CL16     5   20   16  A  P N             T        Y              
IVRCOMNH DS    XL8                                                              
IVRCOMN  DS    CL19     5   38   19  A  P N             T        Y              
IVRSECH  DS    XL8                                                              
IVRSEC   DS    CL4      5   58    4  A  P N             T        Y              
IVRCLPRH DS    XL8                                                              
IVRCLPR  DS    CL13     5   63   13  A  P N             T        Y              
IVRMEDNH DS    XL8                                                              
IVRMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
IVRAUTHH DS    XL8                                                              
IVRAUTH  DS    CL16     6   10   16  A  U N             T        Y   11         
IVRAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
IVRESTH  DS    XL8                                                              
IVREST   DS    CL16     6   46   16  A  U N             T        Y   13         
IVRESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
IVRPDH   DS    XL8                                                              
IVRPD    DS    CL2      6   74    2  N  U N             T        Y   15         
IVRPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
IVRCYCH  DS    XL8                                                              
IVRCYC   DS    CL17     7   10   17  A  U N             T        Y   17         
IVRCYCX  DS    XL8                                                              
IVRLCYCH DS    XL8                                                              
IVRLCYC  DS    CL6      7   30    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
IVRBNPH  DS    XL8                                                              
IVRBNP   DS    CL1      7   59    1  A  U N             T        Y   19         
IVRBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   63   10  A  P N             T        Y              
IVREINVH DS    XL8                                                              
IVREINV  DS    CL6      7   74    6  A  U N             T        Y   21         
IVREINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
IVRHCOMH DS    XL8                                                              
IVRHCOM  DS    CL40     8   10   40  A  U N             T        Y   23         
IVRHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
IVRICOMH DS    XL8                                                              
IVRICOM  DS    CL60     9   10   60  A  U N             T        Y   27         
IVRICOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
IVROPTH  DS    XL8                                                              
IVROPT   DS    CL60    10   10   60  A  U N             T        Y   25         
IVROPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   72    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P H             T        Y              
IVRFRSTH DS    XL8                                                              
IVRFRST  DS    CL5     12    2    5  A  U N             T        Y   51         
IVRFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     12    9    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
IVRDATAH DS    XL8                                                              
IVRDATA  DS    CL47    13    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    13   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14    9    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    15    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    15   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16    9    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    17    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18    9    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    19    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    19   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20    9    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     20   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    21    2   47  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    21   50   30  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     22    2    5  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     22    9    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   29    1  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   31   10  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   42   10  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   53   10  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   64   10  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   76    4  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL47    23    2   47  A  P N             T        Y              
IVRLSTH  DS    XL8                                                              
IVRLST   DS    CL30    23   50   30  A  U N             T        Y   73         
IVRLSTX  DS    XL8                                                              
IVRCMNTH DS    XL8                                                              
IVRCMNT  DS    CL60    24    2   60  A  P H             T        Y              
IVRDUEH  DS    XL8                                                              
IVRDUE   DS    CL14    24   67   14  A  P Z             T        Y              
IVRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
IVRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2704 BYTES                            
