*          DATA SET TAREPE9D   AT LEVEL 011 AS OF 06/29/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703E9D      DATE 06/29/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SPLAGYH  DS    CL8                                                              
SPLAGY   DS    CL6      7   24    6  A  U N             T        Y   13         
SPLAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
SPLAGGH  DS    CL8                                                              
SPLAGG   DS    CL6      8   24    6  A  U N             T        Y   14         
SPLAGGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL6      9   24    6  A  U N             T        Y   15         
SPLCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
SPLCGGH  DS    CL8                                                              
SPLCGG   DS    CL6     10   24    6  A  U N             T        Y   31         
SPLCGGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
SPLPRDH  DS    CL8                                                              
SPLPRD   DS    CL6     11   24    6  A  U N             T        Y   30         
SPLPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
SPLEMPH  DS    CL8                                                              
SPLEMP   DS    CL3     12   24    3  A  U N             T        Y   16         
SPLEMPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14    2   16  A  P H             T        Y              
SPLPERH  DS    CL8                                                              
SPLPER   DS    CL8     14   24    8  A  U H             T        Y   17         
SPLPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15    2   12  A  P H             T        Y              
SPLREQH  DS    CL8                                                              
SPLREQ   DS    CL8     15   24    8  A  U H             T        Y   18         
SPLREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16    2   12  A  P H             T        Y              
SPLRUNH  DS    CL8                                                              
SPLRUN   DS    CL8     16   24    8  A  U H             T        Y   17         
SPLRUNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17    2   12  A  P H             T        Y              
SPLPREVH DS    CL8                                                              
SPLPREV  DS    CL8     17   24    8  A  U H             T        Y   19         
SPLPREVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    18    2   13  A  P H             T        Y              
SPLEPERH DS    CL8                                                              
SPLEPER  DS    CL2     18   24    2  A  U H             T        Y   20         
SPLEPERX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    19    2   17  A  P N             T        Y              
SPLATPH  DS    CL8                                                              
SPLATP   DS    CL2     19   24    2  A  U H             T        Y   22         
SPLATPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     20    2    4  A  P N             T        Y              
SPLYEARH DS    CL8                                                              
SPLYEAR  DS    CL4     20   24    4  A  U N             T        Y   21         
SPLYEARX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL50    22   24   50  A  U N             T        Y   51         
SPLOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23    2    1  A  U N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
