*          DATA SET TARECEQUS  AT LEVEL 001 AS OF 04/16/08                      
*##FILENAME TALFIL                                                              
*##COVEREDBY TLW4D                                                              
RLW4CDQ  EQU   1                   W4 RECORDS                                   
*##COVEREDBY TLW4PD                                                             
RLW4NCDQ EQU   2                   W4 PASSIVE                                   
*                                                                               
*##FILENAME TALDIR                                                              
*##COVEREDBY TLW4D                                                              
DLW4CDQ  EQU   1                   W4 RECORDS                                   
*##COVEREDBY TLW4PD                                                             
DLW4NCDQ EQU   2                   W4 PASSIVE                                   
*                                                                               
*##FILENAME CHKFIL                                                              
*##PROCESS OFF                                                                  
*                                                                               
*##FILENAME CHKDIR                                                              
*##PROCESS OFF                                                                  
*                                                                               
TABCFI   DS    0D                                                               
         DC    AL2(255)                                                         
*                                                                               
TABTFI   DS    0D                                                               
         DC    AL2(RLW4CDQ),X'00',X'600000',XL2'00'                             
         DC    AL2(RLW4NCDQ),X'00',X'610000',XL2'00'                            
         DC    AL2(255)                                                         
