*          DATA SET TAREPC2D   AT LEVEL 002 AS OF 10/14/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703C2D      DATE 10/14/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SAGAGYH  DS    XL8                                                              
SAGAGY   DS    CL6      6   10    6  A  U N             T        Y   16         
SAGAGYX  DS    XL8                                                              
SAGAGYNH DS    XL8                                                              
SAGAGYN  DS    CL36     6   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
SAGNIDH  DS    XL8                                                              
SAGNID   DS    CL12     7   10   12  A  U N             T        Y   61         
SAGNIDX  DS    XL8                                                              
SAGNIDNH DS    XL8                                                              
SAGNIDN  DS    CL36     7   24   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
SAGCLIH  DS    XL8                                                              
SAGCLI   DS    CL3      8   10    3  A  U N             T        Y   31         
SAGCLIX  DS    XL8                                                              
SAGCLINH DS    XL8                                                              
SAGCLIN  DS    CL36     8   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SAGPRDH  DS    XL8                                                              
SAGPRD   DS    CL3      9   10    3  A  U N             T        Y   33         
SAGPRDX  DS    XL8                                                              
SAGPRDNH DS    XL8                                                              
SAGPRDN  DS    CL36     9   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
SAGMEDH  DS    XL8                                                              
SAGMED   DS    CL1     10   10    1  A  U N             T        Y   15         
SAGMEDX  DS    XL8                                                              
SAGMEDNH DS    XL8                                                              
SAGMEDN  DS    CL5     10   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P N             T        Y              
SAGUSEH  DS    XL8                                                              
SAGUSE   DS    CL3     11   10    3  A  U N             T        Y   47         
SAGUSEX  DS    XL8                                                              
SAGUSENH DS    XL8                                                              
SAGUSEN  DS    CL16    11   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
SAGADDH  DS    XL8                                                              
SAGADD   DS    CL8     12   10    8  A  U N             T        Y   35         
SAGADDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
SAGUIDH  DS    XL8                                                              
SAGUID   DS    CL6     13   10    6  A  U N             T        Y   37         
SAGUIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
SAGOPTH  DS    XL8                                                              
SAGOPT   DS    CL50    15   10   50  A  U N             T        Y   51         
SAGOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y              
SAGLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SAGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 592  BYTES                            
