*          DATA SET TAREPD9D   AT LEVEL 004 AS OF 12/18/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703D9D      DATE 12/18/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SDDPERH  DS    CL8                                                              
SDDPER   DS    CL17     7   10   17  A  U N             T        Y    5         
SDDPERX  DS    CL8                                                              
SDDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SDDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 192  BYTES                            
