*          DATA SET TAREPF6D   AT LEVEL 001 AS OF 01/27/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703F6D      DATE 01/27/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
POSTYPEH DS    XL8                                                              
POSTYPE  DS    CL6      6   10    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
POSPERH  DS    XL8                                                              
POSPER   DS    CL17     7   10   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
POSOFFH  DS    XL8                                                              
POSOFF   DS    CL15     8   10   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    2    4  A  P N             T        Y              
POSCURRH DS    XL8                                                              
POSCURR  DS    CL1      9   10    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
POSOPTH  DS    XL8                                                              
POSOPT   DS    CL68    10   10   68  A  U N             T        Y              
POSLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
POSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
