*          DATA SET TAREPB0D   AT LEVEL 013 AS OF 11/11/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703B0D      DATE 11/11/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
RECOPTH  DS    CL8                                                              
RECOPT   DS    CL50     6   10   50  A  U N             T        Y              
RECLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RECWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 80   BYTES                            
