*          DATA SET TAREPD6D   AT LEVEL 006 AS OF 06/12/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703D6D      DATE 06/12/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
SRRAGYH  DS    CL8                                                              
SRRAGY   DS    CL6      6   10    6  A   U    N         T        Y   16         
SRRAGYX  DS    CL8                                                              
SRRAGYNH DS    CL8                                                              
SRRAGYN  DS    CL36     6   25   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    N         T        Y              
SRRCLIH  DS    CL8                                                              
SRRCLI   DS    CL6      7   10    6  A   U    N         T        Y   32         
SRRCLIX  DS    CL8                                                              
SRRCLINH DS    CL8                                                              
SRRCLIN  DS    CL36     7   25   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SRRPRDH  DS    CL8                                                              
SRRPRD   DS    CL6      8   10    6  A   U    N         T        Y   36         
SRRPRDX  DS    CL8                                                              
SRRPRDNH DS    CL8                                                              
SRRPRDN  DS    CL36     8   25   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   P    N         T        Y              
SRRCIDH  DS    CL8                                                              
SRRCID   DS    CL12     9   10   12  A   U    N         T        Y   64         
SRRCIDX  DS    CL8                                                              
SRRCIDNH DS    CL8                                                              
SRRCIDN  DS    CL36     9   25   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13    10    2   13  A   P    N         T        Y              
SRRINVSH DS    CL8                                                              
SRRINVS  DS    CL6     10   20    6  A   U    N         T        Y  144         
SRRINVSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11    2   11  A   P    N         T        Y              
SRRINVEH DS    CL8                                                              
SRRINVE  DS    CL6     11   20    6  A   U    N         T        Y  146         
SRRINVEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    13    2   15  A   P    N         T        Y              
SRRFESTH DS    CL8                                                              
SRRFEST  DS    CL16    13   20   16  A   U    N         T        Y  224         
SRRFESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    14    2   13  A   P    N         T        Y              
SRRTESTH DS    CL8                                                              
SRRTEST  DS    CL16    14   20   16  A   U    N         T        Y  224         
SRRTESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
SRROPTH  DS    CL8                                                              
SRROPT   DS    CL60    16   10   60  A   U    N         T        Y   55         
SRROPTX  DS    CL8                                                              
SRRLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SRRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 624  BYTES                            
