*          DATA SET TAREPC4D   AT LEVEL 001 AS OF 01/22/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703C4D      DATE 01/22/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     7    2   12  A  P H             T        Y              
SPUYEARH DS    CL8                                                              
SPUYEAR  DS    CL4      7   20    4  N  U N             T        Y   12         
SPUYEARX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
SPUSSNH  DS    CL8                                                              
SPUSSN   DS    CL9      8   20    9  N  U N             T        Y   18         
SPUSSNX  DS    CL8                                                              
SPUSSNNH DS    CL8                                                              
SPUSSNN  DS    CL32     8   33   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SPUOPTH  DS    CL8                                                              
SPUOPT   DS    CL50    10   20   50  A  U N             T        Y   19         
SPUOPTX  DS    CL8                                                              
SPULAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 352  BYTES                            
