*          DATA SET TAREPF4D   AT LEVEL 013 AS OF 07/09/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703F4D      DATE 07/09/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
SCKURGH  DS    CL8                                                              
SCKURG   DS    CL1      6   10    1  A   U    N         T        Y    5         
SCKURGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
SCKPERH  DS    CL8                                                              
SCKPER   DS    CL26     7   10   26  A   U    N         T        Y    9         
SCKPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SCKOPTH  DS    CL8                                                              
SCKOPT   DS    CL68     8   10   68  A   U    N         T        Y   13         
SCKOPTX  DS    CL8                                                              
SCKTRACH DS    CL8                                                              
SCKTRAC  DS    CL68     9   10   68  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SCKASOFH DS    CL8                                                              
SCKASOF  DS    CL26    10   10   26  A   U    N         T        Y   17         
SCKASOFX DS    CL8                                                              
SCKLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SCKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 328  BYTES                            
