*          DATA SET TAREPDCD   AT LEVEL 003 AS OF 12/08/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703DCD      DATE 12/08/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
SCREMPH  DS    CL8                                                              
SCREMP   DS    CL3      7   12    3  A  U N             T        Y   12         
SCREMPX  DS    CL8                                                              
SCREMPNH DS    CL8                                                              
SCREMPN  DS    CL36     7   23   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
SCRPERH  DS    CL8                                                              
SCRPER   DS    CL17     8   12   17  A  U N             T        Y   14         
SCRPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
SCROPTH  DS    CL8                                                              
SCROPT   DS    CL50    10   12   50  A  U N             T        Y              
SCRLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 344  BYTES                            
