*          DATA SET TAREPC7D   AT LEVEL 010 AS OF 01/28/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703C7D      DATE 01/28/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SQUPDH   DS    CL8                                                              
SQUPD    DS    CL25     6   10   25  A  U N             T        Y   12         
SQUPDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
SQUMEDH  DS    CL8                                                              
SQUMED   DS    CL1      7   10    1  A  U N             T        Y   17         
SQUMEDX  DS    CL8                                                              
SQUMEDNH DS    CL8                                                              
SQUMEDN  DS    CL5      7   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SQUEMPH  DS    CL8                                                              
SQUEMP   DS    CL3      9   10    3  A  U N             T        Y   13         
SQUEMPX  DS    CL8                                                              
SQUEMPNH DS    CL8                                                              
SQUEMPN  DS    CL36     9   20   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  P N             T        Y              
SQUAGYH  DS    CL8                                                              
SQUAGY   DS    CL6     10   10    6  A  U N             T        Y   14         
SQUAGYX  DS    CL8                                                              
SQUAGYNH DS    CL8                                                              
SQUAGYN  DS    CL36    10   20   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
SQUCLTH  DS    CL8                                                              
SQUCLT   DS    CL6     11   10    6  A  U N             T        Y   15         
SQUCLTX  DS    CL8                                                              
SQUCLTNH DS    CL8                                                              
SQUCLTN  DS    CL36    11   20   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    12    2   17  A  P N             T        Y              
SQUCTYFH DS    CL8                                                              
SQUCTYF  DS    CL3     12   20    3  A  U N             T        Y   18         
SQUCTYFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    13   20   21  A  P N             T        Y              
SQUCMNLH DS    CL8                                                              
SQUCMNL  DS    CL3     13   46    3  A  U N             T        Y   19         
SQUCMNLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    14   20   21  A  P N             T        Y              
SQUCMXLH DS    CL8                                                              
SQUCMXL  DS    CL3     14   46    3  A  U N             T        Y   20         
SQUCMXLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
SQUOPTH  DS    CL8                                                              
SQUOPT   DS    CL60    16   10   60  A  U N             T        Y   17         
SQUOPTX  DS    CL8                                                              
SQULAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SQUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 600  BYTES                            
