*          DATA SET TAREPCBD   AT LEVEL 004 AS OF 10/06/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703CBD      DATE 10/06/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T        N    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A   U    N         T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    H         T        Y              
SNTPERH  DS    CL8                                                              
SNTPER   DS    CL17     7   10   17  A   U    N         T        Y   12         
SNTPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    H         T        Y              
SNTEMPH  DS    CL8                                                              
SNTEMP   DS    CL3      8   10    3  A   U    N         T        Y   14         
SNTEMPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    Z         T        Y              
SNTUNITH DS    CL8                                                              
SNTUNIT  DS    CL3      9   10    3  A   P    Z         T        Y   16         
SNTUNITX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
SNTOPTH  DS    CL8                                                              
SNTOPT   DS    CL50    11   10   50  A   U    N         T        Y   51         
SNTOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   U    N         T        Y              
SNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 352  BYTES                            
