*          DATA SET TAREPF7D   AT LEVEL 005 AS OF 07/30/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703F7D      DATE 07/30/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T        N    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A   U    N         T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7    2    3  A   P    N         T        Y              
SPREMPH  DS    CL8                                                              
SPREMP   DS    CL6      7   10    6  A   U    N         T        Y   58         
SPREMPX  DS    CL8                                                              
SPREMPNH DS    CL8                                                              
SPREMPN  DS    CL36     7   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A   P    N         T        Y              
SPRAGYH  DS    CL8                                                              
SPRAGY   DS    CL6      8   10    6  A   U    N         T        Y   30         
SPRAGYX  DS    CL8                                                              
SPRAGYNH DS    CL8                                                              
SPRAGYN  DS    CL36     8   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SPRPERH  DS    CL8                                                              
SPRPER   DS    CL25     9   10   25  A   U    N         T        Y   51         
SPRPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      9   38    9  A   P    N         T        Y              
SPRRUNH  DS    CL8                                                              
SPRRUN   DS    CL25     9   48   25  A   U    N         T        Y   53         
SPRRUNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SPROPTH  DS    CL8                                                              
SPROPT   DS    CL68    10   10   68  A   U    N         T        Y   54         
SPROPTX  DS    CL8                                                              
SPRTRACH DS    CL8                                                              
SPRTRAC  DS    CL68    11   10   68  A   U    N         T        Y              
SPRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 592  BYTES                            
