*          DATA SET TAREPD8D   AT LEVEL 007 AS OF 08/05/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703D8D      DATE 08/05/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
SIMAGYH  DS    CL8                                                              
SIMAGY   DS    CL6      6   10    6  A   U    N         T        Y   16         
SIMAGYX  DS    CL8                                                              
SIMAGYNH DS    CL8                                                              
SIMAGYN  DS    CL36     6   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  A   P    H         T        Y              
SIMFCLIH DS    CL8                                                              
SIMFCLI  DS    CL6      8   20    6  A   U    N         T        Y   32         
SIMFCLIX DS    CL8                                                              
SIMFCLNH DS    CL8                                                              
SIMFCLN  DS    CL36     8   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     9    2   15  A   P    N         T        Y              
SIMFPRDH DS    CL8                                                              
SIMFPRD  DS    CL6      9   20    6  A   U    N         T        Y   48         
SIMFPRDX DS    CL8                                                              
SIMFPRNH DS    CL8                                                              
SIMFPRN  DS    CL36     9   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    10    2   16  A   P    N         T        Y              
SIMFESTH DS    CL8                                                              
SIMFEST  DS    CL16    10   20   16  A   U    N         T        Y   90         
SIMFESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    12    2   14  A   P    H         T        Y              
SIMTCLIH DS    CL8                                                              
SIMTCLI  DS    CL6     12   20    6  A   U    N         T        Y   33         
SIMTCLIX DS    CL8                                                              
SIMTCLNH DS    CL8                                                              
SIMTCLN  DS    CL36    12   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    13    2   15  A   P    N         T        Y              
SIMTPRDH DS    CL8                                                              
SIMTPRD  DS    CL6     13   20    6  A   U    N         T        Y   49         
SIMTPRDX DS    CL8                                                              
SIMTPRNH DS    CL8                                                              
SIMTPRN  DS    CL36    13   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    14    2   16  A   P    N         T        Y              
SIMTESTH DS    CL8                                                              
SIMTEST  DS    CL16    14   20   16  A   U    N         T        Y   91         
SIMTESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    16    2   13  A   P    N         T        Y              
SIMINVSH DS    CL8                                                              
SIMINVS  DS    CL6     16   20    6  A   U    N         T        Y  144         
SIMINVSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17    2   11  A   P    N         T        Y              
SIMINVEH DS    CL8                                                              
SIMINVE  DS    CL6     17   20    6  A   U    N         T        Y  146         
SIMINVEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18    2   10  A   P    N         T        Y              
SIMASOFH DS    CL8                                                              
SIMASOF  DS    CL8     18   20    8  A   U    N         T        Y   97         
SIMASOFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20    2    7  A   P    N         T        Y              
SIMOPTH  DS    CL8                                                              
SIMOPT   DS    CL50    20   10   50  A   U    N         T        Y   99         
SIMOPTX  DS    CL8                                                              
SIMLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SIMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 760  BYTES                            
