*          DATA SET TAREP08D   AT LEVEL 001 AS OF 01/17/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN ASK1ECD      DATE 01/17/90                 
         SPACE 1                                                                
ASK1ECD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL1                                                              
         DS    CL2    INDICS=DS                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 72   BYTES                            
