*          DATA SET TAREPCED   AT LEVEL 002 AS OF 12/09/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703CED      DATE 12/09/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     7    2   12  A  P H             T        Y              
SCCYEARH DS    CL8                                                              
SCCYEAR  DS    CL4      7   20    4  A  U N             T        Y   12         
SCCYEARX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
SCCEMPH  DS    CL8                                                              
SCCEMP   DS    CL3      8   20    3  A  U N             T        Y   14         
SCCEMPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
SCCSSNH  DS    CL8                                                              
SCCSSN   DS    CL9      9   20    9  A  U N             T        Y   18         
SCCSSNX  DS    CL8                                                              
SCCSSNNH DS    CL8                                                              
SCCSSNN  DS    CL32     9   38   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SCCOPTH  DS    CL8                                                              
SCCOPT   DS    CL50    11   20   50  A  U N             T        Y   51         
SCCOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
SCCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SCCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 392  BYTES                            
