*          DATA SET TAREPEFD   AT LEVEL 003 AS OF 11/12/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703EFD      DATE 11/12/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T        N    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A   U    N         T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     7    2   12  A   P    H         T        Y              
SPLYEARH DS    CL8                                                              
SPLYEAR  DS    CL4      7   20    4  A   U    N         T        Y   12         
SPLYEARX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    H         T        Y              
SPLEMPH  DS    CL8                                                              
SPLEMP   DS    CL3      8   20    3  A   U    N         T        Y   14         
SPLEMPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    H         T        Y              
SPLUNTH  DS    CL8                                                              
SPLUNT   DS    CL3      9   20    3  A   U    N         T        Y   16         
SPLUNTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL50    11   20   50  A   U    N         T        Y   51         
SPLOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 344  BYTES                            
