*          DATA SET TAREPD1D   AT LEVEL 005 AS OF 12/15/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703D1D      DATE 12/15/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SYDPDH   DS    CL8                                                              
SYDPD    DS    CL17     6   10   17  A  U N             T        Y   21         
SYDPDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SYDCURH  DS    CL8                                                              
SYDCUR   DS    CL1      8   10    1  A  U N             T        Y   43         
SYDCURX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
SYDEMPH  DS    CL8                                                              
SYDEMP   DS    CL3      9   10    3  A  U N             T        Y   45         
SYDEMPX  DS    CL8                                                              
SYDEMPNH DS    CL8                                                              
SYDEMPN  DS    CL36     9   20   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SYDSSNH  DS    CL8                                                              
SYDSSN   DS    CL9     10   10    9  A  U N             T        Y   47         
SYDSSNX  DS    CL8                                                              
SYDSSNNH DS    CL8                                                              
SYDSSNN  DS    CL36    10   20   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
SYDAGYH  DS    CL8                                                              
SYDAGY   DS    CL6     11   10    6  A  U N             T        Y   16         
SYDAGYX  DS    CL8                                                              
SYDAGYNH DS    CL8                                                              
SYDAGYN  DS    CL36    11   20   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
SYDOPTH  DS    CL8                                                              
SYDOPT   DS    CL50    12   10   50  A  U N             T        Y   51         
SYDOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y              
SYDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SYDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 416  BYTES                            
