*          DATA SET TAREPC1D   AT LEVEL 001 AS OF 12/21/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703C1D      DATE 12/21/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SNXAGYH  DS    CL8                                                              
SNXAGY   DS    CL6      6   10    6  A  U N             T        Y   10         
SNXAGYX  DS    CL8                                                              
SNXAGYNH DS    CL8                                                              
SNXAGYN  DS    CL36     6   20   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SNXSEQH  DS    CL8                                                              
SNXSEQ   DS    CL4      7   10    4  N  U N             T        Y   13         
SNXSEQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SNXOPTH  DS    CL8                                                              
SNXOPT   DS    CL50     8   10   50  A  U N             T        Y   51         
SNXOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9    2    1  A  U N             T        Y              
SNXLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SNXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 208  BYTES                            
