*          DATA SET TAREPFDD   AT LEVEL 004 AS OF 04/11/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703FDD      DATE 04/11/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL10     6    2   10  A  P N             T        Y              
TAXDATEH DS    XL8                                                              
TAXDATE  DS    CL17     6   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
TAXUNT1H DS    XL8                                                              
TAXUNT1  DS    CL3      7   17    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     7   38   16  A  P N             T        Y              
TAXC2URH DS    XL8                                                              
TAXC2UR  DS    CL6      7   56    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
TAXUNT2H DS    XL8                                                              
TAXUNT2  DS    CL3      8   17    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     8   38   15  A  P N             T        Y              
TAXPZONH DS    XL8                                                              
TAXPZON  DS    CL17     8   56   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
TAXRESH  DS    XL8                                                              
TAXRES   DS    CL1      9   17    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
TAXFREQH DS    XL8                                                              
TAXFREQ  DS    CL1     11   17    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12    2    9  A  P N             T        Y              
TAXGRSPH DS    XL8                                                              
TAXGRSP  DS    CL17    12   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P N             T        Y              
TAXNCL1H DS    XL8                                                              
TAXNCL1  DS    CL17    13   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P N             T        Y              
TAXNCL2H DS    XL8                                                              
TAXNCL2  DS    CL17    14   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
TAXYPNWH DS    XL8                                                              
TAXYPNW  DS    CL17    15   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   38   12  A  P N             T        Y              
TAXYPNTH DS    XL8                                                              
TAXYPNT  DS    CL17    15   56   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16    2   13  A  P N             T        Y              
TAXYUIWH DS    XL8                                                              
TAXYUIW  DS    CL17    16   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   38   11  A  P N             T        Y              
TAXYUITH DS    XL8                                                              
TAXYUIT  DS    CL17    16   56   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    17    2   13  A  P N             T        Y              
TAXYQPWH DS    XL8                                                              
TAXYQPW  DS    CL17    17   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   38   11  A  P N             T        Y              
TAXYQPTH DS    XL8                                                              
TAXYQPT  DS    CL17    17   56   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    18    2   13  A  P N             T        Y              
TAXTDEDH DS    XL8                                                              
TAXTDED  DS    CL17    18   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   38   13  A  P N             T        Y              
TAXXHLTH DS    XL8                                                              
TAXXHLT  DS    CL1     18   56    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
TAXSTATH DS    XL8                                                              
TAXSTAT  DS    CL1     20   17    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21    2   10  A  P N             T        Y              
TAXEXSH  DS    XL8                                                              
TAXEXS   DS    CL2     21   17    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
TAXOPTH  DS    XL8                                                              
TAXOPT   DS    CL60    22   17   60  A  U N             T        Y              
TAXLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
TAXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 848  BYTES                            
