*          DATA SET TAREPDAD   AT LEVEL 001 AS OF 03/12/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703DAD      DATE 03/12/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P H             T        Y              
DUCYRH   DS    XL8                                                              
DUCYR    DS    CL2      7   12    2  A  U N             T        Y   12         
DUCYRX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
DUCCURH  DS    XL8                                                              
DUCCUR   DS    CL1      8   12    1  A  U N             T        Y   14         
DUCCURX  DS    XL8                                                              
DUCCURNH DS    XL8                                                              
DUCCURN  DS    CL4      8   23    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
DUCEMPH  DS    XL8                                                              
DUCEMP   DS    CL3      9   12    3  A  U N             T        Y   16         
DUCEMPX  DS    XL8                                                              
DUCEMPNH DS    XL8                                                              
DUCEMPN  DS    CL36     9   23   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
DUCPIDH  DS    XL8                                                              
DUCPID   DS    CL9     10   12    9  A  U N             T        Y   18         
DUCPIDX  DS    XL8                                                              
DUCPIDNH DS    XL8                                                              
DUCPIDN  DS    CL36    10   23   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
DUCOPTH  DS    XL8                                                              
DUCOPT   DS    CL50    12   12   50  A  U N             T        Y              
DUCLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
DUCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 456  BYTES                            
