*          DATA SET TAREPC9D   AT LEVEL 001 AS OF 10/14/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703C9D      DATE 10/14/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
NMTPDH   DS    XL8                                                              
NMTPD    DS    CL17     6   10   17  A  U N             T        Y   13         
NMTPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      8    2    4  A  P H             T        Y              
NMTEMPH  DS    XL8                                                              
NMTEMP   DS    CL3      8   10    3  A  U N             T        Y   16         
NMTEMPX  DS    XL8                                                              
NMTEMPNH DS    XL8                                                              
NMTEMPN  DS    CL36     8   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
NMTOPTH  DS    XL8                                                              
NMTOPT   DS    CL60    10   10   60  A  U N             T        Y   59         
NMTOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  P N             T        Y              
NMTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
NMTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 232  BYTES                            
