*          DATA SET TAREPF1D   AT LEVEL 013 AS OF 06/21/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703F1D      DATE 06/21/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
SPLCODEH DS    CL8                                                              
SPLCODE  DS    CL8      5   10    8  A  U N             T        N    8         
SPLCODEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
SPLREADH DS    CL8                                                              
SPLREAD  DS    CL8      7   10    8  A  U N             T        Y   20         
SPLREADX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
SPLOFFH  DS    CL8                                                              
SPLOFF   DS    CL8      7   28    8  A  U N             T        Y   61         
SPLOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
SPLEMPH  DS    CL8                                                              
SPLEMP   DS    CL8      7   46    8  A  U N             T        Y   62         
SPLEMPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   56    7  A  P N             T        Y              
SPLPERH  DS    CL8                                                              
SPLPER   DS    CL17     7   64   17  A  U N             T        Y   21         
SPLPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SPLAGYH  DS    CL8                                                              
SPLAGY   DS    CL8      8   10    8  A  U N             T        Y   30         
SPLAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   20    7  A  P N             T        Y              
SPLCLIH  DS    CL8                                                              
SPLCLI   DS    CL8      8   28    8  A  U N             T        Y   31         
SPLCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   38    7  A  P N             T        Y              
SPLPROH  DS    CL8                                                              
SPLPRO   DS    CL8      8   46    8  A  U N             T        Y   32         
SPLPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   56    7  A  P N             T        Y              
SPLISCIH DS    CL8                                                              
SPLISCI  DS    CL14     8   64   14  A  U N             T        Y   33         
SPLISCIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SPLAGGH  DS    CL8                                                              
SPLAGG   DS    CL8      9   10    8  A  U N             T        Y   40         
SPLAGGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   20    7  A  P N             T        Y              
SPLUNH   DS    CL8                                                              
SPLUN    DS    CL8      9   28    8  A  U N             T        Y   41         
SPLUNX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   38    7  A  P N             T        Y              
SPLUSEH  DS    CL8                                                              
SPLUSE   DS    CL8      9   46    8  A  U N             T        Y   42         
SPLUSEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   56    7  A  P N             T        Y              
SPLPERFH DS    CL8                                                              
SPLPERF  DS    CL12     9   64   12  A  U N             T        Y   43         
SPLPERFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SPLFILTH DS    CL8                                                              
SPLFILT  DS    CL68    10   10   68  A  U N             T        Y   50         
SPLFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL68    11   10   68  A  U N             T        Y   51         
SPLOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
SPLLEFTH DS    CL8                                                              
SPLLEFT  DS    CL16    12   10   16  A  U N             T        Y  101         
SPLLEFTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   28   16  A  U N             T        Y  101         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   46   16  A  U N             T        Y  101         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   64   16  A  U N             T        Y  101         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
SPLRGHTH DS    CL8                                                              
SPLRGHT  DS    CL16    13   10   16  A  U N             T        Y  102         
SPLRGHTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   28   16  A  U N             T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     13   46    9  A  U N             T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   56    7  A  P N             T        Y              
SPLMIDH  DS    CL8                                                              
SPLMID   DS    CL16    13   64   16  A  U N             T        Y  103         
SPLMIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
SPLROWSH DS    CL8                                                              
SPLROWS  DS    CL16    14   10   16  A  U N             T        Y  104         
SPLROWSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   28   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   46   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   64   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    15   10   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    15   28   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    15   46   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    15   64   16  A  U N             T        Y  104         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   10    1  A  P N             T        Y              
SPLCOLSH DS    CL8                                                              
SPLCOLS  DS    CL32    16   12   32  A  U N             T        Y  106         
SPLCOLSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    16   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    21   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    21   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    22   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    22   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    23   12   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    23   47   32  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     24    2    6  A  P N             T        Y              
SPLTITLH DS    CL8                                                              
SPLTITL  DS    CL34    24   10   34  A  U N             T        Y   65         
SPLTITLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL34    24   46   34  A  U N             T        Y   66         
         DS    CL8                                                              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2440 BYTES                            
