*          DATA SET TAREPB9D   AT LEVEL 001 AS OF 12/19/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703B9D      DATE 12/19/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
XFRTYPEH DS    XL8                                                              
XFRTYPE  DS    CL7      6   10    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
XFROPTH  DS    XL8                                                              
XFROPT   DS    CL68     7   10   68  A  U N             T        Y              
XFRLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
XFRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 128  BYTES                            
