*          DATA SET TAREPFAD   AT LEVEL 005 AS OF 05/24/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703FAD      DATE 05/24/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SHFPDH   DS    XL8                                                              
SHFPD    DS    CL17     6   10   17  A  U N             T        Y   13         
SHFPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
SHFAGYH  DS    XL8                                                              
SHFAGY   DS    CL10     8   10   10  A  U N             T        Y   16         
SHFAGYX  DS    XL8                                                              
SHFAGYNH DS    XL8                                                              
SHFAGYN  DS    CL36     8   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
SHFCLIH  DS    XL8                                                              
SHFCLI   DS    CL10     9   10   10  A  U N             T        Y   32         
SHFCLIX  DS    XL8                                                              
SHFCLINH DS    XL8                                                              
SHFCLIN  DS    CL36     9   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SHFPRDH  DS    XL8                                                              
SHFPRD   DS    CL10    10   10   10  A  U N             T        Y   48         
SHFPRDX  DS    XL8                                                              
SHFPRDNH DS    XL8                                                              
SHFPRDN  DS    CL36    10   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
SHFCOMH  DS    XL8                                                              
SHFCOM   DS    CL12    11   10   12  A  U N             T        Y   64         
SHFCOMX  DS    XL8                                                              
SHFCOMNH DS    XL8                                                              
SHFCOMN  DS    CL36    11   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
SHFCLGH  DS    XL8                                                              
SHFCLG   DS    CL12    12   10   12  A  U N             T        Y   40         
SHFCLGX  DS    XL8                                                              
SHFCLGNH DS    XL8                                                              
SHFCLGN  DS    CL36    12   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
SHFOFFH  DS    XL8                                                              
SHFOFF   DS    CL10    13   10   10  A  U N             T        Y   15         
SHFOFFX  DS    XL8                                                              
SHFOFFNH DS    XL8                                                              
SHFOFFN  DS    CL36    13   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
SHFOPTH  DS    XL8                                                              
SHFOPT   DS    CL60    15   10   60  A  U N             T        Y   59         
SHFOPTX  DS    XL8                                                              
SHFLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SHFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 656  BYTES                            
