*          DATA SET TAREPF0D   AT LEVEL 007 AS OF 10/14/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703F0D      DATE 10/14/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
SPNAGYH  DS    CL8                                                              
SPNAGY   DS    CL6      6   10    6  A   U    N         T        Y   10         
SPNAGYX  DS    CL8                                                              
SPNAGYNH DS    CL8                                                              
SPNAGYN  DS    CL36     6   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
SPNSEQH  DS    CL8                                                              
SPNSEQ   DS    CL4      7   10    4  N   U    N         T        Y   13         
SPNSEQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SPNEMUH  DS    CL8                                                              
SPNEMU   DS    CL50     8   10   50  A   U    N         T        Y   52         
SPNEMUX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
SPNOPTH  DS    CL8                                                              
SPNOPT   DS    CL50     9   10   50  A   U    N         T        Y   51         
SPNOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   U    N         T        Y              
SPNLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 296  BYTES                            
