*          DATA SET TAREPFBD   AT LEVEL 001 AS OF 10/31/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703FBD      DATE 10/31/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SINPDH   DS    XL8                                                              
SINPD    DS    CL17     6   10   17  A  U N             T        Y   13         
SINPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
SINAGYH  DS    XL8                                                              
SINAGY   DS    CL6      8   10    6  A  U N             T        Y   16         
SINAGYX  DS    XL8                                                              
SINAGYNH DS    XL8                                                              
SINAGYN  DS    CL36     8   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
SINCLIH  DS    XL8                                                              
SINCLI   DS    CL6      9   10    6  A  U N             T        Y   32         
SINCLIX  DS    XL8                                                              
SINCLINH DS    XL8                                                              
SINCLIN  DS    CL36     9   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SINPRDH  DS    XL8                                                              
SINPRD   DS    CL6     10   10    6  A  U N             T        Y   48         
SINPRDX  DS    XL8                                                              
SINPRDNH DS    XL8                                                              
SINPRDN  DS    CL36    10   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
SINCIDH  DS    XL8                                                              
SINCID   DS    CL12    11   10   12  A  U N             T        Y   64         
SINCIDX  DS    XL8                                                              
SINCIDNH DS    XL8                                                              
SINCIDN  DS    CL36    11   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
SINMEDH  DS    XL8                                                              
SINMED   DS    CL1     12   10    1  A  U N             T        Y   60         
SINMEDX  DS    XL8                                                              
SINMEDNH DS    XL8                                                              
SINMEDN  DS    CL5     12   28    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
SINUSEH  DS    XL8                                                              
SINUSE   DS    CL3     13   10    3  A  U N             T        Y   40         
SINUSEX  DS    XL8                                                              
SINUSENH DS    XL8                                                              
SINUSEN  DS    CL36    13   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14    2    4  A  P N             T        Y              
SINCODH  DS    XL8                                                              
SINCOD   DS    CL4     14   10    4  A  U N             T        Y   15         
SINCODX  DS    XL8                                                              
SINCODNH DS    XL8                                                              
SINCODN  DS    CL30    14   28   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
SINOPTH  DS    XL8                                                              
SINOPT   DS    CL60    16   10   60  A  U N             T        Y   59         
SINOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
SINLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 672  BYTES                            
