*          DATA SET TAREPC5D   AT LEVEL 002 AS OF 03/14/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703C5D      DATE 03/14/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SCPPDH   DS    CL8                                                              
SCPPD    DS    CL25     6   10   25  A  U N             T        Y   13         
SCPPDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SCPOPTH  DS    CL8                                                              
SCPOPT   DS    CL60     8   10   60  A  U N             T        Y   17         
SCPOPTX  DS    CL8                                                              
SCPLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SCPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 152  BYTES                            
