*          DATA SET TAREPFCD   AT LEVEL 002 AS OF 05/29/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703FCD      DATE 05/29/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
SBKPDH   DS    CL8                                                              
SBKPD    DS    CL17     6   20   17  A   U    N         T        Y   13         
SBKPDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8    2    9  A   P    N         T        Y              
SBKRUNH  DS    CL8                                                              
SBKRUN   DS    CL17     8   20   17  A   U    N         T        Y   15         
SBKRUNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
SBKOPTH  DS    CL8                                                              
SBKOPT   DS    CL60    10   20   60  A   U    N         T        Y   17         
SBKOPTX  DS    CL8                                                              
SBKLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SBKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 192  BYTES                            
