*          DATA SET TAREPE1D   AT LEVEL 005 AS OF 07/20/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703E1D      DATE 07/20/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
SPLCOMMH DS    CL8                                                              
SPLCOMM  DS    CL9      6   10    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
SPLEFFH  DS    CL8                                                              
SPLEFF   DS    CL6      7   10    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SPLPERFH DS    CL8                                                              
SPLPERF  DS    CL17     8   10   17  A   U    N         T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 104  BYTES                            
