*          DATA SET TAREPD0D   AT LEVEL 013 AS OF 05/09/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703D0D      DATE 05/09/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SMUAGYH  DS    CL8                                                              
SMUAGY   DS    CL6      7   10    6  A  U N             T        Y   13         
SMUAGYX  DS    CL8                                                              
SMUAGYNH DS    CL8                                                              
SMUAGYN  DS    CL36     7   28   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
SMUCLIH  DS    CL8                                                              
SMUCLI   DS    CL8      8   10    8  A  U N             T        Y   14         
SMUCLIX  DS    CL8                                                              
SMUCLINH DS    CL8                                                              
SMUCLIN  DS    CL36     8   28   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  P H             T        Y              
SMUPDH   DS    CL8                                                              
SMUPD    DS    CL30    10   10   30  A  U N             T        Y   15         
SMUPDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SMUNETH  DS    CL8                                                              
SMUNET   DS    CL1     11   10    1  A  U N             T        Y   17         
SMUNETX  DS    CL8                                                              
SMUNETNH DS    CL8                                                              
SMUNETN  DS    CL3     11   28    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
SMUMUSH  DS    CL8                                                              
SMUMUS   DS    CL8     12   10    8  A  U N             T        Y   19         
SMUMUSX  DS    CL8                                                              
SMUMUSNH DS    CL8                                                              
SMUMUSN  DS    CL36    12   28   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
SMUCIDH  DS    CL8                                                              
SMUCID   DS    CL12    13   10   12  A  U N             T        Y   23         
SMUCIDX  DS    CL8                                                              
SMUCIDNH DS    CL8                                                              
SMUCIDN  DS    CL36    13   28   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
SMUOPTH  DS    CL8                                                              
SMUOPT   DS    CL60    15   10   60  A  U N             T        Y   21         
SMUOPTX  DS    CL8                                                              
SMULAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SMUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 672  BYTES                            
