*          DATA SET TAREPE2D   AT LEVEL 003 AS OF 11/11/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703E2D      DATE 11/11/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SPLOPTH  DS    CL8                                                              
SPLOPT   DS    CL68     6   10   68  A  U N             T        Y              
SPLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 96   BYTES                            
