*          DATA SET TAREPCAD   AT LEVEL 003 AS OF 12/02/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703CAD      DATE 12/02/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SEPAGYH  DS    CL8                                                              
SEPAGY   DS    CL6      6   16    6  A  U N             T        Y   14         
SEPAGYX  DS    CL8                                                              
SEPAGYNH DS    CL8                                                              
SEPAGYN  DS    CL36     6   23   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A  P H             T        Y              
SEPDTEH  DS    CL8                                                              
SEPDTE   DS    CL8      7   16    8  A  U N             T        Y   19         
SEPDTEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
SEPCLIH  DS    CL8                                                              
SEPCLI   DS    CL6      8   16    6  A  U N             T        Y   33         
SEPCLIX  DS    CL8                                                              
SEPCLINH DS    CL8                                                              
SEPCLIN  DS    CL36     8   23   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SEPPRDH  DS    CL8                                                              
SEPPRD   DS    CL6      9   16    6  A  U N             T        Y   49         
SEPPRDX  DS    CL8                                                              
SEPPRDNH DS    CL8                                                              
SEPPRDN  DS    CL36     9   23   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SEPOPTH  DS    CL8                                                              
SEPOPT   DS    CL60    11   10   60  A  U N             T        Y   17         
SEPOPTX  DS    CL8                                                              
SEPLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SEPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 384  BYTES                            
