*          DATA SET TAREPC6D   AT LEVEL 002 AS OF 09/27/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703C6D      DATE 09/27/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SCHAGYH  DS    CL8                                                              
SCHAGY   DS    CL6      6   10    6  A  U N             T        Y   16         
SCHAGYX  DS    CL8                                                              
SCHAGYNH DS    CL8                                                              
SCHAGYN  DS    CL36     6   28   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SCHPDH   DS    CL8                                                              
SCHPD    DS    CL17     7   10   17  A  U N             T        Y   13         
SCHPDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
SCHCOMH  DS    CL8                                                              
SCHCOM   DS    CL12     8   10   12  A  U N             T        Y   64         
SCHCOMX  DS    CL8                                                              
SCHCOMNH DS    CL8                                                              
SCHCOMN  DS    CL36     8   28   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
SCHCLIH  DS    CL8                                                              
SCHCLI   DS    CL6      9   10    6  A  U N             T        Y   32         
SCHCLIX  DS    CL8                                                              
SCHCLINH DS    CL8                                                              
SCHCLIN  DS    CL36     9   28   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SCHPRDH  DS    CL8                                                              
SCHPRD   DS    CL6     10   10    6  A  U N             T        Y   48         
SCHPRDX  DS    CL8                                                              
SCHPRDNH DS    CL8                                                              
SCHPRDN  DS    CL36    10   28   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
SCHOPTH  DS    CL8                                                              
SCHOPT   DS    CL60    12   10   60  A  U N             T        Y   59         
SCHOPTX  DS    CL8                                                              
SCHLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SCHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 472  BYTES                            
