*          DATA SET TAREPCCD   AT LEVEL 003 AS OF 07/15/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703CCD      DATE 07/15/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
BSMPERH  DS    XL8                                                              
BSMPER   DS    CL17     7   10   17  A  U N             T        Y   12         
BSMPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
BSMAGYH  DS    XL8                                                              
BSMAGY   DS    CL6      8   10    6  A  U N             T        Y   13         
BSMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
BSMOPTH  DS    XL8                                                              
BSMOPT   DS    CL50    10   10   50  A  U N             T        Y   51         
BSMOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y              
BSMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
BSMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
