*          DATA SET TAREPDDD   AT LEVEL 005 AS OF 11/14/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703DDD      DATE 11/14/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P H             T        Y              
MEDEMPH  DS    XL8                                                              
MEDEMP   DS    CL3      6   12    3  A  U N             T        Y   14         
MEDEMPX  DS    XL8                                                              
MEDEMPNH DS    XL8                                                              
MEDEMPN  DS    CL36     6   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
MEDAGYH  DS    XL8                                                              
MEDAGY   DS    CL6      7   12    6  A  U N             T        Y              
MEDAGYNH DS    XL8                                                              
MEDAGYN  DS    CL36     7   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
MEDCLIH  DS    XL8                                                              
MEDCLI   DS    CL6      8   12    6  A  U N             T        Y              
MEDCLINH DS    XL8                                                              
MEDCLIN  DS    CL36     8   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P H             T        Y              
MEDPERH  DS    XL8                                                              
MEDPER   DS    CL17     9   12   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   79    1  A  P N             T        Y              
MEDLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
MEDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 280  BYTES                            
