*          DATA SET TAREPF5D   AT LEVEL 001 AS OF 09/17/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703F5D      DATE 09/17/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P H             T        Y              
CGUAGYH  DS    XL8                                                              
CGUAGY   DS    CL8      6   12    8  A  U N             T        Y   16         
CGUAGYX  DS    XL8                                                              
CGUAGYNH DS    XL8                                                              
CGUAGYN  DS    CL36     6   23   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
CGUCLIH  DS    XL8                                                              
CGUCLI   DS    CL6      7   12    6  A  U N             T        Y   32         
CGUCLIX  DS    XL8                                                              
CGUCLINH DS    XL8                                                              
CGUCLIN  DS    CL36     7   23   36  A  P N             T        Y              
CGULAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CGUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 176  BYTES                            
