*          DATA SET TAREPC8D   AT LEVEL 003 AS OF 01/21/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703C8D      DATE 01/21/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   10    8  A  U N             T        N    8         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
WLMUIDH  DS    XL8                                                              
WLMUID   DS    CL70     7   10   70  A  U N             T        Y   12         
WLMUIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  U N             T        Y              
WLMLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
WLMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 256  BYTES                            
