*          DATA SET TAREPD3D   AT LEVEL 004 AS OF 03/06/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703D3D      DATE 03/06/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
SGTSSNH  DS    CL8                                                              
SGTSSN   DS    CL9      6   10    9  A   U    N         T        Y   96         
SGTSSNX  DS    CL8                                                              
SGTSSNNH DS    CL8                                                              
SGTSSNN  DS    CL16     6   20   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    H         T        Y              
SGTCODEH DS    CL8                                                              
SGTCODE  DS    CL4      7   10    4  A   U    N         T        Y  108         
SGTCODEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A   P    N         T        Y              
SGTPDH   DS    CL8                                                              
SGTPD    DS    CL17     8   10   17  A   U    N         T        Y  117         
SGTPDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    10    2   16  A   P    H         T        Y              
SGTBALH  DS    CL8                                                              
SGTBAL   DS    CL12    10   20   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    11    2   16  A   P    H         T        Y              
SGTINVH  DS    CL8                                                              
SGTINV   DS    CL6     11   20    6  A   U    N         T        Y              
SGTLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SGTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 240  BYTES                            
