*          DATA SET TAREPDED   AT LEVEL 002 AS OF 04/05/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T703DED      DATE 04/05/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SCOPDH   DS    XL8                                                              
SCOPD    DS    CL17     6   10   17  A  U N             T        Y   13         
SCOPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
SCOAGYH  DS    XL8                                                              
SCOAGY   DS    CL6      8   10    6  A  U N             T        Y   16         
SCOAGYX  DS    XL8                                                              
SCOAGYNH DS    XL8                                                              
SCOAGYN  DS    CL36     8   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
SCOCLIH  DS    XL8                                                              
SCOCLI   DS    CL6      9   10    6  A  U N             T        Y   32         
SCOCLIX  DS    XL8                                                              
SCOCLINH DS    XL8                                                              
SCOCLIN  DS    CL36     9   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SCOPRDH  DS    XL8                                                              
SCOPRD   DS    CL6     10   10    6  A  U N             T        Y   48         
SCOPRDX  DS    XL8                                                              
SCOPRDNH DS    XL8                                                              
SCOPRDN  DS    CL36    10   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
SCOCIDH  DS    XL8                                                              
SCOCID   DS    CL12    11   10   12  A  U N             T        Y   64         
SCOCIDX  DS    XL8                                                              
SCOCIDNH DS    XL8                                                              
SCOCIDN  DS    CL36    11   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
SCOMEDH  DS    XL8                                                              
SCOMED   DS    CL1     12   10    1  A  U N             T        Y   60         
SCOMEDX  DS    XL8                                                              
SCOMEDNH DS    XL8                                                              
SCOMEDN  DS    CL5     12   28    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
SCOOPTH  DS    XL8                                                              
SCOOPT   DS    CL60    14   10   60  A  U N             T        Y   59         
SCOOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
SCOLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 520  BYTES                            
