*          DATA SET TARRINCL   AT LEVEL 038 AS OF 11/10/16                      
         DC    X'04',C'1099    ',AL1(133),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'1099BLD ',AL1(137),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'1099PRT ',AL1(138),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'ADHOC   ',AL1(02),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'ACOPY   ',AL1(19),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'ACTIVITY',AL1(24),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'ADVICE  ',AL1(70),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'ALLTAX  ',AL1(53),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'ANNTAX  ',AL1(129),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'APROF   ',AL1(48),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'AYDOWN  ',AL1(82),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'AYINFO  ',AL1(103),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'AYINTER ',AL1(67),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'AYLINTER',AL1(83),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'BALANCE ',AL1(09),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'BILLING ',AL1(03),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'BILLSUM ',AL1(126),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'BAINTER ',AL1(95),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'BKCONFRM',AL1(96),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'BKPAY   ',AL1(104),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'BKREC   ',AL1(13),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'C2CACP  ',AL1(113),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'CACORP  ',AL1(91),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'CAPS    ',AL1(140),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'CCOPY   ',AL1(57),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'CHECKS  ',AL1(04),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'CEINTER ',AL1(89),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'CGUPDATE',AL1(122),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'CHRYSLER',AL1(120),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'CIBANK  ',AL1(100),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'CITYRES ',AL1(136),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'CKPURGE ',AL1(14),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'CLARAUDT',AL1(119),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'CNCHECKS',AL1(32),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'CNBKREC ',AL1(99),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'COHIST  ',AL1(78),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'COKE    ',AL1(106),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'COMMERCL',AL1(114),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'COPURGE ',AL1(77),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'CPORINT ',AL1(153),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'CRCOPY  ',AL1(64),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'DINVOICE',AL1(51),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'DMACOPY ',AL1(35),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'DMBB    ',AL1(28),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'DMCHECKS',AL1(33),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'DUCOMP  ',AL1(59),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'DUEDATE ',AL1(58),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'ECOPY   ',AL1(127),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'ERMQ    ',AL1(163),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'ESPURGE ',AL1(87),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'EUCHECKS',AL1(118),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'EVTIME  ',AL1(139),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'FACWRK  ',AL1(45),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'FIX     ',AL1(34),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'FGNCORP ',AL1(156),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'GREY    ',AL1(54),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'HFUPDATE',AL1(107),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'HFU2WEB ',AL1(108),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'HFDISK  ',AL1(86),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'HLD     ',AL1(11),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'HLD2WEB ',AL1(108),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'HOLIDAY ',AL1(101),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'HSUMMARY',AL1(26),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'IBANK   ',AL1(22),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'INTERNET',AL1(111),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'INVOICE ',AL1(08),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'JOB     ',AL1(97),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'JWINTER ',AL1(116),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'LABELS  ',AL1(27),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'LCBUPD  ',AL1(123),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'LLABELS ',AL1(74),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'MCINTER ',AL1(115),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'MCLIFE  ',AL1(55),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'MEDICARE',AL1(155),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'NCLARUS ',AL1(125),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'NEDISK  ',AL1(75),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'NSBILL  ',AL1(160),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'NSCHECK ',AL1(161),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'NEWHIRE ',AL1(90),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'NEWMEDIA',AL1(112),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'NINTER  ',AL1(69),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'NR4     ',AL1(60),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'NR4BLD  ',AL1(151),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'NR4TAPE ',AL1(98),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'NR4SUM  ',AL1(152),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'NYDISK  ',AL1(65),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'NYMOBTAX',AL1(117),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'NYTAPE  ',AL1(61),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'NWKGEN  ',AL1(85),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'OMINTER ',AL1(102),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'OMPOADD ',AL1(159),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'PAYROLL ',AL1(07),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'PGEST   ',AL1(29),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'PMUSACT ',AL1(128),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'PMUSIC  ',AL1(42),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'PMDISK  ',AL1(80),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'POSTINGS',AL1(124),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'P+BILLNG',AL1(132),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'P+CHECKS',AL1(131),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'P+PAY   ',AL1(135),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'P+REC   ',AL1(134),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'PRBILLNG',AL1(73),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'PRCHECKS',AL1(71),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'PROD    ',AL1(17),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'PRODERR ',AL1(92),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'PRTAX   ',AL1(130),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'PUBINT  ',AL1(105),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'PUBXML  ',AL1(157),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'PUBXML2 ',AL1(162),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'RATECALC',AL1(158),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'RETRO   ',AL1(49),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'RELEASE ',AL1(21),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'RLETTER ',AL1(21),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'RL1     ',AL1(145),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'RL1BLD  ',AL1(146),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'RL1SUM  ',AL1(147),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'RSUMMARY',AL1(23),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'RECOVERY',AL1(50),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'SCOPY   ',AL1(20),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'SDCHECKS',AL1(76),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'SEASONAL',AL1(52),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'SINTER  ',AL1(88),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'SNOTICE ',AL1(30),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'SNO2WEB ',AL1(108),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'SSUMMARY',AL1(31),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'TYP10INT',AL1(121),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'T4      ',AL1(142),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'T4BLD   ',AL1(143),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'T4SUM   ',AL1(144),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'T4ANR   ',AL1(148),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'T4ANRBLD',AL1(149),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'T4ANRSUM',AL1(150),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'T4RL1   ',AL1(154),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'UCTAPES ',AL1(46),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'UCDISK  ',AL1(72),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'UINTER  ',AL1(15),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'UNDISK  ',AL1(68),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'UNION   ',AL1(10),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'UNTAPE  ',AL1(25),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'UREPORT ',AL1(37),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'WEBSUM  ',AL1(110),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'WORKCOMP',AL1(56),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'WRITER  ',AL1(01),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'W2PRINT ',AL1(38),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'W2PUERTO',AL1(94),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'W2BUILD ',AL1(39),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'W2AUDIT ',AL1(40),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'W2C     ',AL1(44),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'W2TAPES ',AL1(41),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'W2DISK  ',AL1(109),X'0000',AL1(0,0,0,0)                  
         DC    X'04',C'W2SPOOL ',AL1(84),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'W298T   ',AL1(93),X'0000',AL1(0,0,0,0)                   
         DC    X'04',C'XREF    ',AL1(66),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'YTD     ',AL1(43),X'0000',AL1(0,0,0,0)                   
**NO-OP**DC    X'01',C'BYTD    ',AL1(57),X'0000',AL1(0,0,0,0)                   
         DC    X'01',C'YTDAUDIT',AL1(141),X'0000',AL1(0,0,0,0)                  
         DC    X'01',C'QUEST   ',AL1(79),X'0000',AL1(0,0,0,0)                   
         SPACE 3                                                                
*                                                                               
* X'02' ENTRIES ARE AVAILABLE ACTIONS                                           
*                                                                               
* CL8 EXPANDED ACTION NAME                                                      
* CL1 ACTION NUMBER                                                             
* CL1 ACTION EQUATE                                                             
* CL1 SPARE                                                                     
         SPACE 1                                                                
         DC    X'02',C'ADD     ',AL1(01,01,00,0,0,0,0)                          
         DC    X'02',C'CHANGE  ',AL1(02,01,00,0,0,0,0)                          
         DC    X'02',C'CREATE  ',AL1(12,13,00,0,0,0,0)                          
         DC    X'02',C'DISPLAY ',AL1(03,01,00,0,0,0,0)                          
         DC    X'02',C'DELETE  ',AL1(04,01,00,0,0,0,0)                          
         DC    X'02',C'GENERATE',AL1(12,16,00,0,0,0,0)                          
         DC    X'02',C'LIST    ',AL1(10,10,00,0,0,0,0)                          
         DC    X'02',C'MAINT   ',AL1(12,17,00,0,0,0,0)                          
         DC    X'02',C'REPORT  ',AL1(12,12,00,0,0,0,0)                          
         DC    X'02',C'RESTORE ',AL1(06,01,00,0,0,0,0)                          
         DC    X'02',C'SELECT  ',AL1(05,01,00,0,0,0,0)                          
         DC    X'02',C'UPDATE  ',AL1(12,15,00,0,0,0,0)                          
         DC    X'02',C'DOWN    ',AL1(12,18,00,0,0,0,0)                          
         DC    X'02',C'LIMIT   ',AL1(02,19,00,0,0,0,0)                          
         EJECT                                                                  
* DIRECTORY OF PHASES FOR SELECTED RECORD/ACTION                                
         SPACE 3                                                                
* X'03' ENTRIES ARE OK REC/ACT COMBOS                                           
* CL1 RECORD NUMBER                                                             
* CL1 ACTION EQUATE                                                             
* CL1 PHASE NUMBER FOR SCREEN                                                   
* CL1 PHASE NUMBER FOR EDIT                                                     
* CL1 PHASE NUMBER FOR SPECS                                                    
* CL1 PHASE NUMBER FOR REPORT                                                   
* CL1 WHEN OK BITS 80=SCREEN 40=NOW 20=SOON 10=OV 08=DDS                        
* CL2 CODE FOR REPORTS                                                          
* CL2 CODE FOR EOD HANDLING                                                     
         SPACE 1                                                                
*                                 SC  SP  OK                                    
*                                   OV  RP                                      
         DC    X'03',AL1(01,12),X'F101000138',C'RWRW'  REPORT WRITER            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(01,19),X'C801000118',C'    '  WRITER LIMIT             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(02,12),X'EA02000238',C'AHRW'  ADHOC REPORT             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(03,12),X'F303001338',C'BIB2'  BILLING                  
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(04,12),X'F404001438',C'CKCK'  CHECKS                   
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(07,12),X'F707001738',C'PRPR'  PAYROLL REGISTER         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(08,12),X'F808001838',C'IRIR'  INVOICE REGISTER         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(09,13),X'F909001918',C'BCBC'  CREATE BAL RECS          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(10,12),X'F203001338',C'UNUN'  UNION BILLING            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(11,12),X'FA0A001A38',C'HFHF'  HLD FEE NOTICES          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(13,12),X'FC1C001C18',C'BKBK'  BANK RECONCIL.           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(14,12),X'C51D001D08',C'KPKP'  CKPURGE REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(15,12),X'FE1E001E08',C'UIUI'  UNEMP. INTER.            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(17,12),X'F00F001F18',C'PNPN'  PRODUCTION INT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(19,12),X'F303001338',C'ACAC'  AGENCY COPIES            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(20,12),X'F303001338',C'SCSC'  SESSION COPIES           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(21,12),X'E121002118',C'RLRL'  RELEASE LETTERS          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(22,12),X'E222002218',C'IBIB'  INTERFACE BANK           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(23,12),X'E121002118',C'RSRS'  RELEASE SUMMARY          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(24,12),X'E323002338',C'AVAV'  ACTIVITY REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(25,12),X'E020002018',C'UTUT'  UNION TAPES              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(26,12),X'FA0A001A38',C'HSHS'  HLD FEE SUMMARY          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(27,12),X'E727002738',C'LBLB'  LABELS                   
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(74,12),X'E727004B38',C'LLLL'  LASER LABELS             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(28,12),X'E828002818',C'DMDM'  DMB&B TAPE               
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(29,12),X'E929002938',C'PGPG'  P&G 'ESTIMATE'           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(30,12),X'FA0A001A38',C'SNSN'  SECOND NOTICES           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(31,12),X'FA0A001A38',C'SSSS'  2ND NOTICE SUMM          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(32,12),X'F404001418',C'CNCN'  CANADIAN$ CHECKS         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(33,12),X'F404001438',C'DCDC'  DMB&B CHECKS             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(34,12),X'EA2A002A18',C'FXFX'  FIX PROGRAM              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(35,12),X'F303001318',C'DADA'  DMB&B ACOPIES            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(36,12),X'FC1C001C18',C'DBDB'  DMB&B BANK TAPE          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(37,12),X'EB1B002B18',C'URUR'  UNEMP. REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(38,12),X'EC2C002C38',C'W2W2'  W2 PRINT                 
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(39,12),X'ED2D002D18',C'WBWB'  W2 BUILD                 
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(40,12),X'EE2E002E18',C'WAWA'  W2 AUDIT                 
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(41,12),X'EF2F002F18',C'WTWT'  W2 TAPES                 
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(42,12),X'D030003038',C'PMPM'  PMUSIC REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(43,12),X'D131003118',C'YDYD'  YTD REPORT               
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(44,12),X'EE2E002E18',C'WCWC'  W2C FORMS                
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(45,12),X'D232003218',C'FWFW'  FACWRK REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(46,12),X'EB1B002B18',C'UCUC'  UC FORMS/TAPES           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(48,12),X'EB1B002B18',C'APAP'  AGENCY PROFIT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(48,18),X'EB1B002B38',C'GPGP'  APROF DOWN               
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(49,16),X'D535003518',C'RGRG'  RETRO GENERATE           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(49,12),X'D636003618',C'RRRR'  RETRO REPORT             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(50,12),X'E250005018',C'RCRC'  RECOVERY REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(51,12),X'E256005618',C'DIDI'  DINVOICE REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(52,12),X'E259005918',C'SESE'  SEASONAL REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(53,15),X'E515001518',C'AUAU'  ALLTAX UPDATE            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(53,12),X'E415001538',C'ARAR'  ALLTAX REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(54,12),X'E626002618',C'GYGY'  P&G GREY TAPE            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(55,12),X'D424002438',C'MCMC'  MCDONALD LIFE            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(56,12),X'EB16001618',C'WKWK'  WORKMANS COMP            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(57,12),X'F303001338',C'CXCX'  CHLOE COPIES             
         DC    AL1(0,0,0,0)                                                     
**NO-OP**DC    X'03',AL1(57,12),X'D737003718',C'BYBY'  BILL YTD REPORT          
**NO-OP**DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(08,17),X'D838003818',C'IMIM'  INVOICE MAINT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(58,12),X'D939003958',C'DDDD'  DUE DATE REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(59,12),X'DA3A003A38',C'DUDU'  DUECOMP  REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(60,12),X'DB3B003B18',C'NRNR'  NR4      REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(61,12),X'DC3C003C18',C'NYNY'  NYTAPE   REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(64,12),X'F303001338',C'CRCR'  CREDIT COPIES            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(65,12),X'CB1B002B18',C'NTNT'  NYDISK REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(65,18),X'CB1B002B38',C'NDND'  NYDISK DOWN              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(66,12),X'DF3F003F18',C'XRXR'  PAYROLL XREF             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(67,12),X'C040004018',C'AIAI'  AYINTER REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(67,18),X'C040004038',C'ADAD'  AYINTER DOWN             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(68,12),X'E020002018',C'UDUD'  UNDISK REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(68,18),X'E020002038',C'ODOD'  UNDISK DOWN              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(69,12),X'C141004118',C'NXNX'  NINTER REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(70,16),X'C242004238',C'AGAG'  ADVICE GENERATE          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(71,12),X'F404001438',C'PCPC'  PRINT CHECKS             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(72,12),X'EB1B002B18',C'UKUK'  UCDISK                   
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(72,18),X'EB1B002B38',C'KDKD'  UCDISK DOWN              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(73,12),X'F303001338',C'PBP2'  PRINT BILLING            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(75,12),X'C343004318',C'NENE'  NEDISK                   
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(76,12),X'E244004418',C'SDSD'  SDCHECKS                 
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(77,12),X'C545004518',C'CPCP'  COPURGE                  
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(78,12),X'C645004538',C'CHCH'  COHIST                   
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(79,12),X'C747004818',C'QUQU'  QUESTIONAIRE             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(80,12),X'D030003018',C'PDPD'  PMDISK REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(80,18),X'D030003038',C'IDID'  PMDISK DOWN              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(82,12),X'C040004038',C'ADAD'  AYDOWN REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(83,12),X'C040004018',C'ALAL'  AYLINTER REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(83,18),X'C040004038',C'LDLD'  AYLINTER DOWN            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(84,12),X'EC2C002C18',C'WSWS'  W2SPOOL REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(85,12),X'E249004918',C'NGNG'  NWKGEN REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(86,12),X'FA0A001A18',C'HDHD'  HLD FEE DISK             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(86,18),X'FA0A001A38',C'FDFD'  HFEE DISK DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(87,12),X'CA4A004A18',C'EPEP'  ESTIMATE PURGE           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(88,12),X'C141004118',C'SXSX'  SINTER REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(89,12),X'C04D004D18',C'CECE'  CEINTER REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(89,18),X'C04D004D38',C'CDCD'  CEINTER DOWN             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(90,12),X'DC4C004C18',C'NHNH'  NEWHIRE REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(91,12),X'CE4E004E38',C'CACA'  CACORP REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(92,12),X'F00F001F18',C'PEPE'  PRODERR REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(93,12),X'CF4F004F18',C'W9W9'  W2 TAPES 1998            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(94,12),X'C451005138',C'PUPU'  W2 FORMS FOR             
         DC    AL1(0,0,0,0)                            PUERTO RICO              
         DC    X'03',AL1(95,12),X'E052005218',C'BTBT'  BAINTER REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(95,18),X'E052005238',C'BDBD'  BAINTER DOWN             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(115,18),X'E052005238',C'MIMI' MCINTER DOWN             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(96,12),X'FC1C001C18',C'CFCF'  BANK CONFIRM             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(97,12),X'E253005318',C'JBJB'  JOB  REPORT              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(98,12),X'DB3D003D18',C'N4N4'  NR4TAPE  REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(99,12),X'FC1C001C18',C'CBCB'  CAN BANK REC.            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(100,12),X'E222002218',C'CICI'  CANANDIAN IB            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(101,12),X'EA54005418',C'HPHP'  HOLIDAY REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(102,12),X'C046004618',C'OIOI'  OMINTER REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(103,18),X'C055005538',C'AOAO'  AYINFO DOWN             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(104,12),X'E222002218',C'BPBP'  BANK PAY                
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(105,12),X'E828002818',C'PIPI'  PUBLICIS INT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(106,12),X'E858005818',C'COCO'  COKE EDI                
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(107,12),X'FA0A001A18',C'HUHU'  HLD FEE UPDATE          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(108,12),X'E25A005A38',C'TWTW'  ***2WEB REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(109,12),X'EF2F002F38',C'WDWD'  W2DISK                  
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(109,18),X'EF2F002F38',C'WEWE'  W2DISK DOWN             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(110,12),X'E25B005B18',C'SUSU'  WEBSUM REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(111,12),X'FB25002538',C'ININ'  INTERNET REPORT         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(112,12),X'FB25002538',C'NMNM'  NEWMEDIA REPORT         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(113,12),X'E25C005C38',C'CUCU'  C2C ACP REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(114,18),X'DE5D005D38',C'CLCL'  COMM'L DOWN             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(116,12),X'C05F005F18',C'JWJW'  JWINTER REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(117,18),X'C93E003E10',C'MOMO'  NYMOBTAX DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(118,12),X'F404001418',C'ECEC'  EURO CHECKS             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(119,18),X'E25E005E18',C'CTCT'  CLARAUDT DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(120,12),X'C060006018',C'CYCY'  CHRYSLER REPORT         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(121,18),X'C061006138',C'TITI'  TYP10INT DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(122,18),X'F562006238',C'CGCG'  CGUPDATE DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(123,12),X'EA63006338',C'LULU'  LCBUPD REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(124,12),X'F664006438',C'POPO'  POSTINGS REPORT         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(125,12),X'E265006518',C'NCNC'  NCLARUS REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(126,12),X'CC66006638',C'BSBS'  BILLSUM REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(127,12),X'F303001338',C'EBEB'  ECOPY REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(128,18),X'EA67006718',C'PAPA'  PMUSACT DOWN            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(129,18),X'CC68006838',C'ATAT'  ANNTAX DOWN             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(130,12),X'FD69006938',C'PTPT'  PRTAX REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(131,12),X'F404001438',C'PKPK'  P+ CHECKS               
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(132,12),X'F303001338',C'VBV2'  P+ BILLING              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(133,12),X'EF71007118',C'NNNN'  1099 REPORT             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(133,18),X'EF71007118',C'NNNN'  1099 DOWN               
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(137,12),X'EF71007118',C'TBTB'  1099 BUILD              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(138,12),X'EF71007118',C'TNTN'  1099 PRINT              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(134,12),X'FC1C001C18',C'BXBX'  P+ BANK REC             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(135,12),X'E222002218',C'B1B1'  P+ BANK PAY             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(136,12),X'E272007238',C'C4C4'  CITYRES REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(139,18),X'CD73007338',C'EVEV'  EVTIME DOWN             
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(140,18),X'EB73007338',C'CSCS'  CAPS DOWN               
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(141,18),X'EA74007418',C'YAYA'  YTDAUDIT DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(142,12),X'EF75007518',C'T4T4'  T4 REPORT               
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(142,18),X'EF75007518',C'T4T4'  T4 DOWN                 
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(143,12),X'EF75007518',C'4B4B'  T4BUILD REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(154,18),X'EF75007518',C'TRTR'  T4RL1 DOWN              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(156,12),X'CB71007138',C'FCFC'  FGNCORP PRINT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(144,12),X'EF75007518',C'4S4S'  T4SUM REPORT            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(145,12),X'EF76007618',C'R1R1'  RL1 REPORT              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(145,18),X'EF76007618',C'R1R1'  RL1 DOWN                
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(146,12),X'EF76007618',C'1B1B'  RL1BUILD REPORT         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(147,12),X'EF76007618',C'1S1S'  RL1SUM REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(148,18),X'EF77007718',C'4A4A'  T4ANR DOWN              
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(149,12),X'EF77007718',C'ABAB'  T4ANRBLD REPORT         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(150,12),X'EF77007718',C'ASAS'  T4ANRSUM REPORT         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(60,18),X'EF78007818',C'NRNR'   NR4 DOWN                
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(151,12),X'EF78007818',C'NBNB'  NR4BLD REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(152,12),X'EF78007818',C'NSNS'  NR4SUM REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(153,18),X'C061006138',C'CZCZ'  CPORINT DOWN            
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(155,12),X'DD79007938',C'MDMD'  MEDICARE REPORT         
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(155,18),X'DD79007938',C'MDMD'  MEDICARE DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(157,12),X'E828002818',C'PXPX'  PUBXML REPORT           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(158,18),X'E26A006A38',C'RARA'  RATECALC DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(159,12),X'EA0B000B18',C'OPOP'  OMPOADD REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(160,18),X'EA6B006B38',C'NONO'  NSBILL   DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(161,18),X'EA6B006B38',C'NPNP'  NSCHECK  DOWN           
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(162,12),X'E828002818',C'PLPL'  PUBXML2 REPORT          
         DC    AL1(0,0,0,0)                                                     
         DC    X'03',AL1(163,12),X'B999009918',C'EQEQ'  ER MQ XFR REP           
         DC    AL1(0,0,0,0)                                                     
         DC    X'FF'                                                            
         SPACE 1                                                                
*              PHASE USED UP BY SYSTEM SO FAR                                   
         SPACE 1                                                                
*              X0 X1 X2 X3 X4 X5 X6 X7 X8 X9 XA XB XC XD XE XF                  
*                                                                               
*        0X     Y  Y  Y  Y  Y        Y  Y  Y  Y              Y                  
*        1X              Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y                  
*        2X     Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y                  
*        3X     Y  Y  Y  Y     Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y                  
*        4X     Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y                  
*        5X     Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y                  
*        6X     Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y  Y                              
*        7X     Y  Y  Y  Y  Y  Y  Y  Y  Y  Y                                    
*        9X                                Y                                    
*        BX                                Y                                    
*        CX     S  S  S  S  S  S  S  S  S  S  S  S  S  S  S  S                  
*        DX     S  S  S  S  S  S  S  S  S  S  S  S  S  S  S  S                  
*        EX     S  S  S  S  S  S  S  S  S  S  S  S  S  S  S  S                  
*        FX     S  S  S  S  S  S  S  S  S  S  S  S  S  S  S  S                  
         SPACE 3                                                                
