*          DATA SET TASCRE6D   AT LEVEL 003 AS OF 10/14/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2E6D      DATE 10/14/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P H             T        Y              
TRUEMPH  DS    XL8                                                              
TRUEMP   DS    CL3      5   20    3  A  U N             T        Y   88         
TRUEMPX  DS    XL8                                                              
TRUEMPNH DS    XL8                                                              
TRUEMPN  DS    CL36     5   38   36  A  P N             T        Y              
TRUMHEDH DS    XL8                                                              
TRUMHED  DS    CL9      6    2    9  A  P H             T        Y              
TRUMINH  DS    XL8                                                              
TRUMIN   DS    CL9      6   20    9  A  U N             T        Y   96         
TRUMINX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   31    1  A  P N             T        Y              
TRUMINNH DS    XL8                                                              
TRUMINN  DS    CL36     6   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
TRUCURRH DS    XL8                                                              
TRUCURR  DS    CL1      8   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     9    2   15  A  P H             T        Y              
TRUWHLDH DS    XL8                                                              
TRUWHLD  DS    CL10     9   20   10  A  P N             T        Y              
TRUTRSSH DS    XL8                                                              
TRUTRSS  DS    CL9      9   38    9  A  P N             T        Y              
TRUR2MPH DS    XL8                                                              
TRUR2MP  DS    CL15    10    2   15  A  P Z             T        Y              
TRUR2MTH DS    XL8                                                              
TRUR2MT  DS    CL10    10   20   10  A  P N             T        Y   23         
TRUR2MTX DS    XL8                                                              
TRUIINVH DS    XL8                                                              
TRUIINV  DS    CL15    12   20   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     24    2    7  A  P H             T        Y              
TRULAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
TRUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 352  BYTES                            
