*          DATA SET TASCR59D   AT LEVEL 001 AS OF 10/28/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F259D      DATE 10/28/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
ISUAGYH  DS    XL8                                                              
ISUAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
ISUAGYX  DS    XL8                                                              
ISUAGYNH DS    XL8                                                              
ISUAGYN  DS    CL36     5   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
ISUINVH  DS    XL8                                                              
ISUINV   DS    CL6      6   10    6  A  U N             T        Y  144         
ISUINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
ISUCIDH  DS    XL8                                                              
ISUCID   DS    CL12     8   10   12  A  U N             T        Y              
ISUCOMNH DS    XL8                                                              
ISUCOMN  DS    CL20     8   28   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   55    3  A  P N             T        Y              
ISULFTH  DS    XL8                                                              
ISULFT   DS    CL3      8   59    3  A  U N             T        Y              
ISULIDH  DS    XL8                                                              
ISULID   DS    CL12     8   63   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
ISUCYCH  DS    XL8                                                              
ISUCYC   DS    CL17     9   10   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10    2    4  A  P N             T        Y              
ISUTYPEH DS    XL8                                                              
ISUTYPE  DS    CL16    10   10   16  A  U N             T        Y              
ISUBCAH  DS    XL8                                                              
ISUBCA   DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12    4   20  A  P N             T        Y              
ISUNNWH  DS    XL8                                                              
ISUNNW   DS    CL1     12   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    12   45   19  A  P N             T        Y              
ISUTEXH  DS    XL8                                                              
ISUTEX   DS    CL1     13    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL23    13    4   23  A  P N             T        Y              
ISUFGRH  DS    XL8                                                              
ISUFGR   DS    CL1     13   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   45   13  A  P N             T        Y              
ISUIN5H  DS    XL8                                                              
ISUIN5   DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14    4   17  A  P N             T        Y              
ISUICUH  DS    XL8                                                              
ISUICU   DS    CL1     14   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    14   45   16  A  P N             T        Y              
ISUSRIH  DS    XL8                                                              
ISUSRI   DS    CL1     15    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL22    15    4   22  A  P N             T        Y              
ISUPAGH  DS    XL8                                                              
ISUPAG   DS    CL1     15   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    15   45   19  A  P N             T        Y              
ISUCT2H  DS    XL8                                                              
ISUCT2   DS    CL1     16    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16    4   13  A  P N             T        Y              
ISUNWKH  DS    XL8                                                              
ISUNWK   DS    CL1     16   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   45   13  A  P N             T        Y              
ISUCABH  DS    XL8                                                              
ISUCAB   DS    CL1     17    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    4   12  A  P N             T        Y              
ISUGPUH  DS    XL8                                                              
ISUGPU   DS    CL1     17   43    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   45   20  A  P N             T        Y              
ISUGOVH  DS    XL8                                                              
ISUGOV   DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18    4   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    24    2   12  A  P H             T        Y              
ISULAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ISUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
