*          DATA SET TASCRD5D   AT LEVEL 002 AS OF 06/17/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2D5D      DATE 06/17/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SNXAGYH  DS    XL8                                                              
SNXAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SNXAGYX  DS    XL8                                                              
SNXAGYNH DS    XL8                                                              
SNXAGYN  DS    CL16     5   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   38    8  A  P N             T        Y              
SNXMATH  DS    XL8                                                              
SNXMAT   DS    CL1      5   47    1  A  U N             T        Y   53         
SNXMATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     5   54   12  A  P N             T        Y              
SNXMDTEH DS    XL8                                                              
SNXMDTE  DS    CL8      5   67    8  A  U N             T        Y   55         
SNXMDTEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SNXNCLIH DS    XL8                                                              
SNXNCLI  DS    CL3      6   10    3  A  U N             T        Y   31         
SNXNCLIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
SNXNPRDH DS    XL8                                                              
SNXNPRD  DS    CL3      6   29    3  A  U N             T        Y   33         
SNXNPRDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   38    8  A  P N             T        Y              
SNXUSDH  DS    XL8                                                              
SNXUSD   DS    CL1      6   47    1  A  U N             T        Y   57         
SNXUSDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6   54    9  A  P N             T        Y              
SNXUDTEH DS    XL8                                                              
SNXUDTE  DS    CL8      6   67    8  A  U N             T        Y   59         
SNXUDTEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
SNXNIDH  DS    XL8                                                              
SNXNID   DS    CL8      7   10    8  A  U N             T        Y   61         
SNXNIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
SNXFMTH  DS    XL8                                                              
SNXFMT   DS    CL1      7   29    1  A  U N             T        Y   94         
SNXFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   38    8  A  P N             T        Y              
SNXUIDH  DS    XL8                                                              
SNXUID   DS    CL6      7   47    6  A  U N             T        Y   37         
SNXUIDX  DS    XL8                                                              
SNXDELLH DS    XL8                                                              
SNXDELL  DS    CL8      7   54    8  A  P Z             T        Y              
SNXDELH  DS    XL8                                                              
SNXDEL   DS    CL1      7   67    1  A  P Z             T        Y   63         
SNXDELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
SNXMEDH  DS    XL8                                                              
SNXMED   DS    CL1      8   10    1  A  U N             T        Y   15         
SNXMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   20    7  A  P N             T        Y              
SNXUSEH  DS    XL8                                                              
SNXUSE   DS    CL3      8   29    3  A  U N             T        Y   47         
SNXUSEX  DS    XL8                                                              
SNXKEYXH DS    XL8                                                              
SNXKEYX  DS    CL1      8   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL38     9    2   38  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL34     9   41   34  A  P H             T        Y              
SNXSELH  DS    XL8                                                              
SNXSEL   DS    CL3     10    2    3  A  U N             T        Y    1         
SNXSELX  DS    XL8                                                              
SNXFRSTH DS    XL8                                                              
SNXFRST  DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
SNXLSTH  DS    XL8                                                              
SNXLST   DS    CL74    23    6   74  A  P N             T        Y              
SNXLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SNXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1864 BYTES                            
