*          DATA SET TASCRC5D   AT LEVEL 004 AS OF 03/17/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2C5D      DATE 03/17/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13  A   P    H         T        Y              
SWOSSNH  DS    CL8                                                              
SWOSSN   DS    CL9      5   20    9  N   U    N         T        Y   96         
SWOSSNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   31    1  A   P    N         T        Y              
SWOSSNNH DS    CL8                                                              
SWOSSNN  DS    CL33     5   38   33  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    8    7  A   P    H         T        Y              
SWOADDRH DS    CL8                                                              
SWOADDR  DS    CL30     7   20   30  A   U    N         T        Y   10         
SWOADDRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30     8   20   30  A   U    N         T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30     9   20   30  A   U    N         T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    10   20   30  A   U    N         T        Y   10         
         DS    CL8                                                              
SWOLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SWOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 304  BYTES                            
