*          DATA SET TASCR7DD   AT LEVEL 003 AS OF 11/27/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F27DD      DATE 11/27/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
CGMAGYH  DS    XL8                                                              
CGMAGY   DS    CL6      5   20    6  A  U N             T        Y   16         
CGMAGYX  DS    XL8                                                              
CGMAGYNH DS    XL8                                                              
CGMAGYN  DS    CL16     5   28   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
CGMCLIH  DS    XL8                                                              
CGMCLI   DS    CL6      6   20    6  A  U N             T        Y   32         
CGMCLIX  DS    XL8                                                              
CGMCLINH DS    XL8                                                              
CGMCLIN  DS    CL16     6   28   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
CGMPRDH  DS    XL8                                                              
CGMPRD   DS    CL6      7   20    6  A  U N             T        Y   56         
CGMPRDX  DS    XL8                                                              
CGMPRDNH DS    XL8                                                              
CGMPRDN  DS    CL16     7   28   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     8    2   15  A  P H             T        Y              
CGMCOGH  DS    XL8                                                              
CGMCOG   DS    CL6      8   20    6  A  U N             T        Y   72         
CGMCOGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P H             T        Y              
CGMNAMEH DS    XL8                                                              
CGMNAME  DS    CL36    10   20   36  A  U N             T        Y    2         
CGMNAMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    11    2   15  A  P N             T        Y              
CGMSNMEH DS    XL8                                                              
CGMSNME  DS    CL16    11   20   16  A  U N             T        Y    6         
CGMSNMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    13    2   13  A  P N             T        Y              
CGMLCHGH DS    XL8                                                              
CGMLCHG  DS    CL17    13   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    24    2   25  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL24    24   38   24  A  P H             T        Y              
CGMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CGMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
