*          DATA SET TASCREBD   AT LEVEL 004 AS OF 04/24/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2EBD      DATE 04/24/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      4    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   18    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     4   20   13  A  P N             T        Y              
CKSSDTH  DS    XL8                                                              
CKSSDT   DS    CL1      4   36    1  A  U N             T        Y   96         
CKSSDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     4   38   10  A  P N             T        Y              
CKSCDTH  DS    XL8                                                              
CKSCDT   DS    CL1      4   50    1  A  U N             T        Y   97         
CKSCDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     5   20   15  A  P N             T        Y              
CKSCCKH  DS    XL8                                                              
CKSCCK   DS    CL1      5   36    1  A  U N             T        Y   99         
CKSCCKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     6   20   14  A  P N             T        Y              
CKSWTSH  DS    XL8                                                              
CKSWTS   DS    CL1      6   36    1  A  U N             T        Y   98         
CKSWTSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15     6   38   15  A  P N             T        Y              
CKSWOSH  DS    XL8                                                              
CKSWOS   DS    CL1      6   54    1  A  U N             T        Y   99         
CKSWOSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31     7    2   31  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL26     7   38   26  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13     7   67   13  A  P H             T        Y              
CKSSELH  DS    XL8                                                              
CKSSEL   DS    CL1      8    2    1  A  U N             T        Y   30         
CKSSELX  DS    XL8                                                              
CKSDETH  DS    XL8                                                              
CKSDET   DS    CL75     8    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
CKSLSTH  DS    XL8                                                              
CKSLST   DS    CL75    24    6   75  A  P N             T        Y              
CKSLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CKSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
