*          DATA SET TASCR3CD   AT LEVEL 001 AS OF 01/04/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F23CD      DATE 01/04/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SW4STRH  DS    XL8                                                              
SW4STR   DS    CL24     5   10   24  A  U N             T        Y   90         
SW4STRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     5   38   11  A  P N             T        Y              
SW4CORPH DS    XL8                                                              
SW4CORP  DS    CL9      5   50    9  N  U N             T        Y   96         
SW4CORPX DS    XL8                                                              
SW4CNAMH DS    XL8                                                              
SW4CNAM  DS    CL16     5   62   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SW4FMTH  DS    XL8                                                              
SW4FMT   DS    CL1      6   10    1  A  U N             T        Y   94         
SW4FMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
SW4OPTSH DS    XL8                                                              
SW4OPTS  DS    CL25     6   50   25  A  U N             T        Y  102         
SW4OPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
SW4LPHDH DS    XL8                                                              
SW4LPHD  DS    CL23     8    2   23  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL39     8   33   39  A  P H             T        Y              
SW4SELH  DS    XL8                                                              
SW4SEL   DS    CL3      9    2    3  A  U N             T        Y    1         
SW4SELX  DS    XL8                                                              
SW4SSNH  DS    XL8                                                              
SW4SSN   DS    CL74     9    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
SW4LSTH  DS    XL8                                                              
SW4LST   DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL66    24    2   66  A  P H             T        Y              
SW4LAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SW4WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1888 BYTES                            
