*          DATA SET TASCR6ED   AT LEVEL 003 AS OF 07/30/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F26ED      DATE 07/30/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
TSLFMTH  DS    XL8                                                              
TSLFMT   DS    CL1      5   10    1  A  U N             T        Y   94         
TSLFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   18    5  A  P N             T        Y              
TSLSTRH  DS    XL8                                                              
TSLSTR   DS    CL16     5   26   16  A  U N             T        Y   11         
TSLSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TSLOPTSH DS    XL8                                                              
TSLOPTS  DS    CL32     6   10   32  A  U N             T        Y  102         
TSLOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      7    6    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      7   18    4  A  P H             T        Y              
TSLSELH  DS    XL8                                                              
TSLSEL   DS    CL3      8    2    3  A  U N             T        Y    1         
TSLSELX  DS    XL8                                                              
TSLFRSTH DS    XL8                                                              
TSLFRST  DS    CL75     8    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
TSLLSELH DS    XL8                                                              
TSLLSEL  DS    CL3     23    2    3  A  U N             T        Y    1         
TSLLSELX DS    XL8                                                              
TSLLSTH  DS    XL8                                                              
TSLLST   DS    CL75    23    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL64    24    2   64  A  P H             T        Y              
TSLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
TSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
