*          DATA SET TASCR65D   AT LEVEL 002 AS OF 08/24/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F265D      DATE 08/24/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
EVLAGYH  DS    XL8                                                              
EVLAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
EVLAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   18    6  A  P N             T        Y              
EVLCLIH  DS    XL8                                                              
EVLCLI   DS    CL6      5   26    6  A  U N             T        Y   32         
EVLCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     5   45   14  A  P N             T        Y              
EVLPRDH  DS    XL8                                                              
EVLPRD   DS    CL6      5   60    6  A  U N             T        Y   48         
EVLPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
EVLFMTH  DS    XL8                                                              
EVLFMT   DS    CL1      6   10    1  A  U N             T        Y   94         
EVLFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   18    5  A  P N             T        Y              
EVLSTRH  DS    XL8                                                              
EVLSTR   DS    CL16     6   26   16  A  U N             T        Y   11         
EVLSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   45    4  A  P N             T        Y              
EVLJOBH  DS    XL8                                                              
EVLJOB   DS    CL16     6   60   16  A  U N             T        Y   40         
EVLJOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
EVLOPTSH DS    XL8                                                              
EVLOPTS  DS    CL34     7   10   34  A  U N             T        Y  102         
EVLOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      8    6    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     8   19   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL14     8   46   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   66    4  A  P H             T        Y              
EVLSELH  DS    XL8                                                              
EVLSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
EVLSELX  DS    XL8                                                              
EVLFRSTH DS    XL8                                                              
EVLFRST  DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
EVLLSELH DS    XL8                                                              
EVLLSEL  DS    CL3     24    2    3  A  U N             T        Y    1         
EVLLSELX DS    XL8                                                              
EVLLSTH  DS    XL8                                                              
EVLLST   DS    CL75    24    6   75  A  P N             T        Y              
EVLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
EVLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
