*          DATA SET TASCR08D   AT LEVEL 003 AS OF 04/07/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F208D      DATE 04/07/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL3      5    2    3  A  P H             T        Y              
STREMPH  DS    XL8                                                              
STREMP   DS    CL3      5   10    3  A  U N             T        Y   88         
STREMPX  DS    XL8                                                              
STRSHEDH DS    XL8                                                              
STRSHED  DS    CL7      5   20    7  A  P H             T        Y              
STRSSNH  DS    XL8                                                              
STRSSN   DS    CL9      5   28    9  A  U N             T        Y   96         
STRSSNX  DS    XL8                                                              
STRSSNNH DS    XL8                                                              
STRSSNN  DS    CL16     5   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
STRSOTH  DS    XL8                                                              
STRSOT   DS    CL3      6   10    3  A  U N             T        Y    1         
STRSOTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   20    4  A  P N             T        Y              
STRCOTH  DS    XL8                                                              
STRCOT   DS    CL3      6   28    3  A  U N             T        Y    2         
STRCOTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   38    5  A  P N             T        Y              
STRCURRH DS    XL8                                                              
STRCURR  DS    CL1      6   44    1  A  U N             T        Y    3         
STRCURRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19     6   54   19  A  P N             T        Y              
STRFRCH  DS    XL8                                                              
STRFRC   DS    CL1      6   74    1  A  U N             T        Y    7         
STRFRCX  DS    XL8                                                              
STRKENDH DS    XL8                                                              
STRKEND  DS    CL1      6   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   20   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     8   38   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
STRCFTAH DS    XL8                                                              
STRCFTA  DS    CL10     9   20   10  A  P N             T        Y              
STRFTAXH DS    XL8                                                              
STRFTAX  DS    CL10     9   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
STRCFICH DS    XL8                                                              
STRCFIC  DS    CL10    10   20   10  A  P N             T        Y              
STRFICAH DS    XL8                                                              
STRFICA  DS    CL10    10   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
STRCSTAH DS    XL8                                                              
STRCSTA  DS    CL10    11   20   10  A  P N             T        Y              
STRSTAXH DS    XL8                                                              
STRSTAX  DS    CL10    11   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
STRCSUIH DS    XL8                                                              
STRCSUI  DS    CL10    12   20   10  A  P N             T        Y              
STRSUIH  DS    XL8                                                              
STRSUI   DS    CL10    12   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
STRCSDIH DS    XL8                                                              
STRCSDI  DS    CL10    13   20   10  A  P N             T        Y              
STRSDIH  DS    XL8                                                              
STRSDI   DS    CL10    13   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
STRCLTAH DS    XL8                                                              
STRCLTA  DS    CL10    14   20   10  A  P N             T        Y              
STRLTAXH DS    XL8                                                              
STRLTAX  DS    CL10    14   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
STRCMDEH DS    XL8                                                              
STRCMDE  DS    CL10    15   20   10  A  P N             T        Y              
STRMDEDH DS    XL8                                                              
STRMDED  DS    CL10    15   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
STRCDUEH DS    XL8                                                              
STRCDUE  DS    CL10    16   20   10  A  P N             T        Y              
STRMDUEH DS    XL8                                                              
STRMDUE  DS    CL10    16   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  A  P N             T        Y              
STRCMPRH DS    XL8                                                              
STRCMPR  DS    CL10    17   20   10  A  P N             T        Y              
STRMMPRH DS    XL8                                                              
STRMMPR  DS    CL10    17   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
STRCPCHH DS    XL8                                                              
STRCPCH  DS    CL10    18   20   10  A  P N             T        Y              
STRMPCHH DS    XL8                                                              
STRMPCH  DS    CL10    18   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
STRCCTXH DS    XL8                                                              
STRCCTX  DS    CL10    19   20   10  A  P N             T        Y              
STRMCTXH DS    XL8                                                              
STRMCTX  DS    CL10    19   38   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    20   20   10  A  P N             T        Y              
STRNETH  DS    XL8                                                              
STRNET   DS    CL10    20   38   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12    22    2   12  A  P N             T        Y              
STRCOMMH DS    XL8                                                              
STRCOMM  DS    CL30    22   20   30  A  U N             T        Y              
STRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
STRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1016 BYTES                            
