*          DATA SET TASCR5FD   AT LEVEL 002 AS OF 12/26/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F25FD      DATE 12/26/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL3      5    2    3  A  P H             T        Y              
GKLSSNH  DS    XL8                                                              
GKLSSN   DS    CL9      5   10    9  A  U N             T        Y   96         
GKLSSNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   20    4  A  P H             T        Y              
GKLCODEH DS    XL8                                                              
GKLCODE  DS    CL6      5   28    6  A  U N             T        Y  109         
GKLCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
GKLYEARH DS    XL8                                                              
GKLYEAR  DS    CL17     6   10   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL38     7    1   38  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL29     7   48   29  A  P H             T        Y              
GKLLSTH  DS    XL8                                                              
GKLLST   DS    CL77     8    1   77  A  P N             T        Y    1         
GKLLSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77     9    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    10    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    11    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    12    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    13    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    14    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    15    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    16    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    17    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    18    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    19    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    20    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    21    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    22    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    23    1   77  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL46    24    2   46  A  P H             T        Y              
GKLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
GKLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
