*          DATA SET TASCR78D   AT LEVEL 002 AS OF 04/30/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F278D      DATE 04/30/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TD1MSGH  DS    XL8                                                              
TD1MSG   DS    CL78     4    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
TD1CHKH  DS    XL8                                                              
TD1CHK   DS    CL8      5   10    8  A  U N             T        Y  160         
TD1CHKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
TD1PIDH  DS    XL8                                                              
TD1PID   DS    CL9      5   28    9  A  U N             T        Y   96         
TD1PIDX  DS    XL8                                                              
TD1PIDNH DS    XL8                                                              
TD1PIDN  DS    CL16     5   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   56    4  A  P H             T        Y              
TD1TYPEH DS    XL8                                                              
TD1TYPE  DS    CL1      5   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   64    5  A  P N             T        Y              
TD1FREQH DS    XL8                                                              
TD1FREQ  DS    CL1      5   70    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   73    3  A  P N             T        Y              
TD1EMPH  DS    XL8                                                              
TD1EMP   DS    CL3      5   78    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   31    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11     6   49   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   60    1  A  P H             T        Y              
TD1PPROH DS    XL8                                                              
TD1PPRO  DS    CL2      6   62    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      6   65    1  A  P H             T        Y              
TD1NCHH  DS    XL8                                                              
TD1NCH   DS    CL16     7    2   16  A  P H             T        Y              
TD1FNCLH DS    XL8                                                              
TD1FNCL  DS    CL11     7   29   11  A  P N             T        Y              
TD1PNCLH DS    XL8                                                              
TD1PNCL  DS    CL11     7   52   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24     8    2   24  A  P H             T        Y              
TD1FDC1H DS    XL8                                                              
TD1FDC1  DS    CL1      8   34    1  A  P N             T        Y              
TD1PDC1H DS    XL8                                                              
TD1PDC1  DS    CL1      8   57    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P H             T        Y              
TD1FEXMH DS    XL8                                                              
TD1FEXM  DS    CL1      9   34    1  A  P N             T        Y              
TD1PEXMH DS    XL8                                                              
TD1PEXM  DS    CL1      9   57    1  A  P N             T        Y              
TD1PZHH  DS    XL8                                                              
TD1PZH   DS    CL22    10    2   22  A  P H             T        Y              
TD1FPREH DS    XL8                                                              
TD1FPRE  DS    CL11    10   29   11  A  P N             T        Y              
TD1PPREH DS    XL8                                                              
TD1PPRE  DS    CL11    10   52   11  A  P N             T        Y              
TD1HDHH  DS    XL8                                                              
TD1HDH   DS    CL24    11    2   24  A  P H             T        Y              
TD1PHDEH DS    XL8                                                              
TD1PHDE  DS    CL11    11   52   11  A  P N             T        Y              
TD1SPHH  DS    XL8                                                              
TD1SPH   DS    CL22    12    2   22  A  P H             T        Y              
TD1PSPYH DS    XL8                                                              
TD1PSPY  DS    CL11    12   52   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    13    2   25  A  P H             T        Y              
TD1PEHCH DS    XL8                                                              
TD1PEHC  DS    CL1     13   57    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    14    2   16  A  P H             T        Y              
TD1FCPPH DS    XL8                                                              
TD1FCPP  DS    CL1     14   34    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  P H             T        Y              
TD1FDH   DS    XL8                                                              
TD1FD    DS    CL11    16   29   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    2    5  A  P H             T        Y              
TD1PRH   DS    XL8                                                              
TD1PR    DS    CL11    17   52   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  P H             T        Y              
TD1CPPH  DS    XL8                                                              
TD1CPP   DS    CL11    18   29   11  A  P N             T        Y              
TD1CPP2H DS    XL8                                                              
TD1CPP2  DS    CL11    18   52   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    2    6  A  P H             T        Y              
TD1EIH   DS    XL8                                                              
TD1EI    DS    CL11    19   29   11  A  P N             T        Y              
TD1EI2H  DS    XL8                                                              
TD1EI2   DS    CL11    19   52   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20    2    4  A  P H             T        Y              
TD1QPIPH DS    XL8                                                              
TD1QPIP  DS    CL11    20   29   11  A  P N             T        Y              
TD1QPI2H DS    XL8                                                              
TD1QPI2  DS    CL11    20   52   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL44    24    2   44  A  P H             T        Y              
TD1LAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
TD1WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1008 BYTES                            
