*          DATA SET TASCR07D   AT LEVEL 007 AS OF 07/09/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F207D      DATE 07/09/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13  A   P    H         T        Y              
SMRCHKH  DS    CL8                                                              
SMRCHK   DS    CL17     5   20   17  A   U    N         T        Y  160         
SMRCHKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   42    7  A   P    N         T        Y              
SMROPTH  DS    CL8                                                              
SMROPT   DS    CL17     5   50   17  A   U    N         T        Y    1         
SMROPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A   P    N         T        Y              
SMRLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SMRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 120  BYTES                            
