*          DATA SET TASCR7FD   AT LEVEL 011 AS OF 08/21/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F27FD      DATE 08/21/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13  A  P H             T        Y              
SDVFAYH  DS    CL8                                                              
SDVFAY   DS    CL6      5   18    6  A  U N             T        Y   16         
SDVFAYX  DS    CL8                                                              
SDVFAYNH DS    CL8                                                              
SDVFAYN  DS    CL36     5   32   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     6    2   15  A  P H             T        Y              
SDVFCIDH DS    CL8                                                              
SDVFCID  DS    CL12     6   18   12  A  U N             T        Y   64         
SDVFCIDX DS    CL8                                                              
SDVFCDNH DS    CL8                                                              
SDVFCDN  DS    CL36     6   32   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A  P H             T        Y              
SDVFDVH  DS    CL8                                                              
SDVFDV   DS    CL6      7   18    6  A  U N             T        Y  208         
SDVFDVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
SDVTODVH DS    CL8                                                              
SDVTODV  DS    CL13     9    2   13  A  P H             T        Y              
SDVTDVH  DS    CL8                                                              
SDVTDV   DS    CL6      9   18    6  A  U N             T        Y  209         
SDVTDVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    10    2   15  A  P N             T        Y              
SDVTCIDH DS    CL8                                                              
SDVTCID  DS    CL12    10   18   12  A  U N             T        Y   65         
SDVTCIDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    11    2   15  A  P N             T        Y              
SDVTTTLH DS    CL8                                                              
SDVTTTL  DS    CL36    11   18   36  A  U N             T        Y   67         
SDVTTTLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    12    2   15  A  P N             T        Y              
SDVTSECH DS    CL8                                                              
SDVTSEC  DS    CL3     12   18    3  A  U N             T        Y   69         
SDVTSECX DS    CL8                                                              
SDVLSTH  DS    CL8                                                              
SDVLST   DS    CL1     12   79    1  A  P N             T        Y              
SDVLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SDVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 464  BYTES                            
