*          DATA SET TASCR87D   AT LEVEL 023 AS OF 04/02/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F287D      DATE 04/02/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SGTPIDH  DS    XL8                                                              
SGTPID   DS    CL9      5   10    9  A  U N             T        Y   96         
SGTPIDX  DS    XL8                                                              
SGTPIDNH DS    XL8                                                              
SGTPIDN  DS    CL36     5   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
SGTGUAH  DS    XL8                                                              
SGTGUA   DS    CL4      6   10    4  A  U N             T        Y  108         
SGTGUAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   16    1  A  P N             T        Y              
SGTHEADH DS    XL8                                                              
SGTHEAD  DS    CL25     6   47   25  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15     9    2   15  A  P H             T        Y              
SGTEPDH  DS    XL8                                                              
SGTEPD   DS    CL17     9   20   17  A  U N             T        Y  117         
SGTEPDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   38    6  A  P N             T        Y              
SGTEAMTH DS    XL8                                                              
SGTEAMT  DS    CL12     9   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
SGTECYCH DS    XL8                                                              
SGTECYC  DS    CL17    10   20   17  A  U N             T        Y   15         
SGTECYCX DS    XL8                                                              
SGTEPBDH DS    XL8                                                              
SGTEPBD  DS    CL13    10   38   13  A  P N             T        Y              
SGTEPBLH DS    XL8                                                              
SGTEPBL  DS    CL12    10   60   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
SGTEAGYH DS    XL8                                                              
SGTEAGY  DS    CL6     11   10    6  A  U N             T        Y              
SGTEAGNH DS    XL8                                                              
SGTEAGN  DS    CL16    11   20   16  A  P N             T        Y              
SGTEADDH DS    XL8                                                              
SGTEADD  DS    CL14    11   38   14  A  P N             T        Y              
SGTEADAH DS    XL8                                                              
SGTEADA  DS    CL12    11   60   12  A  U N             T        Y   17         
SGTEADAX DS    XL8                                                              
SGTESBTH DS    XL8                                                              
SGTESBT  DS    CL21    12   38   21  A  P N             T        Y              
SGTESBAH DS    XL8                                                              
SGTESBA  DS    CL12    12   60   12  A  U N             T        Y   18         
SGTESBAX DS    XL8                                                              
SGTENBDH DS    XL8                                                              
SGTENBD  DS    CL11    13   38   11  A  P N             T        Y              
SGTENBLH DS    XL8                                                              
SGTENBL  DS    CL12    13   60   12  A  P N             T        Y              
SGTECMHH DS    XL8                                                              
SGTECMH  DS    CL8     14    2    8  A  P N             T        Y              
SGTECMTH DS    XL8                                                              
SGTECMT  DS    CL40    14   20   40  A  U N             T        Y   19         
SGTECMTX DS    XL8                                                              
SGTNPHDH DS    XL8                                                              
SGTNPHD  DS    CL10    17    2   10  A  P N             T        Y              
SGTNPDH  DS    XL8                                                              
SGTNPD   DS    CL17    17   20   17  A  U N             T        Y   23         
SGTNPDX  DS    XL8                                                              
SGTNAMHH DS    XL8                                                              
SGTNAMH  DS    CL6     17   38    6  A  P N             T        Y              
SGTNAMTH DS    XL8                                                              
SGTNAMT  DS    CL12    17   47   12  A  U N             T        Y              
SGTNAGHH DS    XL8                                                              
SGTNAGH  DS    CL6     18    2    6  A  P N             T        Y              
SGTNAGYH DS    XL8                                                              
SGTNAGY  DS    CL6     18   10    6  A  P N             T        Y              
SGTNAGNH DS    XL8                                                              
SGTNAGN  DS    CL16    18   20   16  A  P N             T        Y              
SGTNCMHH DS    XL8                                                              
SGTNCMH  DS    CL8     19    2    8  A  P N             T        Y              
SGTNCMTH DS    XL8                                                              
SGTNCMT  DS    CL40    19   20   40  A  U N             T        Y   19         
SGTNCMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
SGTLCHGH DS    XL8                                                              
SGTLCHG  DS    CL17    22   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    24    2   50  A  P H             T        Y              
SGTPFCMH DS    XL8                                                              
SGTPFCM  DS    CL12    24   55   12  A  P H             T        Y              
SGTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SGTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 952  BYTES                            
