*          DATA SET TASCR67D   AT LEVEL 001 AS OF 09/14/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F267D      DATE 09/14/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
PTYPTYH  DS    XL8                                                              
PTYPTY   DS    CL6      5   10    6  A  U N             T        Y  145         
PTYPTYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
PTYNAMEH DS    XL8                                                              
PTYNAME  DS    CL36     7   16   36  A  U N             T        Y    1         
PTYNAMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
PTYUNITH DS    XL8                                                              
PTYUNIT  DS    CL1      8   16    1  A  U N             T        Y   11         
PTYUNITX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
PTYWAGEH DS    XL8                                                              
PTYWAGE  DS    CL1      9   16    1  A  U N             T        Y   15         
PTYWAGEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10    2    4  A  P N             T        Y              
PTYTAXH  DS    XL8                                                              
PTYTAX   DS    CL1     10   16    1  A  U N             T        Y   13         
PTYTAXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
PTYSTATH DS    XL8                                                              
PTYSTAT  DS    CL45    11   16   45  A  U N             T        Y   38         
PTYSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    13    2   13  A  P N             T        Y              
PTYLCHGH DS    XL8                                                              
PTYLCHG  DS    CL17    13   16   17  A  P N             T        Y              
PTYLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
PTYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 328  BYTES                            
