*          DATA SET TASCR1BD   AT LEVEL 020 AS OF 05/07/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F21BD      DATE 05/07/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13  A   P    H         T        Y              
SEMEMPH  DS    CL8                                                              
SEMEMP   DS    CL3      5   20    3  A   U    N         T        Y   88         
SEMEMPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   25    1  A   P    N         T        Y              
SEMHEMNH DS    CL8                                                              
SEMHEMN  DS    CL4      5   36    4  A   P    H         T        Y              
SEMEMPNH DS    CL8                                                              
SEMEMPN  DS    CL36     5   42   36  A   U    N         T        Y    2         
SEMEMPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     6    2   10  A   P    H         T        Y              
SEMIRSH  DS    CL8                                                              
SEMIRS   DS    CL14     6   20   14  A   U    N         T        Y   47         
SEMIRSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   36    4  A   P    H         T        Y              
SEMGST#H DS    CL8                                                              
SEMGST#  DS    CL10     6   42   10  A   U    N         T        Y   51         
SEMGST#X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     7    2   13  A   P    H         T        Y              
SEMDSTH  DS    CL8                                                              
SEMDST   DS    CL2      7   20    2  A   U    N         T        Y   49         
SEMDSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   36    4  A   P    H         T        Y              
SEMADDRH DS    CL8                                                              
SEMADDR  DS    CL30     7   42   30  A   U    N         T        Y   10         
SEMADDRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30     8   42   30  A   U    N         T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30     9   42   30  A   U    N         T        Y   10         
         DS    CL8                                                              
SEMLHDRH DS    CL8                                                              
SEMLHDR  DS    CL1      9   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  A   P    H         T        Y              
SEMSIDH  DS    CL8                                                              
SEMSID   DS    CL18    10   22   18  A   U    N         T        Y  102         
SEMSIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    10   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    10   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    16    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    16   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    16   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    16   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    17    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    17   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    17   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    17   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    18    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    18   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    18   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    18   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    19    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    19   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    19   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    19   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    20    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    20   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    20   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    20   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    21    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    21   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    21   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    21   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    22    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    22   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    22   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    22   62   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    23    2   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    23   22   18  A   U    N         T        Y  102         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    23   42   18  A   U    N         T        Y  102         
         DS    CL8                                                              
SEMLFLDH DS    CL8                                                              
SEMLFLD  DS    CL18    23   62   18  A   U    N         T        Y  102         
SEMLFLDX DS    CL8                                                              
SEMPFKH  DS    CL8                                                              
SEMPFK   DS    CL18    24    2   18  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL13    24   49   13  A   P    N         T        Y              
SEMLCHGH DS    CL8                                                              
SEMLCHG  DS    CL17    24   63   17  A   P    N         T        Y              
SEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2368 BYTES                            
