*          DATA SET TASCRD4D   AT LEVEL 002 AS OF 11/15/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2D4D      DATE 11/15/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SNXAGYH  DS    XL8                                                              
SNXAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SNXAGYX  DS    XL8                                                              
SNXAGYNH DS    XL8                                                              
SNXAGYN  DS    CL36     4   23   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   63    7  A  P N             T        Y              
SNXMDTEH DS    XL8                                                              
SNXMDTE  DS    CL8      4   72    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SNXNIDH  DS    XL8                                                              
SNXNID   DS    CL12     5   10   12  A  U N             T        Y   61         
SNXNIDX  DS    XL8                                                              
SNXNIDNH DS    XL8                                                              
SNXNIDN  DS    CL38     5   23   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   63    7  A  P N             T        Y              
SNXVIAH  DS    XL8                                                              
SNXVIA   DS    CL8      5   72    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SNXLENH  DS    XL8                                                              
SNXLEN   DS    CL3      6   10    3  A  P N             T        Y              
SNXNDN2H DS    XL8                                                              
SNXNDN2  DS    CL38     6   23   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   63    7  A  P N             T        Y              
SNXUDTEH DS    XL8                                                              
SNXUDTE  DS    CL8      6   72    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
SNXNCLIH DS    XL8                                                              
SNXNCLI  DS    CL3      7   10    3  A  U N             T        Y   31         
SNXNCLIX DS    XL8                                                              
SNXNCLNH DS    XL8                                                              
SNXNCLN  DS    CL19     7   23   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   43    7  A  P N             T        Y              
SNXNPRDH DS    XL8                                                              
SNXNPRD  DS    CL3      7   51    3  A  U N             T        Y   33         
SNXNPRDX DS    XL8                                                              
SNXNPRNH DS    XL8                                                              
SNXNPRN  DS    CL20     7   56   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
SNXMEDH  DS    XL8                                                              
SNXMED   DS    CL1      8   10    1  A  U N             T        Y   15         
SNXMEDX  DS    XL8                                                              
SNXMEDNH DS    XL8                                                              
SNXMEDN  DS    CL5      8   23    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   43    3  A  P N             T        Y              
SNXUSEH  DS    XL8                                                              
SNXUSE   DS    CL3      8   51    3  A  U N             T        Y   47         
SNXUSEX  DS    XL8                                                              
SNXUSENH DS    XL8                                                              
SNXUSEN  DS    CL16     8   56   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SNXADTEH DS    XL8                                                              
SNXADTE  DS    CL8      9   10    8  A  U N             T        Y   35         
SNXADTEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   23    6  A  P N             T        Y              
SNXUIDH  DS    XL8                                                              
SNXUID   DS    CL8      9   30    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   43    7  A  P N             T        Y              
SNXCHGH  DS    XL8                                                              
SNXCHG   DS    CL30     9   51   30  A  U N             T        Y   39         
SNXCHGX  DS    XL8                                                              
SNXMESSH DS    XL8                                                              
SNXMESS  DS    CL39    10    2   39  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
SNXTCIDH DS    XL8                                                              
SNXTCID  DS    CL12    11   10   12  A  U N             T        Y   64         
SNXTCIDX DS    XL8                                                              
SNXTCNMH DS    XL8                                                              
SNXTCNM  DS    CL19    11   23   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   43    9  A  P N             T        Y              
SNXPLFTH DS    XL8                                                              
SNXPLFT  DS    CL3     11   53    3  A  U N             T        Y   67         
SNXPLFTX DS    XL8                                                              
SNXTAGH  DS    XL8                                                              
SNXTAG   DS    CL1     12    2    1  A  P N             T        Y    0         
SNXTAGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL44    24    2   44  A  P H             T        Y              
SNXLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SNXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 912  BYTES                            
