*          DATA SET TASCR91D   AT LEVEL 005 AS OF 05/15/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F291D      DATE 05/15/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P H             T        Y              
STNSSNH  DS    XL8                                                              
STNSSN   DS    CL9      4   10    9  A  U N             T        Y   60         
STNSSNX  DS    XL8                                                              
STNSSNNH DS    XL8                                                              
STNSSNN  DS    CL16     4   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      4   38    8  A  P H             T        Y              
STNEMPH  DS    XL8                                                              
STNEMP   DS    CL3      4   47    3  A  U N             T        Y   58         
STNEMPX  DS    XL8                                                              
STNEMPNH DS    XL8                                                              
STNEMPN  DS    CL16     4   51   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
STNYEARH DS    XL8                                                              
STNYEAR  DS    CL4      5   10    4  N  U N             T        Y   59         
STNYEARX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   38    8  A  P H             T        Y              
STNPRVH  DS    XL8                                                              
STNPRV   DS    CL2      5   47    2  A  U N             T        Y   61         
STNPRVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     7    2   18  A  P N             T        Y              
STNRCDH  DS    XL8                                                              
STNRCD   DS    CL1      7   25    1  A  U N             T        Y   10         
STNRCDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18     8    2   18  A  P N             T        Y              
STNFTIH  DS    XL8                                                              
STNFTI   DS    CL9      8   25    9  A  U N             T        Y   11         
STNFTIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
STNGRSH  DS    XL8                                                              
STNGRS   DS    CL11     9   25   11  A  U N             T        Y   12         
STNGRSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
STNTAXH  DS    XL8                                                              
STNTAX   DS    CL11    10   25   11  A  U N             T        Y   13         
STNTAXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    11    2   18  A  P N             T        Y              
STNRDXH  DS    XL8                                                              
STNRDX   DS    CL1     11   25    1  A  U N             T        Y   14         
STNRDXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    12    2   19  A  P N             T        Y              
STNDYSH  DS    XL8                                                              
STNDYS   DS    CL3     12   25    3  A  U N             T        Y   15         
STNDYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
STNCTYH  DS    XL8                                                              
STNCTY   DS    CL3     13   25    3  A  U N             T        Y   16         
STNCTYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    14    2   17  A  P N             T        Y              
STNITYH  DS    XL8                                                              
STNITY   DS    CL2     14   25    2  A  U N             T        Y   17         
STNITYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL27    24    2   27  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   31   13  A  P N             T        Y              
STNLCHGH DS    XL8                                                              
STNLCHG  DS    CL17    24   45   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   64    8  A  P N             T        Y              
STNLPRTH DS    XL8                                                              
STNLPRT  DS    CL8     24   73    8  A  P N             T        Y              
STNLAST  DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
STNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 688  BYTES                            
