*          DATA SET TASCR56D   AT LEVEL 001 AS OF 03/24/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F256D      DATE 03/24/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SPCPCHDH DS    XL8                                                              
SPCPCHD  DS    CL14    14    4   14  A  P H             T        Y              
SPCCIDH  DS    XL8                                                              
SPCCID   DS    CL12    14   23   12  A  U N             T        Y   64         
SPCCIDX  DS    XL8                                                              
SPCHED1H DS    XL8                                                              
SPCHED1  DS    CL20    14   42   20  A  P H             T        Y              
SPCHED2H DS    XL8                                                              
SPCHED2  DS    CL29    15   23   29  A  P H             T        Y              
SPCAC1H  DS    XL8                                                              
SPCAC1   DS    CL17    16    4   17  A  P N             T        Y              
SPCAC2H  DS    XL8                                                              
SPCAC2   DS    CL17    16   32   17  A  P N             T        Y              
SPCAC3H  DS    XL8                                                              
SPCAC3   DS    CL17    16   61   17  A  P N             T        Y              
SPCPOT1H DS    XL8                                                              
SPCPOT1  DS    CL1     17    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17    4    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   32    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   39   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   59    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   61    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   68   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18    4    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   32    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   39   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   59    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   61    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   68   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    4    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   32    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   39   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   59    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   61    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   68   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20    4    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   30    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   32    6  A  P N             T        Y              
SPCPOTLH DS    XL8                                                              
SPCPOTL  DS    CL12    20   39   12  A  P N             T        Y              
SPCPOMRH DS    XL8                                                              
SPCPOMR  DS    CL21    20   59   21  A  P H             T        Y              
SPCPOM2H DS    XL8                                                              
SPCPOM2  DS    CL21    21   59   21  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
SPCXUSEH DS    XL8                                                              
SPCXUSE  DS    CL57    22   20   57  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23    2    7  A  P H             T        Y              
SPCLCKH  DS    XL8                                                              
SPCLCK   DS    CL1     23   10    1  A  U N             T        Y   23         
SPCLCKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    23   42   13  A  P N             T        Y              
SPCACTVH DS    XL8                                                              
SPCACTV  DS    CL17    23   56   17  A  P N             T        Y              
SPCPF1H  DS    XL8                                                              
SPCPF1   DS    CL19    24    2   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    24   22   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   34   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    24   48   10  A  P H             T        Y              
SPCPFLH  DS    XL8                                                              
SPCPFL   DS    CL20    24   59   20  A  P Z             T        Y              
SPCLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SPCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1008 BYTES                            
