*          DATA SET TASCR80D   AT LEVEL 001 AS OF 11/21/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F280D      DATE 11/21/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     5    2   12  A  P H             T        Y              
SCAFAYH  DS    XL8                                                              
SCAFAY   DS    CL6      5   20    6  A  U N             T        Y   16         
SCAFAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   28    8  A  P H             T        Y              
SCAFCOH  DS    XL8                                                              
SCAFCO   DS    CL12     5   38   12  A  U N             T        Y   64         
SCAFCOX  DS    XL8                                                              
SCAFCONH DS    XL8                                                              
SCAFCON  DS    CL28     5   52   28  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    8    7  A  P N             T        Y              
SCAFVERH DS    XL8                                                              
SCAFVER  DS    CL3      6   20    3  A  U N             T        Y   18         
SCAFVERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   28    5  A  P N             T        Y              
SCAFTRKH DS    XL8                                                              
SCAFTRK  DS    CL1      6   38    1  A  U N             T        Y   19         
SCAFTRKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P H             T        Y              
SCATAYH  DS    XL8                                                              
SCATAY   DS    CL6      8   20    6  A  U N             T        Y   16         
SCATAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      8   28    8  A  P H             T        Y              
SCATCOH  DS    XL8                                                              
SCATCO   DS    CL12     8   38   12  A  U N             T        Y   65         
SCATCOX  DS    XL8                                                              
SCATCONH DS    XL8                                                              
SCATCON  DS    CL28     8   52   28  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    8    7  A  P N             T        Y              
SCATVERH DS    XL8                                                              
SCATVER  DS    CL3      9   20    3  A  U N             T        Y   20         
SCATVERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      9   28    5  A  P N             T        Y              
SCATTRKH DS    XL8                                                              
SCATTRK  DS    CL1      9   38    1  A  U N             T        Y   21         
SCATTRKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P H             T        Y              
SCASCSTH DS    XL8                                                              
SCASCST  DS    CL1     11   20    1  A  U N             T        Y   73         
SCASCSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   22    1  N  P N             T        Y              
SCANSELH DS    XL8                                                              
SCANSEL  DS    CL12    11   23   12  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL16    11   38   16  A  P H             T        Y              
SCADUPH  DS    XL8                                                              
SCADUP   DS    CL1     11   55    1  A  U N             T        Y   75         
SCADUPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    11   59   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    12    2   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    12   20   10  A  P N             T        Y              
SCAONOFH DS    XL8                                                              
SCAONOF  DS    CL3     12   32    3  A  U N             T        Y   81         
SCAONOFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   38    6  A  P N             T        Y              
SCAUNISH DS    XL8                                                              
SCAUNIS  DS    CL35    12   45   35  A  U N             T        Y   77         
SCAUNISX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   20   10  A  P N             T        Y              
SCACATSH DS    XL8                                                              
SCACATS  DS    CL48    13   32   48  A  U N             T        Y   79         
SCACATSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    14    2   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    14   20   11  A  P N             T        Y              
SCAYRH   DS    XL8                                                              
SCAYR    DS    CL3     14   32    3  A  U N             T        Y   83         
SCAYRX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     14   38    8  A  P N             T        Y              
SCA1STH  DS    XL8                                                              
SCA1ST   DS    CL8     14   47    8  A  U N             T        Y   85         
SCA1STX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    14   59   13  A  P N             T        Y              
SCAFFCH  DS    XL8                                                              
SCAFFC   DS    CL8     14   73    8  A  U N             T        Y   87         
SCAFFCX  DS    XL8                                                              
SCATTL1H DS    XL8                                                              
SCATTL1  DS    CL39    15    2   39  A  P Z             T        Y              
SCATTL2H DS    XL8                                                              
SCATTL2  DS    CL25    15   42   25  A  P Z             T        Y              
SCASELH  DS    XL8                                                              
SCASEL   DS    CL1     16    3    1  A  U N             T        Y   17         
SCASELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16    5    1  N  P N             T        Y              
SCALINEH DS    XL8                                                              
SCALINE  DS    CL70    16    7   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    17    7   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    18    7   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    19    7   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    20    7   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    21    7   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    22    7   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     23    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    23    7   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     24    5    1  A  P N             T        Y              
SCALSTH  DS    XL8                                                              
SCALST   DS    CL70    24    7   70  A  P N             T        Y              
SCALAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
