*          DATA SET TASCR30D   AT LEVEL 014 AS OF 03/05/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F230D      DATE 03/05/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
ACLUSERH DS    XL8                                                              
ACLUSER  DS    CL8      5   10    8  A  U N             T        Y   10         
ACLUSERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P Z             T        Y              
ACLTYPEH DS    XL8                                                              
ACLTYPE  DS    CL1      5   28    1  A  P N             T        Y   14         
ACLTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   38    5  A  P Z             T        Y              
ACLSTRH  DS    XL8                                                              
ACLSTR   DS    CL8      5   44    8  A  P N             T        Y   18         
ACLSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P Z             T        Y              
ACLFMTH  DS    XL8                                                              
ACLFMT   DS    CL8      6   10    8  A  P N             T        Y   22         
ACLFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P Z             T        Y              
ACLOPTSH DS    XL8                                                              
ACLOPTS  DS    CL50     6   28   50  A  P N             T        Y   26         
ACLOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL71     8    2   71  A  P H             T        Y              
ACLSELH  DS    XL8                                                              
ACLSEL   DS    CL3      9    2    3  A  U N             T        Y   30         
ACLSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
ACLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ACLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1848 BYTES                            
