*          DATA SET TASCRC4D   AT LEVEL 009 AS OF 06/06/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2C4D      DATE 06/06/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
ECSAGYH  DS    CL8                                                              
ECSAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
ECSAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
ECSCIDH  DS    CL8                                                              
ECSCID   DS    CL12     5   28   12  A  U N             T        Y   64         
ECSCIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   42    7  A  P H             T        Y              
ECSEPIH  DS    CL8                                                              
ECSEPI   DS    CL5      5   50    5  A  U N             T        Y  100         
ECSEPIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
ECSSTRH  DS    CL8                                                              
ECSSTR   DS    CL9      6   10    9  A  U N             T        Y   11         
ECSSTRX  DS    CL8                                                              
ECSKEYXH DS    CL8                                                              
ECSKEYX  DS    CL1      6   79    1  A  P N             T        Y              
ECSTAGH  DS    CL8                                                              
ECSTAG   DS    CL43     8    2   43  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL34     8   47   34  A  P H             T        Y              
ECSL1H   DS    CL8                                                              
ECSL1    DS    CL3      9    2    3  A  U N             T        Y              
ECSSSNH  DS    CL8                                                              
ECSSSN   DS    CL9      9    6    9  A  U N             T        Y              
ECSCATH  DS    CL8                                                              
ECSCAT   DS    CL3      9   17    3  A  U N             T        Y              
ECSCAMH  DS    CL8                                                              
ECSCAM   DS    CL3      9   22    3  A  U N             T        Y              
ECSTAXH  DS    CL8                                                              
ECSTAX   DS    CL3      9   27    3  A  U N             T        Y              
ECSAGNTH DS    CL8                                                              
ECSAGNT  DS    CL4      9   32    4  A  U N             T        Y              
ECSUNLOH DS    CL8                                                              
ECSUNLO  DS    CL7      9   38    7  A  U N             T        Y              
ECSYRH   DS    CL8                                                              
ECSYR    DS    CL3      9   47    3  A  U N             T        Y              
ECSCRPH  DS    CL8                                                              
ECSCRP   DS    CL1      9   53    1  A  U N             T        Y              
ECSPERFH DS    CL8                                                              
ECSPERF  DS    CL10     9   57   10  A  U N             T        Y              
ECSROLEH DS    CL8                                                              
ECSROLE  DS    CL2      9   70    2  A  U N             T        Y              
ECSPCTH  DS    CL8                                                              
ECSPCT   DS    CL6      9   75    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL62    10    6   62  A  P H             T        Y              
ECSL2H   DS    CL8                                                              
ECSL2    DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11    6    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   17    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   22    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   27    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   57   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   75    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL62    12    6   62  A  P H             T        Y              
ECSL3H   DS    CL8                                                              
ECSL3    DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13    6    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   17    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   22    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   27    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   57   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   75    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL62    14    6   62  A  P H             T        Y              
ECSL4H   DS    CL8                                                              
ECSL4    DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15    6    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   17    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   22    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   27    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   57   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   75    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL62    16    6   62  A  P H             T        Y              
ECSL5H   DS    CL8                                                              
ECSL5    DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17    6    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   17    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   22    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   27    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   57   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   75    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL62    18    6   62  A  P H             T        Y              
ECSL6H   DS    CL8                                                              
ECSL6    DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19    6    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   17    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   22    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   27    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   57   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   75    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL62    20    6   62  A  P H             T        Y              
ECSL7H   DS    CL8                                                              
ECSL7    DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21    6    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   17    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   22    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   27    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   32    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   38    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   53    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   57   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   75    6  A  U N             T        Y              
ECSLSTH  DS    CL8                                                              
ECSLST   DS    CL62    22    6   62  A  P H             T        Y              
ECSCMTH  DS    CL8                                                              
ECSCMT   DS    CL60    23    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    24    2   28  A  P H             T        Y              
ECSLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
ECSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1904 BYTES                            
