*          DATA SET TASCRE0D   AT LEVEL 004 AS OF 10/05/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2E0D      DATE 10/05/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SMTKHDH  DS    XL8                                                              
SMTKHD   DS    CL7      5    2    7  A  P H             T        Y              
SMTKEYH  DS    XL8                                                              
SMTKEY   DS    CL6      5   10    6  A  U N             T        Y   17         
SMTKEYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   17    1  A  P N             T        Y              
SMTNHDH  DS    XL8                                                              
SMTNHD   DS    CL11     5   20   11  A  P H             T        Y              
SMTNEWH  DS    XL8                                                              
SMTNEW   DS    CL6      5   34    6  A  U N             T        Y   18         
SMTNEWX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
SMTNAMEH DS    XL8                                                              
SMTNAME  DS    CL50     7   10   50  A  U N             T        Y   64         
SMTNAMEX DS    XL8                                                              
SMTALHDH DS    XL8                                                              
SMTALHD  DS    CL5      8    2    5  A  P N             T        Y              
SMTALFDH DS    XL8                                                              
SMTALFD  DS    CL4      8   10    4  A  U N             T        Y   65         
SMTALFDX DS    XL8                                                              
SMTWGTHH DS    XL8                                                              
SMTWGTH  DS    CL7     10    2    7  A  P N             T        Y              
SMTWGHTH DS    XL8                                                              
SMTWGHT  DS    CL8     10   10    8  A  U N             T        Y              
SMTSWTHH DS    XL8                                                              
SMTSWTH  DS    CL7     11    2    7  A  P N             T        Y              
SMTSWGTH DS    XL8                                                              
SMTSWGT  DS    CL8     11   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
SMTPRE1H DS    XL8                                                              
SMTPRE1  DS    CL6     15   16    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   28    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   39    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   50    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   61    6  A  P N             T        Y              
SMTPRE6H DS    XL8                                                              
SMTPRE6  DS    CL6     15   72    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
SMTACTVH DS    XL8                                                              
SMTACTV  DS    CL17    22   16   17  A  P N             T        Y              
SMTINTNH DS    XL8                                                              
SMTINTN  DS    CL10    22   62   10  A  P N             T        Y              
SMTPF13H DS    XL8                                                              
SMTPF13  DS    CL16    24    2   16  A  P H             T        Y              
SMTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SMTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 456  BYTES                            
