*          DATA SET TASCR31D   AT LEVEL 014 AS OF 08/11/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F231D      DATE 08/11/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    N         T        Y              
SSLUSERH DS    CL8                                                              
SSLUSER  DS    CL8      5   10    8  A   U    N         T        Y   10         
SSLUSERX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    N         T        Y              
SSLTYPEH DS    CL8                                                              
SSLTYPE  DS    CL1      5   28    1  A   U    N         T        Y   14         
SSLTYPEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   38    5  A   P    N         T        Y              
SSLSTRH  DS    CL8                                                              
SSLSTR   DS    CL8      5   44    8  A   U    N         T        Y   18         
SSLSTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
SSLFMTH  DS    CL8                                                              
SSLFMT   DS    CL8      6   10    8  A   U    N         T        Y   22         
SSLFMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
SSLOPTSH DS    CL8                                                              
SSLOPTS  DS    CL50     6   28   50  A   U    N         T        Y   26         
SSLOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     8    2   79  A   P    H         T        Y              
SSLSELH  DS    CL8                                                              
SSLSEL   DS    CL3      9    2    3  A   U    N         T        Y   30         
SSLSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75     9    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    10    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    11    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    12    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    13    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    14    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    15    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    16    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    17    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    18    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    19    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    20    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    21    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    22    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    23    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    24    6   75  A   P    N         T        Y              
SSLLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1960 BYTES                            
