*          DATA SET TASCR9FD   AT LEVEL 001 AS OF 03/05/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F29FD      DATE 03/05/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL62    12    9   62  A  P N             T        Y              
SWSHD1H  DS    XL8                                                              
SWSHD1   DS    CL24    13    4   24  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL24    13   44   24  A  P H             T        Y              
SWSL1H   DS    XL8                                                              
SWSL1    DS    CL1     14    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    14    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    14   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    15    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    15   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    16    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    16   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    17    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    17   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    18    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    18   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    19    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    19   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    20    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    20   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    21    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    21   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    22    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    22   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36    23    4   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   42    1  A  P H             T        Y              
SWSLSTH  DS    XL8                                                              
SWSLST   DS    CL36    23   44   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL44    24    2   44  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   49   13  A  P N             T        Y              
SWSACTVH DS    XL8                                                              
SWSACTV  DS    CL17    24   63   17  A  P N             T        Y              
SWSLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SWSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1312 BYTES                            
