*          DATA SET TASCRECD   AT LEVEL 001 AS OF 03/12/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2ECD      DATE 03/12/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL14     4    2   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   18    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      4   20    9  A  P N             T        Y              
CKPPDTH  DS    XL8                                                              
CKPPDT   DS    CL1      4   33    1  A  U N             T        Y   96         
CKPPDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     4   38   10  A  P N             T        Y              
CKPCDTH  DS    XL8                                                              
CKPCDT   DS    CL1      4   49    1  A  U N             T        Y   83         
CKPCDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     5    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
CKPALLH  DS    XL8                                                              
CKPALL   DS    CL1      5   33    1  A  U N             T        Y   82         
CKPALLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   38    4  A  P N             T        Y              
CKPVOIDH DS    XL8                                                              
CKPVOID  DS    CL1      5   49    1  A  U N             T        Y   98         
CKPVOIDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   51    4  A  P N             T        Y              
CKPHOLDH DS    XL8                                                              
CKPHOLD  DS    CL1      5   60    1  A  U N             T        Y   99         
CKPHOLDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   63    4  A  P N             T        Y              
CKPWIREH DS    XL8                                                              
CKPWIRE  DS    CL1      5   71    1  A  U N             T        Y   80         
CKPWIREX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     6   20   12  A  P N             T        Y              
CKPGRTH  DS    XL8                                                              
CKPGRT   DS    CL1      6   33    1  A  U N             T        Y   97         
CKPGRTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6   38    9  A  P N             T        Y              
CKPOVNTH DS    XL8                                                              
CKPOVNT  DS    CL1      6   49    1  A  U N             T        Y   82         
CKPOVNTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   51    5  A  P N             T        Y              
CKPDRFTH DS    XL8                                                              
CKPDRFT  DS    CL1      6   60    1  A  U N             T        Y   81         
CKPDRFTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   63    5  A  P N             T        Y              
CKPOTHRH DS    XL8                                                              
CKPOTHR  DS    CL1      6   71    1  A  U N             T        Y   83         
CKPOTHRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7    2   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      7   20    9  A  P N             T        Y              
CKPLOOVH DS    XL8                                                              
CKPLOOV  DS    CL1      7   33    1  A  U N             T        Y   82         
CKPLOOVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   38    6  A  P N             T        Y              
CKPLOURH DS    XL8                                                              
CKPLOUR  DS    CL1      7   49    1  A  U N             T        Y   82         
CKPLOURX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      7   51    9  A  P N             T        Y              
CKPSSNH  DS    XL8                                                              
CKPSSN   DS    CL9      7   63    9  A  U N             T        Y   84         
CKPSSNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL28     9    2   28  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     9   38   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      9   51    6  A  P H             T        Y              
CKPSELH  DS    XL8                                                              
CKPSEL   DS    CL1     10    2    1  A  U N             T        Y   30         
CKPSELX  DS    XL8                                                              
CKPDETH  DS    XL8                                                              
CKPDET   DS    CL65    10    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    11    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    12    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    13    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    14    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    15    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    16    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    17    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    18    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    19    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    20    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    21    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    22    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     23    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    23    6   65  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   72    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL1     24    2    1  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL65    24    6   65  A  P N             T        Y              
CKPLSTH  DS    XL8                                                              
CKPLST   DS    CL8     24   72    8  A  P Z             T        Y              
CKPLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CKPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2152 BYTES                            
