*          DATA SET TASCR0ED   AT LEVEL 005 AS OF 08/11/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F20ED      DATE 08/11/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    4    5  A  P H             T        Y              
CLACCSTH DS    XL8                                                              
CLACCST  DS    CL17     5   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      5   38    9  A  P H             T        Y              
CLAWKSH  DS    XL8                                                              
CLAWKS   DS    CL2      5   48    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21     5   55   21  A  P H             T        Y              
CLACLAOH DS    XL8                                                              
CLACLAO  DS    CL1      6    9    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   11    3  A  P N             T        Y              
CLAABCOH DS    XL8                                                              
CLAABCO  DS    CL1      6   21    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   23    3  A  P N             T        Y              
CLANBCOH DS    XL8                                                              
CLANBCO  DS    CL1      6   33    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   35    3  A  P N             T        Y              
CLACBSOH DS    XL8                                                              
CLACBSO  DS    CL1      6   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   47    3  A  P N             T        Y              
CLAFOXOH DS    XL8                                                              
CLAFOXO  DS    CL1      6   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   59    3  A  P N             T        Y              
CLAPAXOH DS    XL8                                                              
CLAPAXO  DS    CL1      6   69    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   71    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL37     7    4   37  A  P H             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL37     7   44   37  A  P H             T        Y              
CLAFRSTH DS    XL8                                                              
CLAFRST  DS    CL1      8    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     8   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     8   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      9    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     9   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      9   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     9   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     10    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    10   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     10   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    10   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     11    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    11   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     11   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    11   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     12    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     12   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     13    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     13   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     14    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     14   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     16    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     16   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     17    4    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    9    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    17   18   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   35    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   42    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     17   44    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   49    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    17   58   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   75    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   79    1  A  U N             T        Y              
CLAITNH  DS    XL8                                                              
CLAITN   DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    4    3  A  P N             T        Y              
CLAAUTOH DS    XL8                                                              
CLAAUTO  DS    CL1     18   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   31    4  A  P N             T        Y              
CLAEUSEH DS    XL8                                                              
CLAEUSE  DS    CL3     18   37    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   41    8  A  P N             T        Y              
CLANUSEH DS    XL8                                                              
CLANUSE  DS    CL3     18   50    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   54    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    19    4   11  A  P H             T        Y              
CLAMUSTH DS    XL8                                                              
CLAMUST  DS    CL17    19   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   38    9  A  P H             T        Y              
CLAMWKSH DS    XL8                                                              
CLAMWKS  DS    CL2     19   48    2  A  U N             T        Y              
CLAMUSEH DS    XL8                                                              
CLAMUSE  DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20    4    5  A  P N             T        Y              
CLAMREH  DS    XL8                                                              
CLAMRE   DS    CL1     20   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   31    5  A  P N             T        Y              
CLAMCONH DS    XL8                                                              
CLAMCON  DS    CL1     20   37    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   39    4  A  P N             T        Y              
CLAMDUBH DS    XL8                                                              
CLAMDUB  DS    CL1     20   44    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   46    3  A  P N             T        Y              
CLAMLTSH DS    XL8                                                              
CLAMLTS  DS    CL1     20   50    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   52   13  A  P N             T        Y              
CLAMU2LH DS    XL8                                                              
CLAMU2L  DS    CL1     20   66    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   68   12  A  P N             T        Y              
CLA1MUSH DS    XL8                                                              
CLA1MUS  DS    CL1     21    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    4   11  A  P N             T        Y              
CLAMBOH  DS    XL8                                                              
CLAMBO   DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    22    4   16  A  P N             T        Y              
CLAMBOIH DS    XL8                                                              
CLAMBOI  DS    CL1     22   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22   31   15  A  P N             T        Y              
CLAMBORH DS    XL8                                                              
CLAMBOR  DS    CL1     22   50    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22   52   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    23    4   14  A  P N             T        Y              
CLAAPPSH DS    XL8                                                              
CLAAPPS  DS    CL1     23   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   28    5  A  P N             T        Y              
CLAAPPHH DS    XL8                                                              
CLAAPPH  DS    CL1     23   34    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   40    7  A  P N             T        Y              
CLAAPPCH DS    XL8                                                              
CLAAPPC  DS    CL30    23   48   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   13    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     24   24    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   36    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     24   48    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   60    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   71    9  A  P H             T        Y              
CLALAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
CLAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2528 BYTES                            
