*          DATA SET TASCR09D   AT LEVEL 002 AS OF 12/22/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F209D      DATE 12/22/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL3      5    2    3  A  P H             T        Y              
STTEMPH  DS    XL8                                                              
STTEMP   DS    CL3      5   10    3  A  U N             T        Y   88         
STTEMPX  DS    XL8                                                              
STTSHEDH DS    XL8                                                              
STTSHED  DS    CL7      5   20    7  A  P H             T        Y              
STTSSNH  DS    XL8                                                              
STTSSN   DS    CL9      5   30    9  A  U N             T        Y   96         
STTSSNX  DS    XL8                                                              
STTSSNNH DS    XL8                                                              
STTSSNN  DS    CL16     5   42   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   60    5  A  P N             T        Y              
STTCURRH DS    XL8                                                              
STTCURR  DS    CL1      5   66    1  A  U N             T        Y    1         
STTCURRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   69   10  A  P N             T        Y              
STTONLYH DS    XL8                                                              
STTONLY  DS    CL1      5   80    1  A  U N             T        Y    6         
STTONLYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
STTOSOTH DS    XL8                                                              
STTOSOT  DS    CL3      6   10    3  A  U N             T        Y    2         
STTOSOTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   20    8  A  P N             T        Y              
STTOCOTH DS    XL8                                                              
STTOCOT  DS    CL3      6   30    3  A  U N             T        Y    3         
STTOCOTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   42    7  A  P N             T        Y              
STTNSOTH DS    XL8                                                              
STTNSOT  DS    CL3      6   50    3  A  U N             T        Y    2         
STTNSOTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   60    8  A  P N             T        Y              
STTNCOTH DS    XL8                                                              
STTNCOT  DS    CL3      6   69    3  A  U N             T        Y    3         
STTNCOTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
STTCHKH  DS    XL8                                                              
STTCHK   DS    CL8      7   10    8  A  U N             T        Y    5         
STTCHKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19     7   20   19  A  P N             T        Y              
STTFRCH  DS    XL8                                                              
STTFRC   DS    CL1      7   40    1  A  U N             T        Y    7         
STTFRCX  DS    XL8                                                              
STTKENDH DS    XL8                                                              
STTKEND  DS    CL1      8    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   23   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12     8   42   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11     8   60   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16     9    2   16  A  P N             T        Y              
STTCERNH DS    XL8                                                              
STTCERN  DS    CL10     9   20   10  A  P N             T        Y              
STTOERNH DS    XL8                                                              
STTOERN  DS    CL10     9   42   10  A  U N             T        Y              
STTNERNH DS    XL8                                                              
STTNERN  DS    CL10     9   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
STTCNTXH DS    XL8                                                              
STTCNTX  DS    CL10    10   20   10  A  P N             T        Y              
STTONTXH DS    XL8                                                              
STTONTX  DS    CL10    10   42   10  A  U N             T        Y              
STTNNTXH DS    XL8                                                              
STTNNTX  DS    CL10    10   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    11    2   16  A  P N             T        Y              
STTCREXH DS    XL8                                                              
STTCREX  DS    CL10    11   20   10  A  P N             T        Y              
STTOREXH DS    XL8                                                              
STTOREX  DS    CL10    11   42   10  A  U N             T        Y              
STTNREXH DS    XL8                                                              
STTNREX  DS    CL10    11   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    12    2   16  A  P N             T        Y              
STTCFTAH DS    XL8                                                              
STTCFTA  DS    CL10    12   20   10  A  P N             T        Y              
STTOFTAH DS    XL8                                                              
STTOFTA  DS    CL10    12   42   10  A  U N             T        Y              
STTNFTAH DS    XL8                                                              
STTNFTA  DS    CL10    12   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
STTCFICH DS    XL8                                                              
STTCFIC  DS    CL10    13   20   10  A  P N             T        Y              
STTOFICH DS    XL8                                                              
STTOFIC  DS    CL10    13   42   10  A  U N             T        Y              
STTNFICH DS    XL8                                                              
STTNFIC  DS    CL10    13   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    14    2   16  A  P N             T        Y              
STTCSTAH DS    XL8                                                              
STTCSTA  DS    CL10    14   20   10  A  P N             T        Y              
STTOSTAH DS    XL8                                                              
STTOSTA  DS    CL10    14   42   10  A  U N             T        Y              
STTNSTAH DS    XL8                                                              
STTNSTA  DS    CL10    14   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    15    2   16  A  P N             T        Y              
STTCSUIH DS    XL8                                                              
STTCSUI  DS    CL10    15   20   10  A  P N             T        Y              
STTOSUIH DS    XL8                                                              
STTOSUI  DS    CL10    15   42   10  A  U N             T        Y              
STTNSUIH DS    XL8                                                              
STTNSUI  DS    CL10    15   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    16    2   16  A  P N             T        Y              
STTCSDIH DS    XL8                                                              
STTCSDI  DS    CL10    16   20   10  A  P N             T        Y              
STTOSDIH DS    XL8                                                              
STTOSDI  DS    CL10    16   42   10  A  U N             T        Y              
STTNSDIH DS    XL8                                                              
STTNSDI  DS    CL10    16   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    17    2   16  A  P N             T        Y              
STTCLTAH DS    XL8                                                              
STTCLTA  DS    CL10    17   20   10  A  P N             T        Y              
STTOLTAH DS    XL8                                                              
STTOLTA  DS    CL10    17   42   10  A  U N             T        Y              
STTNLTAH DS    XL8                                                              
STTNLTA  DS    CL10    17   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    18    2   16  A  P N             T        Y              
STTCMDEH DS    XL8                                                              
STTCMDE  DS    CL10    18   20   10  A  P N             T        Y              
STTOMDEH DS    XL8                                                              
STTOMDE  DS    CL10    18   42   10  A  U N             T        Y              
STTNMDEH DS    XL8                                                              
STTNMDE  DS    CL10    18   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    19    2   16  A  P N             T        Y              
STTCDUEH DS    XL8                                                              
STTCDUE  DS    CL10    19   20   10  A  P N             T        Y              
STTODUEH DS    XL8                                                              
STTODUE  DS    CL10    19   42   10  A  U N             T        Y              
STTNDUEH DS    XL8                                                              
STTNDUE  DS    CL10    19   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    20    2   16  A  P N             T        Y              
STTCMPRH DS    XL8                                                              
STTCMPR  DS    CL10    20   20   10  A  P N             T        Y              
STTOMPRH DS    XL8                                                              
STTOMPR  DS    CL10    20   42   10  A  U N             T        Y              
STTNMPRH DS    XL8                                                              
STTNMPR  DS    CL10    20   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    21    2   16  A  P N             T        Y              
STTCFLIH DS    XL8                                                              
STTCFLI  DS    CL10    21   20   10  A  P N             T        Y              
STTOFLIH DS    XL8                                                              
STTOFLI  DS    CL10    21   42   10  A  U N             T        Y              
STTNFLIH DS    XL8                                                              
STTNFLI  DS    CL10    21   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    22    2   16  A  P N             T        Y              
STTCCTXH DS    XL8                                                              
STTCCTX  DS    CL10    22   20   10  A  P N             T        Y              
STTOCTXH DS    XL8                                                              
STTOCTX  DS    CL10    22   42   10  A  U N             T        Y              
STTNCTXH DS    XL8                                                              
STTNCTX  DS    CL10    22   60   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    23    2   16  A  P H             T        Y              
STTCNETH DS    XL8                                                              
STTCNET  DS    CL10    23   20   10  A  P N             T        Y              
STTONETH DS    XL8                                                              
STTONET  DS    CL10    23   42   10  A  P H             T        Y              
STTNNETH DS    XL8                                                              
STTNNET  DS    CL10    23   60   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
STTCOMMH DS    XL8                                                              
STTCOMM  DS    CL60    24   20   60  A  U N             T        Y              
STTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
STTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1712 BYTES                            
