*          DATA SET TASCRF7D   AT LEVEL 002 AS OF 11/07/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2F7D      DATE 11/07/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
CNAAGYH  DS    XL8                                                              
CNAAGY   DS    CL6      5   20    6  A  U N             T        Y    1         
CNAAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     5   38   11  A  P H             T        Y              
CNACONIH DS    XL8                                                              
CNACONI  DS    CL12     5   51   12  A  U N             T        Y    2         
CNACONIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6    2   10  A  P H             T        Y              
CNATSTAH DS    XL8                                                              
CNATSTA  DS    CL8      6   20    8  A  U N             T        Y    3         
CNATSTAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   38    8  A  P H             T        Y              
CNATENDH DS    XL8                                                              
CNATEND  DS    CL8      6   51    8  A  U N             T        Y    4         
CNATENDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
CNACLIH  DS    XL8                                                              
CNACLI   DS    CL6      8   20    6  A  U N             T        Y    5         
CNACLIX  DS    XL8                                                              
CNACLINH DS    XL8                                                              
CNACLIN  DS    CL36     8   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
CNAPRDH  DS    XL8                                                              
CNAPRD   DS    CL6      9   20    6  A  U N             T        Y    6         
CNAPRDX  DS    XL8                                                              
CNAPRDNH DS    XL8                                                              
CNAPRDN  DS    CL36     9   28   36  A  P N             T        Y              
CNAASUNH DS    XL8                                                              
CNAASUN  DS    CL17    11    2   17  A  P H             T        Y              
CNACIDH  DS    XL8                                                              
CNACID   DS    CL12    11   20   12  A  U N             T        Y    7         
CNACIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11   38    7  A  P N             T        Y              
CNAVERH  DS    XL8                                                              
CNAVER   DS    CL3     11   51    3  A  U N             T        Y    8         
CNAVERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    13    2   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   20    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     13   38    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     13   76    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  P H             T        Y              
CNAFRSTH DS    XL8                                                              
CNAFRST  DS    CL12    14   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    14   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   76    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    15   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   76    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    16   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   76    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    17   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   76    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    18   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   76    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    19   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   76    3  A  P N             T        Y              
CNALSTH  DS    XL8                                                              
CNALST   DS    CL12    20   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL36    20   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   76    3  A  P N             T        Y              
CNAMOREH DS    XL8                                                              
CNAMORE  DS    CL12    21   20   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  P N             T        Y              
CNALCHGH DS    XL8                                                              
CNALCHG  DS    CL17    23   20   17  A  P N             T        Y              
CNAPF13H DS    XL8                                                              
CNAPF13  DS    CL12    24    2   12  A  P H             T        Y              
CNAPF14H DS    XL8                                                              
CNAPF14  DS    CL12    24   20   12  A  P H             T        Y              
CNAPF16H DS    XL8                                                              
CNAPF16  DS    CL12    24   38   12  A  P H             T        Y              
CNAPF17H DS    XL8                                                              
CNAPF17  DS    CL21    24   54   21  A  P H             T        Y              
CNALAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CNAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1184 BYTES                            
