*          DATA SET TASCR36D   AT LEVEL 005 AS OF 03/13/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F236D      DATE 03/13/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SPRSTRH  DS    XL8                                                              
SPRSTR   DS    CL6      5   10    6  A  U N             T        Y   48         
SPRSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
SPRAGYH  DS    XL8                                                              
SPRAGY   DS    CL6      5   28    6  A  U N             T        Y   16         
SPRAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SPRCLIH  DS    XL8                                                              
SPRCLI   DS    CL6      5   46    6  A  U N             T        Y   32         
SPRCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   63    4  A  P N             T        Y              
SPRTYPEH DS    XL8                                                              
SPRTYPE  DS    CL6      5   69    6  A  U N             T        Y   33         
SPRTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SPRPRGH  DS    XL8                                                              
SPRPRG   DS    CL6      6   10    6  A  U N             T        Y   56         
SPRPRGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
SPRFMTH  DS    XL8                                                              
SPRFMT   DS    CL1      6   28    1  A  U N             T        Y   58         
SPRFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
SPROPTSH DS    XL8                                                              
SPROPTS  DS    CL15     6   46   15  A  U N             T        Y   62         
SPROPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   63    5  A  P N             T        Y              
SPRBRNDH DS    XL8                                                              
SPRBRND  DS    CL1      6   69    1  A  U N             T        Y   68         
SPRBRNDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL14     8   20   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12     8   38   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8   58    7  A  P H             T        Y              
SPRSELH  DS    XL8                                                              
SPRSEL   DS    CL3      9    2    3  A  U N             T        Y   66         
SPRSELX  DS    XL8                                                              
SPRPRDH  DS    XL8                                                              
SPRPRD   DS    CL71     9    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    10    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    11    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    12    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    13    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    14    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    15    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    16    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    17    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    18    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    19    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    20    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    21    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    22    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL71    23    6   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    24    2   20  A  P H             T        Y              
SPRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1872 BYTES                            
