*          DATA SET TASCR0CD   AT LEVEL 010 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F20CD      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P H             T        Y              
HYPCOMH  DS    XL8                                                              
HYPCOM   DS    CL12    11   10   12  A  U N             T        Y   64         
HYPCOMX  DS    XL8                                                              
HYPMEDTH DS    XL8                                                              
HYPMEDT  DS    CL5     11   23    5  A  P H             T        Y              
HYPMEDH  DS    XL8                                                              
HYPMED   DS    CL1     11   29    1  A  U N             T        Y   42         
HYPMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11   31    6  A  P H             T        Y              
HYPLENH  DS    XL8                                                              
HYPLEN   DS    CL2     11   38    2  N  U N             T        Y   44         
HYPLENX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11   41    4  A  P N             T        Y              
HYPNAMEH DS    XL8                                                              
HYPNAME  DS    CL34    11   46   34  A  U N             T        Y   45         
HYPNAMEX DS    XL8                                                              
HYPOPTTH DS    XL8                                                              
HYPOPTT  DS    CL7     12    2    7  A  P N             T        Y              
HYPOPTH  DS    XL8                                                              
HYPOPT   DS    CL70    12   10   70  A  U N             T        Y   46         
HYPOPTX  DS    XL8                                                              
HYPOPT2H DS    XL8                                                              
HYPOPT2  DS    CL78    13    2   78  A  U N             T        Y   46         
HYPOPT2X DS    XL8                                                              
HYPOPT3H DS    XL8                                                              
HYPOPT3  DS    CL78    14    2   78  A  U N             T        Y   46         
HYPOPT3X DS    XL8                                                              
HYPOPT4H DS    XL8                                                              
HYPOPT4  DS    CL78    15    2   78  A  U N             T        Y   46         
HYPOPT4X DS    XL8                                                              
HYPHEDH  DS    XL8                                                              
HYPHED   DS    CL36    16    2   36  A  P H             T        Y              
HYPPGSH  DS    XL8                                                              
HYPPGS   DS    CL11    16   69   11  A  P Z             T        Y              
HYPDATAH DS    XL8                                                              
HYPDATA  DS    CL1     17    2    1  A  P H             T        Y              
HYPNUMH  DS    XL8                                                              
HYPNUM   DS    CL3     17    4    3  N  U N             T        Y   30         
HYPNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17    8    3  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   12    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   16    3  A  U N             T        Y   35         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   21    2  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   25    2  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   29    1  A  U N             T        Y   39         
         DS    XL8                                                              
HYPRHSH  DS    XL8                                                              
HYPRHS   DS    CL48    17   32   48  A  U N             T        Y   38         
HYPRHSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     18    4    3  N  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18    8    3  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   12    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   16    3  A  U N             T        Y   35         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   21    2  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   25    2  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   29    1  A  U N             T        Y   39         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL48    18   32   48  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     19    4    3  N  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19    8    3  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   12    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   16    3  A  U N             T        Y   35         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   21    2  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   25    2  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   29    1  A  U N             T        Y   39         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL48    19   32   48  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     20    4    3  N  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20    8    3  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   12    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   16    3  A  U N             T        Y   35         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   21    2  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   25    2  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   29    1  A  U N             T        Y   39         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL48    20   32   48  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     21    4    3  N  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21    8    3  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   12    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   16    3  A  U N             T        Y   35         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   21    2  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   25    2  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   29    1  A  U N             T        Y   39         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL48    21   32   48  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     22    4    3  N  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22    8    3  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   12    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   16    3  A  U N             T        Y   35         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   21    2  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   25    2  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   29    1  A  U N             T        Y   39         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL48    22   32   48  A  U N             T        Y   38         
         DS    XL8                                                              
HYPLSTDH DS    XL8                                                              
HYPLSTD  DS    CL1     23    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     23    4    3  N  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23    8    3  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   12    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   16    3  A  U N             T        Y   35         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     23   21    2  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     23   25    2  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     23   29    1  A  U N             T        Y   39         
         DS    XL8                                                              
HYPLSTRH DS    XL8                                                              
HYPLSTR  DS    CL48    23   32   48  A  U N             T        Y   38         
HYPLSTRX DS    XL8                                                              
HYPMSG2H DS    XL8                                                              
HYPMSG2  DS    CL19    24    2   19  A  P Z             T        Y              
HYPMSG3H DS    XL8                                                              
HYPMSG3  DS    CL33    24   23   33  A  P H             T        Y              
HYPPFPGH DS    XL8                                                              
HYPPFPG  DS    CL1     24   57    1  A  U N             T        Y   49         
HYPPFPGX DS    XL8                                                              
HYPMSG4H DS    XL8                                                              
HYPMSG4  DS    CL8     24   60    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL11    24   70   11  A  P H             T        Y              
HYPLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
HYPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2152 BYTES                            
