*          DATA SET TASCR68D   AT LEVEL 002 AS OF 09/14/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F268D      DATE 09/14/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
PTLFMTH  DS    XL8                                                              
PTLFMT   DS    CL1      5   10    1  A  U N             T        Y   94         
PTLFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   18    5  A  P N             T        Y              
PTLSTRH  DS    XL8                                                              
PTLSTR   DS    CL16     5   26   16  A  U N             T        Y   11         
PTLSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PTLOPTSH DS    XL8                                                              
PTLOPTS  DS    CL32     6   10   32  A  U N             T        Y  102         
PTLOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   56    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8    6    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   18    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   55    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   62    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   69    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   74    6  A  P H             T        Y              
PTLSELH  DS    XL8                                                              
PTLSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
PTLSELX  DS    XL8                                                              
PTLFRSTH DS    XL8                                                              
PTLFRST  DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
PTLLSELH DS    XL8                                                              
PTLLSEL  DS    CL3     23    2    3  A  U N             T        Y    1         
PTLLSELX DS    XL8                                                              
PTLLSTH  DS    XL8                                                              
PTLLST   DS    CL75    23    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL64    24    2   64  A  P H             T        Y              
PTLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
PTLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1856 BYTES                            
