*          DATA SET TASCR18D   AT LEVEL 002 AS OF 11/22/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F218D      DATE 11/22/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SCOAGYH  DS    XL8                                                              
SCOAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SCOAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
SCOCIDH  DS    XL8                                                              
SCOCID   DS    CL12     4   28   12  A  U N             T        Y   64         
SCOCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   43    7  A  P N             T        Y              
SCOPIDH  DS    XL8                                                              
SCOPID   DS    CL19     4   51   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
SCOVRLH  DS    XL8                                                              
SCOVRL   DS    CL3      5   10    3  A  U N             T        Y   20         
SCOVRLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   15    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
SCOVRIH  DS    XL8                                                              
SCOVRI   DS    CL12     5   28   12  A  U N             T        Y   24         
SCOVRIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SCOCLIH  DS    XL8                                                              
SCOCLI   DS    CL6      6   10    6  A  U N             T        Y   32         
SCOCLIX  DS    XL8                                                              
SCOCLINH DS    XL8                                                              
SCOCLIN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     6   43   10  A  P N             T        Y              
SCOCGRPH DS    XL8                                                              
SCOCGRP  DS    CL6      6   58    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SCOPRDH  DS    XL8                                                              
SCOPRD   DS    CL6      7   10    6  A  U N             T        Y   48         
SCOPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   20    4  A  P N             T        Y              
SCOPRDNH DS    XL8                                                              
SCOPRDN  DS    CL16     7   26   16  A  U N             T        Y   49         
SCOPRDNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7   43    5  A  P N             T        Y              
SCOPTYPH DS    XL8                                                              
SCOPTYP  DS    CL6      7   51    6  A  P N             T        Y   78         
SCOPTYPX DS    XL8                                                              
SCOPTYNH DS    XL8                                                              
SCOPTYN  DS    CL20     7   58   20  A  P N             T        Y              
SCOTITLH DS    XL8                                                              
SCOTITL  DS    CL5      8    2    5  A  P H             T        Y              
SCOTITNH DS    XL8                                                              
SCOTITN  DS    CL36     8   20   36  A  U N             T        Y    6         
SCOTITNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   58   10  A  P N             T        Y              
SCOTYPEH DS    XL8                                                              
SCOTYPE  DS    CL1      8   69    1  A  U H             T        Y   11         
SCOTYPEX DS    XL8                                                              
SCOTNAMH DS    XL8                                                              
SCOTNAM  DS    CL7      8   72    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13     9    2   13  A  P N             T        Y              
SCOTAFMH DS    XL8                                                              
SCOTAFM  DS    CL36     9   20   36  A  U N             T        Y    7         
SCOTAFMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   58   10  A  P N             T        Y              
SCOADSTH DS    XL8                                                              
SCOADST  DS    CL2      9   69    2  A  U N             T        Y   17         
SCOADSTX DS    XL8                                                              
SCOADSNH DS    XL8                                                              
SCOADSN  DS    CL8      9   72    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    10    2   17  A  P N             T        Y              
SCOFFCH  DS    XL8                                                              
SCOFFC   DS    CL8     10   20    8  A  U H             T        Y   12         
SCOFFCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     10   30    9  A  P N             T        Y              
SCOFAIRH DS    XL8                                                              
SCOFAIR  DS    CL8     10   40    8  A  U N             T        Y   13         
SCOFAIRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10   58   10  A  P N             T        Y              
SCOEXPH  DS    XL8                                                              
SCOEXP   DS    CL8     10   69    8  A  U N             T        Y   14         
SCOEXPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     11    2    5  A  P H             T        Y              
SCOMEDH  DS    XL8                                                              
SCOMED   DS    CL1     11   10    1  A  U N             T        Y   15         
SCOMEDX  DS    XL8                                                              
SCOMEDNH DS    XL8                                                              
SCOMEDN  DS    CL5     11   12    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   20    3  A  P N             T        Y              
SCOLENH  DS    XL8                                                              
SCOLEN   DS    CL3     11   24    3  N  U H             T        Y   19         
SCOLENX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11   30    7  A  P N             T        Y              
SCOLCIDH DS    XL8                                                              
SCOLCID  DS    CL12    11   40   12  A  U N             T        Y   39         
SCOLCIDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11   58    8  A  P N             T        Y              
SCOLLENH DS    XL8                                                              
SCOLLEN  DS    CL3     11   69    3  N  U H             T        Y   41         
SCOLLENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL23    12    2   23  A  P N             T        Y              
SCOSAIRH DS    XL8                                                              
SCOSAIR  DS    CL8     12   30    8  A  U N             T        Y   18         
SCOSAIRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   58   10  A  P N             T        Y              
SCOCTYPH DS    XL8                                                              
SCOCTYP  DS    CL4     12   69    4  A  U N             T        Y   22         
SCOCTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
SCOSTATH DS    XL8                                                              
SCOSTAT  DS    CL45    13   10   45  A  U H             T        Y   38         
SCOSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     13   58    9  A  P N             T        Y              
SCOAEXPH DS    XL8                                                              
SCOAEXP  DS    CL8     13   69    8  A  U N             T        Y   82         
SCOAEXPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  P N             T        Y              
SCOFDATH DS    XL8                                                              
SCOFDAT  DS    CL8     14   20    8  A  U N             T        Y   23         
SCOFDATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     14   30    6  A  P N             T        Y              
SCOFSTUH DS    XL8                                                              
SCOFSTU  DS    CL12    14   37   12  A  U N             T        Y   26         
SCOFSTUX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   50    4  A  P N             T        Y              
SCOFCITH DS    XL8                                                              
SCOFCIT  DS    CL12    14   58   12  A  U N             T        Y   27         
SCOFCITX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14   71    5  A  P N             T        Y              
SCOFSTAH DS    XL8                                                              
SCOFSTA  DS    CL2     14   77    2  A  U N             T        Y   30         
SCOFSTAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
SCORDATH DS    XL8                                                              
SCORDAT  DS    CL8     15   20    8  A  U N             T        Y   29         
SCORDATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15   30    6  A  P N             T        Y              
SCORSTUH DS    XL8                                                              
SCORSTU  DS    CL12    15   37   12  A  U N             T        Y   31         
SCORSTUX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   50    4  A  P N             T        Y              
SCORCITH DS    XL8                                                              
SCORCIT  DS    CL12    15   58   12  A  U N             T        Y   35         
SCORCITX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     15   71    5  A  P N             T        Y              
SCORSTAH DS    XL8                                                              
SCORSTA  DS    CL2     15   77    2  A  U N             T        Y   36         
SCORSTAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
SCOMDATH DS    XL8                                                              
SCOMDAT  DS    CL8     16   20    8  A  U N             T        Y   37         
SCOMDATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16   30    6  A  P N             T        Y              
SCOMSTUH DS    XL8                                                              
SCOMSTU  DS    CL12    16   37   12  A  U N             T        Y   21         
SCOMSTUX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   50    4  A  P N             T        Y              
SCOMCITH DS    XL8                                                              
SCOMCIT  DS    CL12    16   58   12  A  U N             T        Y   43         
SCOMCITX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16   71    5  A  P N             T        Y              
SCOMSTAH DS    XL8                                                              
SCOMSTA  DS    CL2     16   77    2  A  U N             T        Y   44         
SCOMSTAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    17    2   18  A  P N             T        Y              
SCOMED1H DS    XL8                                                              
SCOMED1  DS    CL4     17   24    4  A  U N             T        Y   83         
SCOMED1X DS    XL8                                                              
SCOMED2H DS    XL8                                                              
SCOMED2  DS    CL4     17   30    4  A  U N             T        Y              
SCOMED3H DS    XL8                                                              
SCOMED3  DS    CL4     17   36    4  A  U N             T        Y              
SCOMED4H DS    XL8                                                              
SCOMED4  DS    CL4     17   42    4  A  U N             T        Y              
SCOMED5H DS    XL8                                                              
SCOMED5  DS    CL4     17   48    4  A  U N             T        Y              
SCOMED6H DS    XL8                                                              
SCOMED6  DS    CL4     17   54    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18    2    9  A  P N             T        Y              
SCOEDYRH DS    XL8                                                              
SCOEDYR  DS    CL4     18   12    4  A  U N             T        Y   75         
SCOEDYRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   19    4  A  P N             T        Y              
SCOETYPH DS    XL8                                                              
SCOETYP  DS    CL6     18   24    6  A  U N             T        Y   80         
SCOETYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     18   36    6  A  P N             T        Y              
SCOACTH  DS    XL8                                                              
SCOACT   DS    CL8     18   47    8  A  U N             T        Y   76         
SCOACTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     18   58    8  A  P N             T        Y              
SCOINACH DS    XL8                                                              
SCOINAC  DS    CL8     18   69    8  A  U N             T        Y   77         
SCOINACX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     19    2    9  A  P N             T        Y              
SCOCOGRH DS    XL8                                                              
SCOCOGR  DS    CL6     19   12    6  A  U N             T        Y   79         
SCOCOGRX DS    XL8                                                              
SCOCOGNH DS    XL8                                                              
SCOCOGN  DS    CL16    19   19   16  A  P N             T        Y              
SCOCSFH  DS    XL8                                                              
SCOCSF   DS    CL17    19   36   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    19   58   13  A  P N             T        Y              
SCOSPCYH DS    XL8                                                              
SCOSPCY  DS    CL1     19   73    1  A  U H             T        Y   81         
SCOSPCYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
SCOBTCH  DS    XL8                                                              
SCOBTC   DS    CL2     20   16    2  A  U N             T        Y   28         
SCOBTCX  DS    XL8                                                              
SCOBTCNH DS    XL8                                                              
SCOBTCN  DS    CL16    20   19   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   36   13  A  P N             T        Y              
SCOCONTH DS    XL8                                                              
SCOCONT  DS    CL1     20   50    1  A  U N             T        Y              
SCOINTNH DS    XL8                                                              
SCOINTN  DS    CL10    20   68   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
SCOCOMMH DS    XL8                                                              
SCOCOMM  DS    CL60    21   16   60  A  U H             T        Y   99         
SCOCOMMX DS    XL8                                                              
SCOXCOMH DS    XL8                                                              
SCOXCOM  DS    CL1     21   77    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
SCOLCHGH DS    XL8                                                              
SCOLCHG  DS    CL17    22   16   17  A  P N             T        Y              
SCOCHHFH DS    XL8                                                              
SCOCHHF  DS    CL1     22   34    1  A  P Z             T        Y              
SCOWIDH  DS    XL8                                                              
SCOWID   DS    CL10    22   36   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   51    8  A  P N             T        Y              
SCOCVERH DS    XL8                                                              
SCOCVER  DS    CL8     22   60    8  A  P N             T        Y              
SCOCVENH DS    XL8                                                              
SCOCVEN  DS    CL8     22   69    8  A  P N             T        Y              
SCOPF1H  DS    XL8                                                              
SCOPF1   DS    CL61    23    2   61  A  P H             T        Y              
SCOPFVH  DS    XL8                                                              
SCOPFV   DS    CL13    23   64   13  A  P N             T        Y              
SCOPF2H  DS    XL8                                                              
SCOPF2   DS    CL58    24    2   58  A  P H             T        Y              
SCOLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2520 BYTES                            
