*          DATA SET TASCRBED   AT LEVEL 012 AS OF 11/21/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2BED      DATE 11/21/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
SECPROGH DS    CL8                                                              
SECPROG  DS    CL3      5   10    3  A   U    N         T        Y    1         
SECPROGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A   P    N         T        Y              
SECRECH  DS    CL8                                                              
SECREC   DS    CL8      5   28    8  A   U    N         T        Y    2         
SECRECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A   P    N         T        Y              
SECACTH  DS    CL8                                                              
SECACT   DS    CL8      5   46    8  A   U    N         T        Y    3         
SECACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   57    4  A   P    N         T        Y              
SECCATH  DS    CL8                                                              
SECCAT   DS    CL17     5   63   17  A   U    N         T        Y    5         
SECCATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
SECOPTSH DS    CL8                                                              
SECOPTS  DS    CL60     6   10   60  A   U    N         T        Y    6         
SECOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32     8    2   32  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL12     8   63   12  A   P    H         T        Y              
SECSELH  DS    CL8                                                              
SECSEL   DS    CL3      9    2    3  A   U    N         T        Y    9         
SECSELX  DS    CL8                                                              
SECSECH  DS    CL8                                                              
SECSEC   DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
SECLSELH DS    CL8                                                              
SECLSEL  DS    CL3     23    2    3  A   U    N         T        Y    9         
SECLSELX DS    CL8                                                              
SECLSTH  DS    CL8                                                              
SECLST   DS    CL74    23    6   74  A   P    N         T        Y              
SECLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SECWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
