*          DATA SET TASCR83D   AT LEVEL 005 AS OF 02/12/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T702ACD      DATE 02/12/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
SOFOFFH  DS    CL8                                                              
SOFOFF   DS    CL1      5   10    1  A   U    N         T        Y   12         
SOFOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    H         T        Y              
SOFNAMEH DS    CL8                                                              
SOFNAME  DS    CL36     7   10   36  A   U    N         T        Y   19         
SOFNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    H         T        Y              
SOFADDRH DS    CL8                                                              
SOFADDR  DS    CL30     9   10   30  A   U    N         T        Y   21         
SOFADDRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    10   10   30  A   U    N         T        Y   21         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    11   10   30  A   U    N         T        Y   21         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    12   10   30  A   U    N         T        Y   21         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     14    2    5  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     14   10    1  A   P    N         T        Y              
SOFAREAH DS    CL8                                                              
SOFAREA  DS    CL3     14   12    3  A   U    N         T        Y   23         
SOFAREAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14   16    1  N   P    N         T        Y              
SOFTELH  DS    CL8                                                              
SOFTEL   DS    CL3     14   18    3  A   U    N         T        Y   23         
SOFTELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14   22    1  N   P    N         T        Y              
SOFTEL2H DS    CL8                                                              
SOFTEL2  DS    CL4     14   24    4  A   U    N         T        Y   23         
SOFTEL2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     16    2    5  A   P    N         T        Y              
SOFPQIDH DS    CL8                                                              
SOFPQID  DS    CL6     16   10    6  A   U    N         T        Y   25         
SOFPQIDX DS    CL8                                                              
SOFIDNMH DS    CL8                                                              
SOFIDNM  DS    CL36    16   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13    18    2   13  A   P    N         T        Y              
SOFACTVH DS    CL8                                                              
SOFACTV  DS    CL17    18   20   17  A   P    N         T        Y              
SOFLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SOFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 536  BYTES                            
