*          DATA SET TASCRD2D   AT LEVEL 012 AS OF 10/02/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2D2D      DATE 10/02/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
LRCCODEH DS    CL8                                                              
LRCCODE  DS    CL3      5   10    3  A  U N             T        Y   21         
LRCCODEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
LRCSTRTH DS    CL8                                                              
LRCSTRT  DS    CL52     5   28   52  A  U N             T        Y   23         
LRCSTRTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
LRCHDH   DS    CL8                                                              
LRCHD    DS    CL3      7    2    3  A  P H             T        Y              
LRCHD1H  DS    CL8                                                              
LRCHD1   DS    CL60     7    6   60  A  P H             T        Y              
LRCHD2H  DS    CL8                                                              
LRCHD2   DS    CL13     7   67   13  A  P H             T        Y              
LRCSELH  DS    CL8                                                              
LRCSEL   DS    CL3      8    2    3  A  U N             T        Y              
LRCDATAH DS    CL8                                                              
LRCDATA  DS    CL60     8    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60     9    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    10    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    11    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    12    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    13    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    14    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    15    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    16    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    17    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    18    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    19    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    20    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    21    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    22    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    23    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
         DS    CL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    24    6   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     24   67    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     24   72    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32              32     N                                       
LRCLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
LRCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2728 BYTES                            
