*          DATA SET TASCRAFD   AT LEVEL 002 AS OF 03/24/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2AFD      DATE 03/24/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SADSTRH  DS    XL8                                                              
SADSTR   DS    CL6      5   10    6  A  U N             T        Y   17         
SADSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   20    4  A  P N             T        Y              
SADTYPEH DS    XL8                                                              
SADTYPE  DS    CL7      5   28    7  A  U N             T        Y   19         
SADTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   38    4  A  P N             T        Y              
SADCURH  DS    XL8                                                              
SADCUR   DS    CL1      5   43    1  A  U N             T        Y   21         
SADCURX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   46    3  A  P N             T        Y              
SADEMPH  DS    XL8                                                              
SADEMP   DS    CL3      5   50    3  A  U N             T        Y   88         
SADEMPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   55    6  A  P N             T        Y              
SADAGYH  DS    XL8                                                              
SADAGY   DS    CL6      5   62    6  A  U N             T        Y   16         
SADAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      5   70    9  A  P N             T        Y              
SADERRH  DS    XL8                                                              
SADERR   DS    CL1      5   80    1  A  U N             T        Y   23         
SADERRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
SADPHEDH DS    XL8                                                              
SADPHED  DS    CL79     7    2   79  A  P H             T        Y              
SADSELH  DS    XL8                                                              
SADSEL   DS    CL3      8    2    3  A  U N             T        Y   66         
SADSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     8    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
SADLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SADWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
