*          DATA SET TASCR76D   AT LEVEL 003 AS OF 04/28/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F276D      DATE 04/28/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL13     4    2   13  A  P H             T        Y              
TD1PIDH  DS    XL8                                                              
TD1PID   DS    CL9      4   20    9  N  U N             T        Y   96         
TD1PIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      4   31    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      4   38    4  A  P N             T        Y              
TD1TYPEH DS    XL8                                                              
TD1TYPE  DS    CL1      4   48    1  A  P N             T        Y   51         
TD1TYPEX DS    XL8                                                              
TD1PAYEH DS    XL8                                                              
TD1PAYE  DS    CL20     4   53   20  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10     5    2   10  A  P N             T        Y              
TD1NAM1H DS    XL8                                                              
TD1NAM1  DS    CL16     5   20   16  A  P N             T        Y   95         
TD1NAM1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
TD1NAM3H DS    XL8                                                              
TD1NAM3  DS    CL16     5   48   16  A  P N             T        Y   80         
TD1NAM3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P N             T        Y              
TD1NAM2H DS    XL8                                                              
TD1NAM2  DS    CL16     6   20   16  A  P N             T        Y   81         
TD1NAM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
TD1NAM4H DS    XL8                                                              
TD1NAM4  DS    CL4      6   48    4  A  P N             T        Y   82         
TD1NAM4X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
TD1AKA1H DS    XL8                                                              
TD1AKA1  DS    CL16     7   20   16  A  P N             T        Y    3         
TD1AKA1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   38    8  A  P N             T        Y              
TD1AKA2H DS    XL8                                                              
TD1AKA2  DS    CL16     7   48   16  A  P N             T        Y   83         
TD1AKA2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P N             T        Y              
TD1ADDRH DS    XL8                                                              
TD1ADDR  DS    CL30     8   12   30  A  P N             T        Y   10         
TD1ADDRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   44    1  A  P N             T        Y              
TD1ADD2H DS    XL8                                                              
TD1ADD2  DS    CL30     8   46   30  A  P N             T        Y   84         
TD1ADD2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   10    1  A  P N             T        Y              
TD1ADD3H DS    XL8                                                              
TD1ADD3  DS    CL30     9   12   30  A  P N             T        Y   85         
TD1ADD3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10    7    4  A  P N             T        Y              
TD1ADDCH DS    XL8                                                              
TD1ADDC  DS    CL25    10   12   25  A  P N             T        Y   65         
TD1ADDCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     10   38    5  A  P N             T        Y              
TD1ADDSH DS    XL8                                                              
TD1ADDS  DS    CL2     10   44    2  A  P N             T        Y   66         
TD1ADDSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     10   47    3  A  P N             T        Y              
TD1ADDZH DS    XL8                                                              
TD1ADDZ  DS    CL10    10   51   10  A  P N             T        Y   67         
TD1ADDZX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   63    7  A  P N             T        Y              
TD1CTRYH DS    XL8                                                              
TD1CTRY  DS    CL2     10   72    2  A  P N             T        Y   68         
TD1CTRYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   31    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    12   49   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     12   60    1  A  P H             T        Y              
TD1PPROH DS    XL8                                                              
TD1PPRO  DS    CL2     12   62    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     12   65    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P H             T        Y              
TD1FNCLH DS    XL8                                                              
TD1FNCL  DS    CL9     13   31    9  A  U N             T        Y              
TD1PNCLH DS    XL8                                                              
TD1PNCL  DS    CL9     13   49    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL24    14    2   24  A  P H             T        Y              
TD1FDC1H DS    XL8                                                              
TD1FDC1  DS    CL1     14   31    1  A  P Z             T        Y              
TD1PDC1H DS    XL8                                                              
TD1PDC1  DS    CL1     14   49    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P H             T        Y              
TD1FEXMH DS    XL8                                                              
TD1FEXM  DS    CL1     15   31    1  A  U N             T        Y              
TD1PEXMH DS    XL8                                                              
TD1PEXM  DS    CL1     15   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16    2   15  A  P N             T        Y              
TD1FPREH DS    XL8                                                              
TD1FPRE  DS    CL9     16   31    9  A  P Z             T        Y              
TD1PPREH DS    XL8                                                              
TD1PPRE  DS    CL9     16   49    9  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL17    17    2   17  A  P N             T        Y              
TD1PHDEH DS    XL8                                                              
TD1PHDE  DS    CL9     17   49    9  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL15    18    2   15  A  P N             T        Y              
TD1PSPYH DS    XL8                                                              
TD1PSPY  DS    CL9     18   49    9  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL25    19    2   25  A  P N             T        Y              
TD1PEHCH DS    XL8                                                              
TD1PEHC  DS    CL1     19   49    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL16    20    2   16  A  P N             T        Y              
TD1FCPPH DS    XL8                                                              
TD1FCPP  DS    CL1     20   31    1  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
TD1LCHGH DS    XL8                                                              
TD1LCHG  DS    CL27    22   31   27  A  P N             T        Y              
TD1NOT1H DS    XL8                                                              
TD1NOT1  DS    CL78    23    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL14    24    2   14  A  P H             T        Y              
TD1LAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
TD1WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1320 BYTES                            
