*          DATA SET TASCR13D   AT LEVEL 005 AS OF 05/19/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T702F3D      DATE 05/19/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     5    2   12  A   P    H         T        Y              
SAGAGGH  DS    CL8                                                              
SAGAGG   DS    CL6      5   20    6  A   U    N         T        Y   24         
SAGAGGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     7    2   17  A   P    H         T        Y              
SAGNAMEH DS    CL8                                                              
SAGNAME  DS    CL36     7   20   36  A   U    N         T        Y   26         
SAGNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     8    2   17  A   P    N         T        Y              
SAGSNMEH DS    CL8                                                              
SAGSNME  DS    CL16     8   20   16  A   U    N         T        Y   30         
SAGSNMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    10    2   13  A   P    N         T        Y              
SAGLCHGH DS    CL8                                                              
SAGLCHG  DS    CL17    10   20   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50    24    2   50  A   P    H         T        Y              
SAGLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SAGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 296  BYTES                            
