*          DATA SET TASCR58D   AT LEVEL 001 AS OF 04/07/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F258D      DATE 04/07/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
VCLAGYH  DS    XL8                                                              
VCLAGY   DS    CL6      4   10    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
VCLCIDH  DS    XL8                                                              
VCLCID   DS    CL12     4   28   12  A  U N             T        Y   64         
VCLCIDX  DS    XL8                                                              
VCLCIDNH DS    XL8                                                              
VCLCIDN  DS    CL20     4   41   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      4   62    3  A  P N             T        Y              
VCLVERH  DS    XL8                                                              
VCLVER   DS    CL3      4   66    3  A  U N             T        Y   47         
VCLVERX  DS    XL8                                                              
VCLAVHDH DS    XL8                                                              
VCLAVHD  DS    CL11     5    2   11  A  P H             T        Y              
VCLAVERH DS    XL8                                                              
VCLAVER  DS    CL21     5   15   21  A  U N             T        Y   88         
VCLAVERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     5   41   14  A  P H             T        Y              
VCLDVERH DS    XL8                                                              
VCLDVER  DS    CL21     5   57   21  A  U N             T        Y   89         
VCLDVERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
VCLTAGH  DS    XL8                                                              
VCLTAG   DS    CL26     7    2   26  A  P H             T        Y              
VCLSEL1H DS    XL8                                                              
VCLSEL1  DS    CL3      8    2    3  A  U N             T        Y   66         
VCLSEL1X DS    XL8                                                              
VCLCST1H DS    XL8                                                              
VCLCST1  DS    CL75     8    6   75  A  P N             T        Y              
VCLNAM1H DS    XL8                                                              
VCLNAM1  DS    CL16     9    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   23    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14     9   27   14  A  P Z             T        Y              
VCLWIDH  DS    XL8                                                              
VCLWID   DS    CL3      9   75    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    11    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     11   23    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14    11   27   14  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     11   75    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    13    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     13   23    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14    13   27   14  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     13   75    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    15    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   23    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14    15   27   14  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     15   75    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    17    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     17   23    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14    17   27   14  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     17   75    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    19    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     19   23    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14    19   27   14  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     19   75    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    21    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     21   23    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14    21   27   14  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     21   75    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    23    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     23   23    3  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL14    23   27   14  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL3     23   75    3  A  P Z             T        Y              
VCLLSTH  DS    XL8                                                              
VCLLST   DS    CL75    24    6   75  A  P H             T        Y              
VCLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
VCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1736 BYTES                            
