*          DATA SET TASCR4BD   AT LEVEL 004 AS OF 10/17/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T702CBD      DATE 10/17/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
SLOUNH   DS    CL8                                                              
SLOUN    DS    CL3      5   10    3  A   U    N         T        Y   22         
SLOUNX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
SLOSTRH  DS    CL8                                                              
SLOSTR   DS    CL3      5   28    3  A   U    N         T        Y   18         
SLOSTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
SLOOPTSH DS    CL8                                                              
SLOOPTS  DS    CL65     6   10   65  A   U    N         T        Y   26         
SLOOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35     8    2   35  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL19     8   54   19  A   P    H         T        Y              
SLOSELH  DS    CL8                                                              
SLOSEL   DS    CL3      9    2    3  A   U    N         T        Y   30         
SLOSELX  DS    CL8                                                              
SLOLCLH  DS    CL8                                                              
SLOLCL   DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    23    6   74  A   P    N         T        Y              
SLOLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SLOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1760 BYTES                            
