*          DATA SET TASCRDAD   AT LEVEL 002 AS OF 05/18/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2DAD      DATE 05/18/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SPASHEDH DS    XL8                                                              
SPASHED  DS    CL7      5    2    7  A  P H             T        Y              
SPASSNH  DS    XL8                                                              
SPASSN   DS    CL9      5   10    9  A  U N             T        Y   96         
SPASSNX  DS    XL8                                                              
SPASSNNH DS    XL8                                                              
SPASSNN  DS    CL36     5   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SPAPDH   DS    XL8                                                              
SPAPD    DS    CL17     6   10   17  A  U N             T        Y   22         
SPAPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
SPAAGYH  DS    XL8                                                              
SPAAGY   DS    CL6      6   46    6  A  U N             T        Y   16         
SPAAGYX  DS    XL8                                                              
SPAAGYNH DS    XL8                                                              
SPAAGYN  DS    CL16     6   55   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
SPAHDH   DS    XL8                                                              
SPAHD    DS    CL57     8    2   57  A  P H             T        Y              
SPASELH  DS    XL8                                                              
SPASEL   DS    CL3      9    2    3  A  U N             T        Y   30         
SPASELX  DS    XL8                                                              
SPADATAH DS    XL8                                                              
SPADATA  DS    CL57     9    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    10    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    11    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    12    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    13    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    14    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    15    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    16    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    17    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    18    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    19    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    20    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    21    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    22    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL57    23    6   57  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
SPALSTH  DS    XL8                                                              
SPALST   DS    CL57    24    6   57  A  P N             T        Y              
SPALAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SPAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1616 BYTES                            
