*          DATA SET TASCRA7D   AT LEVEL 028 AS OF 01/18/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2A7D      DATE 01/18/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    H         T        Y              
SW2YEARH DS    CL8                                                              
SW2YEAR  DS    CL4      5   10    4  A   U    N         T        Y   57         
SW2YEARX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
SW2CURRH DS    CL8                                                              
SW2CURR  DS    CL1      5   26    1  A   U    N         T        Y   58         
SW2CURRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   38    3  A   P    N         T        Y              
SW2EMPH  DS    CL8                                                              
SW2EMP   DS    CL3      5   42    3  A   U    N         T        Y   58         
SW2EMPX  DS    CL8                                                              
SW2EMPNH DS    CL8                                                              
SW2EMPN  DS    CL16     5   46   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y              
SW2STRH  DS    CL8                                                              
SW2STR   DS    CL9      6   10    9  A   U    N         T        Y   96         
SW2STRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
SW2OPTSH DS    CL8                                                              
SW2OPTS  DS    CL30     6   28   30  A   U    N         T        Y  102         
SW2OPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL18     8    2   18  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL16     8   49   16  A   P    H         T        Y              
SW2SELH  DS    CL8                                                              
SW2SEL   DS    CL3      9    2    3  A   U    N         T        Y    1         
SW2SELX  DS    CL8                                                              
SW2YRH   DS    CL8                                                              
SW2YR    DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    23    6   74  A   P    N         T        Y              
SW2LAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SW2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
