*          DATA SET TASCR01D   AT LEVEL 006 AS OF 06/12/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F201D      DATE 06/12/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SCLAGYTH DS    CL8                                                              
SCLAGYT  DS    CL6      4    2    6  A  P H             T        Y              
SCLAGYH  DS    CL8                                                              
SCLAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SCLAGYX  DS    CL8                                                              
SCLCIDTH DS    CL8                                                              
SCLCIDT  DS    CL7      4   20    7  A  P H             T        Y              
SCLCIDH  DS    CL8                                                              
SCLCID   DS    CL12     4   28   12  A  U N             T        Y   64         
SCLCIDX  DS    CL8                                                              
SCLCIDNH DS    CL8                                                              
SCLCIDN  DS    CL20     4   42   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      4   63    7  A  P H             T        Y              
SCLSEPIH DS    CL8                                                              
SCLSEPI  DS    CL5      4   72    5  A  U N             T        Y  100         
SCLSEPIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
SCLTAGH  DS    CL8                                                              
SCLTAG   DS    CL79     6    2   79  A  P H             T        Y              
SCLL1H   DS    CL8                                                              
SCLL1    DS    CL3      7    2    3  A  U N             T        Y    1         
SCLL1X   DS    CL8                                                              
SCLSSNH  DS    CL8                                                              
SCLSSN   DS    CL9      7    6    9  A  U N             T        Y   96         
SCLSSNX  DS    CL8                                                              
SCLCATH  DS    CL8                                                              
SCLCAT   DS    CL3      7   16    3  A  U N             T        Y    3         
SCLCATX  DS    CL8                                                              
SCLONOFH DS    CL8                                                              
SCLONOF  DS    CL3      7   20    3  A  U N             T        Y    5         
SCLONOFX DS    CL8                                                              
SCLUNITH DS    CL8                                                              
SCLUNIT  DS    CL3      7   24    3  A  U N             T        Y    6         
SCLUNITX DS    CL8                                                              
SCLNCDEH DS    CL8                                                              
SCLNCDE  DS    CL4      7   28    4  A  U N             T        Y   80         
SCLNCDEX DS    CL8                                                              
SCLUNLOH DS    CL8                                                              
SCLUNLO  DS    CL7      7   33    7  A  U N             T        Y  176         
SCLUNLOX DS    CL8                                                              
SCLYEARH DS    CL8                                                              
SCLYEAR  DS    CL3      7   41    3  A  U N             T        Y   10         
SCLYEARX DS    CL8                                                              
SCLCORPH DS    CL8                                                              
SCLCORP  DS    CL1      7   46    1  A  U N             T        Y   95         
SCLCORPX DS    CL8                                                              
SCLPRATH DS    CL8                                                              
SCLPRAT  DS    CL10     7   49   10  A  U N             T        Y  110         
SCLPRATX DS    CL8                                                              
SCLWAGEH DS    CL8                                                              
SCLWAGE  DS    CL11     7   60   11  A  U N             T        Y   15         
SCLWAGEX DS    CL8                                                              
SCLWARDH DS    CL8                                                              
SCLWARD  DS    CL8      7   72    8  A  U N             T        Y  108         
SCLWARDX DS    CL8                                                              
SCLNAMEH DS    CL8                                                              
SCLNAME  DS    CL68     8    6   68  A  P H             T        Y              
SCLEPITH DS    CL8                                                              
SCLEPIT  DS    CL8      9    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   22    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2      9   25    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   28    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   35    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2      9   38    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   48    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2      9   51    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   54    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   61    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2      9   64    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   74    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2      9   77    2  A  P N             T        Y              
SCLCHCTH DS    CL8                                                              
SCLCHCT  DS    CL4     10   15    4  A  P N             T        Y              
SCLCHCMH DS    CL8                                                              
SCLCHCM  DS    CL60    10   20   60  A  U N             T        Y   18         
SCLCHCMX DS    CL8                                                              
SCLL2H   DS    CL8                                                              
SCLL2    DS    CL3     11    2    3  A  U N             T        Y    1         
SCLL2X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     11    6    9  A  U N             T        Y   96         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   16    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   20    3  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   24    3  A  U N             T        Y    6         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11   28    4  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11   33    7  A  U N             T        Y  176         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   41    3  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   46    1  A  U N             T        Y   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    11   49   10  A  U N             T        Y  110         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11   60   11  A  U N             T        Y   15         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     11   72    8  A  U N             T        Y  108         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL68    12    6   68  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     13    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   22    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     13   25    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   28    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   35    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     13   38    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   48    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     13   51    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   54    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   61    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     13   64    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   74    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     13   77    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   15    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    14   20   60  A  U N             T        Y   18         
         DS    CL8                                                              
SCLL3H   DS    CL8                                                              
SCLL3    DS    CL3     15    2    3  A  U N             T        Y    1         
SCLL3X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     15    6    9  A  U N             T        Y   96         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15   16    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15   20    3  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15   24    3  A  U N             T        Y    6         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     15   28    4  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15   33    7  A  U N             T        Y  176         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15   41    3  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   46    1  A  U N             T        Y   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15   49   10  A  U N             T        Y  110         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15   60   11  A  U N             T        Y   15         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   72    8  A  U N             T        Y  108         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL68    16    6   68  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     17    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   22    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17   25    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   28    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   35    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17   38    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   48    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17   51    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   54    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   61    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17   64    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   74    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17   77    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   15    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    18   20   60  A  U N             T        Y   18         
         DS    CL8                                                              
SCLL4H   DS    CL8                                                              
SCLL4    DS    CL3     19    2    3  A  U N             T        Y    1         
SCLL4X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19    6    9  A  U N             T        Y   96         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   16    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   20    3  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   24    3  A  U N             T        Y    6         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     19   28    4  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   33    7  A  U N             T        Y  176         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   41    3  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   46    1  A  U N             T        Y   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19   49   10  A  U N             T        Y  110         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19   60   11  A  U N             T        Y   15         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   72    8  A  U N             T        Y  108         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL68    20    6   68  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     21    6    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   22    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21   25    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   28    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   35    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21   38    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   41    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   48    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21   51    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   54    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   61    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21   64    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   67    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   74    2  A  U H             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21   77    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   15    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    22   20   60  A  U N             T        Y   18         
         DS    CL8                                                              
SCLCOMMH DS    CL8                                                              
SCLCOMM  DS    CL60    23    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL40    24    2   40  A  P H             T        Y              
SCLLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2952 BYTES                            
