*          DATA SET TASCRF1D   AT LEVEL 012 AS OF 05/09/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2F1D      DATE 05/09/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    4    5  A  P H             T        Y              
RADCCSTH DS    XL8                                                              
RADCCST  DS    CL17     5   17   17  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL9      5   38    9  A  P H             T        Y              
RADWKSH  DS    XL8                                                              
RADWKS   DS    CL2      5   48    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     5   55   11  A  P H             T        Y              
RADWSPTH DS    XL8                                                              
RADWSPT  DS    CL1      6    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    4    8  A  P N             T        Y              
RADWS8WH DS    XL8                                                              
RADWS8W  DS    CL1      6   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   34    3  A  P N             T        Y              
RADWS13H DS    XL8                                                              
RADWS13  DS    CL1      6   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   41    4  A  P N             T        Y              
RADWSNYH DS    XL8                                                              
RADWSNY  DS    CL1      6   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   48    2  A  P N             T        Y              
RADWSLAH DS    XL8                                                              
RADWSLA  DS    CL1      6   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   55    2  A  P N             T        Y              
RADWSCHH DS    XL8                                                              
RADWSCH  DS    CL1      6   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   62    3  A  P N             T        Y              
RADWSUNH DS    XL8                                                              
RADWSUN  DS    CL4      7   32    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   37    5  A  P N             T        Y              
RADWSUPH DS    XL8                                                              
RADWSUP  DS    CL1      7   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   59    7  A  P N             T        Y              
RADNETWH DS    XL8                                                              
RADNETW  DS    CL1      8    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    4    7  A  P N             T        Y              
RAD1WKH  DS    XL8                                                              
RAD1WK   DS    CL1      8   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   34    3  A  P N             T        Y              
RAD4WKH  DS    XL8                                                              
RAD4WK   DS    CL1      8   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   41    3  A  P N             T        Y              
RAD8WKH  DS    XL8                                                              
RAD8WK   DS    CL1      8   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   48    3  A  P N             T        Y              
RAD13WKH DS    XL8                                                              
RAD13WK  DS    CL1      8   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   55    4  A  P N             T        Y              
RAD26USH DS    XL8                                                              
RAD26US  DS    CL1      8   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   62   10  A  P N             T        Y              
RAD39USH DS    XL8                                                              
RAD39US  DS    CL1      9   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   34   10  A  P N             T        Y              
RADACBDH DS    XL8                                                              
RADACBD  DS    CL1      9   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   48   12  A  P N             T        Y              
RADREGNH DS    XL8                                                              
RADREGN  DS    CL1     10    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    10    4   16  A  P N             T        Y              
RADNONEH DS    XL8                                                              
RADNONE  DS    CL1     10   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   34    4  A  P N             T        Y              
RADRNNYH DS    XL8                                                              
RADRNNY  DS    CL1     10   39    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   41    2  A  P N             T        Y              
RADRNLAH DS    XL8                                                              
RADRNLA  DS    CL1     10   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   48    2  A  P N             T        Y              
RADRNCHH DS    XL8                                                              
RADRNCH  DS    CL1     10   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   55    3  A  P N             T        Y              
RADLOCAH DS    XL8                                                              
RADLOCA  DS    CL1     11    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    4   11  A  P N             T        Y              
RADDEALH DS    XL8                                                              
RADDEAL  DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12    4    6  A  P N             T        Y              
RADINDRH DS    XL8                                                              
RADINDR  DS    CL1     13    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    4   10  A  P N             T        Y              
RADIR30H DS    XL8                                                              
RADIR30  DS    CL1     13   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   34    7  A  P N             T        Y              
RADIRUNH DS    XL8                                                              
RADIRUN  DS    CL1     13   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   48    9  A  P N             T        Y              
RADFREUH DS    XL8                                                              
RADFREU  DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    4    7  A  P N             T        Y              
RADPENAH DS    XL8                                                              
RADPENA  DS    CL1     15    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    4    7  A  P N             T        Y              
RADOTHRH DS    XL8                                                              
RADOTHR  DS    CL1     15   26    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   28   13  A  P N             T        Y              
RADSPECH DS    XL8                                                              
RADSPEC  DS    CL30    15   42   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16    4   11  A  P H             T        Y              
RADMUSTH DS    XL8                                                              
RADMUST  DS    CL17    16   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   38    9  A  P H             T        Y              
RADMWKSH DS    XL8                                                              
RADMWKS  DS    CL2     16   48    2  A  U N             T        Y              
RADMUSH  DS    XL8                                                              
RADMUS   DS    CL1     17    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17    4    5  A  P N             T        Y              
RADM8WH  DS    XL8                                                              
RADM8W   DS    CL1     17   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   34    3  A  P N             T        Y              
RADM13WH DS    XL8                                                              
RADM13W  DS    CL1     17   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   40    4  A  P N             T        Y              
RADMRUSH DS    XL8                                                              
RADMRUS  DS    CL1     17   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   47    5  A  P N             T        Y              
RADMCONH DS    XL8                                                              
RADMCON  DS    CL1     17   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   55    4  A  P N             T        Y              
RADMDUBH DS    XL8                                                              
RADMDUB  DS    CL1     17   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   62    3  A  P N             T        Y              
RADFMUSH DS    XL8                                                              
RADFMUS  DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18    4   11  A  P N             T        Y              
RADFM8WH DS    XL8                                                              
RADFM8W  DS    CL1     18   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   34    3  A  P N             T        Y              
RADFM13H DS    XL8                                                              
RADFM13  DS    CL1     18   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   40    4  A  P N             T        Y              
RADNBMH  DS    XL8                                                              
RADNBM   DS    CL1     19    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    19    4   19  A  P N             T        Y              
RADNBM8H DS    XL8                                                              
RADNBM8  DS    CL1     19   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   34    3  A  P N             T        Y              
RADNBM1H DS    XL8                                                              
RADNBM1  DS    CL1     19   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   40    4  A  P N             T        Y              
RADNBM2H DS    XL8                                                              
RADNBM2  DS    CL1     19   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   47    6  A  P N             T        Y              
RADREGMH DS    XL8                                                              
RADREGM  DS    CL1     19   55    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   57   14  A  P N             T        Y              
RADFRMUH DS    XL8                                                              
RADFRMU  DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    20    4   13  A  P N             T        Y              
RADFM12H DS    XL8                                                              
RADFM12  DS    CL1     20   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   34    3  A  P N             T        Y              
RADFM24H DS    XL8                                                              
RADFM24  DS    CL1     20   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   40    3  A  P N             T        Y              
RADFMUKH DS    XL8                                                              
RADFMUK  DS    CL1     20   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   47    6  A  P N             T        Y              
RADFMNOH DS    XL8                                                              
RADFMNO  DS    CL1     20   54    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   56    6  A  P N             T        Y              
RADFMWOH DS    XL8                                                              
RADFMWO  DS    CL1     20   66    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   68    5  A  P N             T        Y              
RADMBOH  DS    XL8                                                              
RADMBO   DS    CL1     21    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    21    4   16  A  P N             T        Y              
RADMBOIH DS    XL8                                                              
RADMBOI  DS    CL1     21   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    21   34   15  A  P N             T        Y              
RADMBORH DS    XL8                                                              
RADMBOR  DS    CL1     21   54    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   56   11  A  P N             T        Y              
RADMPENH DS    XL8                                                              
RADMPEN  DS    CL1     22    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    22    4   13  A  P N             T        Y              
RADOTHMH DS    XL8                                                              
RADOTHM  DS    CL1     22   26    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    22   28   19  A  P N             T        Y              
RADOMSPH DS    XL8                                                              
RADOMSP  DS    CL30    22   48   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    23    4   14  A  P N             T        Y              
RADAPPSH DS    XL8                                                              
RADAPPS  DS    CL1     23   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   40    7  A  P N             T        Y              
RADAPPCH DS    XL8                                                              
RADAPPC  DS    CL30    23   48   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   15    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   31    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     24   44    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   58    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   71    9  A  P H             T        Y              
RADLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
RADWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
