*          DATA SET TASCR39D   AT LEVEL 020 AS OF 07/18/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F239D      DATE 07/18/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SUHAGYH  DS    XL8                                                              
SUHAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SUHAGYX  DS    XL8                                                              
SUHAGYNH DS    XL8                                                              
SUHAGYN  DS    CL16     5   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P H             T        Y              
SUHCIDH  DS    XL8                                                              
SUHCID   DS    CL12     5   46   12  A  U N             T        Y   64         
SUHCIDX  DS    XL8                                                              
SUHCIDNH DS    XL8                                                              
SUHCIDN  DS    CL16     5   60   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
SUHUSEH  DS    XL8                                                              
SUHUSE   DS    CL3      6   10    3  A  U N             T        Y   69         
SUHUSEX  DS    XL8                                                              
SUHUSENH DS    XL8                                                              
SUHUSEN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
SUHVERSH DS    XL8                                                              
SUHVERS  DS    CL3      6   46    3  A  P N             T        Y              
SUHHEDH  DS    XL8                                                              
SUHHED   DS    CL7      7    2    7  A  P N             T        Y              
SUHSSNH  DS    XL8                                                              
SUHSSN   DS    CL9      7   10    9  N  U N             T        Y   96         
SUHSSNX  DS    XL8                                                              
SUHSSNNH DS    XL8                                                              
SUHSSNN  DS    CL16     7   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7   38    3  A  P N             T        Y              
SUHCATH  DS    XL8                                                              
SUHCAT   DS    CL3      7   46    3  A  U N             T        Y   73         
SUHCATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P N             T        Y              
SUHCYCH  DS    XL8                                                              
SUHCYC   DS    CL17     8   10   17  A  U N             T        Y   70         
SUHCYCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SUHINVH  DS    XL8                                                              
SUHINV   DS    CL6     10   17    6  A  U N             T        Y   10         
SUHINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
SUHTYPH  DS    XL8                                                              
SUHTYP   DS    CL5     11   17    5  A  U N             T        Y   11         
SUHTYPX  DS    XL8                                                              
SUHTYPNH DS    XL8                                                              
SUHTYPN  DS    CL16    11   28   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
SUHDUEH  DS    XL8                                                              
SUHDUE   DS    CL8     12   17    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL35    12   45   35  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     13   46    8  A  P N             T        Y              
SUHCSYSH DS    XL8                                                              
SUHCSYS  DS    CL4     13   59    4  N  U N             T        Y   25         
SUHCSYSX DS    XL8                                                              
SUHLUPH  DS    XL8                                                              
SUHLUP   DS    CL1     13   68    1  A  P N             T        Y              
SUHLSBH  DS    XL8                                                              
SUHLSB   DS    CL8     13   72    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14   17    5  A  P N             T        Y              
SUHTUH   DS    XL8                                                              
SUHTU    DS    CL3     14   25    3  N  U N             T        Y   13         
SUHTUX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     14   30    4  A  P N             T        Y              
SUHLUH   DS    XL8                                                              
SUHLU    DS    CL3     14   37    3  N  U N             T        Y   15         
SUHLUX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     14   46    9  A  P N             T        Y              
SUHLPSBH DS    XL8                                                              
SUHLPSB  DS    CL8     14   72    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL26    16   17   26  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL35    16   45   35  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
SUHNYH   DS    XL8                                                              
SUHNY    DS    CL1     17   17    1  A  U N             T        Y   17         
SUHNYX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   19    1  N  P N             T        Y              
SUHLAH   DS    XL8                                                              
SUHLA    DS    CL1     17   21    1  A  U N             T        Y   19         
SUHLAX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   23    1  N  P N             T        Y              
SUHCHIH  DS    XL8                                                              
SUHCHI   DS    CL1     17   26    1  A  U N             T        Y   21         
SUHCHIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   28    1  N  P N             T        Y              
SUHUNTH  DS    XL8                                                              
SUHUNT   DS    CL4     17   30    4  N  U N             T        Y   23         
SUHUNTX  DS    XL8                                                              
SUHUPGRH DS    XL8                                                              
SUHUPGR  DS    CL1     17   39    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   46    8  A  P N             T        Y              
SUHCUNH  DS    XL8                                                              
SUHCUN   DS    CL7     17   56    7  N  U N             T        Y   25         
SUHCUNX  DS    XL8                                                              
SUHCUPH  DS    XL8                                                              
SUHCUP   DS    CL1     17   68    1  A  P N             T        Y              
SUHCSUBH DS    XL8                                                              
SUHCSUB  DS    CL8     17   72    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18    2    9  A  P N             T        Y              
SUHPNYH  DS    XL8                                                              
SUHPNY   DS    CL1     18   17    1  A  P N             T        Y              
SUHPLAH  DS    XL8                                                              
SUHPLA   DS    CL1     18   21    1  A  P N             T        Y              
SUHPCHIH DS    XL8                                                              
SUHPCHI  DS    CL1     18   26    1  A  P N             T        Y              
SUHPUNTH DS    XL8                                                              
SUHPUNT  DS    CL4     18   30    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   46    9  A  P N             T        Y              
SUHPCUNH DS    XL8                                                              
SUHPCUN  DS    CL7     18   56    7  A  P N             T        Y              
SUHCPREH DS    XL8                                                              
SUHCPRE  DS    CL13    18   66   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20    2   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL49    20   17   49  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
SUHSUNTH DS    XL8                                                              
SUHSUNT  DS    CL4     21   17    4  N  U N             T        Y   31         
SUHSUNTX DS    XL8                                                              
SUHUPGNH DS    XL8                                                              
SUHUPGN  DS    CL1     21   39    1  A  P N             T        Y              
SUHUPGWH DS    XL8                                                              
SUHUPGW  DS    CL1     21   50    1  A  P N             T        Y              
SUHUPGCH DS    XL8                                                              
SUHUPGC  DS    CL1     21   61    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     22    2    9  A  P N             T        Y              
SUHSPUNH DS    XL8                                                              
SUHSPUN  DS    CL4     22   17    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
SUHLCHGH DS    XL8                                                              
SUHLCHG  DS    CL17    24   17   17  A  P N             T        Y              
SUHLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SUHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1320 BYTES                            
