*          DATA SET TASCRE3D   AT LEVEL 005 AS OF 02/26/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2E3D      DATE 02/26/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SJBAGYH  DS    XL8                                                              
SJBAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SJBAGYX  DS    XL8                                                              
SJBAGYNH DS    XL8                                                              
SJBAGYN  DS    CL16     5   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
SJBDTEH  DS    XL8                                                              
SJBDTE   DS    CL8      6   10    8  A  U N             T        Y   11         
SJBDTEX  DS    XL8                                                              
SJBBUNHH DS    XL8                                                              
SJBBUNH  DS    CL9      6   38    9  A  P N             T        Y              
SJBBUNTH DS    XL8                                                              
SJBBUNT  DS    CL16     6   48   16  A  U N             T        Y   53         
SJBBUNTX DS    XL8                                                              
SJBCLHDH DS    XL8                                                              
SJBCLHD  DS    CL6      7    2    6  A  P H             T        Y              
SJBCLIH  DS    XL8                                                              
SJBCLI   DS    CL6      7   10    6  A  U N             T        Y   32         
SJBCLIX  DS    XL8                                                              
SJBCLINH DS    XL8                                                              
SJBCLIN  DS    CL16     7   20   16  A  P N             T        Y              
SJBPRHDH DS    XL8                                                              
SJBPRHD  DS    CL7      8    2    7  A  P H             T        Y              
SJBPRDH  DS    XL8                                                              
SJBPRD   DS    CL6      8   10    6  A  U N             T        Y   48         
SJBPRDX  DS    XL8                                                              
SJBPRDNH DS    XL8                                                              
SJBPRDN  DS    CL16     8   20   16  A  P N             T        Y              
SJBJBHDH DS    XL8                                                              
SJBJBHD  DS    CL9      8   38    9  A  P H             T        Y              
SJBJOBH  DS    XL8                                                              
SJBJOB   DS    CL6      8   48    6  A  U N             T        Y   52         
SJBJOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10    2    4  A  P H             T        Y              
SJBJBSH  DS    XL8                                                              
SJBJBS   DS    CL70    10   10   70  A  U N             T        Y  247         
SJBJBSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    11   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    12   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    13   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    14   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    15   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    16   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    17   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    18   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    19   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    20   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    21   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    22   10   70  A  U N             T        Y  247         
         DS    XL8                                                              
SJBJLSTH DS    XL8                                                              
SJBJLST  DS    CL70    23   10   70  A  U N             T        Y  247         
SJBJLSTX DS    XL8                                                              
SJBPFKH  DS    XL8                                                              
SJBPFK   DS    CL20    24    2   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   49   13  A  P N             T        Y              
SJBLCHGH DS    XL8                                                              
SJBLCHG  DS    CL17    24   63   17  A  P N             T        Y              
SJBLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SJBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1608 BYTES                            
