*          DATA SET TASCR14D   AT LEVEL 007 AS OF 05/20/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F214D      DATE 05/20/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SCLCLIH  DS    XL8                                                              
SCLCLI   DS    CL6      5   10    6  A  U N             T        Y   31         
SCLCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SCLAGYH  DS    XL8                                                              
SCLAGY   DS    CL6      6   10    6  A  U N             T        Y   15         
SCLAGYX  DS    XL8                                                              
SCLAGYNH DS    XL8                                                              
SCLAGYN  DS    CL36     6   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P H             T        Y              
SCLCLINH DS    XL8                                                              
SCLCLIN  DS    CL36     7   20   36  A  U N             T        Y    2         
SCLCLINX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
SCLSNMEH DS    XL8                                                              
SCLSNME  DS    CL16     8   20   16  A  U N             T        Y    6         
SCLSNMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   40    7  A  P N             T        Y              
SCLADDRH DS    XL8                                                              
SCLADDR  DS    CL30     8   50   30  A  U N             T        Y   10         
SCLADDRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30     9   50   30  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    10   50   30  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    11   50   30  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    12    2   14  A  P N             T        Y              
SCLATTNH DS    XL8                                                              
SCLATTN  DS    CL36    12   20   36  A  U N             T        Y   14         
SCLATTNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    13    2   13  A  P N             T        Y              
SCLEMAIH DS    XL8                                                              
SCLEMAI  DS    CL35    13   20   35  L  U N             T        Y   88         
SCLEMAIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
SCLGCLH  DS    XL8                                                              
SCLGCL   DS    CL6     14   20    6  A  U N             T        Y   40         
SCLGCLX  DS    XL8                                                              
SCLGCSNH DS    XL8                                                              
SCLGCSN  DS    CL16    14   30   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
SCLSTATH DS    XL8                                                              
SCLSTAT  DS    CL50    15   20   50  A  U N             T        Y   38         
SCLSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
SCLBTYPH DS    XL8                                                              
SCLBTYP  DS    CL2     16   20    2  N  U N             T        Y   39         
SCLBTYPX DS    XL8                                                              
SCLBTY2H DS    XL8                                                              
SCLBTY2  DS    CL2     16   23    2  N  U N             T        Y   89         
SCLBTY2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    16   26   11  A  P N             T        Y              
SCLTIDH  DS    XL8                                                              
SCLTID   DS    CL6     16   38    6  A  U N             T        Y    9         
SCLTIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   45    8  A  P N             T        Y              
SCLTPCH  DS    XL8                                                              
SCLTPC   DS    CL8     16   54    8  A  U N             T        Y    8         
SCLTPCX  DS    XL8                                                              
SCLTPCNH DS    XL8                                                              
SCLTPCN  DS    CL16    16   63   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    17    2   17  A  P N             T        Y              
SCLPCLTH DS    XL8                                                              
SCLPCLT  DS    CL3     17   20    3  A  U N             T        Y   42         
SCLPCLTX DS    XL8                                                              
SCLPCLNH DS    XL8                                                              
SCLPCLN  DS    CL16    17   30   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     18    2    9  A  P N             T        Y              
SCLSIGNH DS    XL8                                                              
SCLSIGN  DS    CL6     18   20    6  A  U N             T        Y              
SCLSINMH DS    XL8                                                              
SCLSINM  DS    CL16    18   30   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    19    2   14  A  P N             T        Y              
SCLHLDH  DS    XL8                                                              
SCLHLD   DS    CL2     19   20    2  A  U N             T        Y   43         
SCLHLDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    19   43   13  A  P N             T        Y              
SCLLCHGH DS    XL8                                                              
SCLLCHG  DS    CL17    19   58   17  A  P N             T        Y              
SCLADRTH DS    XL8                                                              
SCLADRT  DS    CL16    20    2   16  A  P Z             T        Y              
SCLRCURH DS    XL8                                                              
SCLRCUR  DS    CL5     20   20    5  A  P N             T        Y   90         
SCLRCURX DS    XL8                                                              
SCLRSUTH DS    XL8                                                              
SCLRSUT  DS    CL5     20   28    5  A  P N             T        Y   91         
SCLRSUTX DS    XL8                                                              
SCLRFICH DS    XL8                                                              
SCLRFIC  DS    CL5     20   36    5  A  P N             T        Y   92         
SCLRFICX DS    XL8                                                              
SCLROFIH DS    XL8                                                              
SCLROFI  DS    CL5     20   44    5  A  P N             T        Y   93         
SCLROFIX DS    XL8                                                              
SCLRWCRH DS    XL8                                                              
SCLRWCR  DS    CL5     20   52    5  A  P N             T        Y   94         
SCLRWCRX DS    XL8                                                              
SCLRCRPH DS    XL8                                                              
SCLRCRP  DS    CL5     20   59    5  A  P N             T        Y   95         
SCLRCRPX DS    XL8                                                              
SCLRHNDH DS    XL8                                                              
SCLRHND  DS    CL5     20   67    5  A  P N             T        Y   96         
SCLRHNDX DS    XL8                                                              
SCLRCANH DS    XL8                                                              
SCLRCAN  DS    CL5     20   76    5  A  P N             T        Y   97         
SCLRCANX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
SCLAGRTH DS    XL8                                                              
SCLAGRT  DS    CL3     21   11    3  A  U N             T        Y   32         
SCLAGRTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL28    21   20   28  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     21   52    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21   59    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8     21   66    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     21   76    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     22   20    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     22   28    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     22   36    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     22   43    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     22   52    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     22   59    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     22   68    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     22   76    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  P H             T        Y              
SCLCFUTH DS    XL8                                                              
SCLCFUT  DS    CL5     23   20    5  A  U N             T        Y   54         
SCLCFUTX DS    XL8                                                              
SCLCSUTH DS    XL8                                                              
SCLCSUT  DS    CL5     23   28    5  A  U N             T        Y   58         
SCLCSUTX DS    XL8                                                              
SCLCFICH DS    XL8                                                              
SCLCFIC  DS    CL5     23   36    5  A  U N             T        Y   62         
SCLCFICX DS    XL8                                                              
SCLCOVRH DS    XL8                                                              
SCLCOVR  DS    CL5     23   44    5  A  U N             T        Y   70         
SCLCOVRX DS    XL8                                                              
SCLCWCRH DS    XL8                                                              
SCLCWCR  DS    CL5     23   52    5  A  U N             T        Y   71         
SCLCWCRX DS    XL8                                                              
SCLCCRPH DS    XL8                                                              
SCLCCRP  DS    CL5     23   59    5  A  U N             T        Y   74         
SCLCCRPX DS    XL8                                                              
SCLCHANH DS    XL8                                                              
SCLCHAN  DS    CL5     23   67    5  A  U N             T        Y   82         
SCLCHANX DS    XL8                                                              
SCLCCANH DS    XL8                                                              
SCLCCAN  DS    CL5     23   76    5  A  U N             T        Y   86         
SCLCCANX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL54    24    2   54  A  P H             T        Y              
SCLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
