*          DATA SET TASCR1DD   AT LEVEL 002 AS OF 03/21/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F21DD      DATE 03/21/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     5    2   11  A  P H             T        Y              
SATAGYH  DS    XL8                                                              
SATAGY   DS    CL6      5   20    6  A  U N             T        Y   16         
SATAGYX  DS    XL8                                                              
SATAGYNH DS    XL8                                                              
SATAGYN  DS    CL36     5   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     6    2   14  A  P H             T        Y              
SATATTH  DS    XL8                                                              
SATATT   DS    CL2      6   20    2  A  U N             T        Y   28         
SATATTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
SATNAMEH DS    XL8                                                              
SATNAME  DS    CL36     8   20   36  A  U N             T        Y    2         
SATNAMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    10    2   15  A  P N             T        Y              
SATADDRH DS    XL8                                                              
SATADDR  DS    CL30    10   20   30  A  U N             T        Y   10         
SATADDRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    11   20   30  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    12   20   30  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    13   20   30  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
SATANAMH DS    XL8                                                              
SATANAM  DS    CL36    15   20   36  A  U N             T        Y   12         
SATANAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    16    2   13  A  P N             T        Y              
SATEMAIH DS    XL8                                                              
SATEMAI  DS    CL35    16   20   35  L  U N             T        Y   88         
SATEMAIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    18    2   13  A  P N             T        Y              
SATLCHGH DS    XL8                                                              
SATLCHG  DS    CL17    18   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    24    2   32  A  P H             T        Y              
SATLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 648  BYTES                            
