*          DATA SET TASCRE8D   AT LEVEL 002 AS OF 04/14/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2E8D      DATE 04/14/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
STMAGYH  DS    XL8                                                              
STMAGY   DS    CL6      4   10    6  A  U N             T    I   Y   16         
STMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
STMINVH  DS    XL8                                                              
STMINV   DS    CL6      4   28    6  A  U N             T        Y  144         
STMINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
STMCIDH  DS    XL8                                                              
STMCID   DS    CL12     4   46   12  A  U N             T        Y   64         
STMCIDX  DS    XL8                                                              
STMCOMNH DS    XL8                                                              
STMCOMN  DS    CL19     4   60   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
STMTAGH  DS    XL8                                                              
STMTAG   DS    CL79     6    2   79  A  P H             T        Y              
STMSELH  DS    XL8                                                              
STMSEL   DS    CL3      7    2    3  A  U N             T        Y    1         
STMSELX  DS    XL8                                                              
STML1ENH DS    XL8                                                              
STML1EN  DS    CL70     7    6   70  A  P N             T        Y              
STMNAMEH DS    XL8                                                              
STMNAME  DS    CL16     8    6   16  A  P H             T        Y              
STMCOMMH DS    XL8                                                              
STMCOMM  DS    CL55     8   24   55  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70     9    6   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    10    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL55    10   24   55  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    11    6   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    12    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL55    12   24   55  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    13    6   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    14    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL55    14   24   55  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    15    6   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    16    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL55    16   24   55  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    17    6   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    18    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL55    18   24   55  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    19    6   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    20    6   16  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL55    20   24   55  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    21    6   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    22    6   16  A  P H             T        Y              
STMLSTH  DS    XL8                                                              
STMLST   DS    CL55    22   24   55  A  P H             T        Y              
STMPFKH  DS    XL8                                                              
STMPFK   DS    CL20    24    2   20  A  P H             T        Y              
STMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
STMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
