*          DATA SET TASCR70D   AT LEVEL 007 AS OF 10/11/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F270D      DATE 10/11/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
TKLAGYH  DS    XL8                                                              
TKLAGY   DS    CL6      5   10    6  A  U N             T        Y   17         
TKLAGYX  DS    XL8                                                              
TKLAGYNH DS    XL8                                                              
TKLAGYN  DS    CL36     5   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
TKLOPTSH DS    XL8                                                              
TKLOPTS  DS    CL32     6   10   32  A  U N             T        Y  102         
TKLOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   39    6  A  P H             T        Y              
TKLLSTH  DS    XL8                                                              
TKLLST   DS    CL78     8    2   78  A  P N             T        Y    1         
TKLLSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL64    24    2   64  A  P H             T        Y              
TKLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
TKLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1760 BYTES                            
