*          DATA SET TASCRC6D   AT LEVEL 001 AS OF 04/13/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2C6D      DATE 04/13/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SECSHEDH DS    XL8                                                              
SECSHED  DS    CL7      5    2    7  A  P H             T        Y              
SECSSNH  DS    XL8                                                              
SECSSN   DS    CL9      5   10    9  A  U N             T        Y   96         
SECSSNX  DS    XL8                                                              
SECNAMEH DS    XL8                                                              
SECNAME  DS    CL16     5   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SECAGYH  DS    XL8                                                              
SECAGY   DS    CL6      5   46    6  A  U N             T        Y   16         
SECAGYX  DS    XL8                                                              
SECAGYNH DS    XL8                                                              
SECAGYN  DS    CL13     5   53   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   67    7  A  P N             T        Y              
SECEPIH  DS    XL8                                                              
SECEPI   DS    CL5      5   75    5  A  U N             T        Y  100         
SECEPIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
SECHD1H  DS    XL8                                                              
SECHD1   DS    CL26     7    2   26  A  P H             T        Y              
SECHD2H  DS    XL8                                                              
SECHD2   DS    CL39     7   34   39  A  P H             T        Y              
SECSELH  DS    XL8                                                              
SECSEL   DS    CL3      8    2    3  A  U N             T        Y    1         
SECSELX  DS    XL8                                                              
SECL1H   DS    XL8                                                              
SECL1    DS    CL74     8    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74     9    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
SECLSTH  DS    XL8                                                              
SECLST   DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    24    2   24  A  P H             T        Y              
SECLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SECWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1904 BYTES                            
