*          DATA SET TASCR17D   AT LEVEL 014 AS OF 06/05/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F217D      DATE 06/05/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SPGAGYH  DS    CL8                                                              
SPGAGY   DS    CL6      5   20    6  A  U N             T        Y   16         
SPGAGYX  DS    CL8                                                              
SPGAGYNH DS    CL8                                                              
SPGAGYN  DS    CL16     5   28   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SPGCLIH  DS    CL8                                                              
SPGCLI   DS    CL6      6   20    6  A  U N             T        Y   32         
SPGCLIX  DS    CL8                                                              
SPGCLINH DS    CL8                                                              
SPGCLIN  DS    CL16     6   28   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A  P H             T        Y              
SPGPRGH  DS    CL8                                                              
SPGPRG   DS    CL6      7   20    6  A  U N             T        Y   56         
SPGPRGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A  P H             T        Y              
SPGNAMEH DS    CL8                                                              
SPGNAME  DS    CL36     9   20   36  A  U N             T        Y    2         
SPGNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
SPGSNMEH DS    CL8                                                              
SPGSNME  DS    CL16    10   20   16  A  U N             T        Y    6         
SPGSNMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    12    2   13  A  P N             T        Y              
SPGLCHGH DS    CL8                                                              
SPGLCHG  DS    CL17    12   20   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    24    2   48  A  P H             T        Y              
SPGLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SPGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 408  BYTES                            
