*          DATA SET TASCRA6D   AT LEVEL 011 AS OF 10/14/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2A6D      DATE 10/14/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P H             T        Y              
SW2SSNH  DS    XL8                                                              
SW2SSN   DS    CL9      4   10    9  A  U N             T        Y   60         
SW2SSNX  DS    XL8                                                              
SW2SSNNH DS    XL8                                                              
SW2SSNN  DS    CL16     4   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      4   38    8  A  P H             T        Y              
SW2EMPH  DS    XL8                                                              
SW2EMP   DS    CL3      4   47    3  A  U N             T        Y   58         
SW2EMPX  DS    XL8                                                              
SW2EMPNH DS    XL8                                                              
SW2EMPN  DS    CL16     4   51   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
SW2YEARH DS    XL8                                                              
SW2YEAR  DS    CL4      5   10    4  N  U N             T        Y   59         
SW2YEARX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   38    5  A  P N             T        Y              
SW2CANH  DS    XL8                                                              
SW2CAN   DS    CL1      5   44    1  A  U N             T        Y   61         
SW2CANX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL43     7    2   43  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL35     7   46   35  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
SW2YTDH  DS    XL8                                                              
SW2YTD   DS    CL71     8   10   71  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P H             T        Y              
SW2YTDRH DS    XL8                                                              
SW2YTDR  DS    CL70     9   11   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL44    10    2   44  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL32    10   49   32  A  P H             T        Y              
SW2UNITH DS    XL8                                                              
SW2UNIT  DS    CL3     11    2    3  A  U N             T        Y    9         
SW2UNITX DS    XL8                                                              
SW2EARNH DS    XL8                                                              
SW2EARN  DS    CL11    11   10   11  A  U N             T        Y   10         
SW2EARNX DS    XL8                                                              
SW2TREMH DS    XL8                                                              
SW2TREM  DS    CL11    11   22   11  A  U N             T        Y   21         
SW2TREMX DS    XL8                                                              
SW2TAXH  DS    XL8                                                              
SW2TAX   DS    CL11    11   34   11  A  U N             T        Y   11         
SW2TAXX  DS    XL8                                                              
SW2FICAH DS    XL8                                                              
SW2FICA  DS    CL11    11   46   11  A  U N             T        Y   13         
SW2FICAX DS    XL8                                                              
SW2REIMH DS    XL8                                                              
SW2REIM  DS    CL11    11   58   11  A  U N             T        Y   14         
SW2REIMX DS    XL8                                                              
SW2SFLIH DS    XL8                                                              
SW2SFLI  DS    CL11    11   70   11  A  U N             T        Y   15         
SW2SFLIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    13   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    13   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    13   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    13   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    13   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    13   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    15   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    15   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    15   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    15   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    15   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    15   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    16   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    16   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    16   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    16   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    16   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    16   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    18   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    18   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    18   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    18   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    18   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    18   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    20   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    20   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    20   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    20   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    20   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    20   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    21   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    21   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    21   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    21   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    21   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    21   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    22   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    22   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    22   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    22   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    22   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    22   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    9         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    23   10   11  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    23   22   11  A  U N             T        Y   21         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    23   34   11  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    23   46   11  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    23   58   11  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    23   70   11  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL27    24    2   27  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   31   13  A  P N             T        Y              
SW2LCHGH DS    XL8                                                              
SW2LCHG  DS    CL17    24   45   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   64    8  A  P N             T        Y              
SW2LPRTH DS    XL8                                                              
SW2LPRT  DS    CL8     24   73    8  A  P N             T        Y              
SW2LAST  DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
SW2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 3040 BYTES                            
