*          DATA SET TASCR42D   AT LEVEL 007 AS OF 04/29/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F242D      DATE 04/29/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SLNPHEDH DS    XL8                                                              
SLNPHED  DS    CL4      5    2    4  A  P N             T        Y              
SLNSSNH  DS    XL8                                                              
SLNSSN   DS    CL9      5   10    9  N  U N             T        Y   96         
SLNSSNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
SLNSTRH  DS    XL8                                                              
SLNSTR   DS    CL6      5   28    6  A  U N             T        Y   22         
SLNSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SLNOPTSH DS    XL8                                                              
SLNOPTS  DS    CL15     6   10   15  A  U N             T        Y   26         
SLNOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
SLNSHEDH DS    XL8                                                              
SLNSHED  DS    CL9      8    6    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   17    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   24    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   30    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     8   47   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9      8   61    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8   74    7  A  P H             T        Y              
SLNSELH  DS    XL8                                                              
SLNSEL   DS    CL3      9    2    3  A  U N             T        Y   30         
SLNSELX  DS    XL8                                                              
SLNDETH  DS    XL8                                                              
SLNDET   DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
SLNTOTSH DS    XL8                                                              
SLNTOTS  DS    CL75    24    6   75  A  P H             T        Y              
SLNLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SLNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1864 BYTES                            
