*          DATA SET TASCREED   AT LEVEL 003 AS OF 12/16/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2EED      DATE 12/16/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
CNTAGYH  DS    XL8                                                              
CNTAGY   DS    CL6      5   20    6  A  U N             T        Y   16         
CNTAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     5   38   11  A  P H             T        Y              
CNTCONIH DS    XL8                                                              
CNTCONI  DS    CL12     5   55   12  A  U N             T        Y    1         
CNTCONIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6    2   10  A  P H             T        Y              
CNTTSTAH DS    XL8                                                              
CNTTSTA  DS    CL8      6   20    8  A  U N             T        Y    2         
CNTTSTAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   38    8  A  P H             T        Y              
CNTTENDH DS    XL8                                                              
CNTTEND  DS    CL8      6   55    8  A  U N             T        Y    3         
CNTTENDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     8    2   17  A  P H             T        Y              
CNTCONDH DS    XL8                                                              
CNTCOND  DS    CL60     8   20   60  A  U N             T        Y    4         
CNTCONDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     9    2   13  A  P H             T        Y              
CNTDATEH DS    XL8                                                              
CNTDATE  DS    CL8      9   20    8  A  U N             T        Y    5         
CNTDATEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    11    2   13  A  P H             T        Y              
CNTNONUH DS    XL8                                                              
CNTNONU  DS    CL1     11   18    1  A  U N             T        Y    6         
CNTNONUX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    11   20   19  A  P N             T        Y              
CNTMUSLH DS    XL8                                                              
CNTMUSL  DS    CL1     11   53    1  A  U N             T        Y    6         
CNTMUSLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    11   55   13  A  P N             T        Y              
CNTCNLKH DS    XL8                                                              
CNTCNLK  DS    CL1     12   18    1  A  U N             T        Y    6         
CNTCNLKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL23    12   20   23  A  P N             T        Y              
CNTPRORH DS    XL8                                                              
CNTPROR  DS    CL1     12   53    1  A  U N             T        Y    6         
CNTPRORX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    12   55   16  A  P N             T        Y              
CNTSTFAH DS    XL8                                                              
CNTSTFA  DS    CL1     13   18    1  A  U N             T        Y    6         
CNTSTFAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL23    13   20   23  A  P N             T        Y              
CNTMSTRH DS    XL8                                                              
CNTMSTR  DS    CL1     13   53    1  A  U N             T        Y    6         
CNTMSTRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    13   55   16  A  P N             T        Y              
CNTCOVGH DS    XL8                                                              
CNTCOVG  DS    CL1     14   18    1  A  U N             T        Y    6         
CNTCOVGX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL29    14   20   29  A  P N             T        Y              
CNTNEDMH DS    XL8                                                              
CNTNEDM  DS    CL1     14   53    1  A  U N             T        Y    6         
CNTNEDMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    14   55   16  A  P N             T        Y              
CNTOTHRH DS    XL8                                                              
CNTOTHR  DS    CL1     15   18    1  A  U N             T        Y    6         
CNTOTHRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     15   20    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    16    2   15  A  P Z             T        Y              
CNTSTAAH DS    XL8                                                              
CNTSTAA  DS    CL1     16   18    1  A  P Z             T        Y    7         
CNTSTAAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16   20    6  A  P Z             T        Y              
CNTSTAEH DS    XL8                                                              
CNTSTAE  DS    CL1     16   53    1  A  P Z             T        Y    7         
CNTSTAEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16   55    7  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
CNTCLIH  DS    XL8                                                              
CNTCLI   DS    CL6     17   20    6  A  U N             T        Y    8         
CNTCLIX  DS    XL8                                                              
CNTCLINH DS    XL8                                                              
CNTCLIN  DS    CL36    17   31   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
CNTPRDH  DS    XL8                                                              
CNTPRD   DS    CL6     18   20    6  A  U N             T        Y    9         
CNTPRDX  DS    XL8                                                              
CNTPRDNH DS    XL8                                                              
CNTPRDN  DS    CL36    18   31   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19    2   13  A  P N             T        Y              
CNTSSNH  DS    XL8                                                              
CNTSSN   DS    CL9     19   20    9  A  U N             T        Y   10         
CNTSSNX  DS    XL8                                                              
CNTSSNNH DS    XL8                                                              
CNTSSNN  DS    CL36    19   31   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
CNTFEEH  DS    XL8                                                              
CNTFEE   DS    CL12    20   20   12  A  U N             T        Y   11         
CNTFEEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
CNTCMNTH DS    XL8                                                              
CNTCMNT  DS    CL60    21   20   60  A  U N             T        Y   12         
CNTCMNTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  P N             T        Y              
CNTLCHGH DS    XL8                                                              
CNTLCHG  DS    CL17    23   20   17  A  P N             T        Y              
CNTPF13H DS    XL8                                                              
CNTPF13  DS    CL9     24    2    9  A  P H             T        Y              
CNTPF14H DS    XL8                                                              
CNTPF14  DS    CL11    24   20   11  A  P H             T        Y              
CNTPF15H DS    XL8                                                              
CNTPF15  DS    CL13    24   38   13  A  P H             T        Y              
CNTPF16H DS    XL8                                                              
CNTPF16  DS    CL12    24   55   12  A  P H             T        Y              
CNTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1328 BYTES                            
