*          DATA SET TASCRB9D   AT LEVEL 002 AS OF 04/26/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2B9D      DATE 04/26/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SDTSHEDH DS    XL8                                                              
SDTSHED  DS    CL7      5    2    7  A  P H             T        Y              
SDTSSNH  DS    XL8                                                              
SDTSSN   DS    CL9      5   10    9  A  U N             T        Y   96         
SDTSSNX  DS    XL8                                                              
SDTSSNNH DS    XL8                                                              
SDTSSNN  DS    CL16     5   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P H             T        Y              
SDTDUCH  DS    XL8                                                              
SDTDUC   DS    CL6      6   10    6  A  U N             T        Y  112         
SDTDUCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   20    1  A  P N             T        Y              
SDTBALH  DS    XL8                                                              
SDTBAL   DS    CL20     6   38   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     8    2   16  A  P H             T        Y              
SDTAMTH  DS    XL8                                                              
SDTAMT   DS    CL12     8   20   12  A  U N             T        Y  115         
SDTAMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SDTCMNTH DS    XL8                                                              
SDTCMNT  DS    CL30     9   20   30  A  U N             T        Y  119         
SDTCMNTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    11    2   13  A  P N             T        Y              
SDTLCHGH DS    XL8                                                              
SDTLCHG  DS    CL17    11   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL59    24    2   59  A  P H             T        Y              
SDTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SDTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 368  BYTES                            
