*          DATA SET TASCR8CD   AT LEVEL 002 AS OF 10/20/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F28CD      DATE 10/20/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
MENAGYH  DS    XL8                                                              
MENAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
MENAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
MENCIDH  DS    XL8                                                              
MENCID   DS    CL12     4   28   12  A  U N             T        Y   64         
MENCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      4   42    6  A  P H             T        Y              
MENADVH  DS    XL8                                                              
MENADV   DS    CL6      4   49    6  A  U N             T        Y  208         
MENADVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      4   56    1  A  P N             T        Y              
MENLFTH  DS    XL8                                                              
MENLFT   DS    CL3      4   58    3  A  P N             T        Y              
MENVERH  DS    XL8                                                              
MENVER   DS    CL3      4   62    3  A  U N             T        Y   22         
MENVERX  DS    XL8                                                              
MENVEDH  DS    XL8                                                              
MENVED   DS    CL12     4   67   12  A  P N             T        Y              
MENTAGH  DS    XL8                                                              
MENTAG   DS    CL6      5    2    6  A  P H             T        Y              
MENCLINH DS    XL8                                                              
MENCLIN  DS    CL36     5   10   36  A  U N             T        Y   32         
MENCLINX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   50    4  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
MENPRDNH DS    XL8                                                              
MENPRDN  DS    CL36     6   10   36  A  U N             T        Y   48         
MENPRDNX DS    XL8                                                              
MENRDUH  DS    XL8                                                              
MENRDU   DS    CL3      6   58    3  A  P H             T        Y              
MENRDDH  DS    XL8                                                              
MENRDD   DS    CL8      6   62    8  A  P Z             T        Y              
MENRDTH  DS    XL8                                                              
MENRDT   DS    CL8      6   71    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
MENCIDNH DS    XL8                                                              
MENCIDN  DS    CL36     7   10   36  A  U N             T        Y   65         
MENCIDNX DS    XL8                                                              
MENMDUH  DS    XL8                                                              
MENMDU   DS    CL3      7   58    3  A  P H             T        Y              
MENMDDH  DS    XL8                                                              
MENMDD   DS    CL8      7   62    8  A  P Z             T        Y              
MENMDTH  DS    XL8                                                              
MENMDT   DS    CL8      7   71    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
MENMEDH  DS    XL8                                                              
MENMED   DS    CL1      8   10    1  A  U N             T        Y   73         
MENMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8   13    3  A  P H             T        Y              
MENSECH  DS    XL8                                                              
MENSEC   DS    CL3      8   17    3  A  U N             T        Y   19         
MENSECX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8   21    3  A  P N             T        Y              
MENEXPH  DS    XL8                                                              
MENEXP   DS    CL8      8   25    8  A  U N             T        Y   21         
MENEXPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   35    7  A  P N             T        Y              
MENLIDH  DS    XL8                                                              
MENLID   DS    CL12     8   44   12  A  U N             T        Y   67         
MENLIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8   63    3  A  P N             T        Y              
MENLSECH DS    XL8                                                              
MENLSEC  DS    CL2      8   67    2  A  U N             T        Y   69         
MENLSECX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
MENAUTHH DS    XL8                                                              
MENAUTH  DS    CL16     9   10   16  A  U N             T        Y   37         
MENAUTHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9   35    8  A  P N             T        Y              
MENESTH  DS    XL8                                                              
MENEST   DS    CL16     9   44   16  A  U N             T        Y   39         
MENESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   63    6  A  P N             T        Y              
MENESPDH DS    XL8                                                              
MENESPD  DS    CL2      9   70    2  A  U N             T        Y   41         
MENESPDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    10    2   17  A  P N             T        Y              
MENCON1H DS    XL8                                                              
MENCON1  DS    CL12    10   20   12  A  U N             T        Y   44         
MENCON1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   34    1  A  P N             T        Y              
MENCON2H DS    XL8                                                              
MENCON2  DS    CL12    10   36   12  A  U N             T        Y   44         
MENCON2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   51    1  A  P N             T        Y              
MENCON3H DS    XL8                                                              
MENCON3  DS    CL12    10   53   12  A  U N             T        Y   44         
MENCON3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   66    1  A  P N             T        Y              
MENCON4H DS    XL8                                                              
MENCON4  DS    CL12    10   68   12  A  U N             T        Y   44         
MENCON4X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
MENCOM1H DS    XL8                                                              
MENCOM1  DS    CL70    11   10   70  A  U N             T        Y   75         
MENCOM1X DS    XL8                                                              
MENCOM2H DS    XL8                                                              
MENCOM2  DS    CL70    12   10   70  A  U N             T        Y   75         
MENCOM2X DS    XL8                                                              
MENCOM3H DS    XL8                                                              
MENCOM3  DS    CL70    13   10   70  A  U N             T        Y   75         
MENCOM3X DS    XL8                                                              
MENCOM4H DS    XL8                                                              
MENCOM4  DS    CL70    14   10   70  A  U N             T        Y   75         
MENCOM4X DS    XL8                                                              
MENCOM5H DS    XL8                                                              
MENCOM5  DS    CL70    15   10   70  A  U N             T        Y   75         
MENCOM5X DS    XL8                                                              
MENCOM6H DS    XL8                                                              
MENCOM6  DS    CL70    16   10   70  A  U N             T        Y   75         
MENCOM6X DS    XL8                                                              
MENCOM7H DS    XL8                                                              
MENCOM7  DS    CL70    17   10   70  A  U N             T        Y   75         
MENCOM7X DS    XL8                                                              
MENCOM8H DS    XL8                                                              
MENCOM8  DS    CL70    18   10   70  A  U N             T        Y   75         
MENCOM8X DS    XL8                                                              
MENFEEDH DS    XL8                                                              
MENFEED  DS    CL41    19    2   41  A  P N             T        Y              
MENCOMPH DS    XL8                                                              
MENCOMP  DS    CL36    19   44   36  A  P H             T        Y              
MENLIN1H DS    XL8                                                              
MENLIN1  DS    CL78    20    2   78  A  P N             T        Y              
MENLIN2H DS    XL8                                                              
MENLIN2  DS    CL78    21    2   78  A  P N             T        Y              
MENLIN3H DS    XL8                                                              
MENLIN3  DS    CL78    22    2   78  A  P N             T        Y              
MENLIN4H DS    XL8                                                              
MENLIN4  DS    CL78    23    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     24    2    9  A  P H             T        Y              
MENPFK1H DS    XL8                                                              
MENPFK1  DS    CL9     24   12    9  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10    24   22   10  A  P Z             T        Y              
MENPF16H DS    XL8                                                              
MENPF16  DS    CL9     24   33    9  A  P Z             T        Y              
MENPF21H DS    XL8                                                              
MENPF21  DS    CL9     24   43    9  A  P Z             T        Y              
MENPF22H DS    XL8                                                              
MENPF22  DS    CL7     24   53    7  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     24   61    9  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL9     24   71    9  A  P Z             T        Y              
MENLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
MENWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2208 BYTES                            
