*          DATA SET TASCRC1D   AT LEVEL 012 AS OF 05/06/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2C1D      DATE 05/06/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      4   63    5  A  P N             T        Y              
SSSDESTH DS    CL8                                                              
SSSDEST  DS    CL8      4   70    8  A  U N             T        Y    7         
SSSDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SSSAGYH  DS    CL8                                                              
SSSAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SSSAGYX  DS    CL8                                                              
SSSAGYNH DS    CL8                                                              
SSSAGYN  DS    CL36     5   20   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
SSSESTH  DS    CL8                                                              
SSSEST   DS    CL20     6   10   20  A  U N             T        Y  232         
SSSESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   32    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
SSSESTNH DS    CL8                                                              
SSSESTN  DS    CL36     6   44   36  A  U N             T        Y  233         
SSSESTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
SSSCLIH  DS    CL8                                                              
SSSCLI   DS    CL6      7   10    6  A  U N             T        Y   32         
SSSCLIX  DS    CL8                                                              
SSSCLINH DS    CL8                                                              
SSSCLIN  DS    CL16     7   20   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
SSSPRDH  DS    CL8                                                              
SSSPRD   DS    CL6      7   46    6  A  U N             T        Y   48         
SSSPRDX  DS    CL8                                                              
SSSPRDNH DS    CL8                                                              
SSSPRDN  DS    CL16     7   53   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
SSSOPTSH DS    CL8                                                              
SSSOPTS  DS    CL27     8   10   27  A  U N             T        Y   35         
SSSOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     8   38   13  A  P N             T        Y              
SSSLCHGH DS    CL8                                                              
SSSLCHG  DS    CL17     8   53   17  A  P N             T        Y              
SSSTAGH  DS    CL8                                                              
SSSTAG   DS    CL1      9    2    1  A  P N             T        Y              
SSSLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SSSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
