*          DATA SET TASCR03D   AT LEVEL 012 AS OF 06/12/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F203D      DATE 06/12/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SCLAGYTH DS    CL8                                                              
SCLAGYT  DS    CL6      4    2    6  A  P H             T        Y              
SCLAGYH  DS    CL8                                                              
SCLAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SCLAGYX  DS    CL8                                                              
SCLCIDTH DS    CL8                                                              
SCLCIDT  DS    CL7      4   20    7  A  P H             T        Y              
SCLCIDH  DS    CL8                                                              
SCLCID   DS    CL12     4   28   12  A  U N             T        Y   64         
SCLCIDX  DS    CL8                                                              
SCLCIDNH DS    CL8                                                              
SCLCIDN  DS    CL36     4   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
SCLTAGH  DS    CL8                                                              
SCLTAG   DS    CL72     6    2   72  A  P H             T        Y              
SCLL1H   DS    CL8                                                              
SCLL1    DS    CL3      7    2    3  A  U N             T        Y    1         
SCLL1X   DS    CL8                                                              
SCLSSNH  DS    CL8                                                              
SCLSSN   DS    CL9      7    6    9  A  U N             T        Y   96         
SCLSSNX  DS    CL8                                                              
SCLCATH  DS    CL8                                                              
SCLCAT   DS    CL3      7   16    3  A  U N             T        Y    3         
SCLCATX  DS    CL8                                                              
SCLONOFH DS    CL8                                                              
SCLONOF  DS    CL3      7   20    3  A  U N             T        Y    5         
SCLONOFX DS    CL8                                                              
SCLUNITH DS    CL8                                                              
SCLUNIT  DS    CL3      7   24    3  A  U N             T        Y    6         
SCLUNITX DS    CL8                                                              
SCLNCDEH DS    CL8                                                              
SCLNCDE  DS    CL4      7   28    4  A  U N             T        Y   80         
SCLNCDEX DS    CL8                                                              
SCLUNLOH DS    CL8                                                              
SCLUNLO  DS    CL7      7   33    7  A  U N             T        Y  176         
SCLUNLOX DS    CL8                                                              
SCLYEARH DS    CL8                                                              
SCLYEAR  DS    CL3      7   41    3  A  U N             T        Y   10         
SCLYEARX DS    CL8                                                              
SCLCORPH DS    CL8                                                              
SCLCORP  DS    CL1      7   46    1  A  U N             T        Y   95         
SCLCORPX DS    CL8                                                              
SCLWAGEH DS    CL8                                                              
SCLWAGE  DS    CL11     7   49   11  A  U N             T        Y   15         
SCLWAGEX DS    CL8                                                              
SCLWARDH DS    CL8                                                              
SCLWARD  DS    CL11     7   63   11  A  U N             T        Y  108         
SCLWARDX DS    CL8                                                              
SCLCHCTH DS    CL8                                                              
SCLCHCT  DS    CL4      8    6    4  A  P N             T        Y              
SCLCHCMH DS    CL8                                                              
SCLCHCM  DS    CL60     8   11   60  A  U N             T        Y   18         
SCLCHCMX DS    CL8                                                              
SCLNAMEH DS    CL8                                                              
SCLNAME  DS    CL68     9    6   68  A  P H             T        Y              
SCLL2H   DS    CL8                                                              
SCLL2    DS    CL3     10    2    3  A  U N             T        Y    1         
SCLL2X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     10    6    9  A  U N             T        Y   96         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10   16    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10   20    3  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10   24    3  A  U N             T        Y    6         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     10   28    4  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   33    7  A  U N             T        Y  176         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10   41    3  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10   46    1  A  U N             T        Y   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    10   49   11  A  U N             T        Y   15         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    10   63   11  A  U N             T        Y  108         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    11   11   60  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL68    12    6   68  A  P H             T        Y              
SCLL3H   DS    CL8                                                              
SCLL3    DS    CL3     13    2    3  A  U N             T        Y    1         
SCLL3X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     13    6    9  A  U N             T        Y   96         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     13   16    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     13   20    3  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     13   24    3  A  U N             T        Y    6         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13   28    4  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   33    7  A  U N             T        Y  176         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     13   41    3  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   46    1  A  U N             T        Y   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13   49   11  A  U N             T        Y   15         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13   63   11  A  U N             T        Y  108         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     14    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    14   11   60  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL68    15    6   68  A  P H             T        Y              
SCLL4H   DS    CL8                                                              
SCLL4    DS    CL3     16    2    3  A  U N             T        Y    1         
SCLL4X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     16    6    9  A  U N             T        Y   96         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16   16    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16   20    3  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16   24    3  A  U N             T        Y    6         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     16   28    4  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16   33    7  A  U N             T        Y  176         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16   41    3  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   46    1  A  U N             T        Y   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    16   49   11  A  U N             T        Y   15         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    16   63   11  A  U N             T        Y  108         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   11   60  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL68    18    6   68  A  P H             T        Y              
SCLL5H   DS    CL8                                                              
SCLL5    DS    CL3     19    2    3  A  U N             T        Y    1         
SCLL5X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19    6    9  A  U N             T        Y   96         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   16    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   20    3  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   24    3  A  U N             T        Y    6         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     19   28    4  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19   33    7  A  U N             T        Y  176         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   41    3  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   46    1  A  U N             T        Y   95         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19   49   11  A  U N             T        Y   15         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19   63   11  A  U N             T        Y  108         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     20    6    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    20   11   60  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL68    21    6   68  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     21   79    1  A  P N             T        Y              
SCLCOMMH DS    CL8                                                              
SCLCOMM  DS    CL60    23    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    24    2   48  A  P H             T        Y              
SCLLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2344 BYTES                            
