*          DATA SET TASCR26D   AT LEVEL 012 AS OF 05/19/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F226D      DATE 05/19/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SINAGYH  DS    CL8                                                              
SINAGY   DS    CL6      5   20    6  A  U N             T        Y   16         
SINAGYX  DS    CL8                                                              
SINAGYNH DS    CL8                                                              
SINAGYN  DS    CL36     5   28   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     6    2   15  A  P H             T        Y              
SINNUMIH DS    CL8                                                              
SINNUMI  DS    CL2      6   20    2  N  U N             T        Y   19         
SINNUMIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     8    2   17  A  P N             T        Y              
SININV1H DS    CL8                                                              
SININV1  DS    CL6      8   20    6  A  P N             T        Y              
SINDASHH DS    CL8                                                              
SINDASH  DS    CL1      8   27    1  A  P Z             T        Y              
SININV2H DS    CL8                                                              
SININV2  DS    CL6      8   29    6  A  P N             T        Y              
SINLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 200  BYTES                            
