*          DATA SET TASCR2ED   AT LEVEL 001 AS OF 04/21/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F22ED      DATE 04/21/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SCCSHEDH DS    XL8                                                              
SCCSHED  DS    CL13     5    2   13  A  P H             T        Y              
SCCSSNH  DS    XL8                                                              
SCCSSN   DS    CL9      5   20    9  N  U N             T        Y   96         
SCCSSNX  DS    XL8                                                              
SCCNAMEH DS    XL8                                                              
SCCNAME  DS    CL36     5   34   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     6    2   17  A  P H             T        Y              
SCCCCODH DS    XL8                                                              
SCCCCOD  DS    CL3      6   20    3  A  U N             T        Y    2         
SCCCCODX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15     6   34   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8    2   13  A  P H             T        Y              
SCCNCODH DS    XL8                                                              
SCCNCOD  DS    CL1      8   20    1  A  U N             T        Y    3         
SCCNCODX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     8   34   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
SCCLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
