*          DATA SET TASCR5ED   AT LEVEL 002 AS OF 12/26/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F25ED      DATE 12/26/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL3      5    2    3  A  P H             T        Y              
GCLSSNH  DS    XL8                                                              
GCLSSN   DS    CL9      5   10    9  A  U N             T        Y   96         
GCLSSNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   20    4  A  P N             T        Y              
GCLCODEH DS    XL8                                                              
GCLCODE  DS    CL6      5   28    6  A  U N             T        Y  109         
GCLCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   38    4  A  P N             T        Y              
GCLCYH   DS    XL8                                                              
GCLCY    DS    CL17     5   44   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
GCLAGYH  DS    XL8                                                              
GCLAGY   DS    CL6      6   10    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
GCLCLIH  DS    XL8                                                              
GCLCLI   DS    CL6      6   28    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
GCLOPTH  DS    XL8                                                              
GCLOPT   DS    CL30     6   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25     7    2   25  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL14     7   33   14  A  P H             T        Y              
GCLSELH  DS    XL8                                                              
GCLSEL   DS    CL3      8    2    3  A  U N             T        Y    1         
GCLSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74     8    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74     9    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P H             T        Y              
GCLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
GCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1920 BYTES                            
