*          DATA SET TASCR28D   AT LEVEL 004 AS OF 07/18/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T702E8D      DATE 07/18/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      4    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
SACLINEH DS    CL8                                                              
SACLINE  DS    CL4      5   10    4  A   U    N         T        Y   10         
SACLINEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
SACADDRH DS    CL8                                                              
SACADDR  DS    CL4      6   10    4  A   U    N         T        Y   12         
SACADDRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
SACMSGH  DS    CL8                                                              
SACMSG   DS    CL42     8    2   42  A   P    Z         T        Y              
SACOKTH  DS    CL8                                                              
SACOKT   DS    CL3     10    2    3  A   P    Z         T        Y              
SACOKH   DS    CL8                                                              
SACOK    DS    CL1     10   10    1  A   P    Z         T        Y   14         
SACOKX   DS    CL8                                                              
SACLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SACWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 176  BYTES                            
