*          DATA SET TASCR7ED   AT LEVEL 002 AS OF 11/27/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F27ED      DATE 11/27/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
CGLAGYH  DS    XL8                                                              
CGLAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
CGLAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
CGLCLIH  DS    XL8                                                              
CGLCLI   DS    CL6      5   28    6  A  U N             T        Y   32         
CGLCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
CGLPRDH  DS    XL8                                                              
CGLPRD   DS    CL6      5   46    6  A  U N             T        Y   48         
CGLPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   63    5  A  P N             T        Y              
CGLSTRH  DS    XL8                                                              
CGLSTR   DS    CL6      5   70    6  A  U N             T        Y   90         
CGLSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
CGLOPTSH DS    XL8                                                              
CGLOPTS  DS    CL50     6   10   50  A  U N             T        Y  102         
CGLOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   63    6  A  P N             T        Y              
CGLFMTH  DS    XL8                                                              
CGLFMT   DS    CL1      6   70    1  A  U N             T        Y   94         
CGLFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL41     8    2   41  A  P H             T        Y              
CGLSELH  DS    XL8                                                              
CGLSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
CGLSELX  DS    XL8                                                              
CGLCGRH  DS    XL8                                                              
CGLCGR   DS    CL74     9    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    24    2   24  A  P H             T        Y              
CGLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
CGLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1864 BYTES                            
