*          DATA SET TASCREAD   AT LEVEL 003 AS OF 04/21/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2EAD      DATE 04/21/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P H             T        Y              
PULCHKH  DS    XL8                                                              
PULCHK   DS    CL8      4   10    8  A  U N             T        Y  160         
PULCHKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      4   19    1  A  P N             T        Y              
PULSHEDH DS    XL8                                                              
PULSHED  DS    CL7      4   20    7  A  P N             T        Y              
PULSSNH  DS    XL8                                                              
PULSSN   DS    CL9      4   28    9  A  U N             T        Y   96         
PULSSNX  DS    XL8                                                              
PULSSNNH DS    XL8                                                              
PULSSNN  DS    CL16     4   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      4   63    3  A  P N             T        Y              
PULEMPH  DS    XL8                                                              
PULEMP   DS    CL3      4   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
PULCHKDH DS    XL8                                                              
PULCHKD  DS    CL8      5   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
PULNETH  DS    XL8                                                              
PULNET   DS    CL11     5   28   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   63    3  A  P N             T        Y              
PULCURH  DS    XL8                                                              
PULCUR   DS    CL1      5   70    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PULCRPH  DS    XL8                                                              
PULCRP   DS    CL9      6   10    9  A  U N             T        Y   97         
PULCRPX  DS    XL8                                                              
PULCRPNH DS    XL8                                                              
PULCRPN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   38    5  A  P N             T        Y              
PULNCDEH DS    XL8                                                              
PULNCDE  DS    CL4      6   48    4  A  U N             T        Y   80         
PULNCDEX DS    XL8                                                              
PULNCDNH DS    XL8                                                              
PULNCDN  DS    CL16     6   53   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
PULAGYH  DS    XL8                                                              
PULAGY   DS    CL6      7   10    6  A  U N             T        Y   16         
PULAGYX  DS    XL8                                                              
PULAGYNH DS    XL8                                                              
PULAGYN  DS    CL16     7   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
PULINVH  DS    XL8                                                              
PULINV   DS    CL6      7   48    6  A  U N             T        Y  144         
PULINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
PULAGYCH DS    XL8                                                              
PULAGYC  DS    CL25     8   10   25  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   38    5  A  P N             T        Y              
PULFAXNH DS    XL8                                                              
PULFAXN  DS    CL14     8   48   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
PULPLDTH DS    XL8                                                              
PULPLDT  DS    CL8      9   12    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   25   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   38    6  A  P N             T        Y              
PULURGTH DS    XL8                                                              
PULURGT  DS    CL1      9   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   50    9  A  P N             T        Y              
PULONVTH DS    XL8                                                              
PULONVT  DS    CL1      9   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    10    2   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   38    4  A  P N             T        Y              
PULVOIDH DS    XL8                                                              
PULVOID  DS    CL1     10   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   50    4  A  P N             T        Y              
PULHOLDH DS    XL8                                                              
PULHOLD  DS    CL1     10   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   63    4  A  P N             T        Y              
PULWIREH DS    XL8                                                              
PULWIRE  DS    CL1     10   68    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   38    5  A  P N             T        Y              
PULDRFTH DS    XL8                                                              
PULDRFT  DS    CL1     11   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   50    9  A  P N             T        Y              
PULOVNGH DS    XL8                                                              
PULOVNG  DS    CL1     11   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    12   38   18  A  P N             T        Y              
PULGRTH  DS    XL8                                                              
PULGRT   DS    CL1     12   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   63   12  A  P N             T        Y              
PULOTHRH DS    XL8                                                              
PULOTHR  DS    CL1     12   76    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13    2   15  A  P N             T        Y              
PULDAD1H DS    XL8                                                              
PULDAD1  DS    CL30    13   19   30  A  U N             T        Y              
PULDAD2H DS    XL8                                                              
PULDAD2  DS    CL30    13   50   30  A  U N             T        Y              
PULDKADH DS    XL8                                                              
PULDKAD  DS    CL8     14    2    8  A  P Z             T        Y              
PULDAD3H DS    XL8                                                              
PULDAD3  DS    CL30    14   19   30  A  U N             T        Y              
PULDAD4H DS    XL8                                                              
PULDAD4  DS    CL30    14   50   30  A  U N             T        Y              
PULDAD5H DS    XL8                                                              
PULDAD5  DS    CL30    15   19   30  A  U N             T        Y              
PULDAD6H DS    XL8                                                              
PULDAD6  DS    CL30    15   50   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16    2   20  A  P N             T        Y              
PULSPINH DS    XL8                                                              
PULSPIN  DS    CL56    16   23   56  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    17    2   19  A  P N             T        Y              
PULGRCDH DS    XL8                                                              
PULGRCD  DS    CL8     17   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   25    6  A  P N             T        Y              
PULTAGYH DS    XL8                                                              
PULTAGY  DS    CL1     18   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   38    6  A  P N             T        Y              
PULTTALH DS    XL8                                                              
PULTTAL  DS    CL1     18   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   50    5  A  P N             T        Y              
PULTAGTH DS    XL8                                                              
PULTAGT  DS    CL1     18   56    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   63   15  A  P N             T        Y              
PULTOTHH DS    XL8                                                              
PULTOTH  DS    CL1     18   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   25    4  A  P N             T        Y              
PULVUPSH DS    XL8                                                              
PULVUPS  DS    CL1     19   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   38    6  A  P N             T        Y              
PULVOVCH DS    XL8                                                              
PULVOVC  DS    CL1     19   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   50    5  A  P N             T        Y              
PULVPCHH DS    XL8                                                              
PULVPCH  DS    CL1     19   56    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19   63   15  A  P N             T        Y              
PULVLMSH DS    XL8                                                              
PULVLMS  DS    CL1     19   79    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20    2   20  A  P N             T        Y              
PULRQMBH DS    XL8                                                              
PULRQMB  DS    CL8     20   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   38    4  A  P N             T        Y              
PULRQMDH DS    XL8                                                              
PULRQMD  DS    CL8     20   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    21    2   16  A  P N             T        Y              
PULINFBH DS    XL8                                                              
PULINFB  DS    CL8     21   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   38    4  A  P N             T        Y              
PULINFDH DS    XL8                                                              
PULINFD  DS    CL8     21   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    22    2   18  A  P N             T        Y              
PULDTRCH DS    XL8                                                              
PULDTRC  DS    CL8     22   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL23    22   38   23  A  P N             T        Y              
PULDTCRH DS    XL8                                                              
PULDTCR  DS    CL8     22   62    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  P N             T        Y              
PULLCHPH DS    XL8                                                              
PULLCHP  DS    CL8     23   23    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     23   38    4  A  P N             T        Y              
PULLCHDH DS    XL8                                                              
PULLCHD  DS    CL8     23   43    8  A  P N             T        Y              
PULPF13H DS    XL8                                                              
PULPF13  DS    CL18    24    2   18  A  P H             T        Y              
PULPF14H DS    XL8                                                              
PULPF14  DS    CL14    24   22   14  A  P Z             T        Y              
PULPF15H DS    XL8                                                              
PULPF15  DS    CL17    24   38   17  A  P Z             T        Y              
PULPF16H DS    XL8                                                              
PULPF16  DS    CL8     24   58    8  A  P Z             T        Y              
PULLAST  DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
PULWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1832 BYTES                            
