*          DATA SET TASCRAED   AT LEVEL 006 AS OF 03/11/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2AED      DATE 03/11/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    H         T        Y              
SADREFH  DS    CL8                                                              
SADREF   DS    CL6      5   10    6  A   U    N         T        Y   90         
SADREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15     7    2   15  A   P    N         T        Y              
SADTYPEH DS    CL8                                                              
SADTYPE  DS    CL12     7   20   12  A   U    N         T        Y   11         
SADTYPEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9    2   10  A   P    N         T        Y              
SADOAGYH DS    CL8                                                              
SADOAGY  DS    CL6      9   20    6  A   U    N         T        Y   10         
SADOAGYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     9   30   11  A   P    N         T        Y              
SADOINVH DS    CL8                                                              
SADOINV  DS    CL6      9   45    6  A   U    N         T        Y   13         
SADOINVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    11    2   10  A   P    N         T        Y              
SADCDTEH DS    CL8                                                              
SADCDTE  DS    CL8     11   20    8  A   U    N         T        Y   13         
SADCDTEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11   30   14  A   P    N         T        Y              
SADCRUNH DS    CL8                                                              
SADCRUN  DS    CL8     11   45    8  A   U    N         T        Y   21         
SADCRUNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
SADERRTH DS    CL8                                                              
SADERRT  DS    CL3     13   11    3  N   U    N         T        Y   15         
SADERRTX DS    CL8                                                              
SADERRNH DS    CL8                                                              
SADERRN  DS    CL36    13   20   36  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A   P    N         T        Y              
SADASSTH DS    CL8                                                              
SADASST  DS    CL8     15   11    8  A   U    N         T        Y   21         
SADASSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     15   20    2  A   P    N         T        Y              
SADASDAH DS    CL8                                                              
SADASDA  DS    CL8     15   23    8  A   U    N         T        Y   22         
SADASDAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     15   32    2  A   P    N         T        Y              
SADASTIH DS    CL8                                                              
SADASTI  DS    CL8     15   35    8  A   U    N         T        Y   23         
SADASTIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    17    2   13  A   P    N         T        Y              
SADLCHGH DS    CL8                                                              
SADLCHG  DS    CL17    17   20   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    24    2   20  A   P    H         T        Y              
SADLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SADWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 528  BYTES                            
