*          DATA SET TASCR79D   AT LEVEL 002 AS OF 11/10/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F279D      DATE 11/10/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P H             T        Y              
ST4SSNH  DS    XL8                                                              
ST4SSN   DS    CL9      4   10    9  A  U N             T        Y   60         
ST4SSNX  DS    XL8                                                              
ST4SSNNH DS    XL8                                                              
ST4SSNN  DS    CL16     4   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      4   38    8  A  P H             T        Y              
ST4EMPH  DS    XL8                                                              
ST4EMP   DS    CL3      4   47    3  A  U N             T        Y   58         
ST4EMPX  DS    XL8                                                              
ST4EMPNH DS    XL8                                                              
ST4EMPN  DS    CL16     4   51   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
ST4YEARH DS    XL8                                                              
ST4YEAR  DS    CL4      5   10    4  N  U N             T        Y   59         
ST4YEARX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   38    8  A  P N             T        Y              
ST4PRVH  DS    XL8                                                              
ST4PRV   DS    CL2      5   47    2  A  U N             T        Y   61         
ST4PRVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL21     7    2   21  A  P N             T        Y              
ST4INCH  DS    XL8                                                              
ST4INC   DS    CL11     7   28   11  A  U N             T        Y   10         
ST4INCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20     8    2   20  A  P N             T        Y              
ST4CPPH  DS    XL8                                                              
ST4CPP   DS    CL11     8   28   11  A  U N             T        Y   11         
ST4CPPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20     9    2   20  A  P N             T        Y              
ST4QPPH  DS    XL8                                                              
ST4QPP   DS    CL11     9   28   11  A  U N             T        Y   12         
ST4QPPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
ST4EIPH  DS    XL8                                                              
ST4EIP   DS    CL11    10   28   11  A  U N             T        Y   13         
ST4EIPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL23    11    2   23  A  P N             T        Y              
ST4TAXH  DS    XL8                                                              
ST4TAX   DS    CL11    11   28   11  A  U N             T        Y   14         
ST4TAXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    12    2   21  A  P N             T        Y              
ST4EIEH  DS    XL8                                                              
ST4EIE   DS    CL11    12   28   11  A  U N             T        Y   15         
ST4EIEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    13    2   21  A  P N             T        Y              
ST4PENH  DS    XL8                                                              
ST4PEN   DS    CL11    13   28   11  A  U N             T        Y   16         
ST4PENX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    14    2   17  A  P N             T        Y              
ST4QPRH  DS    XL8                                                              
ST4QPR   DS    CL11    14   28   11  A  U N             T        Y   17         
ST4QPRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    15    2   21  A  P N             T        Y              
ST4QPEH  DS    XL8                                                              
ST4QPE   DS    CL11    15   28   11  A  U N             T        Y   18         
ST4QPEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL27    24    2   27  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   31   13  A  P N             T        Y              
ST4LCHGH DS    XL8                                                              
ST4LCHG  DS    CL17    24   45   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   64    8  A  P N             T        Y              
ST4LPRTH DS    XL8                                                              
ST4LPRT  DS    CL8     24   73    8  A  P N             T        Y              
ST4LAST  DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
ST4WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 808  BYTES                            
