*          DATA SET TASCR49D   AT LEVEL 001 AS OF 03/09/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F249D      DATE 03/09/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SCKLHEDH DS    XL8                                                              
SCKLHED  DS    CL7      4    2    7  A  P N             T        Y              
SCKSSNH  DS    XL8                                                              
SCKSSN   DS    CL9      4   10    9  N  U N             T        Y   96         
SCKSSNX  DS    XL8                                                              
SCKSSNNH DS    XL8                                                              
SCKSSNN  DS    CL16     4   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   38    6  A  P N             T        Y              
SCKAGYH  DS    XL8                                                              
SCKAGY   DS    CL6      4   45    6  A  U N             T        Y   16         
SCKAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   53    7  A  P N             T        Y              
SCKCIDH  DS    XL8                                                              
SCKCID   DS    CL12     4   61   12  A  U N             T        Y   64         
SCKCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
SCKINVH  DS    XL8                                                              
SCKINV   DS    CL6      5   10    6  A  U N             T        Y  144         
SCKINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
SCKCATH  DS    XL8                                                              
SCKCAT   DS    CL3      5   24    3  A  U N             T        Y   22         
SCKCATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   29    3  A  P N             T        Y              
SCKEMPH  DS    XL8                                                              
SCKEMP   DS    CL3      5   33    3  A  U N             T        Y   18         
SCKEMPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SCKPERH  DS    XL8                                                              
SCKPER   DS    CL17     5   45   17  A  U N             T        Y   26         
SCKPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   63    3  A  P N             T        Y              
SCKCLGH  DS    XL8                                                              
SCKCLG   DS    CL6      5   67    6  A  U N             T        Y   40         
SCKCLGX  DS    XL8                                                              
SCKCUHH  DS    XL8                                                              
SCKCUH   DS    CL5      5   74    5  A  P N             T        Y              
SCKCURH  DS    XL8                                                              
SCKCUR   DS    CL1      5   80    1  A  U N             T        Y    1         
SCKCURX  DS    XL8                                                              
SCKUSENH DS    XL8                                                              
SCKUSEN  DS    CL57     6    2   57  A  P H             T        Y              
SCKCIDNH DS    XL8                                                              
SCKCIDN  DS    CL20     6   61   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    5    1  A  P N             T        Y              
SCKHEADH DS    XL8                                                              
SCKHEAD  DS    CL79     8    2   79  A  P H             T        Y              
SCKSELH  DS    XL8                                                              
SCKSEL   DS    CL3      9    2    3  A  U N             T        Y   30         
SCKSELX  DS    XL8                                                              
SCKDETH  DS    XL8                                                              
SCKDET   DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
SCKSL1H  DS    XL8                                                              
SCKSL1   DS    CL3     21    2    3  A  U N             T        Y   30         
SCKSL1X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
SCKSL3H  DS    XL8                                                              
SCKSL3   DS    CL3     22    2    3  A  U N             T        Y   30         
SCKSL3X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
SCKSL2H  DS    XL8                                                              
SCKSL2   DS    CL3     23    2    3  A  U N             T        Y   30         
SCKSL2X  DS    XL8                                                              
SCKLSTH  DS    XL8                                                              
SCKLST   DS    CL51    23    6   51  A  P N             T        Y              
SCKTOT1H DS    XL8                                                              
SCKTOT1  DS    CL23    23   58   23  A  P H             T        Y              
SCKFOOTH DS    XL8                                                              
SCKFOOT  DS    CL37    24    2   37  A  P H             T        Y              
SCKTOT2H DS    XL8                                                              
SCKTOT2  DS    CL41    24   40   41  A  P H             T        Y              
SCKLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2176 BYTES                            
