*          DATA SET TASCR84D   AT LEVEL 003 AS OF 02/12/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T702ABD      DATE 02/12/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    N         T        Y              
SOFSTRH  DS    CL8                                                              
SOFSTR   DS    CL1      5   10    1  A   U    N         T        Y   12         
SOFSTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    N         T        Y              
SOFOPTSH DS    CL8                                                              
SOFOPTS  DS    CL50     5   28   50  A   U    N         T        Y  102         
SOFOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL25     7    2   25  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL9      7   67    9  A   P    H         T        Y              
SOFSELH  DS    CL8                                                              
SOFSEL   DS    CL3      8    2    3  A   U    N         T        Y    1         
SOFSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     8    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
SOFLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SOFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
