*          DATA SET TASCR22D   AT LEVEL 001 AS OF 03/22/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F222D      DATE 03/22/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SLNSHEDH DS    XL8                                                              
SLNSHED  DS    CL13     5    2   13  A  P H             T        Y              
SLNSSNH  DS    XL8                                                              
SLNSSN   DS    CL9      5   20    9  N  U N             T        Y   96         
SLNSSNX  DS    XL8                                                              
SLNSSNNH DS    XL8                                                              
SLNSSNN  DS    CL36     5   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     6    2   16  A  P H             T        Y              
SLNLINH  DS    XL8                                                              
SLNLIN   DS    CL6      6   20    6  A  U N             T        Y  116         
SLNLINX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
SLNEMPH  DS    XL8                                                              
SLNEMP   DS    CL3      7   20    3  A  U N             T        Y   88         
SLNEMPX  DS    XL8                                                              
SLNEMPNH DS    XL8                                                              
SLNEMPN  DS    CL36     7   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      8    2    9  A  P H             T        Y              
SLNTYPEH DS    XL8                                                              
SLNTYPE  DS    CL2      8   20    2  A  U N             T        Y  122         
SLNTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8   38    3  A  P H             T        Y              
SLNEFTH  DS    XL8                                                              
SLNEFT   DS    CL1      8   42    1  A  U N             T        Y  156         
SLNEFTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P H             T        Y              
SLNPAYEH DS    XL8                                                              
SLNPAYE  DS    CL9      9   20    9  N  U N             T        Y  126         
SLNPAYEX DS    XL8                                                              
SLNPAYNH DS    XL8                                                              
SLNPAYN  DS    CL16     9   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P H             T        Y              
SLNEXPH  DS    XL8                                                              
SLNEXP   DS    CL8     10   20    8  A  U N             T        Y  130         
SLNEXPX  DS    XL8                                                              
SLNCUHH  DS    XL8                                                              
SLNCUH   DS    CL11    11    2   11  A  P N             T        Y              
SLNCURH  DS    XL8                                                              
SLNCUR   DS    CL1     11   20    1  A  U N             T        Y  133         
SLNCURX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
SLNUNITH DS    XL8                                                              
SLNUNIT  DS    CL3     12   20    3  A  U N             T        Y  134         
SLNUNITX DS    XL8                                                              
SLNUNINH DS    XL8                                                              
SLNUNIN  DS    CL8     12   38    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P H             T        Y              
SLNDUEH  DS    XL8                                                              
SLNDUE   DS    CL10    13   20   10  A  U N             T        Y  138         
SLNDUEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  P N             T        Y              
SLNXMPTH DS    XL8                                                              
SLNXMPT  DS    CL10    14   20   10  A  U N             T        Y  142         
SLNXMPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
SLNAMTH  DS    XL8                                                              
SLNAMT   DS    CL10    15   20   10  A  U N             T        Y  146         
SLNAMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    16    2   17  A  P N             T        Y              
SLNPCTH  DS    XL8                                                              
SLNPCT   DS    CL6     16   20    6  A  U N             T        Y  150         
SLNPCTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    17    2   16  A  P N             T        Y              
SLNCOLH  DS    XL8                                                              
SLNCOL   DS    CL10    17   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    18    2   14  A  P N             T        Y              
SLNBALH  DS    XL8                                                              
SLNBAL   DS    CL10    18   20   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     19    2    9  A  P N             T        Y              
SLNCOMMH DS    XL8                                                              
SLNCOMM  DS    CL60    19   20   60  A  U N             T        Y  154         
SLNCOMMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    20   20   60  A  U N             T        Y  154         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    21   20   60  A  U N             T        Y  154         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
SLNCAACH DS    XL8                                                              
SLNCAAC  DS    CL15    22   20   15  A  U N             T        Y  155         
SLNCAACX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  P N             T        Y              
SLNLCHGH DS    XL8                                                              
SLNLCHG  DS    CL17    23   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    24    2   75  A  P H             T        Y              
SLNLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SLNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1184 BYTES                            
