*          DATA SET TASCRF8D   AT LEVEL 002 AS OF 10/12/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2F8D      DATE 10/12/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SC2AGYH  DS    XL8                                                              
SC2AGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SC2AGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
SC2CIDH  DS    XL8                                                              
SC2CID   DS    CL12     4   28   12  A  U N             T        Y   64         
SC2CIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   43    7  A  P N             T        Y              
SC2PIDH  DS    XL8                                                              
SC2PID   DS    CL19     4   51   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
SC2VRLH  DS    XL8                                                              
SC2VRL   DS    CL3      5   10    3  A  U N             T        Y   20         
SC2VRLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   15    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
SC2VRIH  DS    XL8                                                              
SC2VRI   DS    CL12     5   28   12  A  U N             T        Y   24         
SC2VRIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SC2CLIH  DS    XL8                                                              
SC2CLI   DS    CL6      6   10    6  A  U N             T        Y   32         
SC2CLIX  DS    XL8                                                              
SC2CLINH DS    XL8                                                              
SC2CLIN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     6   43   10  A  P N             T        Y              
SC2CGRPH DS    XL8                                                              
SC2CGRP  DS    CL6      6   58    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SC2PRDH  DS    XL8                                                              
SC2PRD   DS    CL6      7   10    6  A  U N             T        Y   48         
SC2PRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   20    4  A  P N             T        Y              
SC2PRDNH DS    XL8                                                              
SC2PRDN  DS    CL16     7   26   16  A  U N             T        Y   49         
SC2PRDNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7   43    5  A  P N             T        Y              
SC2PTYPH DS    XL8                                                              
SC2PTYP  DS    CL6      7   51    6  A  P N             T        Y   78         
SC2PTYPX DS    XL8                                                              
SC2PTYNH DS    XL8                                                              
SC2PTYN  DS    CL20     7   58   20  A  P N             T        Y              
SC2TITLH DS    XL8                                                              
SC2TITL  DS    CL5      8    2    5  A  P H             T        Y              
SC2TITNH DS    XL8                                                              
SC2TITN  DS    CL36     8   20   36  A  U N             T        Y    6         
SC2TITNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    9    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   22    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   28    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   33    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   40    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   45   11  A  P N             T        Y              
SC2TAGYH DS    XL8                                                              
SC2TAGY  DS    CL6     10    2    6  A  U N             T        Y              
SC2TCNTH DS    XL8                                                              
SC2TCNT  DS    CL12    10    9   12  A  U N             T        Y              
SC2TTRKH DS    XL8                                                              
SC2TTRK  DS    CL1     10   24    1  A  U N             T        Y              
SC2TLFTH DS    XL8                                                              
SC2TLFT  DS    CL1     10   29    1  A  U N             T        Y              
SC2TLENH DS    XL8                                                              
SC2TLEN  DS    CL3     10   33    3  A  U N             T        Y              
SC2TTYPH DS    XL8                                                              
SC2TTYP  DS    CL1     10   41    1  A  U N             T        Y              
SC2TTITH DS    XL8                                                              
SC2TTIT  DS    CL36    10   45   36  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11    9   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   33    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   41    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    11   45   36  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    9   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   33    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   41    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    12   45   36  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    9   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   33    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   41    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    13   45   36  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14    9   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   33    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   41    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    14   45   36  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15    9   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   33    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   41    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    15   45   36  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16    9   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   24    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   33    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   41    1  A  U N             T        Y              
SC2TTIXH DS    XL8                                                              
SC2TTIX  DS    CL36    16   45   36  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  A  P N             T        Y              
SC2MUS1H DS    XL8                                                              
SC2MUS1  DS    CL8     17   15    8  A  U N             T        Y   72         
SC2MUS1X DS    XL8                                                              
SC2MNM1H DS    XL8                                                              
SC2MNM1  DS    CL16    17   24   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   41   12  A  P N             T        Y              
SC2MUS2H DS    XL8                                                              
SC2MUS2  DS    CL8     17   54    8  A  U N             T        Y   72         
SC2MUS2X DS    XL8                                                              
SC2MNM2H DS    XL8                                                              
SC2MNM2  DS    CL16    17   63   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
SC2MUS3H DS    XL8                                                              
SC2MUS3  DS    CL8     18   15    8  A  U N             T        Y   72         
SC2MUS3X DS    XL8                                                              
SC2MNM3H DS    XL8                                                              
SC2MNM3  DS    CL16    18   24   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   41   12  A  P N             T        Y              
SC2MUS4H DS    XL8                                                              
SC2MUS4  DS    CL8     18   54    8  A  U N             T        Y   72         
SC2MUS4X DS    XL8                                                              
SC2MNM4H DS    XL8                                                              
SC2MNM4  DS    CL16    18   63   16  A  P N             T        Y              
SC2ALLOH DS    XL8                                                              
SC2ALLO  DS    CL14    19    2   14  A  P N             T        Y              
SC2AUSEH DS    XL8                                                              
SC2AUSE  DS    CL1     19   17    1  A  U N             T        Y   77         
SC2AUSEX DS    XL8                                                              
SC2REMAH DS    XL8                                                              
SC2REMA  DS    CL19    19   41   19  A  P N             T        Y              
SC2RUSEH DS    XL8                                                              
SC2RUSE  DS    CL1     19   61    1  A  U N             T        Y   78         
SC2RUSEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
SC2AFMH  DS    XL8                                                              
SC2AFM   DS    CL1     20   15    1  A  U N             T        Y   45         
SC2AFMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     20   24    8  A  P N             T        Y              
SC2DBDTH DS    XL8                                                              
SC2DBDT  DS    CL8     20   34    8  A  U N             T        Y   46         
SC2DBDTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20   51   12  A  P N             T        Y              
SC2STYPH DS    XL8                                                              
SC2STYP  DS    CL1     20   64    1  A  U N             T        Y   42         
SC2STYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
SC2FILTH DS    XL8                                                              
SC2FILT  DS    CL4     21   15    4  A  U N             T        Y   47         
SC2FILTX DS    XL8                                                              
SC2ANNOH DS    XL8                                                              
SC2ANNO  DS    CL27    22    2   27  A  P Z             T        Y              
SC2CLFTH DS    XL8                                                              
SC2CLFT  DS    CL22    22   51   22  A  P Z             T        Y              
SC2PF1H  DS    XL8                                                              
SC2PF1   DS    CL61    23    2   61  A  P H             T        Y              
SC2PFVH  DS    XL8                                                              
SC2PFV   DS    CL13    23   64   13  A  P N             T        Y              
SC2PF2H  DS    XL8                                                              
SC2PF2   DS    CL58    24    2   58  A  P H             T        Y              
SC2LAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SC2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2144 BYTES                            
