*          DATA SET TASCR8DD   AT LEVEL 001 AS OF 05/05/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F28DD      DATE 05/05/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SDVAGYH  DS    XL8                                                              
SDVAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SDVAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   17    6  A  P N             T        Y              
SDVCLIH  DS    XL8                                                              
SDVCLI   DS    CL6      5   24    6  A  U N             T        Y   52         
SDVCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   31    6  A  P N             T        Y              
SDVOFFH  DS    XL8                                                              
SDVOFF   DS    CL1      5   38    1  A  U N             T        Y   52         
SDVOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   40    4  A  P N             T        Y              
SDVVERH  DS    XL8                                                              
SDVVER   DS    CL1      5   45    1  A  U N             T        Y   57         
SDVVERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   47    5  A  P N             T        Y              
SDVSNTH  DS    XL8                                                              
SDVSNT   DS    CL1      5   53    1  A  U N             T        Y   53         
SDVSNTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      5   55    9  A  P N             T        Y              
SDVDTEH  DS    XL8                                                              
SDVDTE   DS    CL8      5   65    8  A  U N             T        Y   55         
SDVDTEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   74    3  A  P N             T        Y              
SDVCOMH  DS    XL8                                                              
SDVCOM   DS    CL1      5   78    1  A  U N             T        Y   56         
SDVCOMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
SDVCIDH  DS    XL8                                                              
SDVCID   DS    CL12     6   10   12  A  U N             T        Y   64         
SDVCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   26    4  A  P N             T        Y              
SDVTYPH  DS    XL8                                                              
SDVTYP   DS    CL4      6   31    4  A  U N             T        Y   51         
SDVTYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   40    4  A  P N             T        Y              
SDVRECH  DS    XL8                                                              
SDVREC   DS    CL1      6   45    1  A  U N             T        Y   59         
SDVRECX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   47    5  A  P N             T        Y              
SDVPAIDH DS    XL8                                                              
SDVPAID  DS    CL1      6   53    1  A  U N             T        Y   61         
SDVPAIDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6   55    9  A  P N             T        Y              
SDVPDTEH DS    XL8                                                              
SDVPDTE  DS    CL8      6   65    8  A  U N             T        Y   63         
SDVPDTEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6   74    3  A  P N             T        Y              
SDVDUEH  DS    XL8                                                              
SDVDUE   DS    CL1      6   78    1  A  U N             T        Y   56         
SDVDUEX  DS    XL8                                                              
SDVKEYXH DS    XL8                                                              
SDVKEYX  DS    CL1      6   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79     8    2   79  A  P H             T        Y              
SDVSELH  DS    XL8                                                              
SDVSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
SDVSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
SDVLSTH  DS    XL8                                                              
SDVLST   DS    CL75    23    6   75  A  P N             T        Y              
SDVLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SDVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2064 BYTES                            
