*          DATA SET TASCR4CD   AT LEVEL 022 AS OF 05/13/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F24CD      DATE 05/13/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SESAGYH  DS    CL8                                                              
SESAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SESAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
SESSTRH  DS    CL8                                                              
SESSTR   DS    CL20     5   28   20  A  U N             T        Y  224         
SESSTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SESCLIH  DS    CL8                                                              
SESCLI   DS    CL6      6   10    6  A  U N             T        Y   32         
SESCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
SESPRDH  DS    CL8                                                              
SESPRD   DS    CL6      6   28    6  A  U N             T        Y   49         
SESPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     6   38   11  A  P N             T        Y              
SESRDTEH DS    CL8                                                              
SESRDTE  DS    CL9      6   50    9  A  U N             T        Y   63         
SESRDTEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      6   63    8  A  P N             T        Y              
SESCDTEH DS    CL8                                                              
SESCDTE  DS    CL9      6   72    9  A  U N             T        Y   65         
SESCDTEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30     8    2   30  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17     8   64   17  A  P H             T        Y              
SESSELH  DS    CL8                                                              
SESSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
SESSELX  DS    CL8                                                              
SESDATAH DS    CL8                                                              
SESDATA  DS    CL75     9    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    24    2   20  A  P H             T        Y              
SESLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SESWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1880 BYTES                            
