*          DATA SET TASCR24D   AT LEVEL 006 AS OF 03/12/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F224D      DATE 03/12/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SPESHEDH DS    XL8                                                              
SPESHED  DS    CL13     5    2   13  A  P H             T        Y              
SPESSNH  DS    XL8                                                              
SPESSN   DS    CL9      5   20    9  N  U N             T        Y   96         
SPESSNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   31    1  A  P N             T        Y              
SPESSNNH DS    XL8                                                              
SPESSNN  DS    CL36     5   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
SPECNUMH DS    XL8                                                              
SPECNUM  DS    CL1      7   18    1  A  P N             T        Y              
SPEID1H  DS    XL8                                                              
SPEID1   DS    CL9      7   20    9  N  U N             T        Y   98         
SPEID1X  DS    XL8                                                              
SPEID1NH DS    XL8                                                              
SPEID1N  DS    CL32     7   36   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      8   18    1  A  P N             T        Y              
SPEID2H  DS    XL8                                                              
SPEID2   DS    CL9      8   20    9  N  U N             T        Y   98         
SPEID2X  DS    XL8                                                              
SPEID2NH DS    XL8                                                              
SPEID2N  DS    CL32     8   36   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   18    1  A  P N             T        Y              
SPEID3H  DS    XL8                                                              
SPEID3   DS    CL9      9   20    9  N  U N             T        Y   98         
SPEID3X  DS    XL8                                                              
SPEID3NH DS    XL8                                                              
SPEID3N  DS    CL32     9   36   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   18    1  A  P N             T        Y              
SPEID4H  DS    XL8                                                              
SPEID4   DS    CL9     10   20    9  N  U N             T        Y   98         
SPEID4X  DS    XL8                                                              
SPEID4NH DS    XL8                                                              
SPEID4N  DS    CL32    10   36   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   18    1  A  P N             T        Y              
SPEID5H  DS    XL8                                                              
SPEID5   DS    CL9     11   20    9  N  U N             T        Y   98         
SPEID5X  DS    XL8                                                              
SPEID5NH DS    XL8                                                              
SPEID5N  DS    CL32    11   36   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   18    1  A  P N             T        Y              
SPEID6H  DS    XL8                                                              
SPEID6   DS    CL9     12   20    9  N  U N             T        Y   98         
SPEID6X  DS    XL8                                                              
SPEID6NH DS    XL8                                                              
SPEID6N  DS    CL32    12   36   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
SPENAMEH DS    XL8                                                              
SPENAME  DS    CL36    14   14   36  A  U N             T        Y  102         
SPENAMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     15    2    9  A  P N             T        Y              
SPEADD1H DS    XL8                                                              
SPEADD1  DS    CL30    15   14   30  A  U N             T        Y   10         
SPEADD1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   46    1  A  P N             T        Y              
SPEADD2H DS    XL8                                                              
SPEADD2  DS    CL30    15   48   30  A  U N             T        Y   10         
SPEADD2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   10    1  A  P N             T        Y              
SPEADD3H DS    XL8                                                              
SPEADD3  DS    CL30    16   14   30  A  U N             T        Y   10         
SPEADD3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   46    1  A  P N             T        Y              
SPEADD4H DS    XL8                                                              
SPEADD4  DS    CL30    16   48   30  A  U N             T        Y   10         
SPEADD4X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17    7    4  A  P N             T        Y              
SPEADDCH DS    XL8                                                              
SPEADDC  DS    CL25    17   14   25  A  U N             T        Y   65         
SPEADDCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     17   42    5  A  P N             T        Y              
SPEADDSH DS    XL8                                                              
SPEADDS  DS    CL2     17   48    2  A  U N             T        Y   66         
SPEADDSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   51    3  A  P N             T        Y              
SPEADDZH DS    XL8                                                              
SPEADDZ  DS    CL10    17   55   10  A  U N             T        Y   67         
SPEADDZX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     17   67    7  A  P N             T        Y              
SPECTRYH DS    XL8                                                              
SPECTRY  DS    CL2     17   76    2  A  U N             T        Y   68         
SPECTRYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    18    2   15  A  P N             T        Y              
SPEESTH  DS    XL8                                                              
SPEEST   DS    CL8     18   20    8  A  U N             T        Y  109         
SPEESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    19    2   15  A  P N             T        Y              
SPEEXPH  DS    XL8                                                              
SPEEXP   DS    CL8     19   20    8  A  U N             T        Y  110         
SPEEXPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
SPELCHGH DS    XL8                                                              
SPELCHG  DS    CL17    22   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL63    24   15   63  A  P H             T        Y              
SPELAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SPEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1232 BYTES                            
