*          DATA SET TASCRE7BD  AT LEVEL 028 AS OF 04/20/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2E7D      DATE 04/20/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      3    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      3   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3   20    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      3   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      3   38    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
TIMAGYH  DS    CL8                                                              
TIMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
TIMAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
TIMCIDH  DS    CL8                                                              
TIMCID   DS    CL12     4   28   12  A  U N             T        Y   64         
TIMCIDX  DS    CL8                                                              
TIMCOMNH DS    CL8                                                              
TIMCOMN  DS    CL19     4   43   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      5    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      5   10    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      5   28    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   32    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   10    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8   29   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL35     9   10   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   10   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   23    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    10   29   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   46    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   10    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   16    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   18    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   23    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL34    13   10   34  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL34    14   10   34  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL34    15   10   34  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    16    2   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    17   10   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   30   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    18   10   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   30   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   10   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   31   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   48    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   56   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   10   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   48    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   56    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    24    2   79  A  P N             T        Y              
TIMLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
TIMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1128 BYTES                            
