*          DATA SET TASCR0BD   AT LEVEL 002 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F20BD      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9     11    2    9  A  P N             T        Y              
MSCTXTTH DS    XL8                                                              
MSCTXTT  DS    CL1     11   13    1  A  P H             T        Y              
MSCTXTH  DS    XL8                                                              
MSCTXT   DS    CL20    11   15   20  A  U N             T        Y   71         
MSCTXTX  DS    XL8                                                              
MSCAMTH  DS    XL8                                                              
MSCAMT   DS    CL9     11   37    9  A  U N             T        Y   73         
MSCAMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   47    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    11   49   20  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11   71    9  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   13    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    12   15   20  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     12   37    9  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   47    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    12   49   20  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     12   71    9  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   13    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    13   15   20  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     13   37    9  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   47    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL20    13   49   20  A  U N             T        Y   71         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     13   71    9  A  U N             T        Y   73         
         DS    XL8                                                              
MSCNARTH DS    XL8                                                              
MSCNART  DS    CL11    14    2   11  A  P N             T        Y              
MSCNARRH DS    XL8                                                              
MSCNARR  DS    CL60    14   15   60  A  U N             T        Y   75         
MSCNARRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    15   15   60  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    16   15   60  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    17   15   60  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    18   15   60  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    19   15   60  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    20   15   60  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    21   15   60  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    22   15   60  A  U N             T        Y   75         
         DS    XL8                                                              
MSCNARXH DS    XL8                                                              
MSCNARX  DS    CL60    23   15   60  A  U N             T        Y   75         
MSCNARXX DS    XL8                                                              
MSCMSG2H DS    XL8                                                              
MSCMSG2  DS    CL17    24   14   17  A  P Z             T        Y              
MSCMSG3H DS    XL8                                                              
MSCMSG3  DS    CL11    24   33   11  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL11    24   70   11  A  P H             T        Y              
MSCLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
MSCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1288 BYTES                            
