*          DATA SET TASCR7AD   AT LEVEL 001 AS OF 11/09/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F27AD      DATE 11/09/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ACMAGYH  DS    XL8                                                              
ACMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
ACMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
ACMCIDH  DS    XL8                                                              
ACMCID   DS    CL12     4   28   12  A  U N             T        Y   64         
ACMCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      4   42    6  A  P H             T        Y              
ACMADVH  DS    XL8                                                              
ACMADV   DS    CL6      4   49    6  A  U N             T        Y  208         
ACMADVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      4   56    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      4   58    3  A  P N             T        Y              
ACMVERH  DS    XL8                                                              
ACMVER   DS    CL3      4   62    3  A  P N             T        Y   22         
ACMVERX  DS    XL8                                                              
ACMVEDH  DS    XL8                                                              
ACMVED   DS    CL12     4   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
ACMCLINH DS    XL8                                                              
ACMCLIN  DS    CL36     5   10   36  A  P N             T        Y   32         
ACMCLINX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
ACMPRDNH DS    XL8                                                              
ACMPRDN  DS    CL36     6   10   36  A  P N             T        Y   48         
ACMPRDNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8    6    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      8   13    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      8   32    6  A  P H             T        Y              
ACMFRSTH DS    XL8                                                              
ACMFRST  DS    CL2     10    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10    6    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18    10   13   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    10   32   48  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12    6    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18    12   13   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    12   32   48  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14    6    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18    14   13   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    14   32   48  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16    6    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18    16   13   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL48    16   32   48  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18    6    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18    18   13   18  A  P N             T        Y              
ACMLSTH  DS    XL8                                                              
ACMLST   DS    CL48    18   32   48  A  P N             T        Y              
ACMCOMPH DS    XL8                                                              
ACMCOMP  DS    CL40    21    2   40  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12    24    2   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    24   22   11  A  P H             T        Y              
ACMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ACMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 976  BYTES                            
