*          DATA SET TASCR25D   AT LEVEL 004 AS OF 02/05/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F225D      DATE 02/05/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SIFAGYH  DS    XL8                                                              
SIFAGY   DS    CL6      4   20    6  A  U N             T        Y   16         
SIFAGYX  DS    XL8                                                              
SIFAGYNH DS    XL8                                                              
SIFAGYN  DS    CL36     4   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     5    2   11  A  P N             T        Y              
SIFCLIH  DS    XL8                                                              
SIFCLI   DS    CL3      5   20    3  A  U N             T        Y   33         
SIFCLIX  DS    XL8                                                              
SIFCLINH DS    XL8                                                              
SIFCLIN  DS    CL36     5   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     6    2   13  A  P H             T        Y              
SIFALPHH DS    XL8                                                              
SIFALPH  DS    CL6      6   20    6  A  U N             T        Y    2         
SIFALPHX DS    XL8                                                              
SIFALPNH DS    XL8                                                              
SIFALPN  DS    CL33     6   38   33  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P H             T        Y              
SIFVENDH DS    XL8                                                              
SIFVEND  DS    CL14     7   20   14  A  U N             T        Y    3         
SIFVENDX DS    XL8                                                              
SIFVENNH DS    XL8                                                              
SIFVENN  DS    CL36     7   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     8    2   15  A  P H             T        Y              
SIFT10VH DS    XL8                                                              
SIFT10V  DS    CL14     8   20   14  A  U N             T        Y   15         
SIFT10VX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P H             T        Y              
SIFWCODH DS    XL8                                                              
SIFWCOD  DS    CL60     9   20   60  A  U N             T        Y    6         
SIFWCODX DS    XL8                                                              
SIFWC2H  DS    XL8                                                              
SIFWC2   DS    CL60    10   20   60  A  U N             T        Y    6         
SIFWC2X  DS    XL8                                                              
SIFWC3H  DS    XL8                                                              
SIFWC3   DS    CL60    11   20   60  A  U N             T        Y    6         
SIFWC3X  DS    XL8                                                              
SIFWC4H  DS    XL8                                                              
SIFWC4   DS    CL60    12   20   60  A  U N             T        Y    6         
SIFWC4X  DS    XL8                                                              
SIFWC5H  DS    XL8                                                              
SIFWC5   DS    CL60    13   20   60  A  U N             T        Y    6         
SIFWC5X  DS    XL8                                                              
SIFWC6H  DS    XL8                                                              
SIFWC6   DS    CL60    14   20   60  A  U N             T        Y    6         
SIFWC6X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
SIFSTATH DS    XL8                                                              
SIFSTAT  DS    CL50    15   20   50  A  U N             T        Y   11         
SIFSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    16    2   14  A  P N             T        Y              
SIFDJOBH DS    XL8                                                              
SIFDJOB  DS    CL25    16   20   25  A  U N             T        Y   10         
SIFDJOBX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    18    5   42  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL17    18   55   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  P H             T        Y              
SIFOFF1H DS    XL8                                                              
SIFOFF1  DS    CL2     19    5    2  A  U N             T        Y   13         
SIFOFF1X DS    XL8                                                              
SIFJOB1H DS    XL8                                                              
SIFJOB1  DS    CL12    19   11   12  A  U N             T        Y   14         
SIFJOB1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   27    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     19   30    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    19   36   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   52    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     19   55    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    19   61   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     20    5    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20   11   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   27    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     20   30    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20   36   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   52    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     20   55    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20   61   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21    2    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     21    5    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    21   11   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   27    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     21   30    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    21   36   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   52    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     21   55    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    21   61   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22    2    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     22    5    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    22   11   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   27    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     22   30    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    22   36   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   52    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     22   55    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    22   61   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     23    2    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     23    5    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    23   11   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     23   27    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     23   30    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    23   36   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     23   52    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     23   55    2  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    23   61   12  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
SIFLCHGH DS    XL8                                                              
SIFLCHG  DS    CL17    24   20   17  A  P N             T        Y              
SIFLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SIFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1992 BYTES                            
