*          DATA SET TASCR3FD   AT LEVEL 001 AS OF 03/05/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F23FD      DATE 03/05/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SSSLCSSH DS    XL8                                                              
SSSLCSS  DS    CL13     5    2   13  A  P H             T        Y              
SSSSSNH  DS    XL8                                                              
SSSSSN   DS    CL9      5   20    9  N  U N             T        Y   96         
SSSSSNX  DS    XL8                                                              
SSSNAMEH DS    XL8                                                              
SSSNAME  DS    CL36     5   34   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
SSSLNSSH DS    XL8                                                              
SSSLNSS  DS    CL9      7    2    9  A  P H             T        Y              
SSSNSSNH DS    XL8                                                              
SSSNSSN  DS    CL9      7   20    9  A  U N             T        Y    3         
SSSNSSNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL50    21    2   50  A  P N             T        Y              
SSSLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SSSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 208  BYTES                            
