*          DATA SET TASCR85D   AT LEVEL 001 AS OF 03/23/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F285D      DATE 03/23/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
OPTAGYH  DS    XL8                                                              
OPTAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
OPTAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
OPTINVH  DS    XL8                                                              
OPTINV   DS    CL6      4   28    6  A  U N             T        Y  144         
OPTINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      4   35    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P N             T        Y              
OPTCIDH  DS    XL8                                                              
OPTCID   DS    CL12     4   46   12  A  U N             T        Y   64         
OPTCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
OPTLFTH  DS    XL8                                                              
OPTLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
OPTLFTX  DS    XL8                                                              
OPTLIDH  DS    XL8                                                              
OPTLID   DS    CL12     4   67   12  A  P N             T        Y              
OPTAGYNH DS    XL8                                                              
OPTAGYN  DS    CL16     5    2   16  A  P N             T        Y              
OPTCLINH DS    XL8                                                              
OPTCLIN  DS    CL16     5   20   16  A  P N             T        Y              
OPTCOMNH DS    XL8                                                              
OPTCOMN  DS    CL19     5   38   19  A  P N             T        Y              
OPTSECH  DS    XL8                                                              
OPTSEC   DS    CL4      5   58    4  A  P N             T        Y              
OPTCLPRH DS    XL8                                                              
OPTCLPR  DS    CL13     5   63   13  A  P N             T        Y              
OPTMEDNH DS    XL8                                                              
OPTMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
OPTDISPH DS    XL8                                                              
OPTDISP  DS    CL5      6   10    5  A  U N             T        Y   12         
OPTDISPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
OPTOPTH  DS    XL8                                                              
OPTOPT   DS    CL60     8   10   60  A  U N             T        Y   25         
OPTOPTX  DS    XL8                                                              
OPTPFKYH DS    XL8                                                              
OPTPFKY  DS    CL20    24    2   20  A  P H             T        Y              
OPTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
OPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 448  BYTES                            
