*          DATA SET TASCR99D   AT LEVEL 037 AS OF 02/07/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F299D      DATE 02/07/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SCKMSGH  DS    XL8                                                              
SCKMSG   DS    CL78     4    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SCKCHKH  DS    XL8                                                              
SCKCHK   DS    CL8      5   10    8  A  U N             T        Y  160         
SCKCHKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
SCKSHEDH DS    XL8                                                              
SCKSHED  DS    CL7      5   20    7  A  P N             T        Y              
SCKSSNH  DS    XL8                                                              
SCKSSN   DS    CL9      5   28    9  A  P N             T        Y   96         
SCKSSNX  DS    XL8                                                              
SCKSSNNH DS    XL8                                                              
SCKSSNN  DS    CL16     5   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34     7    2   34  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL23     7   38   23  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL34     8    2   34  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL23     8   38   23  A  P H             T        Y              
SCKWSHTH DS    XL8                                                              
SCKWSHT  DS    CL77     9    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    10    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    11    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    12    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    13    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    14    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    15    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    16    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    17    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    18    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    19    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    20    2   77  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL77    21    2   77  A  P N             T        Y              
SCKLSTH  DS    XL8                                                              
SCKLST   DS    CL77    22    2   77  A  P N             T        Y              
SCKPFTH  DS    XL8                                                              
SCKPFT   DS    CL18    24    2   18  A  P H             T        Y              
SCKDADDH DS    XL8                                                              
SCKDADD  DS    CL8     24   70    8  A  P N             T        Y              
SCKLAST  DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
SCKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1584 BYTES                            
