*          DATA SET TASCR2CD   AT LEVEL 025 AS OF 05/24/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F22CD      DATE 05/24/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ESTAGYH  DS    CL8                                                              
ESTAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
ESTAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      4   20    4  A  P H             T        Y              
ESTESTH  DS    CL8                                                              
ESTEST   DS    CL20     4   28   20  A  U N             T        Y  224         
ESTESTX  DS    CL8                                                              
ESTVERH  DS    CL8                                                              
ESTVER   DS    CL10     4   50   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      4   63    4  A  P N             T        Y              
ESTREVH  DS    CL8                                                              
ESTREV   DS    CL3      4   68    3  N  U H             T        Y   63         
ESTREVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      4   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     5    2   12  A  P N             T        Y              
ESTNAMEH DS    CL8                                                              
ESTNAME  DS    CL36     5   20   36  A  U N             T        Y   62         
ESTNAMEX DS    CL8                                                              
ESTLCHGH DS    CL8                                                              
ESTLCHG  DS    CL17     5   63   17  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL9      6    2    9  A  P N             T        Y              
ESTNARRH DS    CL8                                                              
ESTNARR  DS    CL60     6   20   60  A  U N             T        Y   70         
ESTNARRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15     7    2   15  A  P N             T        Y              
ESTFLTSH DS    CL8                                                              
ESTFLTS  DS    CL60     7   20   60  A  U N             T        Y   65         
ESTFLTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
ESTCLIH  DS    CL8                                                              
ESTCLI   DS    CL6      8   10    6  A  U N             T        Y   10         
ESTCLIX  DS    CL8                                                              
ESTCLINH DS    CL8                                                              
ESTCLIN  DS    CL16     8   20   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   42    7  A  P H             T        Y              
ESTPRDH  DS    CL8                                                              
ESTPRD   DS    CL6      8   50    6  A  U N             T        Y   12         
ESTPRDX  DS    CL8                                                              
ESTPRDNH DS    CL8                                                              
ESTPRDN  DS    CL16     8   58   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     9    2   15  A  P N             T        Y              
ESTOPTSH DS    CL8                                                              
ESTOPTS  DS    CL60     9   20   60  A  U N             T        Y   67         
ESTOPTSX DS    CL8                                                              
ESTMSGH  DS    CL8                                                              
ESTMSG   DS    CL16    10    2   16  A  P Z             T        Y              
ESTOPT2H DS    CL8                                                              
ESTOPT2  DS    CL60    10   20   60  A  U N             T        Y   67         
ESTOPT2X DS    CL8                                                              
ESTOVLYH DS    CL8                                                              
ESTOVLY  DS    CL1     11    2    1  A  P H             T        Y              
ESTLHEDH DS    CL8                                                              
ESTLHED  DS    CL38    11    4   38  A  P N             T        Y              
ESTRHEDH DS    CL8                                                              
ESTRHED  DS    CL37    11   43   37  A  P H             T        Y              
ESTDATAH DS    CL8                                                              
ESTDATA  DS    CL1     12    2    1  A  P H             T        Y   72         
ESTDATAX DS    CL8                                                              
ESTLHSH  DS    CL8                                                              
ESTLHS   DS    CL38    12    4   38  A  P N             T        Y              
ESTRHSH  DS    CL8                                                              
ESTRHS   DS    CL37    12   43   37  A  U H             T        Y   75         
ESTRHSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    13    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    13   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    14    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    14   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    15    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    15   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    16    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    16   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    17    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    17   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    18    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    18   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    19    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    19   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    20    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    20   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    21    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    21   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  P H             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    22    4   38  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL37    22   43   37  A  U H             T        Y   75         
         DS    CL8                                                              
ESTLSTDH DS    CL8                                                              
ESTLSTD  DS    CL1     23    2    1  A  P H             T        Y   72         
ESTLSTDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL38    23    4   38  A  P N             T        Y              
ESTLSTRH DS    CL8                                                              
ESTLSTR  DS    CL37    23   43   37  A  U H             T        Y   75         
ESTLSTRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    24    2   11  A  P Z             T        Y              
ESTMSG2H DS    CL8                                                              
ESTMSG2  DS    CL17    24   14   17  A  P Z             T        Y              
ESTMSG3H DS    CL8                                                              
ESTMSG3  DS    CL11    24   33   11  A  P Z             T        Y              
ESTMSG4H DS    CL8                                                              
ESTMSG4  DS    CL11    24   46   11  A  P Z             T        Y              
ESTMSG5H DS    CL8                                                              
ESTMSG5  DS    CL9     24   59    9  A  P Z             T        Y              
ESTMSG6H DS    CL8                                                              
ESTMSG6  DS    CL11    24   70   11  A  P H             T        Y              
ESTLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2368 BYTES                            
