*          DATA SET TASCRDCD   AT LEVEL 002 AS OF 08/30/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2DCD      DATE 08/30/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SCKCHKH  DS    XL8                                                              
SCKCHK   DS    CL8      5   10    8  A  U N             T        Y  160         
SCKCHKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
SCKSHEDH DS    XL8                                                              
SCKSHED  DS    CL7      7    2    7  A  P N             T        Y              
SCKSSNH  DS    XL8                                                              
SCKSSN   DS    CL9      7   10    9  A  P N             T        Y   96         
SCKSSNX  DS    XL8                                                              
SCKSSNNH DS    XL8                                                              
SCKSSNN  DS    CL16     7   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   38    6  A  P H             T        Y              
SCKCSHH  DS    XL8                                                              
SCKCSH   DS    CL8      7   45    8  A  P N             T        Y   25         
SCKCSHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   63    7  A  P N             T        Y              
SCKSTOPH DS    XL8                                                              
SCKSTOP  DS    CL1      7   71    1  A  P N             T        Y   26         
SCKSTOPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21     9    2   21  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     10    2    4  A  P N             T        Y              
SCKRDTEH DS    XL8                                                              
SCKRDTE  DS    CL8     10    7    8  A  U N             T        Y   13         
SCKRDTEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10   17    7  A  P N             T        Y              
SCKUIDH  DS    XL8                                                              
SCKUID   DS    CL6     10   25    6  A  U N             T        Y    9         
SCKUIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10   33   10  A  P N             T        Y              
SCKSTAFH DS    XL8                                                              
SCKSTAF  DS    CL8     10   45    8  A  U N             T        Y    8         
SCKSTAFX DS    XL8                                                              
SCKSTFNH DS    XL8                                                              
SCKSTFN  DS    CL16    10   54   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     13    2    4  A  P N             T        Y              
SCKDDTEH DS    XL8                                                              
SCKDDTE  DS    CL8     13    7    8  A  U N             T        Y   19         
SCKDDTEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13   17    7  A  P N             T        Y              
SCKFILEH DS    XL8                                                              
SCKFILE  DS    CL1     13   25    1  A  U N             T        Y   15         
SCKFILEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13   33    7  A  P N             T        Y              
SCKMAILH DS    XL8                                                              
SCKMAIL  DS    CL1     13   41    1  A  U N             T        Y   17         
SCKMAILX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
SCKCOMH  DS    XL8                                                              
SCKCOM   DS    CL60    15   10   60  A  U N             T        Y   21         
SCKCOMX  DS    XL8                                                              
SCKCOM2H DS    XL8                                                              
SCKCOM2  DS    CL60    16   10   60  A  U N             T        Y   23         
SCKCOM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    18    2   13  A  P N             T        Y              
SCKLCHGH DS    XL8                                                              
SCKLCHG  DS    CL17    18   16   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL31    24    2   31  A  P H             T        Y              
SCKLAST  DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
SCKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 728  BYTES                            
