*          DATA SET TASCR0AD   AT LEVEL 007 AS OF 01/27/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F20AD      DATE 01/27/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SCLAGYTH DS    XL8                                                              
SCLAGYT  DS    CL6      4    2    6  A  P H             T        Y              
SCLAGYH  DS    XL8                                                              
SCLAGY   DS    CL6      4   10    6  A  U N             T        Y              
SCLCIDTH DS    XL8                                                              
SCLCIDT  DS    CL7      4   20    7  A  P H             T        Y              
SCLCIDH  DS    XL8                                                              
SCLCID   DS    CL12     4   28   12  A  U N             T        Y   64         
SCLCIDX  DS    XL8                                                              
SCLCIDNH DS    XL8                                                              
SCLCIDN  DS    CL20     4   41   20  A  P N             T        Y              
SCLVERLH DS    XL8                                                              
SCLVERL  DS    CL3      4   63    3  A  P Z             T        Y              
SCLVERH  DS    XL8                                                              
SCLVER   DS    CL12     4   67   12  A  P Z             T        Y   47         
SCLVERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
SCLOPTH  DS    XL8                                                              
SCLOPT   DS    CL30     5   10   30  A  U N             T        Y  102         
SCLOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
SCLTAGH  DS    XL8                                                              
SCLTAG   DS    CL76     6    2   76  A  P H             T        Y              
SCLL1H   DS    XL8                                                              
SCLL1    DS    CL2      7    2    2  A  U N             T        Y    1         
SCLL1X   DS    XL8                                                              
SCLSSNH  DS    XL8                                                              
SCLSSN   DS    CL9      7    6    9  A  U N             T        Y   96         
SCLSSNX  DS    XL8                                                              
SCLCATH  DS    XL8                                                              
SCLCAT   DS    CL3      7   16    3  A  U N             T        Y    3         
SCLCATX  DS    XL8                                                              
SCLONOFH DS    XL8                                                              
SCLONOF  DS    CL3      7   20    3  A  U N             T        Y              
SCLUNITH DS    XL8                                                              
SCLUNIT  DS    CL3      7   24    3  A  U N             T        Y    6         
SCLUNITX DS    XL8                                                              
SCLNCDEH DS    XL8                                                              
SCLNCDE  DS    CL4      7   28    4  A  U N             T        Y   80         
SCLNCDEX DS    XL8                                                              
SCLUNLOH DS    XL8                                                              
SCLUNLO  DS    CL7      7   33    7  A  U N             T        Y  176         
SCLUNLOX DS    XL8                                                              
SCLYEARH DS    XL8                                                              
SCLYEAR  DS    CL3      7   41    3  A  U N             T        Y   10         
SCLYEARX DS    XL8                                                              
SCLLIFTH DS    XL8                                                              
SCLLIFT  DS    CL1      7   45    1  A  U N             T        Y   11         
SCLLIFTX DS    XL8                                                              
SCLCORPH DS    XL8                                                              
SCLCORP  DS    CL1      7   48    1  A  U N             T        Y   95         
SCLCORPX DS    XL8                                                              
SCLOPH   DS    XL8                                                              
SCLOP    DS    CL3      7   51    3  A  U N             T        Y   15         
SCLOPX   DS    XL8                                                              
SCLGUARH DS    XL8                                                              
SCLGUAR  DS    CL4      7   56    4  A  U N             T        Y  108         
SCLGUARX DS    XL8                                                              
SCLDBLH  DS    XL8                                                              
SCLDBL   DS    CL1      7   61    1  A  U N             T        Y   18         
SCLDBLX  DS    XL8                                                              
SCLFRSTH DS    XL8                                                              
SCLFRST  DS    CL8      7   65    8  A  U N             T        Y              
SCLTRKSH DS    XL8                                                              
SCLTRKS  DS    CL7      7   74    7  A  U N             T        Y              
SCLNAMEH DS    XL8                                                              
SCLNAME  DS    CL68     8    6   68  A  P H             T        Y              
SCLWIDH  DS    XL8                                                              
SCLWID   DS    CL2      8   75    2  A  P Z             T        Y              
SCLL2H   DS    XL8                                                              
SCLL2    DS    CL2      9    2    2  A  U N             T        Y    1         
SCLL2X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9   16    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   24    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      9   28    4  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9   33    7  A  U N             T        Y  176         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9   41    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   45    1  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   48    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9   51    3  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      9   56    4  A  U N             T        Y  108         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   61    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9   65    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   74    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    10    6   68  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     10   75    2  A  P Z             T        Y              
SCLL3H   DS    XL8                                                              
SCLL3    DS    CL2     11    2    2  A  U N             T        Y    1         
SCLL3X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11   16    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   24    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11   28    4  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11   33    7  A  U N             T        Y  176         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11   41    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   45    1  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   48    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11   51    3  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11   56    4  A  U N             T        Y  108         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   61    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11   65    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   74    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    12    6   68  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     12   75    2  A  P Z             T        Y              
SCLL4H   DS    XL8                                                              
SCLL4    DS    CL2     13    2    2  A  U N             T        Y    1         
SCLL4X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     13    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   16    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   24    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     13   28    4  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13   33    7  A  U N             T        Y  176         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   41    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   45    1  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   48    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   51    3  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     13   56    4  A  U N             T        Y  108         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   61    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13   65    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   74    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    14    6   68  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     14   75    2  A  P Z             T        Y              
SCLL5H   DS    XL8                                                              
SCLL5    DS    CL2     15    2    2  A  U N             T        Y    1         
SCLL5X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     15    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   16    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   24    3  A  U N             T        Y    6         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   28    4  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15   33    7  A  U N             T        Y  176         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   41    3  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   45    1  A  U N             T        Y   11         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   48    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   51    3  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     15   56    4  A  U N             T        Y  108         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   61    1  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15   65    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15   74    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    16    6   68  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     16   75    2  A  P Z             T        Y              
SCLL6H   DS    XL8                                                              
SCLL6    DS    CL2     17    2    2  A  U N             T        Y    1         
SCLL6X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     17    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   16    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   24    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   28    4  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     17   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   41    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   48    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   51    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   56    4  A  U N             T        Y  108         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   65    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17   74    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    18    6   68  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     18   75    2  A  P Z             T        Y              
SCLL7H   DS    XL8                                                              
SCLL7    DS    CL2     19    2    2  A  U N             T        Y    1         
SCLL7X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     19    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   16    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   24    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   28    4  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     19   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   41    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   48    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   51    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   56    4  A  U N             T        Y  108         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   65    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19   74    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    20    6   68  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     20   75    2  A  P Z             T        Y              
SCLL8H   DS    XL8                                                              
SCLL8    DS    CL2     21    2    2  A  U N             T        Y    1         
SCLL8X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     21    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   16    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   20    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   24    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   28    4  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21   33    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   41    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   48    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   51    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   56    4  A  U N             T        Y  108         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   65    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21   74    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    22    6   68  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     22   75    2  A  P Z             T        Y              
SCLCOMMH DS    XL8                                                              
SCLCOMM  DS    CL60    23    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    24    2   60  A  P H             T        Y              
SCLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 3128 BYTES                            
