*          DATA SET TASCRA9D   AT LEVEL 009 AS OF 01/21/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2A9D      DATE 01/21/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
SMUAGYH  DS    CL8                                                              
SMUAGY   DS    CL6      5   10    6  A   U    N         T        Y   16         
SMUAGYX  DS    CL8                                                              
SMUAGYNH DS    CL8                                                              
SMUAGYN  DS    CL16     5   20   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   38    5  A   P    N         T        Y              
SMUSTRH  DS    CL8                                                              
SMUSTR   DS    CL8      5   44    8  A   U    N         T        Y   12         
SMUSTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   54    7  A   P    N         T        Y              
SMUOPTSH DS    CL8                                                              
SMUOPTS  DS    CL16     5   63   16  A   U    N         T        Y  102         
SMUOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   80    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL29     7    2   29  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL33     7   47   33  A   P    H         T        Y              
SMUSELH  DS    CL8                                                              
SMUSEL   DS    CL3      8    2    3  A   U    N         T        Y    1         
SMUSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     8    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    23    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    24    2   16  A   P    H         T        Y              
SMULAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SMUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1880 BYTES                            
