*          DATA SET TASCRF9D   AT LEVEL 007 AS OF 09/25/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2F9D      DATE 09/25/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
LPTAGYH  DS    XL8                                                              
LPTAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
LPTAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
LPTSTRH  DS    XL8                                                              
LPTSTR   DS    CL6      5   28    6  A  U N             T        Y   90         
LPTSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
LPTFMTH  DS    XL8                                                              
LPTFMT   DS    CL1      5   48    1  A  U N             T        Y   94         
LPTFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
LPTOPTSH DS    XL8                                                              
LPTOPTS  DS    CL50     6   10   50  A  U N             T        Y  102         
LPTOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL65     8    2   65  A  P H             T        Y              
LPTSELH  DS    XL8                                                              
LPTSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
LPTSELX  DS    XL8                                                              
LPTPGTH  DS    XL8                                                              
LPTPGT   DS    CL74     9    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
LPTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
LPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1784 BYTES                            
