*          DATA SET TASCR21D   AT LEVEL 013 AS OF 02/10/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F221D      DATE 02/10/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     5    2   12  A  P H             T        Y              
SPWOLDH  DS    CL8                                                              
SPWOLD   DS    CL8      5   20    8  A  U Z             T        Y   14         
SPWOLDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     7    2   12  A  P H             T        Y              
SPWNEWH  DS    CL8                                                              
SPWNEW   DS    CL8      7   20    8  A  U Z             T        Y   18         
SPWNEWX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     8    2   12  A  P H             T        Y              
SPWNEW2H DS    CL8                                                              
SPWNEW2  DS    CL8      8   20    8  A  U Z             T        Y   19         
SPWNEW2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    10    2   13  A  P N             T        Y              
SPWLCHGH DS    CL8                                                              
SPWLCHG  DS    CL17    10   20   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  P Z             T        Y              
SPWTXT1H DS    CL8                                                              
SPWTXT1  DS    CL50    15   20   50  A  P Z             T        Y              
SPWTXT2H DS    CL8                                                              
SPWTXT2  DS    CL50    16   20   50  A  P Z             T        Y              
SPWLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SPWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
