*          DATA SET TASCRA0D   AT LEVEL 010 AS OF 09/12/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2A0D      DATE 09/12/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
INRAGYH  DS    CL8                                                              
INRAGY   DS    CL6      5   10    6  A   U    N         T        Y   16         
INRAGYX  DS    CL8                                                              
INRAGYNH DS    CL8                                                              
INRAGYN  DS    CL36     5   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   80    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL49     7    2   49  A   P    H         T        Y              
INRSELH  DS    CL8                                                              
INRSEL   DS    CL1      8    3    1  A   U    N         T        Y   66         
INRSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    5    1  N   P    N         T        Y              
INRFSTH  DS    CL8                                                              
INRFST   DS    CL46     8    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46     9    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    10    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    11    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    12    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    13    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    14    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    15    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    16    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    17    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    18    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    19    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    20    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    21    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22    5    1  N   P    N         T        Y              
         DS    CL8                                                              
         DS    CL46    22    6   46  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23    3    1  A   U    N         T        Y   66         
         DS    CL8                                                              
INRLSTH  DS    CL8                                                              
INRLST   DS    CL46    23    6   46  A   P    N         T        Y              
INRLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
INRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1424 BYTES                            
