*          DATA SET TASCR8BD   AT LEVEL 009 AS OF 01/16/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F28BD      DATE 01/16/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SFTSHEDH DS    XL8                                                              
SFTSHED  DS    CL7      5    2    7  A  P H             T        Y              
SFTSSNH  DS    XL8                                                              
SFTSSN   DS    CL9      5   10    9  A  U N             T        Y   96         
SFTSSNX  DS    XL8                                                              
SFTSSNNH DS    XL8                                                              
SFTSSNN  DS    CL16     5   23   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   42    6  A  P H             T        Y              
SFTAGYH  DS    XL8                                                              
SFTAGY   DS    CL6      5   50    6  A  U N             T        Y   16         
SFTAGYX  DS    XL8                                                              
SFTAGYNH DS    XL8                                                              
SFTAGYN  DS    CL16     5   57   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SFTCIDH  DS    XL8                                                              
SFTCID   DS    CL12     6   10   12  A  U N             T        Y   64         
SFTCIDX  DS    XL8                                                              
SFTCIDNH DS    XL8                                                              
SFTCIDN  DS    CL16     6   23   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   42    3  A  P H             T        Y              
SFTCATH  DS    XL8                                                              
SFTCAT   DS    CL3      6   46    3  A  U N             T        Y   71         
SFTCATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   50    6  A  P N             T        Y              
SFTPDH   DS    XL8                                                              
SFTPD    DS    CL17     6   57   17  A  U N             T        Y   75         
SFTPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
SFTAMTH  DS    XL8                                                              
SFTAMT   DS    CL12     7   10   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   23    7  A  P N             T        Y              
SFTBALH  DS    XL8                                                              
SFTBAL   DS    CL12     7   31   12  A  P N             T        Y              
SFTCU1HH DS    XL8                                                              
SFTCU1H  DS    CL15     7   50   15  A  P Z             T        Y              
SFTCUS1H DS    XL8                                                              
SFTCUS1  DS    CL3      7   71    3  A  P Z             T        Y   78         
SFTCUS1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   46    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   50    5  A  P N             T        Y              
SFTGUARH DS    XL8                                                              
SFTGUAR  DS    CL1      8   57    1  A  U N             T        Y   77         
SFTGUARX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
SFTCYCH  DS    XL8                                                              
SFTCYC   DS    CL17     9   20   17  A  U N             T        Y   15         
SFTCYCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
SFTAPPLH DS    XL8                                                              
SFTAPPL  DS    CL12    10   20   12  A  U N             T        Y   17         
SFTAPPLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11    2    8  A  P N             T        Y              
SFTCMNTH DS    XL8                                                              
SFTCMNT  DS    CL40    11   20   40  A  U N             T        Y   19         
SFTCMNTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL46    13   13   46  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
SFTNPDH  DS    XL8                                                              
SFTNPD   DS    CL17    15   13   17  A  U N             T        Y   23         
SFTNPDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
SFTUSEH  DS    XL8                                                              
SFTUSE   DS    CL3     16   13    3  A  U N             T        Y   25         
SFTUSEX  DS    XL8                                                              
SFTCU2HH DS    XL8                                                              
SFTCU2H  DS    CL19    16   50   19  A  P Z             T        Y              
SFTCUS2H DS    XL8                                                              
SFTCUS2  DS    CL3     16   71    3  A  P Z             T        Y   78         
SFTCUS2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL23    17    2   23  A  P N             T        Y              
SFTVERH  DS    XL8                                                              
SFTVER   DS    CL1     17   26    1  A  U N             T        Y   27         
SFTVERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    20    2   13  A  P N             T        Y              
SFTLCHGH DS    XL8                                                              
SFTLCHG  DS    CL17    20   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL53    24    2   53  A  P H             T        Y              
SFTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SFTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 944  BYTES                            
