*          DATA SET TASCR55D   AT LEVEL 001 AS OF 12/26/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F255D      DATE 12/26/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6     15    2    6  A  P H             T        Y              
SLOPDH   DS    XL8                                                              
SLOPD    DS    CL17    15   10   17  A  U N             T        Y   11         
SLOPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15   28    6  A  P H             T        Y              
SLOAMTH  DS    XL8                                                              
SLOAMT   DS    CL12    15   35   12  A  U N             T        Y   13         
SLOAMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15   54    7  A  P H             T        Y              
SLOBALH  DS    XL8                                                              
SLOBAL   DS    CL12    15   62   12  A  U N             T        Y   15         
SLOBALX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
SLOGCNTH DS    XL8                                                              
SLOGCNT  DS    CL6     16   18    6  A  U N             T        Y  109         
SLOGCNTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    17    2   13  A  P H             T        Y              
SLOOVERH DS    XL8                                                              
SLOOVER  DS    CL1     17   18    1  A  U N             T        Y   21         
SLOOVERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    17   28   15  A  P H             T        Y              
SLOESTH  DS    XL8                                                              
SLOEST   DS    CL1     17   44    1  A  U N             T        Y   25         
SLOESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     17   54    7  A  P H             T        Y              
SLOLCKH  DS    XL8                                                              
SLOLCK   DS    CL1     17   62    1  A  U N             T        Y   23         
SLOLCKX  DS    XL8                                                              
SLODBH   DS    XL8                                                              
SLODB    DS    CL15    18    2   15  A  P Z             T        Y              
SLODBALH DS    XL8                                                              
SLODBAL  DS    CL1     18   18    1  A  P Z             T        Y   17         
SLODBALX DS    XL8                                                              
SLOPHH   DS    XL8                                                              
SLOPH    DS    CL15    18   28   15  A  P H             T        Y              
SLOPNHH  DS    XL8                                                              
SLOPNH   DS    CL1     18   44    1  A  U N             T        Y   14         
SLOPNHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18   54    4  A  P H             T        Y              
SLOMSCH  DS    XL8                                                              
SLOMSC   DS    CL1     18   62    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    20    2   13  A  P N             T        Y              
SLOXUSEH DS    XL8                                                              
SLOXUSE  DS    CL52    20   18   52  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
SLOACTVH DS    XL8                                                              
SLOACTV  DS    CL17    22   18   17  A  P N             T        Y              
SLOADDH  DS    XL8                                                              
SLOADD   DS    CL18    22   42   18  A  P Z             T        Y              
SLOINVH  DS    XL8                                                              
SLOINV   DS    CL13    22   61   13  A  P Z             T        Y              
SLOPF1H  DS    XL8                                                              
SLOPF1   DS    CL14    24    2   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   18   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15    24   33   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12    24   50   12  A  P H             T        Y              
SLOPFLH  DS    XL8                                                              
SLOPFL   DS    CL14    24   64   14  A  P H             T        Y              
SLOLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SLOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 672  BYTES                            
