*          DATA SET TASCRD9D   AT LEVEL 008 AS OF 08/31/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2D9D      DATE 08/31/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SIFAGYH  DS    CL8                                                              
SIFAGY   DS    CL6      5   20    6  A  U N             T        Y   16         
SIFAGYX  DS    CL8                                                              
SIFAGYNH DS    CL8                                                              
SIFAGYN  DS    CL36     5   38   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
SIFCLIH  DS    CL8                                                              
SIFCLI   DS    CL3      6   20    3  A  U N             T        Y   33         
SIFCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL47     8    2   47  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      8   51    4  A  P H             T        Y              
SIFFRSTH DS    CL8                                                              
SIFFRST  DS    CL1      9    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28     9   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    10   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    11   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    12   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    13   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    14   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    15   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    16   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    17   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    18   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    19   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    20   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    21   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    22   26   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    6    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   14    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   19    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    23   26   28  A  P N             T        Y              
SIFPFKH  DS    CL8                                                              
SIFPFK   DS    CL12    24    2   12  A  P H             T        Y              
SIFLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SIFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1528 BYTES                            
