*          DATA SET TASCR41D   AT LEVEL 003 AS OF 05/04/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F241D      DATE 05/04/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SETSHEDH DS    XL8                                                              
SETSHED  DS    CL7      5    2    7  A  P H             T        Y              
SETSSNH  DS    XL8                                                              
SETSSN   DS    CL9      5   10    9  A  U N             T        Y   96         
SETSSNX  DS    XL8                                                              
SETSSNNH DS    XL8                                                              
SETSSNN  DS    CL16     5   23   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   42    6  A  P H             T        Y              
SETAGYH  DS    XL8                                                              
SETAGY   DS    CL6      5   50    6  A  U N             T        Y   16         
SETAGYX  DS    XL8                                                              
SETAGYNH DS    XL8                                                              
SETAGYN  DS    CL16     5   58   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SETCIDH  DS    XL8                                                              
SETCID   DS    CL12     6   10   12  A  U N             T        Y   64         
SETCIDX  DS    XL8                                                              
SETCIDNH DS    XL8                                                              
SETCIDN  DS    CL16     6   23   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   42    3  A  P N             T        Y              
SETCATH  DS    XL8                                                              
SETCAT   DS    CL3      6   46    3  A  U N             T        Y   71         
SETCATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   50    7  A  P H             T        Y              
SETEPIH  DS    XL8                                                              
SETEPI   DS    CL5      6   58    5  A  U N             T        Y  100         
SETEPIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
SETAMTH  DS    XL8                                                              
SETAMT   DS    CL12     7   10   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   23    7  A  P N             T        Y              
SETBALH  DS    XL8                                                              
SETBAL   DS    CL12     7   31   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  P H             T        Y              
SETFSTH  DS    XL8                                                              
SETFST   DS    CL79    10    2   79  A  P N             T        Y              
SETFST2H DS    XL8                                                              
SETFST2  DS    CL79    11    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
SETLSTH  DS    XL8                                                              
SETLST   DS    CL79    23    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL68    24    2   68  A  P H             T        Y              
SETLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SETWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
