*          DATA SET TASCR64D   AT LEVEL 001 AS OF 09/11/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F264D      DATE 09/11/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
EVTAGYH  DS    XL8                                                              
EVTAGY   DS    CL6      4   20    6  A  U N             T        Y   16         
EVTAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P H             T        Y              
EVTEVTH  DS    XL8                                                              
EVTEVT   DS    CL12     5   20   12  A  U N             T        Y   64         
EVTEVTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
EVTCLIH  DS    XL8                                                              
EVTCLI   DS    CL6      6   20    6  A  U N             T        Y   32         
EVTCLIX  DS    XL8                                                              
EVTCLINH DS    XL8                                                              
EVTCLIN  DS    CL16     6   28   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
EVTPRDH  DS    XL8                                                              
EVTPRD   DS    CL6      7   20    6  A  U N             T        Y   48         
EVTPRDX  DS    XL8                                                              
EVTPRDNH DS    XL8                                                              
EVTPRDN  DS    CL16     7   28   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P H             T        Y              
EVTTITNH DS    XL8                                                              
EVTTITN  DS    CL36     8   20   36  A  U N             T        Y    6         
EVTTITNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
EVTPOH   DS    XL8                                                              
EVTPO    DS    CL16     9   20   16  A  U N             T        Y   11         
EVTPOX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     10    2    4  A  P N             T        Y              
EVTJOBH  DS    XL8                                                              
EVTJOB   DS    CL16    10   20   16  A  U N             T        Y   13         
EVTJOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
EVTSTATH DS    XL8                                                              
EVTSTAT  DS    CL45    11   20   45  A  U N             T        Y   38         
EVTSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
EVTCOMMH DS    XL8                                                              
EVTCOMM  DS    CL60    12   20   60  A  U N             T        Y   99         
EVTCOMMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    14    2   15  A  P H             T        Y              
EVTAPERH DS    XL8                                                              
EVTAPER  DS    CL17    14   20   17  A  U N             T        Y   20         
EVTAPERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    14   40   12  A  P H             T        Y              
EVTAINVH DS    XL8                                                              
EVTAINV  DS    CL6     14   55    6  A  U N             T        Y  144         
EVTAINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    15   10   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     15   40    7  A  P H             T        Y              
EVTSELH  DS    XL8                                                              
EVTSEL   DS    CL3     16    2    3  A  U N             T        Y  145         
EVTSELX  DS    XL8                                                              
EVTPERH  DS    XL8                                                              
EVTPER   DS    CL17    16   10   17  A  P N             T        Y              
EVTINVH  DS    XL8                                                              
EVTINV   DS    CL6     16   40    6  A  P N             T        Y              
EVTCRDH  DS    XL8                                                              
EVTCRD   DS    CL2     16   47    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y  145         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    17   10   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   47    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y  145         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    18   10   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   47    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y  145         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    19   10   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   47    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y  145         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    20   10   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   47    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y  145         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    21   10   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   47    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y  145         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    22   10   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   47    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y  145         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    23   10   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   40    6  A  P N             T        Y              
EVTLCRDH DS    XL8                                                              
EVTLCRD  DS    CL2     23   47    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
EVTLCHGH DS    XL8                                                              
EVTLCHG  DS    CL17    24   20   17  A  P N             T        Y              
EVTINTNH DS    XL8                                                              
EVTINTN  DS    CL10    24   68   10  A  P H             T        Y              
EVTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
EVTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1296 BYTES                            
