*          DATA SET TASCRA8D   AT LEVEL 009 AS OF 08/20/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2A8D      DATE 08/20/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
SMUAGYH  DS    CL8                                                              
SMUAGY   DS    CL6      5   10    6  A   U    N         T        Y   16         
SMUAGYX  DS    CL8                                                              
SMUAGYNH DS    CL8                                                              
SMUAGYN  DS    CL36     5   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    H         T        Y              
SMUMUSH  DS    CL8                                                              
SMUMUS   DS    CL8      6   10    8  A   U    N         T        Y   72         
SMUMUSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  A   P    H         T        Y              
SMUNAMEH DS    CL8                                                              
SMUNAME  DS    CL36     8   20   36  A   U    N         T        Y   73         
SMUNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36     9   20   36  A   U    N         T        Y   73         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    10    2   11  A   P    H         T        Y              
SMUPUB1H DS    CL8                                                              
SMUPUB1  DS    CL36    10   20   36  A   U    N         T        Y   79         
SMUPUB1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10   58    8  A   P    H         T        Y              
SMULC1H  DS    CL8                                                              
SMULC1   DS    CL1     10   67    1  A   U    N         T        Y   81         
SMULC1X  DS    CL8                                                              
SMULC1NH DS    CL8                                                              
SMULC1N  DS    CL9     10   69    9  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11    2   11  A   P    N         T        Y              
SMUPUB2H DS    CL8                                                              
SMUPUB2  DS    CL36    11   20   36  A   U    N         T        Y   83         
SMUPUB2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     11   58    8  A   P    N         T        Y              
SMULC2H  DS    CL8                                                              
SMULC2   DS    CL1     11   67    1  A   U    N         T        Y   85         
SMULC2X  DS    CL8                                                              
SMULC2NH DS    CL8                                                              
SMULC2N  DS    CL9     11   69    9  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   P    H         T        Y              
SMUCOMPH DS    CL8                                                              
SMUCOMP  DS    CL36    12   20   36  A   U    N         T        Y   87         
SMUCOMPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   58    8  A   P    N         T        Y              
SMULC3H  DS    CL8                                                              
SMULC3   DS    CL1     12   67    1  A   U    N         T        Y   85         
SMULC3X  DS    CL8                                                              
SMULC3NH DS    CL8                                                              
SMULC3N  DS    CL9     12   69    9  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    13   20   36  A   U    N         T        Y   87         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    14   20   36  A   U    N         T        Y   87         
         DS    CL8                                                              
SMUCOMLH DS    CL8                                                              
SMUCOML  DS    CL36    15   20   36  A   U    N         T        Y   87         
SMUCOMLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    2    6  A   P    N         T        Y              
SMUAUTHH DS    CL8                                                              
SMUAUTH  DS    CL36    16   20   36  A   U    N         T        Y   89         
SMUAUTHX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   58    8  A   P    N         T        Y              
SMULC4H  DS    CL8                                                              
SMULC4   DS    CL1     16   67    1  A   U    N         T        Y   85         
SMULC4X  DS    CL8                                                              
SMULC4NH DS    CL8                                                              
SMULC4N  DS    CL9     16   69    9  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    17   20   36  A   U    N         T        Y   89         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    18   20   36  A   U    N         T        Y   89         
         DS    CL8                                                              
SMUAUTLH DS    CL8                                                              
SMUAUTL  DS    CL36    19   20   36  A   U    N         T        Y   89         
SMUAUTLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20    2    6  A   P    H         T        Y              
SMUCLIH  DS    CL8                                                              
SMUCLI   DS    CL36    20   20   36  A   U    N         T        Y   93         
SMUCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21    2    7  A   P    N         T        Y              
SMUPRDH  DS    CL8                                                              
SMUPRD   DS    CL36    21   20   36  A   U    N         T        Y   95         
SMUPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL27    24    2   27  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL13    24   49   13  A   P    N         T        Y              
SMULCHGH DS    CL8                                                              
SMULCHG  DS    CL17    24   63   17  A   P    N         T        Y              
SMULAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SMUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1264 BYTES                            
