*          DATA SET TASCR46D   AT LEVEL 013 AS OF 04/14/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F246D      DATE 04/14/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
SINAGYH  DS    XL8                                                              
SINAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SINAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   17    5  A  P N             T        Y              
SININVH  DS    XL8                                                              
SININV   DS    CL6      5   23    6  A  U N             T        Y   26         
SININVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   30    5  A  P N             T        Y              
SINPDONH DS    XL8                                                              
SINPDON  DS    CL1      5   41    1  A  U N             T        Y   30         
SINPDONX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      5   43    9  A  P N             T        Y              
SINAPPH  DS    XL8                                                              
SINAPP   DS    CL1      5   53    1  A  U N             T        Y   34         
SINAPPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   55   10  A  P N             T        Y              
SINDUEH  DS    XL8                                                              
SINDUE   DS    CL1      5   66    1  A  U N             T        Y   58         
SINDUEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      5   68    9  A  P N             T        Y              
SINTIMEH DS    XL8                                                              
SINTIME  DS    CL1      5   78    1  A  U N             T        Y   59         
SINTIMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SINBILDH DS    XL8                                                              
SINBILD  DS    CL1      6   10    1  A  U N             T        Y   42         
SINBILDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   17    5  A  P N             T        Y              
SINHLDH  DS    XL8                                                              
SINHLD   DS    CL1      6   23    1  A  U N             T        Y   46         
SINHLDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   30   10  A  P N             T        Y              
SINCANCH DS    XL8                                                              
SINCANC  DS    CL1      6   41    1  A  U N             T        Y   50         
SINCANCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   43    6  A  P N             T        Y              
SINERRH  DS    XL8                                                              
SINERR   DS    CL1      6   53    1  A  U N             T        Y   54         
SINERRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   55    7  A  P N             T        Y              
SINURGH  DS    XL8                                                              
SINURG   DS    CL1      6   66    1  A  U N             T        Y   55         
SINURGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6   68    9  A  P N             T        Y              
SINOFFH  DS    XL8                                                              
SINOFF   DS    CL1      6   78    1  A  U N             T        Y   60         
SINOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL35     8    2   35  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL27     8   42   27  A  P H             T        Y              
SINSELH  DS    XL8                                                              
SINSEL   DS    CL3      9    2    3  A  U N             T        Y   66         
SINSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL29    24    2   29  A  P H             T        Y              
SINLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2056 BYTES                            
