*          DATA SET TASCR48D   AT LEVEL 001 AS OF 03/22/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F248D      DATE 03/22/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SCOLSSNH DS    XL8                                                              
SCOLSSN  DS    CL7      5    2    7  A  P H             T        Y              
SCOSSNH  DS    XL8                                                              
SCOSSN   DS    CL9      5   10    9  A  U N             T        Y   96         
SCOSSNX  DS    XL8                                                              
SCONAMEH DS    XL8                                                              
SCONAME  DS    CL16     5   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SCOAGYH  DS    XL8                                                              
SCOAGY   DS    CL6      5   48    6  A  U N             T        Y   16         
SCOAGYX  DS    XL8                                                              
SCOAGYNH DS    XL8                                                              
SCOAGYN  DS    CL16     5   55   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SCOOPTSH DS    XL8                                                              
SCOOPTS  DS    CL38     6   10   38  A  U N             T        Y  102         
SCOOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL31     8    2   31  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL30     8   48   30  A  P H             T        Y              
SCOSELH  DS    XL8                                                              
SCOSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
SCOSELX  DS    XL8                                                              
SCOCOMH  DS    XL8                                                              
SCOCOM   DS    CL74     9    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
SCOLSELH DS    XL8                                                              
SCOLSEL  DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
SCOLSTH  DS    XL8                                                              
SCOLST   DS    CL74    22    6   74  A  P N             T        Y              
SCOPFH   DS    XL8                                                              
SCOPF    DS    CL34    24    2   34  A  P H             T        Y              
SCOLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1600 BYTES                            
