*          DATA SET TASCREDD   AT LEVEL 002 AS OF 01/26/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2EDD      DATE 01/26/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
COMAGYH  DS    XL8                                                              
COMAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
COMAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   20    4  A  P H             T        Y              
COMTYPEH DS    XL8                                                              
COMTYPE  DS    CL1      5   28    1  A  U N             T        Y   67         
COMTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   38    2  A  P H             T        Y              
COMIDH   DS    XL8                                                              
COMID    DS    CL12     5   42   12  A  U N             T        Y   28         
COMIDX   DS    XL8                                                              
COMCODH  DS    XL8                                                              
COMCOD   DS    CL4      5   63    4  A  P H             T        Y              
COMCODEH DS    XL8                                                              
COMCODE  DS    CL6      5   68    6  A  U N             T        Y   30         
COMCODEX DS    XL8                                                              
COMSTH   DS    XL8                                                              
COMST    DS    CL5      6    2    5  A  P H             T        Y              
COMSTAH  DS    XL8                                                              
COMSTA   DS    CL8      6   10    8  A  U N             T        Y   57         
COMSTAX  DS    XL8                                                              
COMENH   DS    XL8                                                              
COMEN    DS    CL3      6   20    3  A  P H             T        Y              
COMENDH  DS    XL8                                                              
COMEND   DS    CL8      6   28    8  A  U N             T        Y   58         
COMENDX  DS    XL8                                                              
COMLIN1H DS    XL8                                                              
COMLIN1  DS    CL78     7    2   78  A  U N             T        Y   40         
COMLIN1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  P N             T        Y              
COMLCHGH DS    XL8                                                              
COMLCHG  DS    CL17    23   20   17  A  P N             T        Y              
COMPF13H DS    XL8                                                              
COMPF13  DS    CL19    24    2   19  A  P H             T        Y              
COMPFFLH DS    XL8                                                              
COMPFFL  DS    CL24    24   38   24  A  P H             T        Y              
COMLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
