*          DATA SET TASCRADD   AT LEVEL 002 AS OF 05/14/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2ADD      DATE 05/14/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SGTSHEDH DS    XL8                                                              
SGTSHED  DS    CL7      5    2    7  A  P H             T        Y              
SGTSSNH  DS    XL8                                                              
SGTSSN   DS    CL9      5   10    9  A  U N             T        Y   96         
SGTSSNX  DS    XL8                                                              
SGTSSNNH DS    XL8                                                              
SGTSSNN  DS    CL16     5   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
SGTCODEH DS    XL8                                                              
SGTCODE  DS    CL4      6   10    4  A  U N             T        Y  108         
SGTCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
SGTPDH   DS    XL8                                                              
SGTPD    DS    CL17     7   10   17  A  U N             T        Y  117         
SGTPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     9    2   16  A  P H             T        Y              
SGTBALH  DS    XL8                                                              
SGTBAL   DS    CL12     9   20   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    10    2   16  A  P H             T        Y              
SGTINVH  DS    XL8                                                              
SGTINV   DS    CL6     10   20    6  A  U N             T        Y              
SGTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SGTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 240  BYTES                            
