*          DATA SET TASCRF4D   AT LEVEL 002 AS OF 05/09/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2F4D      DATE 05/09/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    4    5  A  P H             T        Y              
CANCCSTH DS    XL8                                                              
CANCCST  DS    CL17     6   17   17  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL9      6   38    9  A  P H             T        Y              
CANWKSH  DS    XL8                                                              
CANWKS   DS    CL2      6   48    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14     6   55   14  A  P H             T        Y              
CANAUTNH DS    XL8                                                              
CANAUTN  DS    CL1      7    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     7    4   20  A  P N             T        Y              
CANACUNH DS    XL8                                                              
CANACUN  DS    CL4      7   32    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   37    5  A  P N             T        Y              
CANACUPH DS    XL8                                                              
CANACUP  DS    CL1      7   47    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   49    7  A  P N             T        Y              
CANWSPTH DS    XL8                                                              
CANWSPT  DS    CL1      8    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    4    8  A  P N             T        Y              
CANWSUNH DS    XL8                                                              
CANWSUN  DS    CL4      8   32    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   37    5  A  P N             T        Y              
CANWSUPH DS    XL8                                                              
CANWSUP  DS    CL1      8   47    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8   49    7  A  P N             T        Y              
CANWCOMH DS    XL8                                                              
CANWCOM  DS    CL1      9    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17     9    4   17  A  P N             T        Y              
CANWCUNH DS    XL8                                                              
CANWCUN  DS    CL4      9   32    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   37    5  A  P N             T        Y              
CANWCUPH DS    XL8                                                              
CANWCUP  DS    CL1      9   47    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9   49    7  A  P N             T        Y              
CANPRIMH DS    XL8                                                              
CANPRIM  DS    CL1     10    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    10    4   20  A  P N             T        Y              
CANACRRH DS    XL8                                                              
CANACRR  DS    CL1     11    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11    4   17  A  P N             T        Y              
CANACDFH DS    XL8                                                              
CANACDF  DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    12    4   18  A  P N             T        Y              
CANUDLMH DS    XL8                                                              
CANUDLM  DS    CL1     13    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    13    4   18  A  P N             T        Y              
CANUDPUH DS    XL8                                                              
CANUDPU  DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    4   11  A  P N             T        Y              
CANUDPFH DS    XL8                                                              
CANUDPF  DS    CL1     15    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15    4   20  A  P N             T        Y              
CANPENAH DS    XL8                                                              
CANPENA  DS    CL1     16    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    4    7  A  P N             T        Y              
CANOTHRH DS    XL8                                                              
CANOTHR  DS    CL1     16   25    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   27   13  A  P N             T        Y              
CANSPECH DS    XL8                                                              
CANSPEC  DS    CL30    16   42   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18    4   11  A  P H             T        Y              
CANMUSTH DS    XL8                                                              
CANMUST  DS    CL17    18   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   38    9  A  P H             T        Y              
CANMWKSH DS    XL8                                                              
CANMWKS  DS    CL2     18   48    2  A  U N             T        Y              
CANMUSEH DS    XL8                                                              
CANMUSE  DS    CL1     19    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19    4    5  A  P N             T        Y              
CANM8WH  DS    XL8                                                              
CANM8W   DS    CL1     19   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   34    3  A  P N             T        Y              
CANM13WH DS    XL8                                                              
CANM13W  DS    CL1     19   38    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   40    4  A  P N             T        Y              
CANMRUSH DS    XL8                                                              
CANMRUS  DS    CL1     19   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   47    5  A  P N             T        Y              
CANMCONH DS    XL8                                                              
CANMCON  DS    CL1     19   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   55    4  A  P N             T        Y              
CANMDUBH DS    XL8                                                              
CANMDUB  DS    CL1     19   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   62    3  A  P N             T        Y              
CANMLTSH DS    XL8                                                              
CANMLTS  DS    CL1     19   66    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   68   13  A  P N             T        Y              
CANMREUH DS    XL8                                                              
CANMREU  DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL22    20    4   22  A  P N             T        Y              
CANMPENH DS    XL8                                                              
CANMPEN  DS    CL1     21    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    21    4   13  A  P N             T        Y              
CANOTHMH DS    XL8                                                              
CANOTHM  DS    CL1     21   25    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    21   27   19  A  P N             T        Y              
CANOMSPH DS    XL8                                                              
CANOMSP  DS    CL30    21   48   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    23    4   14  A  P N             T        Y              
CANAPPSH DS    XL8                                                              
CANAPPS  DS    CL1     23   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   28    5  A  P N             T        Y              
CANAPPHH DS    XL8                                                              
CANAPPH  DS    CL1     23   34    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     23   40    7  A  P N             T        Y              
CANAPPCH DS    XL8                                                              
CANAPPC  DS    CL30    23   48   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   15    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   31    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     24   44    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   58    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   71    9  A  P H             T        Y              
CANLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
CANWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1208 BYTES                            
