*          DATA SET TASCRABD   AT LEVEL 003 AS OF 01/17/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2ABD      DATE 01/17/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    H         T        Y              
SGLLSTH  DS    CL8                                                              
SGLLST   DS    CL8      5   10    8  A   U    N         T        Y  244         
SGLLSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    N         T        Y              
SGLNAMEH DS    CL8                                                              
SGLNAME  DS    CL36     7   10   36  A   U    N         T        Y  245         
SGLNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9    2    4  A   P    H         T        Y              
SGLDATAH DS    CL8                                                              
SGLDATA  DS    CL70     9   10   70  A   U    N         T        Y  247         
SGLDATAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    10   10   70  A   U    N         T        Y  247         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    11   10   70  A   U    N         T        Y  247         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    12   10   70  A   U    N         T        Y  247         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    13   10   70  A   U    N         T        Y  247         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    14   10   70  A   U    N         T        Y  247         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    15   10   70  A   U    N         T        Y  247         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    16   10   70  A   U    N         T        Y  247         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    17   10   70  A   U    N         T        Y  247         
         DS    CL8                                                              
SGLDLSTH DS    CL8                                                              
SGLDLST  DS    CL70    18   10   70  A   U    N         T        Y  247         
SGLDLSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    20    2   13  A   P    N         T        Y              
SGLLCHGH DS    CL8                                                              
SGLLCHG  DS    CL17    20   20   17  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    24    2   15  A   P    H         T        Y              
SGLLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SGLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1056 BYTES                            
