*          DATA SET TASCR4AD   AT LEVEL 003 AS OF 07/19/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F24AD      DATE 07/19/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
SCAAGTH  DS    XL8                                                              
SCAAGT   DS    CL4      5   10    4  A  U N             T        Y   80         
SCAAGTX  DS    XL8                                                              
SCAAGTNH DS    XL8                                                              
SCAAGTN  DS    CL36     5   20   36  A  P N             T        Y              
SCASSNDH DS    XL8                                                              
SCASSND  DS    CL7      6    2    7  A  P N             T        Y              
SCASSNH  DS    XL8                                                              
SCASSN   DS    CL9      6   10    9  A  U N             T        Y   96         
SCASSNX  DS    XL8                                                              
SCASSNNH DS    XL8                                                              
SCASSNN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
SCAAGYH  DS    XL8                                                              
SCAAGY   DS    CL6      6   45    6  A  U N             T        Y   16         
SCAAGYX  DS    XL8                                                              
SCAAGYNH DS    XL8                                                              
SCAAGYN  DS    CL16     6   56   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   80    1  A  P N             T        Y              
SCATAGH  DS    XL8                                                              
SCATAG   DS    CL41     8    2   41  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL25     8   56   25  A  P H             T        Y              
SCASELH  DS    XL8                                                              
SCASEL   DS    CL3      9    2    3  A  U N             T        Y   66         
SCASELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
SCALSTH  DS    XL8                                                              
SCALST   DS    CL75    24    6   75  A  P N             T        Y              
SCALAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
