*          DATA SET TASCRB4D   AT LEVEL 006 AS OF 08/25/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2B4D      DATE 08/25/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SDLAGYH  DS    CL8                                                              
SDLAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SDLAGYX  DS    CL8                                                              
SDLAGYNH DS    CL8                                                              
SDLAGYN  DS    CL16     5   20   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SDLCLIH  DS    CL8                                                              
SDLCLI   DS    CL6      6   10    6  A  U N             T        Y   32         
SDLCLIX  DS    CL8                                                              
SDLCLINH DS    CL8                                                              
SDLCLIN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL44     8    2   44  A  P H             T        Y              
SDLL1H   DS    CL8                                                              
SDLL1    DS    CL3      9    2    3  A  U N             T        Y   13         
SDLL1X   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     9    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     9   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    11    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    11   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    15    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    15   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    16    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    16   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    17    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    17   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    18    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    18   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    19    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    19   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    20    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    20   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    21    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    21   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    22    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    22   27   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   44    2  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    23    6   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   23    3  A  U N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    23   27   16  A  P N             T        Y              
SDLLSTH  DS    CL8                                                              
SDLLST   DS    CL2     23   44    2  A  U N             T        Y   33         
SDLLSTX  DS    CL8                                                              
SDLPFKH  DS    CL8                                                              
SDLPFK   DS    CL9     24    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL13    24   49   13  A  P N             T        Y              
SDLLCHGH DS    CL8                                                              
SDLLCHG  DS    CL17    24   63   17  A  P N             T        Y              
SDLLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SDLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1808 BYTES                            
