*          DATA SET TASCR1AD   AT LEVEL 005 AS OF 06/11/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F21AD      DATE 06/11/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SCASORTH DS    XL8                                                              
SCASORT  DS    CL14     4   63   14  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SCAAGYH  DS    XL8                                                              
SCAAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SCAAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
SCACIDH  DS    XL8                                                              
SCACID   DS    CL12     5   28   12  A  U N             T        Y   64         
SCACIDX  DS    XL8                                                              
SCACIDNH DS    XL8                                                              
SCACIDN  DS    CL36     5   42   36  A  P N             T        Y              
SCASPIDH DS    XL8                                                              
SCASPID  DS    CL7      6    2    7  A  P H             T        Y              
SCASSNH  DS    XL8                                                              
SCASSN   DS    CL9      6   10    9  A  U N             T        Y   96         
SCASSNX  DS    XL8                                                              
SCASSNNH DS    XL8                                                              
SCASSNN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   38    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   42    7  A  P H             T        Y              
SCACATH  DS    XL8                                                              
SCACAT   DS    CL3      6   50    3  A  U N             T        Y    1         
SCACATX  DS    XL8                                                              
SCALCHGH DS    XL8                                                              
SCALCHG  DS    CL17     6   63   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16     7    2   16  A  P H             T        Y              
SCALAGYH DS    XL8                                                              
SCALAGY  DS    CL12     7   20   12  A  U N             T        Y   86         
SCALAGYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     7   33   12  A  P H             T        Y              
SCALIFTH DS    XL8                                                              
SCALIFT  DS    CL12     7   49   12  A  U N             T        Y   87         
SCALIFTX DS    XL8                                                              
SCAWIDH  DS    XL8                                                              
SCAWID   DS    CL10     7   70   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8    2   13  A  P H             T        Y              
SCAONOFH DS    XL8                                                              
SCAONOF  DS    CL3      8   20    3  A  U N             T        Y    2         
SCAONOFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     8   33   13  A  P H             T        Y              
SCAUNITH DS    XL8                                                              
SCAUNIT  DS    CL3      8   49    3  A  U N             T        Y    3         
SCAUNITX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8   62    7  A  P H             T        Y              
SCAEQTYH DS    XL8                                                              
SCAEQTY  DS    CL1      8   71    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P H             T        Y              
SCAUNLOH DS    XL8                                                              
SCAUNLO  DS    CL7      9   20    7  A  U N             T        Y  176         
SCAUNLOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     9   33   13  A  P H             T        Y              
SCAYEARH DS    XL8                                                              
SCAYEAR  DS    CL3      9   49    3  A  U N             T        Y    6         
SCAYEARX DS    XL8                                                              
SCALCLNH DS    XL8                                                              
SCALCLN  DS    CL16     9   55   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    10    2   17  A  P N             T        Y              
SCAFCYCH DS    XL8                                                              
SCAFCYC  DS    CL8     10   20    8  A  U N             T        Y   20         
SCAFCYCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     10   33    8  A  P N             T        Y              
SCARLSDH DS    XL8                                                              
SCARLSD  DS    CL1     10   49    1  A  U N             T        Y   97         
SCARLSDX DS    XL8                                                              
SCARLDTH DS    XL8                                                              
SCARLDT  DS    CL9     10   52    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   62    4  A  P N             T        Y              
SCARLSPH DS    XL8                                                              
SCARLSP  DS    CL2     10   69    2  A  P N             T        Y              
SCARLDPH DS    XL8                                                              
SCARLDP  DS    CL9     10   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
SCAFRSTH DS    XL8                                                              
SCAFRST  DS    CL8     11   20    8  A  U N             T        Y    7         
SCAFRSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    11   33   13  A  P N             T        Y              
SCALSTH  DS    XL8                                                              
SCALST   DS    CL8     11   49    8  A  U N             T        Y    9         
SCALSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11   62    8  A  P N             T        Y              
SCAEFDTH DS    XL8                                                              
SCAEFDT  DS    CL8     11   71    8  A  U N             T        Y   56         
SCAEFDTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    12    2   16  A  P N             T        Y              
SCACORPH DS    XL8                                                              
SCACORP  DS    CL1     12   20    1  A  U N             T        Y   95         
SCACORPX DS    XL8                                                              
SCACORNH DS    XL8                                                              
SCACORN  DS    CL16    12   33   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P N             T        Y              
SCANCDEH DS    XL8                                                              
SCANCDE  DS    CL4     13   20    4  A  U N             T        Y   80         
SCANCDEX DS    XL8                                                              
SCANCDNH DS    XL8                                                              
SCANCDN  DS    CL16    13   33   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
SCAGUARH DS    XL8                                                              
SCAGUAR  DS    CL4     14   20    4  A  U N             T        Y  108         
SCAGUARX DS    XL8                                                              
SCAGUADH DS    XL8                                                              
SCAGUAD  DS    CL17    14   33   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15    2   13  A  P Z             T        Y              
SCARERH  DS    XL8                                                              
SCARER   DS    CL8     15   20    8  A  P Z             T        Y   12         
SCARERX  DS    XL8                                                              
SCAHFNH  DS    XL8                                                              
SCAHFN   DS    CL42    15   33   42  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL15    16    2   15  A  P N             T        Y              
SCAEXPH  DS    XL8                                                              
SCAEXP   DS    CL8     16   20    8  A  U N             T        Y   10         
SCAEXPX  DS    XL8                                                              
SCA2NDH  DS    XL8                                                              
SCA2ND   DS    CL25    16   33   25  A  P Z             T        Y              
SCAHLDH  DS    XL8                                                              
SCAHLD   DS    CL15    16   62   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
SCASTATH DS    XL8                                                              
SCASTAT  DS    CL57    17   20   57  A  U N             T        Y   11         
SCASTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    18    2   17  A  P N             T        Y              
SCAOPH   DS    XL8                                                              
SCAOP    DS    CL57    18   20   57  A  U N             T        Y   15         
SCAOPX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    19    2   17  A  P N             T        Y              
SCAOV2H  DS    XL8                                                              
SCAOV2   DS    CL57    19   20   57  A  U N             T        Y   17         
SCAOV2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    20    2   17  A  P N             T        Y              
SCAOAH   DS    XL8                                                              
SCAOA    DS    CL57    20   20   57  A  U N             T        Y   18         
SCAOAX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
SCATRKSH DS    XL8                                                              
SCATRKS  DS    CL7     21   10    7  A  U N             T        Y   24         
SCATRKSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21   20    7  A  P N             T        Y              
SCADBLH  DS    XL8                                                              
SCADBL   DS    CL1     21   29    1  A  U N             T        Y   14         
SCADBLX  DS    XL8                                                              
SCAGRRHH DS    XL8                                                              
SCAGRRH  DS    CL40    21   33   40  A  P Z             T        Y              
SCAGRRFH DS    XL8                                                              
SCAGRRF  DS    CL1     21   74    1  A  P Z             T        Y   25         
SCAGRRFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     22    2    8  A  P N             T        Y              
SCACMH   DS    XL8                                                              
SCACM    DS    CL57    22   20   57  A  U N             T        Y   19         
SCACMX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    23    2   17  A  P N             T        Y              
SCAROLEH DS    XL8                                                              
SCAROLE  DS    CL57    23   20   57  A  U N             T        Y   23         
SCAROLEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL66    24    2   66  A  P H             T        Y              
SCAVCASH DS    XL8                                                              
SCAVCAS  DS    CL8     24   69    8  A  P H             T        Y              
SCALAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2064 BYTES                            
