*          DATA SET TASCRE4D   AT LEVEL 002 AS OF 02/11/16                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2E4D      DATE 02/11/16                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SJBAGYH  DS    XL8                                                              
SJBAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SJBAGYX  DS    XL8                                                              
SJBAGYNH DS    XL8                                                              
SJBAGYN  DS    CL16     5   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   38    4  A  P N             T        Y              
SJBDTEH  DS    XL8                                                              
SJBDTE   DS    CL8      5   43    8  A  U N             T        Y   11         
SJBDTEX  DS    XL8                                                              
SJBCLHDH DS    XL8                                                              
SJBCLHD  DS    CL6      5   53    6  A  P N             T        Y              
SJBCLIH  DS    XL8                                                              
SJBCLI   DS    CL6      5   60    6  A  U N             T        Y   32         
SJBCLIX  DS    XL8                                                              
SJBPRHDH DS    XL8                                                              
SJBPRHD  DS    CL7      6    2    7  A  P N             T        Y              
SJBPRDH  DS    XL8                                                              
SJBPRD   DS    CL6      6   10    6  A  U N             T        Y   48         
SJBPRDX  DS    XL8                                                              
SJBJBHDH DS    XL8                                                              
SJBJBHD  DS    CL4      6   38    4  A  P Z             T        Y              
SJBJOBH  DS    XL8                                                              
SJBJOB   DS    CL7      6   43    7  A  P Z             T        Y   49         
SJBJOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
SJBHD1H  DS    XL8                                                              
SJBHD1   DS    CL40     8    2   40  A  P H             T        Y              
SJBSELH  DS    XL8                                                              
SJBSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
SJBSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
SJBLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SJBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1800 BYTES                            
