*          DATA SET TASCR6AD   AT LEVEL 001 AS OF 04/29/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F26AD      DATE 04/29/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
EMLAGYTH DS    XL8                                                              
EMLAGYT  DS    CL6      4    2    6  A  P H             T        Y              
EMLAGYH  DS    XL8                                                              
EMLAGY   DS    CL6      4   10    6  A  U N             T        Y              
EMLEVIDH DS    XL8                                                              
EMLEVID  DS    CL8      4   20    8  A  P H             T        Y              
EMLEVTH  DS    XL8                                                              
EMLEVT   DS    CL12     4   29   12  A  U N             T        Y   64         
EMLEVTX  DS    XL8                                                              
EMLEVTNH DS    XL8                                                              
EMLEVTN  DS    CL20     4   42   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
EMLOPTH  DS    XL8                                                              
EMLOPT   DS    CL30     5   10   30  A  U N             T        Y  102         
EMLOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   42   10  A  P N             T        Y              
EMLPIDSH DS    XL8                                                              
EMLPIDS  DS    CL9      5   55    9  A  U N             T        Y  104         
EMLPIDSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      6    6    3  A  P H             T        Y              
EMLCRPHH DS    XL8                                                              
EMLCRPH  DS    CL3      6   16    3  A  P H             T        Y              
EMLNEGHH DS    XL8                                                              
EMLNEGH  DS    CL10     6   21   10  A  P Z             T        Y              
EMLL1H   DS    XL8                                                              
EMLL1    DS    CL2      7    2    2  A  U N             T        Y    1         
EMLL1X   DS    XL8                                                              
EMLPIDH  DS    XL8                                                              
EMLPID   DS    CL9      7    6    9  A  U N             T        Y   96         
EMLPIDX  DS    XL8                                                              
EMLCORPH DS    XL8                                                              
EMLCORP  DS    CL1      7   17    1  A  U N             T        Y   95         
EMLCORPX DS    XL8                                                              
EMLNEGRH DS    XL8                                                              
EMLNEGR  DS    CL1      7   24    1  A  P Z             T        Y   15         
EMLNEGRX DS    XL8                                                              
EMLNAMEH DS    XL8                                                              
EMLNAME  DS    CL74     8    6   74  A  P H             T        Y              
EMLL2H   DS    XL8                                                              
EMLL2    DS    CL2      9    2    2  A  U N             T        Y    1         
EMLL2X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   17    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   24    1  A  P Z             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    10    6   74  A  P H             T        Y              
EMLL3H   DS    XL8                                                              
EMLL3    DS    CL2     11    2    2  A  U N             T        Y    1         
EMLL3X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   17    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   24    1  A  P Z             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P H             T        Y              
EMLL4H   DS    XL8                                                              
EMLL4    DS    CL2     13    2    2  A  U N             T        Y    1         
EMLL4X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     13    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   17    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13   24    1  A  P Z             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P H             T        Y              
EMLL5H   DS    XL8                                                              
EMLL5    DS    CL2     15    2    2  A  U N             T        Y    1         
EMLL5X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     15    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   17    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   24    1  A  P Z             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P H             T        Y              
EMLL6H   DS    XL8                                                              
EMLL6    DS    CL2     17    2    2  A  U N             T        Y    1         
EMLL6X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     17    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   17    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   24    1  A  P Z             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P H             T        Y              
EMLL7H   DS    XL8                                                              
EMLL7    DS    CL2     19    2    2  A  U N             T        Y    1         
EMLL7X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     19    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   17    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   24    1  A  P Z             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P H             T        Y              
EMLL8H   DS    XL8                                                              
EMLL8    DS    CL2     21    2    2  A  U N             T        Y    1         
EMLL8X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     21    6    9  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   17    1  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   24    1  A  P Z             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P H             T        Y              
EMLCOMMH DS    XL8                                                              
EMLCOMM  DS    CL60    23    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    24    2   60  A  P H             T        Y              
EMLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
EMLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1680 BYTES                            
