*          DATA SET TASCR81D   AT LEVEL 002 AS OF 08/19/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F281D      DATE 08/19/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SCOAGYH  DS    XL8                                                              
SCOAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SCOAGYX  DS    XL8                                                              
SCOAGYNH DS    XL8                                                              
SCOAGYN  DS    CL36     5   23   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SCOCIDH  DS    XL8                                                              
SCOCID   DS    CL12     6   10   12  A  U N             T        Y   64         
SCOCIDX  DS    XL8                                                              
SCOCIDNH DS    XL8                                                              
SCOCIDN  DS    CL36     6   23   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P H             T        Y              
SCOCODEH DS    XL8                                                              
SCOCODE  DS    CL1      7   14    1  A  U N             T        Y   13         
SCOCODEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     7   23   12  A  P H             T        Y              
SCOCASTH DS    XL8                                                              
SCOCAST  DS    CL1      7   36    1  A  U N             T        Y   11         
SCOCASTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7   39   14  A  P N             T        Y              
SCOEFDTH DS    XL8                                                              
SCOEFDT  DS    CL8      7   54    8  A  U N             T        Y   15         
SCOEFDTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     7   64   13  A  P N             T        Y              
SCOCNTH  DS    XL8                                                              
SCOCNT   DS    CL3      7   78    3  A  P N             T        Y   19         
SCOCNTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
SCOHEADH DS    XL8                                                              
SCOHEAD  DS    CL30     9    7   30  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      9   51    7  A  P H             T        Y              
SCOSELH  DS    XL8                                                              
SCOSEL   DS    CL1     10    3    1  A  U N             T        Y   17         
SCOSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10    5    1  N  P N             T        Y              
SCOLINEH DS    XL8                                                              
SCOLINE  DS    CL60    10    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    11    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    12    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    13    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    14    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    15    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    16    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    17    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    18    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    19    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    20    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    21    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    22    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     23    5    1  N  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    23    7   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     24    3    1  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     24    5    1  A  P N             T        Y              
SCOLSTH  DS    XL8                                                              
SCOLST   DS    CL60    24    7   60  A  P N             T        Y              
SCOLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1816 BYTES                            
