*          DATA SET TASCR57D   AT LEVEL 002 AS OF 09/13/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F257D      DATE 09/13/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
GCOPIDH  DS    XL8                                                              
GCOPID   DS    CL9      5   10    9  A  U N             T        Y   96         
GCOPIDX  DS    XL8                                                              
GCOPIDNH DS    XL8                                                              
GCOPIDN  DS    CL36     5   20   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
GCOGUAH  DS    XL8                                                              
GCOGUA   DS    CL4      6   10    4  A  U N             T        Y  108         
GCOGUAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   16    1  A  P N             T        Y              
GCOHEADH DS    XL8                                                              
GCOHEAD  DS    CL25     6   42   25  A  P H             T        Y              
GCOLIN1H DS    XL8                                                              
GCOLIN1  DS    CL78     7    2   78  A  U N             T        Y   40         
GCOLIN1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  U N             T        Y   40         
         DS    XL8                                                              
GCOLINXH DS    XL8                                                              
GCOLINX  DS    CL78    22    2   78  A  U N             T        Y   40         
GCOLINXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  P N             T        Y              
GCOLCHGH DS    XL8                                                              
GCOLCHG  DS    CL17    23   20   17  A  P N             T        Y              
GCOPF13H DS    XL8                                                              
GCOPF13  DS    CL22    24    2   22  A  P H             T        Y              
GCOLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
GCOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
