*          DATA SET TASCR0FD   AT LEVEL 005 AS OF 07/12/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T702CFD      DATE 07/12/89                 
         SPACE 1                                                                
T702CFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL50     6   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50     7   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50     8   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50     9   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50    10   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50    11   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50    12   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50    13   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50    14   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50    15   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50    16   10   50  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL50    17   10   50  A   P    N         T        Y              
PFKLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PFKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 784  BYTES                            
