*          DATA SET TASCR66D   AT LEVEL 001 AS OF 11/21/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F266D      DATE 11/21/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CK2MSGH  DS    XL8                                                              
CK2MSG   DS    CL78     4    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
CK2CHKH  DS    XL8                                                              
CK2CHK   DS    CL8      5   10    8  A  U N             T        Y  160         
CK2CHKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
CK2PIDH  DS    XL8                                                              
CK2PID   DS    CL9      5   28    9  A  U N             T        Y   96         
CK2PIDX  DS    XL8                                                              
CK2PIDNH DS    XL8                                                              
CK2PIDN  DS    CL16     5   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   56    4  A  P H             T        Y              
CK2TYPEH DS    XL8                                                              
CK2TYPE  DS    CL1      5   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      5   64    5  A  P N             T        Y              
CK2FREQH DS    XL8                                                              
CK2FREQ  DS    CL1      5   70    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   73    3  A  P N             T        Y              
CK2EMPH  DS    XL8                                                              
CK2EMP   DS    CL3      5   78    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      6   18    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   31    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   44    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   53    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     6   60   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   76    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   18    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   31    5  A  P N             T        Y              
CK2UNITH DS    XL8                                                              
CK2UNIT  DS    CL4      8    2    4  A  P N             T        Y              
CK2WAGEH DS    XL8                                                              
CK2WAGE  DS    CL10     8    7   10  A  P N             T        Y              
CK2NTRMH DS    XL8                                                              
CK2NTRM  DS    CL10     8   18   10  A  P N             T        Y              
CK2TXRMH DS    XL8                                                              
CK2TXRM  DS    CL10     8   29   10  A  P N             T        Y              
CK2TAXH  DS    XL8                                                              
CK2TAX   DS    CL10     8   40   10  A  P N             T        Y              
CK2UEMPH DS    XL8                                                              
CK2UEMP  DS    CL9      8   51    9  A  P N             T        Y              
CK2DISH  DS    XL8                                                              
CK2DIS   DS    CL9      8   61    9  A  P N             T        Y              
CK2FLIH  DS    XL8                                                              
CK2FLI   DS    CL9      8   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     10   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     11    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     11   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     12   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     13   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     14   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     15   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     16   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     18   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     19   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     20   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     21   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     22    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     22   61    9  A  P N             T        Y              
CK2LSTH  DS    XL8                                                              
CK2LST   DS    CL9     22   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     23    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23    7   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   18   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   29   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   40   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   51    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   61    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   71    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL44    24    2   44  A  P H             T        Y              
CK2DADDH DS    XL8                                                              
CK2DADD  DS    CL8     24   70    8  A  P Z             T        Y              
CK2LAST  DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
CK2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2648 BYTES                            
