*          DATA SET TASCRE7CD  AT LEVEL 066 AS OF 04/20/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2E7D      DATE 04/20/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      3    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      3   10    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3   20    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      3   28    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      3   38    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
TIMAGYH  DS    CL8                                                              
TIMAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
TIMAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
TIMINVH  DS    CL8                                                              
TIMINV   DS    CL6      4   28    6  A  U N             T        Y  144         
TIMINVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
TIMCIDH  DS    CL8                                                              
TIMCID   DS    CL12     4   46   12  A  U N             T        Y   64         
TIMCIDX  DS    CL8                                                              
TIMCOMNH DS    CL8                                                              
TIMCOMN  DS    CL19     4   60   19  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      5    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      5   10    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      5   28    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   32    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   24   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   36    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     7   46   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   57    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   60    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   66   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   24   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   36    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   58    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   66   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   24   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   58    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   66    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   16    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   24    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   28    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   36    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   46    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   51    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   60    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   66   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    9    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   12    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   15    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   21    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   24    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   27    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   30    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   33    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   43    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   49    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   55    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   63    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   65    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   24   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   36    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   46   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   57    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   60    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   66   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   24   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   36    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   58    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   66   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   24   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   58    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   66    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   16    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   24    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   28    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   36    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   46    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   51    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   60    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   66   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    9    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   12    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   15    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   21    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   24    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   27    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   30    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   33    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   43    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   49    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   55    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   63    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   65    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   16    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   24   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   36    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   46   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   57    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   60    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   66   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   24   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   36    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   58    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   66   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   24   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   58    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   66    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   16    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   24    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   28    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   36    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   44    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   46    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   51    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   53    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   58    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   60    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   66   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    9    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   12    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   15    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   21    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   24    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   27    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   30    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   33    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   37    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   43    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   49    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   55    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   63    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   65    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   70   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    23   11   30  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  U N             T        Y              
TIMLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
TIMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2528 BYTES                            
