*          DATA SET TASCR2AD   AT LEVEL 013 AS OF 12/30/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F22AD      DATE 12/30/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SPHPHEDH DS    XL8                                                              
SPHPHED  DS    CL7      4    2    7  A  P H             T        Y              
SPHSSNH  DS    XL8                                                              
SPHSSN   DS    CL9      4   10    9  N  U N             T        Y   96         
SPHSSNX  DS    XL8                                                              
SPHSSNNH DS    XL8                                                              
SPHSSNN  DS    CL16     4   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      4   38    8  A  P N             T        Y              
SPHEMPH  DS    XL8                                                              
SPHEMP   DS    CL3      4   47    3  A  U N             T        Y   88         
SPHEMPX  DS    XL8                                                              
SPHEMPNH DS    XL8                                                              
SPHEMPN  DS    CL16     4   51   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SPHDTEH  DS    XL8                                                              
SPHDTE   DS    CL8      5   10    8  A  U N             T        Y   31         
SPHDTEX  DS    XL8                                                              
SPHCUHH  DS    XL8                                                              
SPHCUH   DS    CL5      5   38    5  A  P N             T        Y              
SPHCURH  DS    XL8                                                              
SPHCUR   DS    CL1      5   44    1  A  U N             T        Y   33         
SPHCURX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   51    7  A  P N             T        Y              
SPHCHKH  DS    XL8                                                              
SPHCHK   DS    CL8      5   59    8  A  U N             T        Y  161         
SPHCHKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
SPHHD1H  DS    XL8                                                              
SPHHD1   DS    CL36     6    2   36  A  P H             T        Y              
SPHHD2H  DS    XL8                                                              
SPHHD2   DS    CL40     6   40   40  A  P H             T        Y              
SPHBLBLH DS    XL8                                                              
SPHBLBL  DS    CL10     7    2   10  A  P N             T        Y              
SPHTAX1H DS    XL8                                                              
SPHTAX1  DS    CL11     7   13   11  A  U N             T        Y   17         
SPHTAX1X DS    XL8                                                              
SPHTX1BH DS    XL8                                                              
SPHTX1B  DS    CL56     7   25   56  A  U N             T        Y              
SPHCLBLH DS    XL8                                                              
SPHCLBL  DS    CL10     8    2   10  A  P N             T        Y              
SPHTAX2H DS    XL8                                                              
SPHTAX2  DS    CL11     8   13   11  A  U N             T        Y   18         
SPHTAX2X DS    XL8                                                              
SPHTX2BH DS    XL8                                                              
SPHTX2B  DS    CL56     8   25   56  A  U N             T        Y              
SPHTBILH DS    XL8                                                              
SPHTBIL  DS    CL9      9    2    9  A  P Z             T        Y              
SPHTACOH DS    XL8                                                              
SPHTACO  DS    CL11     9   13   11  A  U N             T        Y              
SPHTBI2H DS    XL8                                                              
SPHTBI2  DS    CL9     10    2    9  A  P Z             T        Y              
SPHTAX3H DS    XL8                                                              
SPHTAX3  DS    CL11    10   13   11  A  U N             T        Y   19         
SPHTAX3X DS    XL8                                                              
SPHTX3BH DS    XL8                                                              
SPHTX3B  DS    CL56    10   25   56  A  U N             T        Y              
SPHTCHKH DS    XL8                                                              
SPHTCHK  DS    CL10    11    2   10  A  P Z             T        Y              
SPHTAX4H DS    XL8                                                              
SPHTAX4  DS    CL11    11   13   11  A  U N             T        Y   21         
SPHTAX4X DS    XL8                                                              
SPHTX4BH DS    XL8                                                              
SPHTX4B  DS    CL56    11   25   56  A  U N             T        Y              
SPHHED1H DS    XL8                                                              
SPHHED1  DS    CL34    12    2   34  A  P H             T        Y              
SPHHED2H DS    XL8                                                              
SPHHED2  DS    CL23    12   38   23  A  P H             T        Y              
SPHSDITH DS    XL8                                                              
SPHSDIT  DS    CL3                3     N                                       
SPHGSTTH DS    XL8                                                              
SPHGSTT  DS    CL3                3     N                                       
SPHHED3H DS    XL8                                                              
SPHHED3  DS    CL18    12   61   18  A  P H             T        Y              
SPHDETH  DS    XL8                                                              
SPHDET   DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
SPHTOTSH DS    XL8                                                              
SPHTOTS  DS    CL79    23    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL74    24    2   74  A  P H             T        Y              
SPHLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SPHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1968 BYTES                            
