*          DATA SET TASCRC9D   AT LEVEL 002 AS OF 04/07/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2C9D      DATE 04/07/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SECAGYH  DS    XL8                                                              
SECAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SECAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
SECCIDH  DS    XL8                                                              
SECCID   DS    CL12     5   28   12  A  U N             T        Y   64         
SECCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   42    7  A  P H             T        Y              
SECEPIH  DS    XL8                                                              
SECEPI   DS    CL5      5   50    5  A  U N             T        Y  100         
SECEPIX  DS    XL8                                                              
SECSHEDH DS    XL8                                                              
SECSHED  DS    CL7      6    2    7  A  P H             T        Y              
SECSSNH  DS    XL8                                                              
SECSSN   DS    CL9      6   10    9  A  U N             T        Y   96         
SECSSNX  DS    XL8                                                              
SECSSNNH DS    XL8                                                              
SECSSNN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   42    7  A  P H             T        Y              
SECCATH  DS    XL8                                                              
SECCAT   DS    CL3      6   50    3  A  U N             T        Y    1         
SECCATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8    2   13  A  P H             T        Y              
SECONOFH DS    XL8                                                              
SECONOF  DS    CL3      8   20    3  A  U N             T        Y    2         
SECONOFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     8   34   13  A  P H             T        Y              
SECUNITH DS    XL8                                                              
SECUNIT  DS    CL3      8   50    3  A  U N             T        Y    3         
SECUNITX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P H             T        Y              
SECUNLOH DS    XL8                                                              
SECUNLO  DS    CL7      9   20    7  A  U N             T        Y  176         
SECUNLOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     9   34   13  A  P H             T        Y              
SECYEARH DS    XL8                                                              
SECYEAR  DS    CL3      9   50    3  A  U N             T        Y    6         
SECYEARX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
SECCORPH DS    XL8                                                              
SECCORP  DS    CL1     10   20    1  A  U N             T        Y   95         
SECCORPX DS    XL8                                                              
SECCORNH DS    XL8                                                              
SECCORN  DS    CL16    10   34   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
SECNCDEH DS    XL8                                                              
SECNCDE  DS    CL4     11   20    4  A  U N             T        Y   80         
SECNCDEX DS    XL8                                                              
SECNCDNH DS    XL8                                                              
SECNCDN  DS    CL16    11   34   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
SECWRIRH DS    XL8                                                              
SECWRIR  DS    CL2     12   20    2  A  U N             T        Y   23         
SECWRIRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    13    2   17  A  P N             T        Y              
SECPCTH  DS    XL8                                                              
SECPCT   DS    CL6     13   20    6  A  U N             T        Y   25         
SECPCTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    14    2   16  A  P N             T        Y              
SECPERFH DS    XL8                                                              
SECPERF  DS    CL10    14   20   10  A  U N             T        Y   15         
SECPERFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    15    2   16  A  P N             T        Y              
SECCAMTH DS    XL8                                                              
SECCAMT  DS    CL10    15   20   10  A  U N             T        Y   17         
SECCAMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    16    2   16  A  P N             T        Y              
SECCBALH DS    XL8                                                              
SECCBAL  DS    CL10    16   20   10  A  U N             T        Y   21         
SECCBALX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     17    2    7  A  P N             T        Y              
SECCMH   DS    XL8                                                              
SECCM    DS    CL57    17   20   57  A  U N             T        Y   19         
SECCMX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    18    2   14  A  P N             T        Y              
SECINVH  DS    XL8                                                              
SECINV   DS    CL6     18   20    6  A  P N             T        Y   13         
SECINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    20    2   13  A  P N             T        Y              
SECLCHGH DS    XL8                                                              
SECLCHG  DS    CL17    20   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL37    24    2   37  A  P H             T        Y              
SECLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SECWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 976  BYTES                            
