*          DATA SET TASCR15D   AT LEVEL 012 AS OF 06/05/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F215D      DATE 06/05/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     5    2   12  A  P H             T        Y              
SCGCLGH  DS    CL8                                                              
SCGCLG   DS    CL6      5   20    6  A  U N             T        Y   40         
SCGCLGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     7    2   17  A  P H             T        Y              
SCGNAMEH DS    CL8                                                              
SCGNAME  DS    CL36     7   20   36  A  U N             T        Y   42         
SCGNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17     8    2   17  A  P N             T        Y              
SCGSNMEH DS    CL8                                                              
SCGSNME  DS    CL16     8   20   16  A  U N             T        Y   46         
SCGSNMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    10    2   13  A  P N             T        Y              
SCGLCHGH DS    CL8                                                              
SCGLCHG  DS    CL17    10   20   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL49    24    2   49  A  P H             T        Y              
SCGLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SCGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 296  BYTES                            
