*          DATA SET TASCR5BD   AT LEVEL 004 AS OF 01/26/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F25BD      DATE 01/26/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P H             T        Y              
PMUMUSH  DS    XL8                                                              
PMUMUS   DS    CL8      5   15    8  A  U N             T        Y   72         
PMUMUSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     5   38   12  A  P N             T        Y              
PMUPAGYH DS    XL8                                                              
PMUPAGY  DS    CL6      5   52    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P H             T        Y              
PMUCAGYH DS    XL8                                                              
PMUCAGY  DS    CL6      6   15    6  A  U N             T        Y              
PMUCAGNH DS    XL8                                                              
PMUCAGN  DS    CL13     6   23   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     6   38   12  A  P N             T        Y              
PMUOAGYH DS    XL8                                                              
PMUOAGY  DS    CL6      6   52    6  A  P N             T        Y              
PMUOMUSH DS    XL8                                                              
PMUOMUS  DS    CL14     6   60   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     8    2   16  A  P H             T        Y              
PMUNAMEH DS    XL8                                                              
PMUNAME  DS    CL36     8   20   36  A  U N             T        Y   73         
PMUNAMEX DS    XL8                                                              
PMUNAM2H DS    XL8                                                              
PMUNAM2  DS    CL36     9   20   36  A  U N             T        Y   73         
PMUNAM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P H             T        Y              
PMUPUB1H DS    XL8                                                              
PMUPUB1  DS    CL36    10   20   36  A  U N             T        Y   79         
PMUPUB1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     10   58    8  A  P H             T        Y              
PMUPL1H  DS    XL8                                                              
PMUPL1   DS    CL1     10   67    1  A  U N             T        Y   81         
PMUPL1X  DS    XL8                                                              
PMUPL1NH DS    XL8                                                              
PMUPL1N  DS    CL9     10   69    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
PMUPUB2H DS    XL8                                                              
PMUPUB2  DS    CL36    11   20   36  A  U N             T        Y   83         
PMUPUB2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11   58    8  A  P N             T        Y              
PMUPL2H  DS    XL8                                                              
PMUPL2   DS    CL1     11   67    1  A  U N             T        Y   85         
PMUPL2X  DS    XL8                                                              
PMUPL2NH DS    XL8                                                              
PMUPL2N  DS    CL9     11   69    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
PMUPUB3H DS    XL8                                                              
PMUPUB3  DS    CL36    12   20   36  A  U N             T        Y   83         
PMUPUB3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12   58    8  A  P N             T        Y              
PMUPL3H  DS    XL8                                                              
PMUPL3   DS    CL1     12   67    1  A  U N             T        Y   85         
PMUPL3X  DS    XL8                                                              
PMUPL3NH DS    XL8                                                              
PMUPL3N  DS    CL9     12   69    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  A  P H             T        Y              
PMUCOM1H DS    XL8                                                              
PMUCOM1  DS    CL36    13   20   36  A  U N             T        Y   79         
PMUCOM1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13   58    8  A  P H             T        Y              
PMUCL1H  DS    XL8                                                              
PMUCL1   DS    CL1     13   67    1  A  U N             T        Y   81         
PMUCL1X  DS    XL8                                                              
PMUCL1NH DS    XL8                                                              
PMUCL1N  DS    CL9     13   69    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
PMUCOM2H DS    XL8                                                              
PMUCOM2  DS    CL36    14   20   36  A  U N             T        Y   83         
PMUCOM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     14   58    8  A  P N             T        Y              
PMUCL2H  DS    XL8                                                              
PMUCL2   DS    CL1     14   67    1  A  U N             T        Y   85         
PMUCL2X  DS    XL8                                                              
PMUCL2NH DS    XL8                                                              
PMUCL2N  DS    CL9     14   69    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
PMUCOM3H DS    XL8                                                              
PMUCOM3  DS    CL36    15   20   36  A  U N             T        Y   83         
PMUCOM3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15   58    8  A  P N             T        Y              
PMUCL3H  DS    XL8                                                              
PMUCL3   DS    CL1     15   67    1  A  U N             T        Y   85         
PMUCL3X  DS    XL8                                                              
PMUCL3NH DS    XL8                                                              
PMUCL3N  DS    CL9     15   69    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16    2   10  A  P N             T        Y              
PMUCOM4H DS    XL8                                                              
PMUCOM4  DS    CL36    16   20   36  A  U N             T        Y   83         
PMUCOM4X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   58    8  A  P N             T        Y              
PMUCL4H  DS    XL8                                                              
PMUCL4   DS    CL1     16   67    1  A  U N             T        Y   85         
PMUCL4X  DS    XL8                                                              
PMUCL4NH DS    XL8                                                              
PMUCL4N  DS    CL9     16   69    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
PMUAUT1H DS    XL8                                                              
PMUAUT1  DS    CL36    17   20   36  A  U N             T        Y   79         
PMUAUT1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17   58    8  A  P N             T        Y              
PMUAL1H  DS    XL8                                                              
PMUAL1   DS    CL1     17   67    1  A  U N             T        Y   81         
PMUAL1X  DS    XL8                                                              
PMUAL1NH DS    XL8                                                              
PMUAL1N  DS    CL9     17   69    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
PMUAUT2H DS    XL8                                                              
PMUAUT2  DS    CL36    18   20   36  A  U N             T        Y   83         
PMUAUT2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     18   58    8  A  P N             T        Y              
PMUAL2H  DS    XL8                                                              
PMUAL2   DS    CL1     18   67    1  A  U N             T        Y   85         
PMUAL2X  DS    XL8                                                              
PMUAL2NH DS    XL8                                                              
PMUAL2N  DS    CL9     18   69    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     20    2    6  A  P H             T        Y              
PMUCLIH  DS    XL8                                                              
PMUCLI   DS    CL36    20   20   36  A  U N             T        Y   93         
PMUCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
PMUPRDH  DS    XL8                                                              
PMUPRD   DS    CL36    21   20   36  A  U N             T        Y   95         
PMUPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     22    2    8  A  P N             T        Y              
PMUCMT1H DS    XL8                                                              
PMUCMT1  DS    CL60    22   20   60  A  U N             T        Y   73         
PMUCMT1X DS    XL8                                                              
PMUCMT2H DS    XL8                                                              
PMUCMT2  DS    CL60    23   20   60  A  U N             T        Y   73         
PMUCMT2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL27    24    2   27  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   49   13  A  P N             T        Y              
PMULCHGH DS    XL8                                                              
PMULCHG  DS    CL17    24   63   17  A  P N             T        Y              
PMULAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
PMUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1784 BYTES                            
