*          DATA SET TASCR8ED   AT LEVEL 014 AS OF 06/27/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F28ED      DATE 06/27/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13  A   P    H         T        Y              
SCLFAYH  DS    CL8                                                              
SCLFAY   DS    CL6      5   20    6  A   U    N         T        Y   16         
SCLFAYX  DS    CL8                                                              
SCLFAYNH DS    CL8                                                              
SCLFAYN  DS    CL36     5   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13     6    2   13  A   P    H         T        Y              
SCLFCLIH DS    CL8                                                              
SCLFCLI  DS    CL6      6   20    6  A   U    N         T        Y   20         
SCLFCLIX DS    CL8                                                              
SCLFCLNH DS    CL8                                                              
SCLFCLN  DS    CL36     6   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A   P    N         T        Y              
SCLFPRDH DS    CL8                                                              
SCLFPRD  DS    CL6      7   20    6  A   U    N         T        Y   30         
SCLFPRDX DS    CL8                                                              
SCLFPRNH DS    CL8                                                              
SCLFPRN  DS    CL36     7   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13     9    2   13  A   P    H         T        Y              
SCLTAYH  DS    CL8                                                              
SCLTAY   DS    CL6      9   20    6  A   U    N         T        Y   16         
SCLTAYX  DS    CL8                                                              
SCLTAYNH DS    CL8                                                              
SCLTAYN  DS    CL36     9   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL13    10    2   13  A   P    H         T        Y              
SCLTCLIH DS    CL8                                                              
SCLTCLI  DS    CL6     10   20    6  A   U    N         T        Y   71         
SCLTCLIX DS    CL8                                                              
SCLTCLNH DS    CL8                                                              
SCLTCLN  DS    CL36    10   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A   P    N         T        Y              
SCLTPRDH DS    CL8                                                              
SCLTPRD  DS    CL6     11   20    6  A   U    N         T        Y   91         
SCLTPRDX DS    CL8                                                              
SCLTPRNH DS    CL8                                                              
SCLTPRN  DS    CL36    11   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
SCLOPTH  DS    CL8                                                              
SCLOPT   DS    CL50    13   10   50  A   U    N         T        Y   93         
SCLOPTX  DS    CL8                                                              
SCLLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 608  BYTES                            
