*          DATA SET TASCRB7D   AT LEVEL 002 AS OF 04/29/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2B7D      DATE 04/29/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SFTAGYH  DS    XL8                                                              
SFTAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SFTAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
SFTCIDH  DS    XL8                                                              
SFTCID   DS    CL12     5   28   12  A  U N             T        Y   64         
SFTCIDX  DS    XL8                                                              
SFTCIDNH DS    XL8                                                              
SFTCIDN  DS    CL20     5   42   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   64    3  A  P N             T        Y              
SFTUSEH  DS    XL8                                                              
SFTUSE   DS    CL3      5   68    3  A  U N             T        Y   71         
SFTUSEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SFTINVH  DS    XL8                                                              
SFTINV   DS    CL6      6   10    6  A  U N             T        Y   73         
SFTINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
SFTPDH   DS    XL8                                                              
SFTPD    DS    CL17     6   28   17  A  U N             T        Y   75         
SFTPDX   DS    XL8                                                              
SFTSHEDH DS    XL8                                                              
SFTSHED  DS    CL7      6   46    7  A  P N             T        Y              
SFTSSNH  DS    XL8                                                              
SFTSSN   DS    CL9      6   54    9  A  U N             T        Y   77         
SFTSSNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6   64    3  A  P N             T        Y              
SFTCATH  DS    XL8                                                              
SFTCAT   DS    CL3      6   68    3  A  U N             T        Y   79         
SFTCATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6   72    3  A  P N             T        Y              
SFTOPTH  DS    XL8                                                              
SFTOPT   DS    CL3      6   76    3  A  U N             T        Y   99         
SFTOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   80    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
SFTPHEDH DS    XL8                                                              
SFTPHED  DS    CL8      8    6    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL23     8   16   23  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL37     8   44   37  A  P H             T        Y              
SFTSELH  DS    XL8                                                              
SFTSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
SFTSELX  DS    XL8                                                              
SFTLHSH  DS    XL8                                                              
SFTLHS   DS    CL31     9    6   31  A  P N             T        Y              
SFTNOPH  DS    XL8                                                              
SFTNOP   DS    CL12              12     N                                       
SFTGUARH DS    XL8                                                              
SFTGUAR  DS    CL1      9   38    1  A  P N             T        Y    3         
SFTGUARX DS    XL8                                                              
SFTAMTH  DS    XL8                                                              
SFTAMT   DS    CL10     9   40   10  A  P N             T        Y    5         
SFTAMTX  DS    XL8                                                              
SFTRHSH  DS    XL8                                                              
SFTRHS   DS    CL30     9   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    10    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     10   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    10   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    11    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     11   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    11   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    12    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     12   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    12   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    13    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     13   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    13   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    14    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     14   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    14   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    15    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     15   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    15   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    16    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     16   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    16   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    17    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     17   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    17   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    18    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     18   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    18   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    19    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     19   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    19   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    20    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     20   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    20   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    21    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     21   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    21   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    22    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     22   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    22   51   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL31    23    6   31  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12              12     N                                       
         DS    XL8                                                              
         DS    CL1     23   38    1  A  P N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23   40   10  A  P N             T        Y    5         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    23   51   30  A  P N             T        Y              
SFTPFKH  DS    XL8                                                              
SFTPFK   DS    CL42    24    2   42  A  P H             T        Y              
SFTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SFTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2872 BYTES                            
