*          DATA SET TASCR8AD   AT LEVEL 002 AS OF 12/27/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F28AD      DATE 12/27/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SFTSHEDH DS    XL8                                                              
SFTSHED  DS    CL7      5    2    7  A  P H             T        Y              
SFTSSNH  DS    XL8                                                              
SFTSSN   DS    CL9      5   10    9  A  U N             T        Y   96         
SFTSSNX  DS    XL8                                                              
SFTSSNNH DS    XL8                                                              
SFTSSNN  DS    CL16     5   23   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   42    6  A  P H             T        Y              
SFTAGYH  DS    XL8                                                              
SFTAGY   DS    CL6      5   50    6  A  U N             T        Y   16         
SFTAGYX  DS    XL8                                                              
SFTAGYNH DS    XL8                                                              
SFTAGYN  DS    CL16     5   57   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SFTCIDH  DS    XL8                                                              
SFTCID   DS    CL12     6   10   12  A  U N             T        Y   64         
SFTCIDX  DS    XL8                                                              
SFTCIDNH DS    XL8                                                              
SFTCIDN  DS    CL16     6   23   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   42    3  A  P N             T        Y              
SFTCATH  DS    XL8                                                              
SFTCAT   DS    CL3      6   46    3  A  U N             T        Y   71         
SFTCATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   50    6  A  P N             T        Y              
SFTPDH   DS    XL8                                                              
SFTPD    DS    CL17     6   57   17  A  U N             T        Y   75         
SFTPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
SFTAMTH  DS    XL8                                                              
SFTAMT   DS    CL12     7   10   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   23    7  A  P N             T        Y              
SFTBALH  DS    XL8                                                              
SFTBAL   DS    CL12     7   31   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   50    5  A  P N             T        Y              
SFTGUARH DS    XL8                                                              
SFTGUAR  DS    CL1      7   57    1  A  P N             T        Y              
SFTUSHDH DS    XL8                                                              
SFTUSHD  DS    CL3      7   63    3  A  P Z             T        Y              
SFTUSEH  DS    XL8                                                              
SFTUSE   DS    CL3      7   70    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
SFTWARNH DS    XL8                                                              
SFTWARN  DS    CL55     8   14   55  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  P H             T        Y              
SFTFSTH  DS    XL8                                                              
SFTFST   DS    CL79    10    2   79  A  P N             T        Y              
SFTFST2H DS    XL8                                                              
SFTFST2  DS    CL79    11    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  P N             T        Y              
SFTLSTH  DS    XL8                                                              
SFTLST   DS    CL79    23    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL31    24    2   31  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL33    24   35   33  A  P H             T        Y              
SFTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SFTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
