*          DATA SET TASCRBBD   AT LEVEL 005 AS OF 01/14/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2BBD      DATE 01/14/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SCAAGYH  DS    XL8                                                              
SCAAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SCAAGYX  DS    XL8                                                              
SCAAGYNH DS    XL8                                                              
SCAAGYN  DS    CL16     4   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
SCACIDH  DS    XL8                                                              
SCACID   DS    CL12     4   47   12  A  U N             T        Y   64         
SCACIDX  DS    XL8                                                              
SCACIDNH DS    XL8                                                              
SCACIDN  DS    CL20     4   60   20  A  P N             T        Y              
SCASHEDH DS    XL8                                                              
SCASHED  DS    CL7      5    2    7  A  P H             T        Y              
SCASSNH  DS    XL8                                                              
SCASSN   DS    CL9      5   10    9  A  U N             T        Y   96         
SCASSNX  DS    XL8                                                              
SCASSNNH DS    XL8                                                              
SCASSNN  DS    CL16     5   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      5   38    8  A  P H             T        Y              
SCACATH  DS    XL8                                                              
SCACAT   DS    CL3      5   47    3  A  U N             T        Y   66         
SCACATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
SCAAGTH  DS    XL8                                                              
SCAAGT   DS    CL4      7   10    4  A  U N             T        Y   80         
SCAAGTX  DS    XL8                                                              
SCAAGTNH DS    XL8                                                              
SCAAGTN  DS    CL16     7   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   38    8  A  P H             T        Y              
SCATAXH  DS    XL8                                                              
SCATAX   DS    CL3      7   47    3  A  U N             T        Y   81         
SCATAXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   52    4  A  P N             T        Y              
SCACRPH  DS    XL8                                                              
SCACRP   DS    CL1      7   58    1  A  U N             T        Y   82         
SCACRPX  DS    XL8                                                              
SCACRPNH DS    XL8                                                              
SCACRPN  DS    CL16     7   60   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
SCAPAYEH DS    XL8                                                              
SCAPAYE  DS    CL1      8   10    1  A  U N             T        Y   85         
SCAPAYEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      8   20    9  A  P N             T        Y              
SCAEBASH DS    XL8                                                              
SCAEBAS  DS    CL1      8   30    1  A  U N             T        Y   86         
SCAEBASX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      8   38    8  A  P N             T        Y              
SCAAGTFH DS    XL8                                                              
SCAAGTF  DS    CL5      8   47    5  A  U N             T        Y   87         
SCAAGTFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   60   10  A  P N             T        Y              
SCASDTEH DS    XL8                                                              
SCASDTE  DS    CL8      8   71    8  A  U N             T        Y   89         
SCASDTEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SCACMNTH DS    XL8                                                              
SCACMNT  DS    CL60     9   10   60  A  U N             T        Y   91         
SCACMNTX DS    XL8                                                              
SCASTHH  DS    XL8                                                              
SCASTH   DS    CL7     10    2    7  A  P N             T        Y              
SCASTAH  DS    XL8                                                              
SCASTA   DS    CL60    10   10   60  A  U N             T        Y   92         
SCASTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  P H             T        Y              
SCAL1H   DS    XL8                                                              
SCAL1    DS    CL3     12    2    3  A  U N             T        Y  136         
SCAL1X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    12    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    12   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     12   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12   73    8  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y  136         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    13    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    13   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    13   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     13   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13   73    8  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y  136         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    14    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    14   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     14   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     14   73    8  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y  136         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    15    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    15   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    15   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     15   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15   73    8  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y  136         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    16    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    16   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   73    8  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y  136         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    17    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    17   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     17   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17   73    8  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y  136         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    18    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    18   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     18   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     18   73    8  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y  136         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    19    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    19   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    19   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     19   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     19   73    8  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y  136         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    20    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    20   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     20   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     20   73    8  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y  136         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3                3     N                                       
         DS    XL8                                                              
         DS    CL16    21    6   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   23    3  A  U N             T        Y  140         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    21   27   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   44    2  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    21   47   10  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     21   58    5  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     21   64    8  A  U N             T        Y   63         
         DS    XL8                                                              
SCALSTH  DS    XL8                                                              
SCALST   DS    CL8     21   73    8  A  U N             T        Y   73         
SCALSTX  DS    XL8                                                              
SCACCMTH DS    XL8                                                              
SCACCMT  DS    CL60    23    2   60  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL44    24    2   44  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   49   13  A  P N             T        Y              
SCALCHGH DS    XL8                                                              
SCALCHG  DS    CL17    24   63   17  A  P N             T        Y              
SCALAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 3072 BYTES                            
