*          DATA SET TASCR6FD   AT LEVEL 002 AS OF 10/17/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F26FD      DATE 10/17/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
TKRAGYH  DS    XL8                                                              
TKRAGY   DS    CL6      5   14    6  A  U N             T        Y   17         
TKRAGYX  DS    XL8                                                              
TKRAGYNH DS    XL8                                                              
TKRAGYN  DS    CL36     5   22   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
TKRCLIH  DS    XL8                                                              
TKRCLI   DS    CL6      6   14    6  A  U N             T        Y   33         
TKRCLIX  DS    XL8                                                              
TKRCLINH DS    XL8                                                              
TKRCLIN  DS    CL36     6   22   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   14    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7   25   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     7   42   18  A  P N             T        Y              
TKRFRSTH DS    XL8                                                              
TKRFRST  DS    CL6      8    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     8   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20     9   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    10   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    11   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    21   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22    2    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   14    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   25   10  A  U N             T        Y              
TKRLSTH  DS    XL8                                                              
TKRLST   DS    CL20    22   42   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
TKRLCHGH DS    XL8                                                              
TKRLCHG  DS    CL17    24   16   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   42    8  A  P N             T        Y              
TKRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
TKRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1424 BYTES                            
