*          DATA SET TASCRB0D   AT LEVEL 032 AS OF 03/17/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2B0D      DATE 03/17/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
SARAREAH DS    CL8                                                              
SARAREA  DS    CL3      5   10    3  A  U N             T        Y  136         
SARAREAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   20    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P H             T        Y              
SARARENH DS    CL8                                                              
SARAREN  DS    CL28     7   10   28  A  U N             T        Y  137         
SARARENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    10    2   13  A  P N             T        Y              
SARLCHGH DS    CL8                                                              
SARLCHG  DS    CL17    10   16   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    24    2   14  A  P H             T        Y              
SARLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SARWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 168  BYTES                            
