*          DATA SET TASCR82D   AT LEVEL 012 AS OF 02/13/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T702AED      DATE 02/13/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A   P    N         T        Y              
SBASTRH  DS    CL8                                                              
SBASTR   DS    CL8      5   10    8  A   U    N         T        Y   90         
SBASTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    N         T        Y              
SBAOPTSH DS    CL8                                                              
SBAOPTS  DS    CL47     5   30   47  A   U    N         T        Y  102         
SBAOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39     7    2   39  A   P    H         T        Y              
SBASELH  DS    CL8                                                              
SBASEL   DS    CL3      8    2    3  A   U    N         T        Y    1         
SBASELX  DS    CL8                                                              
SBABALH  DS    CL8                                                              
SBABAL   DS    CL74     8    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    23    6   74  A   P    N         T        Y              
SBALAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SBAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
