*          DATA SET TASCRFED   AT LEVEL 001 AS OF 10/30/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2FED      DATE 10/30/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
FIXAGYH  DS    CL8                                                              
FIXAGY   DS    CL6      5   10    6  A   U    N         T        Y   16         
FIXAGYX  DS    CL8                                                              
FIXAGYNH DS    CL8                                                              
FIXAGYN  DS    CL36     5   38   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   79    1  A   P    N         T        Y              
FIXLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
FIXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 96   BYTES                            
