*          DATA SET TASCRE1D   AT LEVEL 003 AS OF 06/24/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2E1D      DATE 06/24/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SMTSTRTH DS    XL8                                                              
SMTSTRT  DS    CL6      5   10    6  A  U N             T        Y  228         
SMTSTRTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SMTFMTH  DS    XL8                                                              
SMTFMT   DS    CL8      5   45    8  A  U N             T        Y   26         
SMTFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P H             T        Y              
SMTHEADH DS    XL8                                                              
SMTHEAD  DS    CL7      7   10    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      7   20    4  A  P H             T        Y              
SMTALPHH DS    XL8                                                              
SMTALPH  DS    CL5      7   53    5  A  P H             T        Y              
SMTWGHTH DS    XL8                                                              
SMTWGHT  DS    CL6      7   60    6  A  P H             T        Y              
SMTSWGTH DS    XL8                                                              
SMTSWGT  DS    CL11     7   70   11  A  P H             T        Y              
SMTSELH  DS    XL8                                                              
SMTSEL   DS    CL3      8    2    3  A  U N             T        Y    1         
SMTSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     8    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
SMTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SMTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1808 BYTES                            
