*          DATA SET TASCR6BD   AT LEVEL 005 AS OF 07/21/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F26BD      DATE 07/21/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ETIAGYH  DS    XL8                                                              
ETIAGY   DS    CL12     4   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
ETIINVH  DS    XL8                                                              
ETIINV   DS    CL6      4   49    6  A  P N             T        Y              
ETILCHGH DS    XL8                                                              
ETILCHG  DS    CL17     4   63   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P H             T        Y              
ETIEVTH  DS    XL8                                                              
ETIEVT   DS    CL12     5   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     5   38   10  A  P H             T        Y              
ETIPERH  DS    XL8                                                              
ETIPER   DS    CL17     5   49   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
ETIPIDH  DS    XL8                                                              
ETIPID   DS    CL9      6   20    9  A  P N             T        Y              
ETINAMH  DS    XL8                                                              
ETINAM   DS    CL36     6   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16     7    2   16  A  P H             T        Y              
ETICRPCH DS    XL8                                                              
ETICRPC  DS    CL1      7   20    1  A  P N             T        Y              
ETICRPNH DS    XL8                                                              
ETICRPN  DS    CL23     7   30   23  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   11    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL8      8   18    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      8   30    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   43    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   53    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   60    8  A  P N             T        Y              
ETIFRSTH DS    XL8                                                              
ETIFRST  DS    CL3      9    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     10   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     13   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     14   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     17   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     18   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     19   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     20   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     22   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   49   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    4    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   11    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   19    6  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     23   29    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   37   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   49   10  A  U N             T        Y              
ETILSTH  DS    XL8                                                              
ETILST   DS    CL2     23   63    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24    2    8  A  P N             T        Y              
ETICMTH  DS    XL8                                                              
ETICMT   DS    CL27    24   11   27  A  U N             T        Y   19         
ETICMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     24   42    6  A  P N             T        Y              
ETITOTH  DS    XL8                                                              
ETITOT   DS    CL10    24   49   10  A  P N             T        Y              
ETILAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ETIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2112 BYTES                            
