*          DATA SET TASCR40D   AT LEVEL 002 AS OF 03/14/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F240D      DATE 03/14/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ERPLDESH DS    XL8                                                              
ERPLDES  DS    CL5      4   63    5  A  P N             T        Y              
ERPDESTH DS    XL8                                                              
ERPDEST  DS    CL8      4   70    8  A  U N             T        Y    7         
ERPDESTX DS    XL8                                                              
ERPLAGYH DS    XL8                                                              
ERPLAGY  DS    CL6      5    2    6  A  P H             T        Y              
ERPAGYH  DS    XL8                                                              
ERPAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
ERPAGYX  DS    XL8                                                              
ERPAGYNH DS    XL8                                                              
ERPAGYN  DS    CL36     5   38   36  A  P N             T        Y              
ERPLESTH DS    XL8                                                              
ERPLEST  DS    CL7      6    2    7  A  P H             T        Y              
ERPESTH  DS    XL8                                                              
ERPEST   DS    CL20     6   10   20  A  U N             T        Y  224         
ERPESTX  DS    XL8                                                              
ERPESTNH DS    XL8                                                              
ERPESTN  DS    CL36     6   38   36  A  P N             T        Y              
ERPLES2H DS    XL8                                                              
ERPLES2  DS    CL7      7    2    7  A  P N             T        Y              
ERPES2H  DS    XL8                                                              
ERPES2   DS    CL20     7   10   20  A  U N             T        Y  225         
ERPES2X  DS    XL8                                                              
ERPES2NH DS    XL8                                                              
ERPES2N  DS    CL36     7   38   36  A  P N             T        Y              
ERPLES3H DS    XL8                                                              
ERPLES3  DS    CL7      8    2    7  A  P N             T        Y              
ERPES3H  DS    XL8                                                              
ERPES3   DS    CL20     8   10   20  A  U N             T        Y  225         
ERPES3X  DS    XL8                                                              
ERPES3NH DS    XL8                                                              
ERPES3N  DS    CL36     8   38   36  A  P N             T        Y              
ERPLES4H DS    XL8                                                              
ERPLES4  DS    CL7      9    2    7  A  P N             T        Y              
ERPES4H  DS    XL8                                                              
ERPES4   DS    CL20     9   10   20  A  U N             T        Y  225         
ERPES4X  DS    XL8                                                              
ERPES4NH DS    XL8                                                              
ERPES4N  DS    CL36     9   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   79    1  A  P N             T        Y              
ERPLFMTH DS    XL8                                                              
ERPLFMT  DS    CL13    10    2   13  A  P H             T        Y              
ERPFMTH  DS    XL8                                                              
ERPFMT   DS    CL1     10   20    1  A  U N             T        Y   61         
ERPFMTX  DS    XL8                                                              
ERPFMTNH DS    XL8                                                              
ERPFMTN  DS    CL15    10   28   15  A  P N             T        Y              
ERPLPERH DS    XL8                                                              
ERPLPER  DS    CL13    11    2   13  A  P N             T        Y              
ERPPERH  DS    XL8                                                              
ERPPER   DS    CL17    11   20   17  A  U N             T        Y   62         
ERPPERX  DS    XL8                                                              
ERPLCASH DS    XL8                                                              
ERPLCAS  DS    CL16    12    2   16  A  P N             T        Y              
ERPCASTH DS    XL8                                                              
ERPCAST  DS    CL1     12   20    1  A  U N             T        Y   63         
ERPCASTX DS    XL8                                                              
ERPLAUTH DS    XL8                                                              
ERPLAUT  DS    CL14    12   28   14  A  P N             T        Y              
ERPAUTOH DS    XL8                                                              
ERPAUTO  DS    CL1     12   46    1  A  U N             T        Y   65         
ERPAUTOX DS    XL8                                                              
ERPLPBSH DS    XL8                                                              
ERPLPBS  DS    CL15    12   56   15  A  P N             T        Y              
ERPPBSSH DS    XL8                                                              
ERPPBSS  DS    CL1     12   77    1  A  U N             T        Y   67         
ERPPBSSX DS    XL8                                                              
ERPLHORH DS    XL8                                                              
ERPLHOR  DS    CL14    13    2   14  A  P N             T        Y              
ERPHORZH DS    XL8                                                              
ERPHORZ  DS    CL1     13   20    1  A  U N             T        Y   69         
ERPHORZX DS    XL8                                                              
ERPLCOMH DS    XL8                                                              
ERPLCOM  DS    CL15    13   28   15  A  P N             T        Y              
ERPCOMLH DS    XL8                                                              
ERPCOML  DS    CL1     13   46    1  A  U N             T        Y   71         
ERPCOMLX DS    XL8                                                              
ERPLSACH DS    XL8                                                              
ERPLSAC  DS    CL15    13   56   15  A  P N             T        Y              
ERPSACCH DS    XL8                                                              
ERPSACC  DS    CL1     13   77    1  A  U N             T        Y   73         
ERPSACCX DS    XL8                                                              
ERPLACTH DS    XL8                                                              
ERPLACT  DS    CL16    14    2   16  A  P N             T        Y              
ERPACTH  DS    XL8                                                              
ERPACT   DS    CL1     14   20    1  A  U N             T        Y   75         
ERPACTX  DS    XL8                                                              
ERPLFILH DS    XL8                                                              
ERPLFIL  DS    CL17    14   28   17  A  P N             T        Y              
ERPFILTH DS    XL8                                                              
ERPFILT  DS    CL1     14   46    1  A  U N             T        Y   53         
ERPFILTX DS    XL8                                                              
ERPLONLH DS    XL8                                                              
ERPLONL  DS    CL11    14   56   11  A  P N             T        Y              
ERPONLYH DS    XL8                                                              
ERPONLY  DS    CL1     14   77    1  A  U N             T        Y   99         
ERPONLYX DS    XL8                                                              
ERPLLEFH DS    XL8                                                              
ERPLLEF  DS    CL11    15    2   11  A  P N             T        Y              
ERPLEFTH DS    XL8                                                              
ERPLEFT  DS    CL1     15   20    1  A  U N             T        Y   77         
ERPLEFTX DS    XL8                                                              
ERPLNOBH DS    XL8                                                              
ERPLNOB  DS    CL15    15   28   15  A  P N             T        Y              
ERPNOBXH DS    XL8                                                              
ERPNOBX  DS    CL1     15   46    1  A  U N             T        Y   79         
ERPNOBXX DS    XL8                                                              
ERPLDLRH DS    XL8                                                              
ERPLDLR  DS    CL16    15   56   16  A  P N             T        Y              
ERPDLRH  DS    XL8                                                              
ERPDLR   DS    CL1     15   77    1  A  U N             T        Y   81         
ERPDLRX  DS    XL8                                                              
ERPLFREH DS    XL8                                                              
ERPLFRE  DS    CL15    16    2   15  A  P N             T        Y              
ERPFREEH DS    XL8                                                              
ERPFREE  DS    CL1     16   20    1  A  U N             T        Y   55         
ERPFREEX DS    XL8                                                              
ERPLSIGH DS    XL8                                                              
ERPLSIG  DS    CL16    16   28   16  A  P N             T        Y              
ERPSIGH  DS    XL8                                                              
ERPSIG   DS    CL1     16   46    1  A  U N             T        Y   83         
ERPSIGX  DS    XL8                                                              
ERPLCLAH DS    XL8                                                              
ERPLCLA  DS    CL20    16   56   20  A  P N             T        Y              
ERPCLAH  DS    XL8                                                              
ERPCLA   DS    CL1     16   77    1  A  U N             T        Y   85         
ERPCLAX  DS    XL8                                                              
ERPLDETH DS    XL8                                                              
ERPLDET  DS    CL14    17    2   14  A  P N             T        Y              
ERPDETH  DS    XL8                                                              
ERPDET   DS    CL1     17   20    1  A  U N             T        Y   87         
ERPDETX  DS    XL8                                                              
ERPLTRCH DS    XL8                                                              
ERPLTRC  DS    CL6     18    2    6  A  P Z             T        Y              
ERPTRCH  DS    XL8                                                              
ERPTRC   DS    CL1     18   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   78    1  A  U Z             T        Y              
ERPLLREH DS    XL8                                                              
ERPLLRE  DS    CL15    19    2   15  A  P N             T        Y              
ERPLREQH DS    XL8                                                              
ERPLREQ  DS    CL17    19   20   17  A  P N             T        Y              
ERPALTPH DS    XL8                                                              
ERPALTP  DS    CL19    24    2   19  A  P H             T        Y              
ERPLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ERPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1376 BYTES                            
