*          DATA SET TASCR32D   AT LEVEL 005 AS OF 02/20/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F232D      DATE 02/20/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SALSTRH  DS    XL8                                                              
SALSTR   DS    CL8      5   10    8  A  U N             T        Y   18         
SALSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
SALAGGH  DS    XL8                                                              
SALAGG   DS    CL6      5   28    6  A  U N             T        Y   24         
SALAGGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
SALFMTH  DS    XL8                                                              
SALFMT   DS    CL8      5   45    8  A  U N             T        Y   26         
SALFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SALOPTSH DS    XL8                                                              
SALOPTS  DS    CL60     6   10   60  A  U N             T        Y   30         
SALOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  P H             T        Y              
SALSELH  DS    XL8                                                              
SALSEL   DS    CL3      9    2    3  A  U N             T        Y   34         
SALSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70     9   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    10   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    11   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    12   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    13   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    14   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    15   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    16   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    17   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    18   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    19   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    20   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    21   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    22   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    23   10   70  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL58    24    2   58  A  P H             T        Y              
SALLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SALWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
