*          DATA SET TASCRD0D   AT LEVEL 004 AS OF 10/25/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2D0D      DATE 10/25/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SIDAGYH  DS    XL8                                                              
SIDAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SIDAGYX  DS    XL8                                                              
SIDAGYNH DS    XL8                                                              
SIDAGYN  DS    CL36     5   18   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
SIDINVH  DS    XL8                                                              
SIDINV   DS    CL6      6   10    6  A  U N             T        Y  144         
SIDINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34     8    4   34  A  P H             T        Y              
SIDL1H   DS    XL8                                                              
SIDL1    DS    CL1      9    2    1  A  P H             T        Y              
SIDESTH  DS    XL8                                                              
SIDEST   DS    CL16     9    4   16  A  U N             T        Y   13         
SIDESTX  DS    XL8                                                              
SIDPCTH  DS    XL8                                                              
SIDPCT   DS    CL8      9   22    8  A  U N             T        Y   15         
SIDPCTX  DS    XL8                                                              
SIDNUMH  DS    XL8                                                              
SIDNUM   DS    CL6      9   31    6  A  P N             T        Y  144         
SIDNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    10    4   16  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     10   22    8  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     10   31    6  A  P N             T        Y  144         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    11    4   16  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11   22    8  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11   31    6  A  P N             T        Y  144         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    12    4   16  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12   22    8  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   31    6  A  P N             T        Y  144         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    13    4   16  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13   22    8  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     13   31    6  A  P N             T        Y  144         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    14    4   16  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     14   22    8  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     14   31    6  A  P N             T        Y  144         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    15    4   16  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15   22    8  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15   31    6  A  P N             T        Y  144         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    16    4   16  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   22    8  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16   31    6  A  P N             T        Y  144         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    17    4   16  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17   22    8  A  U N             T        Y   15         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     17   31    6  A  P N             T        Y  144         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL16    18    4   16  A  U N             T        Y   13         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     18   22    8  A  U N             T        Y   15         
         DS    XL8                                                              
SIDLSTH  DS    XL8                                                              
SIDLST   DS    CL6     18   31    6  A  P N             T        Y  144         
SIDLSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    20    2   13  A  P N             T        Y              
SIDLCHGH DS    XL8                                                              
SIDLCHG  DS    CL17    20   16   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL49    24    2   49  A  P H             T        Y              
SIDLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SIDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1144 BYTES                            
