*          DATA SET TASCR10D   AT LEVEL 001 AS OF 10/20/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F210D      DATE 10/20/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL1      4    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     5    2   12  A  P N             T        Y              
SSYUSBKH DS    XL8                                                              
SSYUSBK  DS    CL6      5   20    6  A  U N             T        Y    6         
SSYUSBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   30   10  A  P N             T        Y              
SSYUSSTH DS    XL8                                                              
SSYUSST  DS    CL8      5   46    8  A  U N             T        Y   10         
SSYUSSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15     6    2   15  A  P N             T        Y              
SSYCNBKH DS    XL8                                                              
SSYCNBK  DS    CL6      6   20    6  A  U N             T        Y   14         
SSYCNBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   30   10  A  P N             T        Y              
SSYCNSTH DS    XL8                                                              
SSYCNST  DS    CL8      6   46    8  A  U N             T        Y   18         
SSYCNSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
SSYEUBKH DS    XL8                                                              
SSYEUBK  DS    CL6      7   20    6  A  U N             T        Y   37         
SSYEUBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   30   10  A  P N             T        Y              
SSYEUSTH DS    XL8                                                              
SSYEUST  DS    CL8      7   46    8  A  U N             T        Y   39         
SSYEUSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
SSYPCBKH DS    XL8                                                              
SSYPCBK  DS    CL6      8   20    6  A  U N             T        Y   28         
SSYPCBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   30   10  A  P N             T        Y              
SSYPCSTH DS    XL8                                                              
SSYPCST  DS    CL8      8   46    8  A  U N             T        Y   29         
SSYPCSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
SSYLCBKH DS    XL8                                                              
SSYLCBK  DS    CL6      9   20    6  A  U N             T        Y   31         
SSYLCBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   30   10  A  P N             T        Y              
SSYLCSTH DS    XL8                                                              
SSYLCST  DS    CL8      9   46    8  A  U N             T        Y   32         
SSYLCSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    10    2   17  A  P N             T        Y              
SSYLMKTH DS    XL8                                                              
SSYLMKT  DS    CL8     10   20    8  A  U N             T        Y   23         
SSYLMKTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10   30   10  A  P N             T        Y              
SSYLCOMH DS    XL8                                                              
SSYLCOM  DS    CL8     10   46    8  A  U N             T        Y   22         
SSYLCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
SSYLAGTH DS    XL8                                                              
SSYLAGT  DS    CL4     11   20    4  N  U N             T        Y   26         
SSYLAGTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    11   30   13  A  P N             T        Y              
SSYLPMUH DS    XL8                                                              
SSYLPMU  DS    CL8     11   46    8  A  U N             T        Y   40         
SSYLPMUX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    12    2   17  A  P N             T        Y              
SSYCCVTH DS    XL8                                                              
SSYCCVT  DS    CL6     12   20    6  A  U N             T        Y   27         
SSYCCVTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    12   30   13  A  P N             T        Y              
SSYECVTH DS    XL8                                                              
SSYECVT  DS    CL6     12   46    6  A  U N             T        Y   70         
SSYECVTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    13    2   16  A  P H             T        Y              
SSYEMPH  DS    XL8                                                              
SSYEMP   DS    CL3     13   20    3  A  U N             T        Y   30         
SSYEMPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    13   30   15  A  P H             T        Y              
SSYIDH   DS    XL8                                                              
SSYID    DS    CL6     13   46    6  A  U N             T        Y   34         
SSYIDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    14    2   17  A  P N             T        Y              
SSYLKDTH DS    XL8                                                              
SSYLKDT  DS    CL8     14   20    8  A  U N             T        Y   45         
SSYLKDTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     14   30    5  A  P N             T        Y              
SSYLKSTH DS    XL8                                                              
SSYLKST  DS    CL8     14   36    8  A  U N             T        Y   47         
SSYLKSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   46    3  A  P N             T        Y              
SSYLKENH DS    XL8                                                              
SSYLKEN  DS    CL8     14   50    8  A  U N             T        Y   49         
SSYLKENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    15    2   17  A  P N             T        Y              
SSYPLDTH DS    XL8                                                              
SSYPLDT  DS    CL8     15   20    8  A  U N             T        Y   55         
SSYPLDTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     15   30    5  A  P N             T        Y              
SSYPLSTH DS    XL8                                                              
SSYPLST  DS    CL8     15   36    8  A  U N             T        Y   57         
SSYPLSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   46    3  A  P N             T        Y              
SSYPLENH DS    XL8                                                              
SSYPLEN  DS    CL8     15   50    8  A  U N             T        Y   59         
SSYPLENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    16    2   14  A  P N             T        Y              
SSYLLDTH DS    XL8                                                              
SSYLLDT  DS    CL8     16   20    8  A  U N             T        Y   55         
SSYLLDTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     16   30    5  A  P N             T        Y              
SSYLLSTH DS    XL8                                                              
SSYLLST  DS    CL8     16   36    8  A  U N             T        Y   57         
SSYLLSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   46    3  A  P N             T        Y              
SSYLLENH DS    XL8                                                              
SSYLLEN  DS    CL8     16   50    8  A  U N             T        Y   59         
SSYLLENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    17    2   30  A  P N             T        Y              
SSYLYRH  DS    XL8                                                              
SSYLYR   DS    CL1     17   33    1  A  U N             T        Y   65         
SSYLYRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    17   46   20  A  P N             T        Y              
SSYBRBH  DS    XL8                                                              
SSYBRB   DS    CL1     17   71    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    18    2   30  A  P N             T        Y              
SSYITCDH DS    XL8                                                              
SSYITCD  DS    CL8     18   33    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL22    18   46   22  A  P N             T        Y              
SSYCRDH  DS    XL8                                                              
SSYCRD   DS    CL1     18   71    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    19    2   30  A  P N             T        Y              
SSYGENH  DS    XL8                                                              
SSYGEN   DS    CL6     19   33    6  A  U N             T        Y   61         
SSYGENX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL23    19   46   23  A  P N             T        Y              
SSYNCSH  DS    XL8                                                              
SSYNCS   DS    CL1     19   71    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    20    2   30  A  P N             T        Y              
SSYREPH  DS    XL8                                                              
SSYREP   DS    CL6     20   33    6  A  U N             T        Y   63         
SSYREPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL23    20   46   23  A  P N             T        Y              
SSYULAH  DS    XL8                                                              
SSYULA   DS    CL1     20   71    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    21   46   21  A  P N             T        Y              
SSYFLTH  DS    XL8                                                              
SSYFLT   DS    CL1     21   71    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL22    22    2   22  A  P N             T        Y              
SSYROIH  DS    XL8                                                              
SSYROI   DS    CL1     22   33    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL22    22   46   22  A  P N             T        Y              
SSYNDCH  DS    XL8                                                              
SSYNDC   DS    CL1     22   71    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    23    2   21  A  P N             T        Y              
SSYMQRH  DS    XL8                                                              
SSYMQR   DS    CL1     23   33    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL22    23   46   22  A  P N             T        Y              
SSYVHWH  DS    XL8                                                              
SSYVHW   DS    CL1     23   71    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
SSYLCHGH DS    XL8                                                              
SSYLCHG  DS    CL17    24   20   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL24    24   46   24  A  P N             T        Y              
SSYECLH  DS    XL8                                                              
SSYECL   DS    CL1     24   71    1  A  U N             T        Y              
SSYLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SSYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
