*          DATA SET TASCRDFD   AT LEVEL 020 AS OF 12/12/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2DFD      DATE 12/12/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      4    2    1  A  P N             T        Y              
STECDEH  DS    CL8                                                              
STECDE   DS    CL3      4    4    3  A  U N             T        Y              
STEKEYH  DS    CL8                                                              
STEKEY   DS    CL63     4    8   63  A  U N             T        Y              
STEOPTH  DS    CL8                                                              
STEOPT   DS    CL1      4   73    1  A  U N             T        Y              
STEOVRH  DS    CL8                                                              
STEOVR   DS    CL1      4   76    1  A  U N             T        Y              
STECNTH  DS    CL8                                                              
STECNT   DS    CL1      4   79    1  A  U N             T        Y              
STERECH  DS    CL8                                                              
STEREC   DS    CL79     5    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79     6    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79     7    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79     8    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79     9    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    10    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    11    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    12    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    13    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    14    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    15    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    16    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    17    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    18    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    19    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    20    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    21    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    22    2   79  L  U N             T        N              
         DS    CL8                                                              
         DS    CL79    23    2   79  L  U N             T        N              
STELSTH  DS    CL8                                                              
STELST   DS    CL78    24    2   78  L  U N             T        N              
STELAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
STEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1864 BYTES                            
