*          DATA SET TASCR6CD   AT LEVEL 017 AS OF 10/10/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F26CD      DATE 10/10/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ETLAGYH  DS    XL8                                                              
ETLAGY   DS    CL12     4   20   12  A  U N             T        Y   16         
ETLAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
ETLINVH  DS    XL8                                                              
ETLINV   DS    CL6      4   49    6  A  U N             T        Y  144         
ETLINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P H             T        Y              
ETLEVTH  DS    XL8                                                              
ETLEVT   DS    CL12     5   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     5   38   10  A  P H             T        Y              
ETLPERH  DS    XL8                                                              
ETLPER   DS    CL17     5   49   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     6    2   15  A  P N             T        Y              
ETLGTEH  DS    XL8                                                              
ETLGTE   DS    CL16     6   20   16  A  U N             T        Y   82         
ETLGTEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   38   10  A  P N             T        Y              
ETLPIDSH DS    XL8                                                              
ETLPIDS  DS    CL9      6   49    9  A  U N             T        Y  105         
ETLPIDSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6   63    9  A  P N             T        Y              
ETLTMSTH DS    XL8                                                              
ETLTMST  DS    CL1      6   73    1  A  U N             T        Y  145         
ETLTMSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      7    6    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      7   17    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL12     7   56   12  A  P H             T        Y              
ETLL1H   DS    XL8                                                              
ETLL1    DS    CL3      8    2    3  A  U N             T        Y    1         
ETLL1X   DS    XL8                                                              
ETLPIDH  DS    XL8                                                              
ETLPID   DS    CL70     8    6   70  A  P N             T        Y    1         
ETLPIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70     9    6   70  A  P H             T        Y              
ETLL2H   DS    XL8                                                              
ETLL2    DS    CL3     10    2    3  A  U N             T        Y    1         
ETLL2X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    10    6   70  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    11    6   70  A  P H             T        Y              
ETLL3H   DS    XL8                                                              
ETLL3    DS    CL3     12    2    3  A  U N             T        Y    1         
ETLL3X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    12    6   70  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    13    6   70  A  P H             T        Y              
ETLL4H   DS    XL8                                                              
ETLL4    DS    CL3     14    2    3  A  U N             T        Y    1         
ETLL4X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    14    6   70  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    15    6   70  A  P H             T        Y              
ETLL5H   DS    XL8                                                              
ETLL5    DS    CL3     16    2    3  A  U N             T        Y    1         
ETLL5X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    16    6   70  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    17    6   70  A  P H             T        Y              
ETLL6H   DS    XL8                                                              
ETLL6    DS    CL3     18    2    3  A  U N             T        Y    1         
ETLL6X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    18    6   70  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    19    6   70  A  P H             T        Y              
ETLL7H   DS    XL8                                                              
ETLL7    DS    CL3     20    2    3  A  U N             T        Y    1         
ETLL7X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    20    6   70  A  P N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    21    6   70  A  P H             T        Y              
ETLL8H   DS    XL8                                                              
ETLL8    DS    CL3     22    2    3  A  U N             T        Y    1         
ETLL8X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL70    22    6   70  A  P N             T        Y    1         
         DS    XL8                                                              
ETLL8NH  DS    XL8                                                              
ETLL8N   DS    CL3     23    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL70    23    6   70  A  P H             T        Y              
ETLL9H   DS    XL8                                                              
ETLL9    DS    CL3     24    2    3  A  U N             T        Y    1         
ETLL9X   DS    XL8                                                              
ETLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ETLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1928 BYTES                            
