*          DATA SET TASCR02D   AT LEVEL 004 AS OF 04/07/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F202D      DATE 04/07/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
SSTFEMPH DS    XL8                                                              
SSTFEMP  DS    CL3      5   10    3  A  U N             T        Y   88         
SSTFEMPX DS    XL8                                                              
SSTFHEDH DS    XL8                                                              
SSTFHED  DS    CL7      5   20    7  A  P H             T        Y              
SSTFSSNH DS    XL8                                                              
SSTFSSN  DS    CL9      5   30    9  A  U N             T        Y   96         
SSTFSSNX DS    XL8                                                              
SSTFSNNH DS    XL8                                                              
SSTFSNN  DS    CL16     5   42   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
SSTTEMPH DS    XL8                                                              
SSTTEMP  DS    CL3      6   10    3  A  U N             T        Y    6         
SSTTEMPX DS    XL8                                                              
SSTTHEDH DS    XL8                                                              
SSTTHED  DS    CL7      6   20    7  A  P H             T        Y              
SSTTSSNH DS    XL8                                                              
SSTTSSN  DS    CL9      6   30    9  A  U N             T        Y    7         
SSTTSSNX DS    XL8                                                              
SSTTSNNH DS    XL8                                                              
SSTTSNN  DS    CL16     6   42   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
SSTCHKH  DS    XL8                                                              
SSTCHK   DS    CL8      7   10    8  A  U N             T        Y    9         
SSTCHKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7   20    5  A  P N             T        Y              
SSTCURRH DS    XL8                                                              
SSTCURR  DS    CL1      7   30    1  A  U N             T        Y   10         
SSTCURRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19     7   42   19  A  P N             T        Y              
SSTFRCH  DS    XL8                                                              
SSTFRC   DS    CL1      7   62    1  A  U N             T        Y   11         
SSTFRCX  DS    XL8                                                              
SSTKENDH DS    XL8                                                              
SSTKEND  DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL62     9    2   62  A  P H             T        Y              
SSTAMTSH DS    XL8                                                              
SSTAMTS  DS    CL3     10    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   41   10  A  P N             T        Y              
SSTNTAXH DS    XL8                                                              
SSTNTAX  DS    CL10    10   54   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   30   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23    8   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   19   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   30   10  A  P N             T        Y              
SSTAMTXH DS    XL8                                                              
SSTAMTX  DS    CL10    23   41   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
SSTCCOMH DS    XL8                                                              
SSTCCOM  DS    CL60    24   20   60  A  U N             T        Y              
SSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1664 BYTES                            
