*          DATA SET TASCRF2D   AT LEVEL 003 AS OF 05/09/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2F2D      DATE 05/09/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      6    4    5  A  P H             T        Y              
ADDCYSTH DS    XL8                                                              
ADDCYST  DS    CL17     6   17   17  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL9      6   38    9  A  P H             T        Y              
ADDWKSH  DS    XL8                                                              
ADDWKS   DS    CL2      6   48    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14     6   55   14  A  P H             T        Y              
ADDCSESH DS    XL8                                                              
ADDCSES  DS    CL1      8    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25     8    4   25  A  P N             T        Y              
ADDC3DYH DS    XL8                                                              
ADDC3DY  DS    CL1      8   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   34    4  A  P N             T        Y              
ADDC1WKH DS    XL8                                                              
ADDC1WK  DS    CL1      8   40    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   42    3  A  P N             T        Y              
ADDC4WKH DS    XL8                                                              
ADDC4WK  DS    CL1      8   47    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   49    3  A  P N             T        Y              
ADDC13WH DS    XL8                                                              
ADDC13W  DS    CL1      8   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   55    4  A  P N             T        Y              
ADDC31DH DS    XL8                                                              
ADDC31D  DS    CL1      8   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   63    5  A  P N             T        Y              
ADDCSUNH DS    XL8                                                              
ADDCSUN  DS    CL4      8   69    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   74    5  A  P N             T        Y              
ADDHFEEH DS    XL8                                                              
ADDHFEE  DS    CL1      9    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    4   11  A  P N             T        Y              
ADDWSPTH DS    XL8                                                              
ADDWSPT  DS    CL1     10    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    4    8  A  P N             T        Y              
ADDW3DYH DS    XL8                                                              
ADDW3DY  DS    CL1     10   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   34    4  A  P N             T        Y              
ADDW1WKH DS    XL8                                                              
ADDW1WK  DS    CL1     10   40    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   42    3  A  P N             T        Y              
ADDW4WKH DS    XL8                                                              
ADDW4WK  DS    CL1     10   47    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   49    3  A  P N             T        Y              
ADDW13WH DS    XL8                                                              
ADDW13W  DS    CL1     10   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   55    4  A  P N             T        Y              
ADDW31DH DS    XL8                                                              
ADDW31D  DS    CL1     10   61    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   63    5  A  P N             T        Y              
ADDWSUNH DS    XL8                                                              
ADDWSUN  DS    CL4     11   32    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   37    5  A  P N             T        Y              
ADDWSUPH DS    XL8                                                              
ADDWSUP  DS    CL1     11   49    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11   51    7  A  P N             T        Y              
ADDCABLH DS    XL8                                                              
ADDCABL  DS    CL1     12    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12    4    5  A  P N             T        Y              
ADDCSUBH DS    XL8                                                              
ADDCSUB  DS    CL9     12   32    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   42   11  A  P N             T        Y              
ADDCUPGH DS    XL8                                                              
ADDCUPG  DS    CL1     12   62    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   64    7  A  P N             T        Y              
ADDREINH DS    XL8                                                              
ADDREIN  DS    CL1     13    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13    4   13  A  P N             T        Y              
ADDOTHRH DS    XL8                                                              
ADDOTHR  DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14    4   13  A  P N             T        Y              
ADDOTSPH DS    XL8                                                              
ADDOTSP  DS    CL30    14   19   30  A  U N             T        Y              
ADDPENAH DS    XL8                                                              
ADDPENA  DS    CL1     15    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    4    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    4   11  A  P H             T        Y              
ADDMCSTH DS    XL8                                                              
ADDMCST  DS    CL17    17   17   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17   38    9  A  P H             T        Y              
ADDMWKSH DS    XL8                                                              
ADDMWKS  DS    CL2     17   48    2  A  U N             T        Y              
ADDMREUH DS    XL8                                                              
ADDMREU  DS    CL1     18    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18    4    5  A  P N             T        Y              
ADDMRUSH DS    XL8                                                              
ADDMRUS  DS    CL1     18   29    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   31    5  A  P N             T        Y              
ADDMCONH DS    XL8                                                              
ADDMCON  DS    CL1     18   37    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   39    4  A  P N             T        Y              
ADDMDUBH DS    XL8                                                              
ADDMDUB  DS    CL1     18   44    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   46    3  A  P N             T        Y              
ADDMLTSH DS    XL8                                                              
ADDMLTS  DS    CL1     18   50    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   52   13  A  P N             T        Y              
ADDMU2LH DS    XL8                                                              
ADDMU2L  DS    CL1     18   66    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   68   12  A  P N             T        Y              
ADDFIMUH DS    XL8                                                              
ADDFIMU  DS    CL1     19    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19    4   11  A  P N             T        Y              
ADDREGMH DS    XL8                                                              
ADDREGM  DS    CL1     19   25    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   27   14  A  P N             T        Y              
ADDMPENH DS    XL8                                                              
ADDMPEN  DS    CL1     20    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    20    4   13  A  P N             T        Y              
ADDMUOTH DS    XL8                                                              
ADDMUOT  DS    CL1     20   25    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    20   27   19  A  P N             T        Y              
ADDMUOSH DS    XL8                                                              
ADDMUOS  DS    CL30    20   47   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    22    4   14  A  P N             T        Y              
ADDAPPSH DS    XL8                                                              
ADDAPPS  DS    CL1     22   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   28    5  A  P N             T        Y              
ADDAPPHH DS    XL8                                                              
ADDAPPH  DS    CL1     22   34    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   40    7  A  P N             T        Y              
ADDAPPCH DS    XL8                                                              
ADDAPPC  DS    CL30    22   48   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   15    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   31    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     24   44    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   58    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   71    9  A  P H             T        Y              
ADDLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
ADDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1256 BYTES                            
