*          DATA SET TASCRFDD   AT LEVEL 001 AS OF 12/13/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2FDD      DATE 12/13/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
VCALCHGH DS    XL8                                                              
VCALCHG  DS    CL17     4   63   17  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
VCAAGYH  DS    XL8                                                              
VCAAGY   DS    CL6      5   10    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
VCACIDH  DS    XL8                                                              
VCACID   DS    CL12     5   28   12  A  U N             T        Y              
VCACIDNH DS    XL8                                                              
VCACIDN  DS    CL36     5   42   36  A  P N             T        Y              
VCASPIDH DS    XL8                                                              
VCASPID  DS    CL7      6    2    7  A  P H             T        Y              
VCASSNH  DS    XL8                                                              
VCASSN   DS    CL9      6   10    9  A  U N             T        Y              
VCASSNNH DS    XL8                                                              
VCASSNN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   38    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6   42    7  A  P H             T        Y              
VCACATH  DS    XL8                                                              
VCACAT   DS    CL3      6   50    3  A  U N             T        Y              
VCASORTH DS    XL8                                                              
VCASORT  DS    CL14     6   63   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     7    2   13  A  P H             T        Y              
VCAONOFH DS    XL8                                                              
VCAONOF  DS    CL3      7   20    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     7   42   13  A  P H             T        Y              
VCAUNITH DS    XL8                                                              
VCAUNIT  DS    CL3      7   58    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P H             T        Y              
VCAUNLOH DS    XL8                                                              
VCAUNLO  DS    CL7      8   20    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   42   13  A  P H             T        Y              
VCAYEARH DS    XL8                                                              
VCAYEAR  DS    CL3      8   58    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P H             T        Y              
VCAAVERH DS    XL8                                                              
VCAAVER  DS    CL21    10   15   21  A  U N             T        Y   88         
VCAAVERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    10   42   14  A  P H             T        Y              
VCADVERH DS    XL8                                                              
VCADVER  DS    CL21    10   58   21  A  U N             T        Y   89         
VCADVERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   11    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   31    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   40    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   60    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   69    7  A  P H             T        Y              
VCAVR1H  DS    XL8                                                              
VCAVR1   DS    CL3     13    2    3  A  P N             T        Y              
VCAVR1NH DS    XL8                                                              
VCAVR1N  DS    CL12    13   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   60    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   11   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   31    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    22   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   60    3  A  P N             T        Y              
VCAVRLH  DS    XL8                                                              
VCAVRL   DS    CL12    22   69   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
VCALAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
VCAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1600 BYTES                            
