*          DATA SET TASCR27D   AT LEVEL 001 AS OF 11/06/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F227D      DATE 11/06/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SINAGYH  DS    XL8                                                              
SINAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SINAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P H             T        Y              
SININVH  DS    XL8                                                              
SININV   DS    CL6      4   28    6  A  U N             T        Y  144         
SININVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      4   35    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P N             T        Y              
SINCIDH  DS    XL8                                                              
SINCID   DS    CL12     4   46   12  A  U N             T        Y   64         
SINCIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      4   59    3  A  P N             T        Y              
SINLFTH  DS    XL8                                                              
SINLFT   DS    CL3      4   63    3  A  U N             T        Y   65         
SINLFTX  DS    XL8                                                              
SINLIDH  DS    XL8                                                              
SINLID   DS    CL12     4   67   12  A  P N             T        Y              
SINAGYNH DS    XL8                                                              
SINAGYN  DS    CL16     5    2   16  A  P N             T        Y              
SINCLINH DS    XL8                                                              
SINCLIN  DS    CL16     5   20   16  A  P N             T        Y              
SINCOMNH DS    XL8                                                              
SINCOMN  DS    CL19     5   38   19  A  P N             T        Y              
SINSECH  DS    XL8                                                              
SINSEC   DS    CL4      5   58    4  A  P N             T        Y              
SINCLPRH DS    XL8                                                              
SINCLPR  DS    CL13     5   63   13  A  P N             T        Y              
SINMEDNH DS    XL8                                                              
SINMEDN  DS    CL3      5   77    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
SINDISPH DS    XL8                                                              
SINDISP  DS    CL5      6   10    5  A  U N             T        Y   12         
SINDISPX DS    XL8                                                              
SINBOVRH DS    XL8                                                              
SINBOVR  DS    CL5      6   63    5  A  P N             T        Y              
SINBVDTH DS    XL8                                                              
SINBVDT  DS    CL8      6   70    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SINAUTHH DS    XL8                                                              
SINAUTH  DS    CL16     7   10   16  A  U N             T        Y   11         
SINAUTHX DS    XL8                                                              
SINADVH  DS    XL8                                                              
SINADV   DS    CL8      7   28    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL4      7   38    4  A  P N             T        Y              
SINESTH  DS    XL8                                                              
SINEST   DS    CL16     7   46   16  A  U N             T        Y   13         
SINESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   63    6  A  P N             T        Y              
SINPDH   DS    XL8                                                              
SINPD    DS    CL2      7   74    2  N  U N             T        Y   15         
SINPDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
SINCYCH  DS    XL8                                                              
SINCYC   DS    CL17     8   10   17  A  U N             T        Y   17         
SINCYCX  DS    XL8                                                              
SINLCYCH DS    XL8                                                              
SINLCYC  DS    CL6      8   28    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      8   38    7  A  P N             T        Y              
SINDTLH  DS    XL8                                                              
SINDTL   DS    CL1      8   46    1  A  U N             T        Y   18         
SINDTLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8   52    6  A  P N             T        Y              
SINBNPH  DS    XL8                                                              
SINBNP   DS    CL1      8   59    1  A  U N             T        Y   19         
SINBNPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   63   10  A  P N             T        Y              
SINEINVH DS    XL8                                                              
SINEINV  DS    CL6      8   74    6  A  U N             T        Y   21         
SINEINVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
SINHCOMH DS    XL8                                                              
SINHCOM  DS    CL40     9   10   40  A  U N             T        Y   23         
SINHCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9   52    7  A  P N             T        Y              
SINOPTH  DS    XL8                                                              
SINOPT   DS    CL20     9   61   20  A  U N             T        Y   25         
SINOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
SINICOMH DS    XL8                                                              
SINICOM  DS    CL60    10   10   60  A  U N             T        Y   27         
SINICOMX DS    XL8                                                              
SINEPISH DS    XL8                                                              
SINEPIS  DS    CL71    11   10   71  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
SINIDTEH DS    XL8                                                              
SINIDTE  DS    CL8     12   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12   20    7  A  P N             T        Y              
SINPDTEH DS    XL8                                                              
SINPDTE  DS    CL8     12   28    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   38    8  A  P N             T        Y              
SINUSEH  DS    XL8                                                              
SINUSE   DS    CL32    12   48   32  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
SINCDTEH DS    XL8                                                              
SINCDTE  DS    CL8     13   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   20    7  A  P N             T        Y              
SINDDTEH DS    XL8                                                              
SINDDTE  DS    CL8     13   28    8  A  U N             T        Y              
SINWEBHH DS    XL8                                                              
SINWEBH  DS    CL20    13   38   20  A  P Z             T        Y              
SINWEBIH DS    XL8                                                              
SINWEBI  DS    CL18    13   59   18  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     14    2    5  A  P N             T        Y              
SINSCALH DS    XL8                                                              
SINSCAL  DS    CL12    14   21   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   38    3  A  P N             T        Y              
SINPNHH  DS    XL8                                                              
SINPNH   DS    CL12    14   54   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15    2   15  A  P N             T        Y              
SINAPPLH DS    XL8                                                              
SINAPPL  DS    CL12    15   21   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   38    3  A  P N             T        Y              
SINHNWH  DS    XL8                                                              
SINHNW   DS    CL12    15   54   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16    2   17  A  P N             T        Y              
SINGUARH DS    XL8                                                              
SINGUAR  DS    CL12    16   21   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   38    3  A  P N             T        Y              
SININRH  DS    XL8                                                              
SININR   DS    CL12    16   54   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    17    2   13  A  P N             T        Y              
SINIPMTH DS    XL8                                                              
SINIPMT  DS    CL12    17   21   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   38   13  A  P N             T        Y              
SINTAXH  DS    XL8                                                              
SINTAX   DS    CL12    17   54   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
SINCPMTH DS    XL8                                                              
SINCPMT  DS    CL12    18   21   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   38    8  A  P N             T        Y              
SINHNDH  DS    XL8                                                              
SINHND   DS    CL12    18   54   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    19    2   18  A  P N             T        Y              
SINREXPH DS    XL8                                                              
SINREXP  DS    CL12    19   21   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   38   13  A  P N             T        Y              
SINHNDCH DS    XL8                                                              
SINHNDC  DS    CL12    19   54   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    20    2   14  A  P N             T        Y              
SINSPNHH DS    XL8                                                              
SINSPNH  DS    CL12    20   21   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   38   14  A  P N             T        Y              
SINMDEDH DS    XL8                                                              
SINMDED  DS    CL12    20   54   12  A  U N             T        Y              
SINCCVHH DS    XL8                                                              
SINCCVH  DS    CL18    21    2   18  A  P N             T        Y              
SINCCVTH DS    XL8                                                              
SINCCVT  DS    CL12    21   21   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   38   11  A  P N             T        Y              
SINFICRH DS    XL8                                                              
SINFICR  DS    CL12    21   54   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22    2   17  A  P N             T        Y              
SINACOMH DS    XL8                                                              
SINACOM  DS    CL12    22   21   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22   38    7  A  P N             T        Y              
SINGSTH  DS    XL8                                                              
SINGST   DS    CL12    22   54   12  A  U N             T        Y              
SINUSCNH DS    XL8                                                              
SINUSCN  DS    CL8     22   68    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  P N             T        Y              
SINLCHGH DS    XL8                                                              
SINLCHG  DS    CL17    23   16   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   38   13  A  P N             T        Y              
SINITOTH DS    XL8                                                              
SINITOT  DS    CL12    23   54   12  A  U N             T        Y              
SINMSGH  DS    XL8                                                              
SINMSG   DS    CL12    23   68   12  A  P Z             T        Y              
SINPFKYH DS    XL8                                                              
SINPFKY  DS    CL29    24    2   29  A  P H             T        Y              
SINPFCMH DS    XL8                                                              
SINPFCM  DS    CL12    24   33   12  A  P H             T        Y              
SINPF16H DS    XL8                                                              
SINPF16  DS    CL12    24   47   12  A  P Z             T        Y              
SINPF18H DS    XL8                                                              
SINPF18  DS    CL10    24   61   10  A  P H             T        Y              
SINLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SINWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2112 BYTES                            
