*          DATA SET TASCR44D   AT LEVEL 004 AS OF 02/13/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F244D      DATE 02/13/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
APPAGYH  DS    XL8                                                              
APPAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
APPAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
APPINVH  DS    XL8                                                              
APPINV   DS    CL6      5   28    6  A  U N             T        Y  145         
APPINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   36    1  A  P N             T        Y              
APPHCHGH DS    XL8                                                              
APPHCHG  DS    CL13     5   38   13  A  P Z             T        Y              
APPLCHGH DS    XL8                                                              
APPLCHG  DS    CL17     5   52   17  A  P Z             T        Y              
APPHAPPH DS    XL8                                                              
APPHAPP  DS    CL13     6    2   13  A  P Z             T        Y              
APPAPPH  DS    XL8                                                              
APPAPP   DS    CL8      6   20    8  A  P Z             T        Y              
APPHEDH  DS    XL8                                                              
APPHED   DS    CL71     7    2   71  A  P Z             T        Y              
APPFSTH  DS    XL8                                                              
APPFST   DS    CL34     8    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34     8   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34     9    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34     9   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    10    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    10   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    11    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    11   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    12    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    12   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    13    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    13   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    14    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    14   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    15    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    15   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    16    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    16   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    17    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    17   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    18    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    18   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    19    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    19   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    20    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    20   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    21    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    21   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    22    2   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    22   45   34  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL34    23    2   34  A  P N             T        Y              
APPLSTH  DS    XL8                                                              
APPLST   DS    CL34    23   45   34  A  P N             T        Y              
APPLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
APPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1592 BYTES                            
