*          DATA SET TASCR38D   AT LEVEL 002 AS OF 11/17/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F238D      DATE 11/17/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SCOAGYH  DS    XL8                                                              
SCOAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SCOAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
SCOCLIH  DS    XL8                                                              
SCOCLI   DS    CL6      5   28    6  A  U N             T        Y   32         
SCOCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
SCOPRDH  DS    XL8                                                              
SCOPRD   DS    CL6      5   46    6  A  U N             T        Y   48         
SCOPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   55    5  A  P N             T        Y              
SCOMUSH  DS    XL8                                                              
SCOMUS   DS    CL8      5   64    8  A  U N             T        Y   72         
SCOMUSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
SCOFMTH  DS    XL8                                                              
SCOFMT   DS    CL1      6   10    1  A  U N             T        Y   94         
SCOFMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   20    5  A  P N             T        Y              
SCOSTRH  DS    XL8                                                              
SCOSTR   DS    CL16     6   28   16  A  U N             T        Y   11         
SCOSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   46    5  A  P N             T        Y              
SCOMEDH  DS    XL8                                                              
SCOMED   DS    CL1      6   52    1  A  U N             T        Y   15         
SCOMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   55    7  A  P N             T        Y              
SCOCLGH  DS    XL8                                                              
SCOCLG   DS    CL6      6   64    6  A  U N             T        Y   40         
SCOCLGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   71    4  A  P N             T        Y              
SCOTYPEH DS    XL8                                                              
SCOTYPE  DS    CL2      6   76    2  A  U N             T        Y   42         
SCOTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SCOOPTSH DS    XL8                                                              
SCOOPTS  DS    CL34     7   10   34  A  U N             T        Y  102         
SCOOPTSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   46    4  A  P N             T        Y              
SCOVERSH DS    XL8                                                              
SCOVERS  DS    CL1      7   52    1  A  U N             T        Y   41         
SCOVERSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   55    8  A  P N             T        Y              
SCOCOPH  DS    XL8                                                              
SCOCOP   DS    CL6      7   64    6  A  U N             T        Y   40         
SCOCOPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
SCOHD1H  DS    XL8                                                              
SCOHD1   DS    CL29     8    2   29  A  P H             T        Y              
SCOHD2H  DS    XL8                                                              
SCOHD2   DS    CL36     8   45   36  A  P H             T        Y              
SCOSELH  DS    XL8                                                              
SCOSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
SCOSELX  DS    XL8                                                              
SCOCOMH  DS    XL8                                                              
SCOCOM   DS    CL75     9    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
SCOLSELH DS    XL8                                                              
SCOLSEL  DS    CL3     23    2    3  A  U N             T        Y    1         
SCOLSELX DS    XL8                                                              
SCOLSTH  DS    XL8                                                              
SCOLST   DS    CL75    23    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL64    24    2   64  A  P H             T        Y              
SCOLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SCOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2152 BYTES                            
