*          DATA SET TASCR45D   AT LEVEL 016 AS OF 05/17/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F245D      DATE 05/17/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
SIFAGYH  DS    CL8                                                              
SIFAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SIFAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
SIFSTRH  DS    CL8                                                              
SIFSTR   DS    CL6      5   28    6  A  U N             T        Y   32         
SIFSTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SIFOPTSH DS    CL8                                                              
SIFOPTS  DS    CL60     6   10   60  A  U N             T        Y  102         
SIFOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL34     8    2   34  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL32     8   42   32  A  P H             T        Y              
SIFSELH  DS    CL8                                                              
SIFSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
SIFSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
SIFLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SIFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
