*          DATA SET TASCRC0D   AT LEVEL 001 AS OF 04/09/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2C0D      DATE 04/09/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
SPYAGYH  DS    XL8                                                              
SPYAGY   DS    CL6      4   10    6  A  U N             T        Y   16         
SPYAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   28    7  A  P H             T        Y              
SPYINVH  DS    XL8                                                              
SPYINV   DS    CL6      4   38    6  A  U N             T        Y  144         
SPYINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   63    7  A  P N             T        Y              
SPYOTHH  DS    XL8                                                              
SPYOTH   DS    CL1      4   71    1  A  U N             T        Y   17         
SPYOTHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      4   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
SPYCIDH  DS    XL8                                                              
SPYCID   DS    CL12     5   10   12  A  P N             T        Y   64         
SPYCIDX  DS    XL8                                                              
SPYCIDNH DS    XL8                                                              
SPYCIDN  DS    CL24     5   28   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
SPYLIDH  DS    XL8                                                              
SPYLID   DS    CL12     6   10   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   28    8  A  P N             T        Y              
SPYUSEH  DS    XL8                                                              
SPYUSE   DS    CL22     6   38   22  A  P H             T        Y              
SPYCRDH  DS    XL8                                                              
SPYCRD   DS    CL8      6   63    8  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
SPYCYCH  DS    XL8                                                              
SPYCYC   DS    CL17     7   10   17  A  P N             T        Y              
SPYLTWAH DS    XL8                                                              
SPYLTWA  DS    CL8      7   63    8  A  P H             T        Y              
SPYTAGH  DS    XL8                                                              
SPYTAG   DS    CL1      9    2    1  A  P N             T        Y              
SPYLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SPYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 352  BYTES                            
