*          DATA SET TASCR1FD   AT LEVEL 005 AS OF 02/18/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F21FD      DATE 02/18/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
DELAGYH  DS    XL8                                                              
DELAGY   DS    CL6      5   20    6  A  U N             T        Y   16         
DELAGYX  DS    XL8                                                              
DELAGYNH DS    XL8                                                              
DELAGYN  DS    CL36     5   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     6    2   13  A  P H             T        Y              
DELINV1H DS    XL8                                                              
DELINV1  DS    CL6      6   20    6  A  U N             T        Y  145         
DELINV1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     7    2   12  A  P N             T        Y              
DELINV2H DS    XL8                                                              
DELINV2  DS    CL6      7   20    6  A  U N             T        Y  146         
DELINV2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   50    1  A  P N             T        Y              
DELPF13H DS    XL8                                                              
DELPF13  DS    CL20    24    2   20  A  P H             T        Y              
DELPF14H DS    XL8                                                              
DELPF14  DS    CL20    24   28   20  A  P H             T        Y              
DELLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
DELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 240  BYTES                            
