*          DATA SET TASCRE2D   AT LEVEL 006 AS OF 11/19/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2E2D      DATE 11/19/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
STERECH  DS    CL8                                                              
STEREC   DS    CL1      3   80    1  A  U N             T        Y              
STELAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
STEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 16   BYTES                            
