*          DATA SET TASCR90D   AT LEVEL 002 AS OF 11/10/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F290D      DATE 11/10/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P H             T        Y              
SRLSSNH  DS    XL8                                                              
SRLSSN   DS    CL9      4   10    9  A  U N             T        Y   60         
SRLSSNX  DS    XL8                                                              
SRLSSNNH DS    XL8                                                              
SRLSSNN  DS    CL16     4   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      4   38    8  A  P H             T        Y              
SRLEMPH  DS    XL8                                                              
SRLEMP   DS    CL3      4   47    3  A  U N             T        Y   58         
SRLEMPX  DS    XL8                                                              
SRLEMPNH DS    XL8                                                              
SRLEMPN  DS    CL16     4   51   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
SRLYEARH DS    XL8                                                              
SRLYEAR  DS    CL4      5   10    4  N  U N             T        Y   59         
SRLYEARX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   38    8  A  P N             T        Y              
SRLPRVH  DS    XL8                                                              
SRLPRV   DS    CL2      5   47    2  A  U N             T        Y   61         
SRLPRVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     7    2   20  A  P N             T        Y              
SRLINCH  DS    XL8                                                              
SRLINC   DS    CL11     7   25   11  A  U N             T        Y   10         
SRLINCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19     8    2   19  A  P N             T        Y              
SRLQPPH  DS    XL8                                                              
SRLQPP   DS    CL11     8   25   11  A  U N             T        Y   11         
SRLQPPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     9    2   14  A  P N             T        Y              
SRLEIPH  DS    XL8                                                              
SRLEIP   DS    CL11     9   25   11  A  U N             T        Y   12         
SRLEIPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    10    2   18  A  P N             T        Y              
SRLTAXH  DS    XL8                                                              
SRLTAX   DS    CL11    10   25   11  A  U N             T        Y   13         
SRLTAXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL21    11    2   21  A  P N             T        Y              
SRLPENH  DS    XL8                                                              
SRLPEN   DS    CL11    11   25   11  A  U N             T        Y   14         
SRLPENX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    12    2   16  A  P N             T        Y              
SRLQPRH  DS    XL8                                                              
SRLQPR   DS    CL11    12   25   11  A  U N             T        Y   15         
SRLQPRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    13    2   13  A  P N             T        Y              
SRLQPWH  DS    XL8                                                              
SRLQPW   DS    CL11    13   25   11  A  U N             T        Y   16         
SRLQPWX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL27    24    2   27  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13    24   31   13  A  P N             T        Y              
SRLLCHGH DS    XL8                                                              
SRLLCHG  DS    CL17    24   45   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   64    8  A  P N             T        Y              
SRLLPRTH DS    XL8                                                              
SRLLPRT  DS    CL8     24   73    8  A  P N             T        Y              
SRLLAST  DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
SRLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 680  BYTES                            
