*          DATA SET TASCR71D   AT LEVEL 001 AS OF 03/05/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F271D      DATE 03/05/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
ET2AGYH  DS    XL8                                                              
ET2AGY   DS    CL6      4   20    6  A  U N             T        Y   16         
ET2AGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      4   38    7  A  P H             T        Y              
ET2INVH  DS    XL8                                                              
ET2INV   DS    CL6      4   49    6  A  U N             T        Y  144         
ET2INVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P H             T        Y              
ET2EVTH  DS    XL8                                                              
ET2EVT   DS    CL12     5   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     5   38   10  A  P H             T        Y              
ET2PERH  DS    XL8                                                              
ET2PER   DS    CL17     5   49   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15     6    2   15  A  P N             T        Y              
ET2GTEH  DS    XL8                                                              
ET2GTE   DS    CL16     6   20   16  A  U N             T        Y   82         
ET2GTEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   12    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2      7   28    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      7   36    5  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   45    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   57    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4      7   70    4  A  P H             T        Y              
ET2L1H   DS    XL8                                                              
ET2L1    DS    CL6      8    2    6  A  P N             T        Y    1         
ET2L1X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8    9   10  A  P N             T        Y              
ET2L1TH  DS    XL8                                                              
ET2L1T   DS    CL10     8   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68     9    2   68  A  P H             T        Y              
ET2L2H   DS    XL8                                                              
ET2L2    DS    CL6     10    2    6  A  P N             T        Y    1         
ET2L2X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    10    9   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    11    2   68  A  P H             T        Y              
ET2L3H   DS    XL8                                                              
ET2L3    DS    CL6     12    2    6  A  P N             T        Y    1         
ET2L3X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12    9   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    13    2   68  A  P H             T        Y              
ET2L4H   DS    XL8                                                              
ET2L4    DS    CL6     14    2    6  A  P N             T        Y    1         
ET2L4X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    14    9   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    15    2   68  A  P H             T        Y              
ET2L5H   DS    XL8                                                              
ET2L5    DS    CL6     16    2    6  A  P N             T        Y    1         
ET2L5X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16    9   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    17    2   68  A  P H             T        Y              
ET2L6H   DS    XL8                                                              
ET2L6    DS    CL6     18    2    6  A  P N             T        Y    1         
ET2L6X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    18    9   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    19    2   68  A  P H             T        Y              
ET2L7H   DS    XL8                                                              
ET2L7    DS    CL6     20    2    6  A  P N             T        Y    1         
ET2L7X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20    9   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   64   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL68    21    2   68  A  P H             T        Y              
ET2L8H   DS    XL8                                                              
ET2L8    DS    CL6     22    2    6  A  P N             T        Y    1         
ET2L8X   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    22    9   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   20   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   31   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   42   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   53   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   64   10  A  U N             T        Y              
ET2ENDH  DS    XL8                                                              
ET2END   DS    CL68    23    2   68  A  P H             T        Y              
ET2LAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
ET2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1960 BYTES                            
