*          DATA SET TASCRCED   AT LEVEL 001 AS OF 06/17/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2CED      DATE 06/17/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SAFAGYH  DS    XL8                                                              
SAFAGY   DS    CL6      5   10    6  A  U N             T        Y   16         
SAFAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P H             T        Y              
SAFCLIH  DS    XL8                                                              
SAFCLI   DS    CL6      5   28    6  A  U N             T        Y   32         
SAFCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   38    5  A  P N             T        Y              
SAFSTRH  DS    XL8                                                              
SAFSTR   DS    CL12     5   46   12  A  U N             T        Y   47         
SAFSTRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
SAFHDH   DS    XL8                                                              
SAFHD    DS    CL78     7    2   78  A  P H             T        Y              
SAFSELH  DS    XL8                                                              
SAFSEL   DS    CL3      8    2    3  A  U N             T        Y   66         
SAFSELX  DS    XL8                                                              
SAFDATAH DS    XL8                                                              
SAFDATA  DS    CL75     8    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
SAFSEL2H DS    XL8                                                              
SAFSEL2  DS    CL3     10    2    3  A  U N             T        Y   66         
SAFSEL2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
SAFLSTH  DS    XL8                                                              
SAFLST   DS    CL75    23    6   75  A  P N             T        Y              
SAFPFSH  DS    XL8                                                              
SAFPFS   DS    CL64    24    2   64  A  P H             T        Y              
SAFLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SAFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1768 BYTES                            
