*          DATA SET TASCR04D   AT LEVEL 003 AS OF 05/09/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F204D      DATE 05/09/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL23     5   56   23  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y    0         
         DS    XL8                                                              
SDSFDTEH DS    XL8                                                              
SDSFDTE  DS    CL8      6   10    8  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
SDSFSTUH DS    XL8                                                              
SDSFSTU  DS    CL12     6   28   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   42    4  A  P N             T        Y              
SDSFCITH DS    XL8                                                              
SDSFCIT  DS    CL12     6   49   12  A  U N             T        Y              
SDSFSTHH DS    XL8                                                              
SDSFSTH  DS    CL5      6   63    5  A  P N             T        Y              
SDSFSTAH DS    XL8                                                              
SDSFSTA  DS    CL2      6   70    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
SDSRDTEH DS    XL8                                                              
SDSRDTE  DS    CL8      7   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P N             T        Y              
SDSRSTUH DS    XL8                                                              
SDSRSTU  DS    CL12     7   28   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   42    4  A  P N             T        Y              
SDSRCITH DS    XL8                                                              
SDSRCIT  DS    CL12     7   49   12  A  U N             T        Y              
SDSRSTHH DS    XL8                                                              
SDSRSTH  DS    CL5      7   63    5  A  P N             T        Y              
SDSRSTAH DS    XL8                                                              
SDSRSTA  DS    CL2      7   70    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL24     9    2   24  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL33     9   40   33  A  P H             T        Y              
SDSFRSTH DS    XL8                                                              
SDSFRST  DS    CL9     10    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    10   12   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   44    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   70    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     11    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     11   12    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    11   17   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     12    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    12   12   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   44    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   70    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     13   12    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    13   17   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     14    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    14   12   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   44    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   70    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     15    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   12    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    15   17   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     16    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    16   12   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   44    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   70    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     17    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     17   12    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    17   17   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     18    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    18   12   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   44    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   70    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     19    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     19   12    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    19   17   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     20    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    20   12   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   44    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   70    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     21    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     21   12    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    21   17   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     22    2    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL26    22   12   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   40    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   44    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   48    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   53    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   63    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   70    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     23    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     23   12    4  A  P N             T        Y              
SDSLSTH  DS    XL8                                                              
SDSLST   DS    CL60    23   17   60  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9     24    2    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   12    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     24   22    7  A  P H             T        Y              
SDSDEREH DS    XL8                                                              
SDSDERE  DS    CL11    24   30   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   42    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     24   52    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   60    9  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL9     24   70    9  A  P H             T        Y              
SDSLAST  DS    XL1                                                              
         DS    XL2    INDICS=                                                   
SDSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2080 BYTES                            
