*          DATA SET TASCR1CD   AT LEVEL 001 AS OF 06/02/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F21CD      DATE 06/02/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SW4PHEDH DS    XL8                                                              
SW4PHED  DS    CL13     4    2   13  A  P H             T        Y              
SW4SSNH  DS    XL8                                                              
SW4SSN   DS    CL9      4   20    9  N  U N             T        Y   96         
SW4SSNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      4   31    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      4   38    4  A  P N             T        Y              
SW4TYPEH DS    XL8                                                              
SW4TYPE  DS    CL1      4   48    1  A  U N             T        Y   51         
SW4TYPEX DS    XL8                                                              
SW4PAYEH DS    XL8                                                              
SW4PAYE  DS    CL20     4   53   20  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL10     5    2   10  A  P H             T        Y              
SW4NAM1H DS    XL8                                                              
SW4NAM1  DS    CL16     5   20   16  A  U N             T        Y   95         
SW4NAM1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P H             T        Y              
SW4NAM3H DS    XL8                                                              
SW4NAM3  DS    CL16     5   48   16  A  U N             T        Y   80         
SW4NAM3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
SW4NAM2H DS    XL8                                                              
SW4NAM2  DS    CL16     6   20   16  A  U N             T        Y   81         
SW4NAM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P H             T        Y              
SW4NAM4H DS    XL8                                                              
SW4NAM4  DS    CL4      6   48    4  A  U N             T        Y   82         
SW4NAM4X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     6   53   12  A  P N             T        Y              
SW4PHONH DS    XL8                                                              
SW4PHON  DS    CL12     6   66   12  A  U N             T        Y   52         
SW4PHONX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
SW4AKA1H DS    XL8                                                              
SW4AKA1  DS    CL16     7   20   16  A  U N             T        Y    3         
SW4AKA1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   38    8  A  P N             T        Y              
SW4AKA2H DS    XL8                                                              
SW4AKA2  DS    CL16     7   48   16  A  U N             T        Y   83         
SW4AKA2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     8    2   16  A  P N             T        Y              
SW4CRPNH DS    XL8                                                              
SW4CRPN  DS    CL32     8   20   32  A  U N             T        Y    5         
SW4CRPNX DS    XL8                                                              
SW4IHEDH DS    XL8                                                              
SW4IHED  DS    CL9      8   53    9  A  P N             T        Y              
SW4ISSH  DS    XL8                                                              
SW4ISS   DS    CL9      8   63    9  A  P N             T        Y              
SW4ISSNH DS    XL8                                                              
SW4ISSN  DS    CL1      8   73    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P H             T        Y              
SW4ADDRH DS    XL8                                                              
SW4ADDR  DS    CL30     9   12   30  A  U N             T        Y   10         
SW4ADDRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   44    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     9   46   30  A  U N             T        Y   84         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     10   10    1  A  P N             T        Y              
SW4ADD3H DS    XL8                                                              
SW4ADD3  DS    CL30    10   12   30  A  U N             T        Y   85         
SW4ADD3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     11    7    4  A  P N             T        Y              
SW4ADDCH DS    XL8                                                              
SW4ADDC  DS    CL25    11   12   25  A  U N             T        Y   65         
SW4ADDCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     11   38    5  A  P N             T        Y              
SW4ADDSH DS    XL8                                                              
SW4ADDS  DS    CL2     11   44    2  A  U N             T        Y   66         
SW4ADDSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11   47    3  A  P N             T        Y              
SW4ADDZH DS    XL8                                                              
SW4ADDZ  DS    CL10    11   51   10  A  U N             T        Y   67         
SW4ADDZX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11   63    7  A  P N             T        Y              
SW4CTRYH DS    XL8                                                              
SW4CTRY  DS    CL2     11   72    2  A  U N             T        Y   68         
SW4CTRYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P H             T        Y              
SW4SEXH  DS    XL8                                                              
SW4SEX   DS    CL1     12   12    1  A  U N             T        Y   11         
SW4SEXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   20    3  A  P N             T        Y              
SW4ETHH  DS    XL8                                                              
SW4ETH   DS    CL2     12   26    2  A  U N             T        Y   13         
SW4ETHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     12   38    7  A  P N             T        Y              
SW4FILTH DS    XL8                                                              
SW4FILT  DS    CL4     12   46    4  A  U N             T        Y   19         
SW4FILTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   63    4  A  P N             T        Y              
SW4FREQH DS    XL8                                                              
SW4FREQ  DS    CL1     12   69    1  A  U N             T        Y   15         
SW4FREQX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
SW4CIDH  DS    XL8                                                              
SW4CID   DS    CL9     13   20    9  N  U N             T        Y   17         
SW4CIDX  DS    XL8                                                              
SW4CIDNH DS    XL8                                                              
SW4CIDN  DS    CL1     13   30    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   38   12  A  P N             T        Y              
SW4INDH  DS    XL8                                                              
SW4IND   DS    CL8     13   53    8  A  U N             T        Y   18         
SW4INDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     13   63    9  A  P N             T        Y              
SW4LOCLH DS    XL8                                                              
SW4LOCL  DS    CL3     13   74    3  A  U N             T        Y   61         
SW4LOCLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    14    2   17  A  P N             T        Y              
SW4MEMH  DS    XL8                                                              
SW4MEM   DS    CL9     14   20    9  A  U N             T        Y   21         
SW4MEMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     14   38    6  A  P N             T        Y              
SW4STATH DS    XL8                                                              
SW4STAT  DS    CL34    14   46   34  A  U H             T        Y   22         
SW4STATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    15    2   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL32    15   20   32  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL22    15   57   22  A  P N             T        Y              
SW4SLETH DS    XL8                                                              
SW4SLET  DS    CL1     15   80    1  A  U N             T        Y   72         
SW4SLETX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  P H             T        Y              
SW4FEDH  DS    XL8                                                              
SW4FED   DS    CL3     16   20    3  A  U N             T        Y   46         
SW4FEDX  DS    XL8                                                              
SW4FMSH  DS    XL8                                                              
SW4FMS   DS    CL1     16   31    1  A  U N             T        Y   50         
SW4FMSX  DS    XL8                                                              
SW4FEXMH DS    XL8                                                              
SW4FEXM  DS    CL3     16   38    3  N  U N             T        Y   54         
SW4FEXMX DS    XL8                                                              
SW4FFIXH DS    XL8                                                              
SW4FFIX  DS    CL6     16   46    6  A  U N             T        Y   58         
SW4FFIXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   57    8  A  P N             T        Y              
SW4MERNH DS    XL8                                                              
SW4MERN  DS    CL11    16   66   11  A  U N             T        Y   73         
SW4MERNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     17    2    5  A  P H             T        Y              
SW4SSTAH DS    XL8                                                              
SW4SSTA  DS    CL3     17   20    3  A  U N             T        Y   87         
SW4SSTAX DS    XL8                                                              
SW4SMSH  DS    XL8                                                              
SW4SMS   DS    CL1     17   31    1  A  U N             T        Y   88         
SW4SMSX  DS    XL8                                                              
SW4SEXMH DS    XL8                                                              
SW4SEXM  DS    CL3     17   38    3  N  U N             T        Y   89         
SW4SEXMX DS    XL8                                                              
SW4SFIXH DS    XL8                                                              
SW4SFIX  DS    CL6     17   46    6  A  U N             T        Y   90         
SW4SFIXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    17   57   16  A  P N             T        Y              
SW4RECPH DS    XL8                                                              
SW4RECP  DS    CL2     17   74    2  A  U N             T        Y   47         
SW4RECPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18    2    4  A  P N             T        Y              
SW4CITYH DS    XL8                                                              
SW4CITY  DS    CL3     18   20    3  A  U N             T        Y   91         
SW4CITYX DS    XL8                                                              
SW4CMSH  DS    XL8                                                              
SW4CMS   DS    CL1     18   31    1  A  U N             T        Y   92         
SW4CMSX  DS    XL8                                                              
SW4CEXMH DS    XL8                                                              
SW4CEXM  DS    CL3     18   38    3  N  U N             T        Y   93         
SW4CEXMX DS    XL8                                                              
SW4CFIXH DS    XL8                                                              
SW4CFIX  DS    CL6     18   46    6  A  U N             T        Y   94         
SW4CFIXX DS    XL8                                                              
SW4FTXTH DS    XL8                                                              
SW4FTXT  DS    CL14    18   57   14  A  P N             T        Y              
SW4FTXH  DS    XL8                                                              
SW4FTX   DS    CL1     18   74    1  A  U N             T        Y   74         
SW4FTXX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    19    2   13  A  P N             T        Y              
SW4DOBH  DS    XL8                                                              
SW4DOB   DS    CL8     19   16    8  A  U N             T        Y   70         
SW4DOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     19   25    8  A  P N             T        Y              
SW4PDEDH DS    XL8                                                              
SW4PDED  DS    CL6     19   40    6  A  U N             T        Y   71         
SW4PDEDX DS    XL8                                                              
SW4THEDH DS    XL8                                                              
SW4THED  DS    CL11    19   47   11  A  P N             T        Y              
SW4TSSNH DS    XL8                                                              
SW4TSSN  DS    CL9     19   59    9  A  U N             T        Y   97         
SW4TSSNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   69    3  A  P N             T        Y              
SW4NHAH  DS    XL8                                                              
SW4NHA   DS    CL8     19   73    8  A  U N             T        Y   98         
SW4NHAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    20    2   10  A  P N             T        Y              
SW4MPRFH DS    XL8                                                              
SW4MPRF  DS    CL6     20   16    6  A  U N             T        Y   59         
SW4MPRFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    20   25   14  A  P N             T        Y              
SW4PCHRH DS    XL8                                                              
SW4PCHR  DS    CL6     20   40    6  A  U N             T        Y   55         
SW4PCHRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    20   47   14  A  P N             T        Y              
SW4GSTH  DS    XL8                                                              
SW4GST   DS    CL10    20   62   10  A  U N             T        Y   62         
SW4GSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
SW4COMMH DS    XL8                                                              
SW4COMM  DS    CL69    21   11   69  A  U H             T        Y   63         
SW4COMMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
SW4LCHGH DS    XL8                                                              
SW4LCHG  DS    CL17    22   16   17  A  P N             T        Y              
SW4LIENH DS    XL8                                                              
SW4LIEN  DS    CL14    22   45   14  A  P Z             T        Y              
SW4DUEH  DS    XL8                                                              
SW4DUE   DS    CL18    22   60   18  A  P Z             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL75    24    2   75  A  P H             T        Y              
SW4LAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SW4WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2424 BYTES                            
