*          DATA SET TASCRF5D   AT LEVEL 006 AS OF 07/31/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2F5D      DATE 07/31/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P H             T        Y              
PL2CHKH  DS    XL8                                                              
PL2CHK   DS    CL8      4   10    8  A  U N             T        Y  160         
PL2CHKX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      4   19    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P N             T        Y              
PL2SSNH  DS    XL8                                                              
PL2SSN   DS    CL9      4   28    9  A  U N             T        Y   96         
PL2SSNX  DS    XL8                                                              
PL2SSNNH DS    XL8                                                              
PL2SSNN  DS    CL16     4   38   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      4   63    3  A  P N             T        Y              
PL2EMPH  DS    XL8                                                              
PL2EMP   DS    CL3      4   70    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
PL2CHKDH DS    XL8                                                              
PL2CHKD  DS    CL8      5   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   20    3  A  P N             T        Y              
PL2NETH  DS    XL8                                                              
PL2NET   DS    CL11     5   28   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   63    3  A  P N             T        Y              
PL2CURH  DS    XL8                                                              
PL2CUR   DS    CL1      5   70    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PL2CRPH  DS    XL8                                                              
PL2CRP   DS    CL9      6   10    9  A  U N             T        Y   97         
PL2CRPX  DS    XL8                                                              
PL2CRPNH DS    XL8                                                              
PL2CRPN  DS    CL16     6   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      6   38    5  A  P N             T        Y              
PL2NCDEH DS    XL8                                                              
PL2NCDE  DS    CL4      6   48    4  A  U N             T        Y   80         
PL2NCDEX DS    XL8                                                              
PL2NCDNH DS    XL8                                                              
PL2NCDN  DS    CL16     6   53   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
PL2AGYH  DS    XL8                                                              
PL2AGY   DS    CL6      7   10    6  A  U N             T        Y   16         
PL2AGYX  DS    XL8                                                              
PL2AGYNH DS    XL8                                                              
PL2AGYN  DS    CL16     7   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7   38    7  A  P N             T        Y              
PL2INVH  DS    XL8                                                              
PL2INV   DS    CL6      7   48    6  A  U N             T        Y  144         
PL2INVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
PL2PLDTH DS    XL8                                                              
PL2PLDT  DS    CL8      9   12    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   25   10  A  P N             T        Y              
PL2URGTH DS    XL8                                                              
PL2URGT  DS    CL1      9   45    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   50    9  A  P N             T        Y              
PL2ONVTH DS    XL8                                                              
PL2ONVT  DS    CL1      9   60    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13    2   13  A  P N             T        Y              
PL2NPAYH DS    XL8                                                              
PL2NPAY  DS    CL53    13   27   53  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
PL2SADDH DS    XL8                                                              
PL2SADD  DS    CL53    14   27   53  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL24    15    2   24  A  P N             T        Y              
PL2CCPCH DS    XL8                                                              
PL2CCPC  DS    CL53    15   27   53  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    19    2   20  A  P N             T        Y              
PL2RQMBH DS    XL8                                                              
PL2RQMB  DS    CL8     19   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   38    4  A  P N             T        Y              
PL2RQMDH DS    XL8                                                              
PL2RQMD  DS    CL8     19   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    20    2   13  A  P N             T        Y              
PL2LCHPH DS    XL8                                                              
PL2LCHP  DS    CL8     20   23    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   38    4  A  P N             T        Y              
PL2LCHDH DS    XL8                                                              
PL2LCHD  DS    CL8     20   43    8  A  P N             T        Y              
PL2PF13H DS    XL8                                                              
PL2PF13  DS    CL18    24    2   18  A  P H             T        Y              
PL2PF15H DS    XL8                                                              
PL2PF15  DS    CL17    24   38   17  A  P Z             T        Y              
PL2PF16H DS    XL8                                                              
PL2PF16  DS    CL8     24   58    8  A  P Z             T        Y              
PL2LAST  DS    XL1                                                              
         DS    XL2    INDICS= X                                                 
PL2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 984  BYTES                            
