*          DATA SET TASCRBAD   AT LEVEL 013 AS OF 10/26/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2BAD      DATE 10/26/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
SCOAGYH  DS    CL8                                                              
SCOAGY   DS    CL6      5   16    6  A  U N             T        Y   16         
SCOAGYX  DS    CL8                                                              
SCOAGYNH DS    CL8                                                              
SCOAGYN  DS    CL16     5   28   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     6    2   13  A  P H             T        Y              
SCOCIDH  DS    CL8                                                              
SCOCID   DS    CL12     6   16   12  A  U N             T        Y   64         
SCOCIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
SCOCIDNH DS    CL8                                                              
SCOCIDN  DS    CL36     8   16   36  A  U N             T        Y    6         
SCOCIDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  P H             T        Y              
SCOCLIH  DS    CL8                                                              
SCOCLI   DS    CL6     10   16    6  A  U N             T        Y   32         
SCOCLIX  DS    CL8                                                              
SCOCLINH DS    CL8                                                              
SCOCLIN  DS    CL16    10   24   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A  P H             T        Y              
SCOPRDH  DS    CL8                                                              
SCOPRD   DS    CL6     11   16    6  A  U N             T        Y   48         
SCOPRDX  DS    CL8                                                              
SCOPRDNH DS    CL8                                                              
SCOPRDN  DS    CL16    11   24   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   49    6  A  U N             T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    11   57   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   16    6  A  U N             T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   24   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   49    6  A  U N             T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   57   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   16    6  A  U N             T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   24   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   49    6  A  U N             T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   57   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
SCOPHOH  DS    CL8                                                              
SCOPHO   DS    CL9     15   16    9  A  U N             T        Y   96         
SCOPHOX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     15   28    4  A  P N             T        Y              
SCOPHONH DS    CL8                                                              
SCOPHON  DS    CL16    15   33   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
SCOSVCH  DS    CL8                                                              
SCOSVC   DS    CL6     16   16    6  A  U N             T        Y   17         
SCOSVCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     16   28    4  A  P N             T        Y              
SCOSVCNH DS    CL8                                                              
SCOSVCN  DS    CL16    16   33   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    18    2   10  A  P N             T        Y              
SCOSDTEH DS    CL8                                                              
SCOSDTE  DS    CL8     18   16    8  A  U N             T        Y   37         
SCOSDTEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18   28   12  A  P N             T        Y              
SCOSSTUH DS    CL8                                                              
SCOSSTU  DS    CL12    18   41   12  A  U N             T        Y   21         
SCOSSTUX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18   57   10  A  P N             T        Y              
SCOSCITH DS    CL8                                                              
SCOSCIT  DS    CL12    18   68   12  A  U N             T        Y   43         
SCOSCITX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
SCOSTATH DS    CL8                                                              
SCOSTAT  DS    CL40    19   16   40  A  U H             T        Y   38         
SCOSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
SCOATTH  DS    CL8                                                              
SCOATT   DS    CL2     20   16    2  A  U N             T        Y   28         
SCOATTX  DS    CL8                                                              
SCOATTNH DS    CL8                                                              
SCOATTN  DS    CL16    20   28   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   57    7  A  P N             T        Y              
SCOFILTH DS    CL8                                                              
SCOFILT  DS    CL4     20   65    4  A  U N             T        Y   47         
SCOFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
SCOCOMMH DS    CL8                                                              
SCOCOMM  DS    CL60    21   16   60  A  U H             T        Y   99         
SCOCOMMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    23    2   13  A  P N             T        Y              
SCOLCHGH DS    CL8                                                              
SCOLCHG  DS    CL17    23   16   17  A  P N             T        Y              
SCOCOMH  DS    CL8                                                              
SCOCOM   DS    CL10    23   57   10  A  P Z             T        Y              
SCOPF1H  DS    CL8                                                              
SCOPF1   DS    CL34    24    2   34  A  P H             T        Y              
SCOLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SCOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1200 BYTES                            
