*          DATA SET TASCRBDD   AT LEVEL 010 AS OF 11/21/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F2BDD      DATE 11/21/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
SECPROGH DS    CL8                                                              
SECPROG  DS    CL3      5   10    3  A   U    N         T        Y    1         
SECPROGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
SECRECH  DS    CL8                                                              
SECREC   DS    CL8      6   10    8  A   U    N         T        Y    2         
SECRECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
SECACTH  DS    CL8                                                              
SECACT   DS    CL8      7   10    8  A   U    N         T        Y    3         
SECACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A   P    H         T        Y              
SECCATH  DS    CL8                                                              
SECCAT   DS    CL50     9   16   50  A   U    N         T        Y    5         
SECCATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    11    2   13  A   P    N         T        Y              
SECLCHGH DS    CL8                                                              
SECLCHG  DS    CL17    11   16   17  A   P    N         T        Y              
SECPFH   DS    CL8                                                              
SECPF    DS    CL18    24    2   18  A   P    H         T        Y              
SECLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
SECWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 280  BYTES                            
