*          DATA SET TASCR89D   AT LEVEL 002 AS OF 01/16/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T7F289D      DATE 01/16/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL1      4    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     5    2   12  A  P N             T        Y              
SSCUSBKH DS    XL8                                                              
SSCUSBK  DS    CL6      5   20    6  A  P N             T        Y    6         
SSCUSBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     5   28   10  A  P H             T        Y              
SSCUSSTH DS    XL8                                                              
SSCUSST  DS    CL8      5   42    8  N  U N             T        Y   10         
SSCUSSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15     6    2   15  A  P N             T        Y              
SSCCNBKH DS    XL8                                                              
SSCCNBK  DS    CL6      6   20    6  A  P N             T        Y   14         
SSCCNBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     6   28   10  A  P H             T        Y              
SSCCNSTH DS    XL8                                                              
SSCCNST  DS    CL8      6   42    8  N  U N             T        Y   18         
SSCCNSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
SSCEUBKH DS    XL8                                                              
SSCEUBK  DS    CL6      7   20    6  A  P N             T        Y   37         
SSCEUBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   28   10  A  P H             T        Y              
SSCEUSTH DS    XL8                                                              
SSCEUST  DS    CL8      7   42    8  N  U N             T        Y   26         
SSCEUSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
SSCPCBKH DS    XL8                                                              
SSCPCBK  DS    CL6      8   20    6  A  P N             T        Y   28         
SSCPCBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   28   10  A  P H             T        Y              
SSCPCSTH DS    XL8                                                              
SSCPCST  DS    CL8      8   42    8  N  U N             T        Y   30         
SSCPCSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
SSCLCBKH DS    XL8                                                              
SSCLCBK  DS    CL6      9   20    6  A  P N             T        Y   31         
SSCLCBKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   28   10  A  P H             T        Y              
SSCLCSTH DS    XL8                                                              
SSCLCST  DS    CL8      9   42    8  N  U N             T        Y   32         
SSCLCSTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    11    2   13  A  P N             T        Y              
SSCLCHGH DS    XL8                                                              
SSCLCHG  DS    CL17    11   20   17  A  P N             T        Y              
SSCLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
SSCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 488  BYTES                            
