*          DATA SET TASYSMAJS  AT LEVEL 064 AS OF 11/30/89                      
*              TABLE OF VALID MAJOR EXPRESSIONS                                 
         SPACE 1                                                                
*                                  BYTES 1-9 = CHARACTER EXPRESSION             
TAMAJS   DS    0CL10               BYTE  10  = EQUATE                           
         DC    CL9'NONE     ',AL1(0)                                            
         DC    CL9'NY       ',AL1(NY)                                           
         DC    CL9'LA       ',AL1(LA)                                           
         DC    CL9'CHI      ',AL1(CHI)                                          
         DC    CL9'CH       ',AL1(CHI)                                          
         DC    CL9'C        ',AL1(CHI)                                          
         DC    CL9'NY+LA    ',AL1(NY+LA)                                        
         DC    CL9'NY+CHI   ',AL1(NY+CHI)                                       
         DC    CL9'LA+CHI   ',AL1(LA+CHI)                                       
         DC    CL9'LA+NY    ',AL1(NY+LA)                                        
         DC    CL9'CHI+NY   ',AL1(NY+CHI)                                       
         DC    CL9'CHI+LA   ',AL1(LA+CHI)                                       
         DC    CL9'NL       ',AL1(NY+LA)                                        
         DC    CL9'NC       ',AL1(NY+CHI)                                       
         DC    CL9'CL       ',AL1(LA+CHI)                                       
         DC    CL9'LN       ',AL1(NY+LA)                                        
         DC    CL9'CN       ',AL1(NY+CHI)                                       
         DC    CL9'LC       ',AL1(LA+CHI)                                       
         DC    CL9'NY+CHI+LA',AL1(NY+LA+CHI)                                    
         DC    CL9'ALL      ',AL1(NY+LA+CHI)                                    
         DC    CL9'NCL      ',AL1(NY+LA+CHI)                                    
         DC    CL9'NLC      ',AL1(NY+LA+CHI)                                    
         DC    CL9'CNL      ',AL1(NY+LA+CHI)                                    
         DC    CL9'CLN      ',AL1(NY+LA+CHI)                                    
         DC    CL9'LNC      ',AL1(NY+LA+CHI)                                    
         DC    CL9'LCN      ',AL1(NY+LA+CHI)                                    
         DC    X'FF'                                                            
