*          DATA SET TASYSEDT   AT LEVEL 011 AS OF 05/17/04                      
*                                                                               
*          TABLE OF EDIT TYPES BY COMPLEMENTED YEAR                             
*                                                                               
TAEDTYP  DS    0CL3                                                             
         DC    X'6E',AL2(YR1991-TAEDTYP)                                        
         DC    X'6B',AL2(YR1994-TAEDTYP)                                        
         DC    X'68',AL2(YR1997-TAEDTYP)                                        
         DC    X'5F',AL2(YR2000-TAEDTYP)                                        
         DC    X'5C',AL2(YR2003-TAEDTYP)                                        
         DC    X'FF'                                                            
*                                                                               
YR1991   DC    CL6'T 26-A'                                                      
         DC    CL6'T 26-B'                                                      
         DC    CL6'T 26-C'                                                      
         DC    CL6'T 26-D'                                                      
         DC    CL6'T 26-E'                                                      
         DC    CL6'T 26-F'                                                      
         DC    CL6'T 26-G'                                                      
         DC    CL6'T 26-H'                                                      
         DC    CL6'T 26-I'                                                      
         DC    CL6'T 26-J'                                                      
         DC    X'FF'                                                            
*                                                                               
YR1994   DC    CL6'CC'                                                          
         DC    CL6'NONSAG'                                                      
         DC    CL6'R 22-A'                                                      
         DC    CL6'R 22-B'                                                      
         DC    CL6'R 22-C'                                                      
         DC    CL6'R 22-D'                                                      
         DC    CL6'R 22-E'                                                      
         DC    CL6'T 26-A'                                                      
         DC    CL6'T 26-B'                                                      
         DC    CL6'T 26-C'                                                      
         DC    CL6'T 26-D'                                                      
         DC    CL6'T 26-E'                                                      
         DC    CL6'T 26-F'                                                      
         DC    CL6'T 26-G'                                                      
         DC    CL6'T 26-H'                                                      
         DC    CL6'T 26-I'                                                      
         DC    CL6'T 26-J'                                                      
         DC    X'FF'                                                            
*                                                                               
YR1997   DC    CL6'CC'                                                          
         DC    CL6'NONSAG'                                                      
         DC    CL6'R 22-A'                                                      
         DC    CL6'R 22-B'                                                      
         DC    CL6'R 22-C'                                                      
         DC    CL6'R 22-D'                                                      
         DC    CL6'R 22-E'                                                      
         DC    CL6'R 22-F'                                                      
         DC    CL6'R 22-G'                                                      
         DC    CL6'T 26-A'                                                      
         DC    CL6'T 26-B'                                                      
         DC    CL6'T 26-C'                                                      
         DC    CL6'T 26-D'                                                      
         DC    CL6'T 26-E'                                                      
         DC    CL6'T 26-F'                                                      
         DC    CL6'T 26-G'                                                      
         DC    CL6'T 26-H'                                                      
         DC    CL6'T 26-I'                                                      
         DC    CL6'T 26-J'                                                      
         DC    CL6'T 26-K'                                                      
         DC    X'FF'                                                            
*                                                                               
YR2000   DC    CL6'CC'                                                          
         DC    CL6'NONSAG'                                                      
         DC    CL6'R 23-A'                                                      
         DC    CL6'R 23-B'                                                      
         DC    CL6'R 23-C'                                                      
         DC    CL6'R 23-D'                                                      
         DC    CL6'R 23-E'                                                      
         DC    CL6'R 23-F'                                                      
         DC    CL6'R 23-G'                                                      
         DC    CL6'T 22-G'                                                      
         DC    CL6'T 26-A'                                                      
         DC    CL6'T 26-B'                                                      
         DC    CL6'T 26-C'                                                      
         DC    CL6'T 26-D'                                                      
         DC    CL6'T 26-E'                                                      
         DC    CL6'T 26-F'                                                      
         DC    CL6'T 26-G'                                                      
         DC    CL6'T 26-H'                                                      
         DC    CL6'T 26-I'                                                      
         DC    CL6'T 26-J'                                                      
         DC    CL6'T 26-K'                                                      
         DC    X'FF'                                                            
*                                                                               
YR2003   DC    CL6'CC'                                                          
         DC    CL6'NONSAG'                                                      
         DC    CL6'R 23-A'                                                      
         DC    CL6'R 23-B'                                                      
         DC    CL6'R 23-C'                                                      
         DC    CL6'R 23-D'                                                      
         DC    CL6'R 23-E'                                                      
         DC    CL6'R 23-F'                                                      
         DC    CL6'R 23-G'                                                      
         DC    CL6'T 22-G'                                                      
         DC    CL6'T 26-A'                                                      
         DC    CL6'T 26-B'                                                      
         DC    CL6'T 26-C'                                                      
         DC    CL6'T 26-D'                                                      
         DC    CL6'T 26-E'                                                      
         DC    CL6'T 26-F'                                                      
         DC    CL6'T 26-G'                                                      
         DC    CL6'T 26-H'                                                      
         DC    CL6'T 26-I'                                                      
         DC    CL6'T 26-J'                                                      
         DC    CL6'T 26-K'                                                      
         DC    X'FF'                                                            
