*          DATA SET TASYSSTAFS AT LEVEL 007 AS OF 09/14/95                      
         SPACE 2                                                                
*              STAFF TYPE TABLE                                                 
         SPACE 1                                                                
TASTAFS  DS    0C                                                               
         DC    AL1(TASTTYPP,SECMASK1-SECMASKS,BP),B'11111111'                   
         DC    CL16'PROGRAMMER'                                                 
         DC    AL1(TASTTYP2,SECMASK1-SECMASKS,B2),B'01111111'                   
         DC    CL16'SYSTEM MANAGER'                                             
         DC    AL1(TASTTYP3,SECMASK1-SECMASKS,B3),B'00111111'                   
         DC    CL16'LEVEL 3'                                                    
         DC    AL1(TASTTYPM,SECMASK1-SECMASKS,BM),B'00111111'                   
         DC    CL16'ADMINISTRATION'                                             
         DC    AL1(TASTTYP4,SECMASK1-SECMASKS,B4),B'00010101'                   
         DC    CL16'LEVEL 4'                                                    
         DC    AL1(TASTTYP5,SECMASK1-SECMASKS,B5),B'00000101'                   
         DC    CL16'LEVEL 5'                                                    
         DC    AL1(TASTTYP6,SECMASK1-SECMASKS,B6),B'00000001'                   
         DC    CL16'LEVEL 6'                                                    
         SPACE 1                                                                
         DC    AL1(TASTTYP7,SECMASK2-SECMASKS,B7),B'00000001'                   
         DC    CL16'LEVEL 7'                                                    
         DC    AL1(TASTTYP8,SECMASK2-SECMASKS,B8),B'00000001'                   
         DC    CL16'LEVEL 8'                                                    
         DC    AL1(TASTTYPA,SECMASK2-SECMASKS,BAA),B'00000010'                  
         DC    CL16'ACCOUNTING'                                                 
         DC    AL1(TASTTYPB,SECMASK2-SECMASKS,BB),B'00001010'                   
         DC    CL16'ACCOUNTING MGR'                                             
         SPACE 1                                                                
         DC    AL1(TASTTYPC,SECMASK3-SECMASKS,BC),B'00000001'                   
         DC    CL16'CLIENT'                                                     
         DC    AL1(TASTTYPO,SECMASK3-SECMASKS,BO),B'00000001'                   
         DC    CL16'OPERATOR'                                                   
         DC    AL1(TASTTYPD,SECMASK3-SECMASKS,BD),B'00000001'                   
         DC    CL16'CLIENT 2'                                                   
         DC    AL1(TASTTYPF,SECMASK3-SECMASKS,BF),B'00000001'                   
         DC    CL16'CLIENT 3'                                                   
         SPACE 1                                                                
         DC    X'FF'                                                            
