*          DATA SET TASYSCONT  AT LEVEL 001 AS OF 12/02/13                      
         SPACE 2                                                                
*              EXPANSION OF CONTRACT TYPES                                      
         SPACE 1                                                                
TACONTS  DS    0XL14                                                            
         DC    AL1(CONTUAS),CL13'UNASSIGNED'                                    
         DC    AL1(CONTCOM),CL13'COMMERCIALS'                                   
         DC    AL1(CONTCEN),CL13'CP/ED NON-BRD'                                 
         DC    AL1(CONTINT),CL13'IACTIVE MEDIA'                                 
         DC    AL1(CONTMUV),CL13'MUSIC VIDEO'                                   
         DC    AL1(CONTNMD),CL13'NEW MEDIA'                                     
         DC    AL1(CONTTHE),CL13'THEATRICAL'                                    
         DC    AL1(CONTTEL),CL13'TV'                                            
         DC    X'FF'                                                            
