*          DATA SET TASYSCCTYP AT LEVEL 013 AS OF 09/26/14                      
         SPACE 2                                                                
*              EXPANSION OF CANADIAN COMMERCIAL TYPES                           
         SPACE 1                                                                
TACTYPS  DS    0CL17                                                            
         DC    CL4'AUD ',AL1(CCTYAUD),CL12'AUDITION'                            
         DC    CL4'BBRD',AL1(CCTYBBRD),CL12'BILLBOARD'                          
         DC    CL4'DEMO',AL1(CCTYDEMO),CL12'DEMO'                               
         DC    CL4'DLR ',AL1(CCTYDEAL),CL12'DEALER'                             
         DC    CL4'LOCL',AL1(CCTYLOCL),CL12'LOCAL'                              
         DC    CL4'NATL',AL1(CCTYNATL),CL12'NATIONAL'                           
         DC    CL4'PSA ',AL1(CCTYPSA),CL12'PUB SERV ANN'                        
         DC    CL4'R1  ',AL1(CCTYR1),CL12'LOC/RG CAT 1'                         
         DC    CL4'R2  ',AL1(CCTYR2),CL12'LOC/RG CAT 2'                         
         DC    CL4'R3  ',AL1(CCTYR3),CL12'LOC/RG CAT 3'                         
         DC    CL4'S7  ',AL1(CCTYS7),CL12'SHRT LIF 7  '                         
         DC    CL4'S14 ',AL1(CCTYS14),CL12'SHRT LIF 14 '                        
         DC    CL4'S31 ',AL1(CCTYS31),CL12'SHRT LIF 31 '                        
         DC    CL4'S45 ',AL1(CCTYS45),CL12'SHRT LIF 45 '                        
         DC    CL4'TAG ',AL1(CCTYTAG),CL12'TAG'                                 
         DC    CL4'04A ',AL1(CCTY04A),CL12'2404A'                               
         DC    CL4'04B ',AL1(CCTY04B),CL12'2404B'                               
         DC    CL4'VDO ',AL1(CCTYVDO),CL12'VIDEO'                               
         DC    CL4'ADO ',AL1(CCTYADO),CL12'AUDIO'                               
         DC    CL4'2404',AL1(CCTY2404),CL12'2404'                               
         DC    X'FF'                                                            
