*          DATA SET TASYSUNITD AT LEVEL 007 AS OF 03/26/10                      
         SPACE 1                                                                
*              DSECT TO COVER TALENT UNITS                                      
         SPACE 1                                                                
TALUNITD DSECT                                                                  
TALUNAME DS    CL8                 EXPANDED NAME                                
TALUCODE DS    CL3                 ALLTAX CODE                                  
TALUGATE DS    CL2                 GATES/MCDONALD STATE NUMBER                  
TALUNUM  DS    CL2                 NUMERIC CODE                                 
TALUZIPF DS    CL3                 FIRST 3 ZIP DIGITS FROM                      
TALUZIPT DS    CL3                 FIRST 3 ZIP DIGITS TO                        
TALUSTAT DS    XL1                 STATUS                                       
TALUNTAX EQU   X'80'               NO INCOME TAX WITHHOLDING FOR STATE          
TALUOKAD EQU   X'40'               ADDENDUM RATES INSTALLED FOR STATE           
TALUSRND EQU   X'20'               INCOME TAX ROUNDING REQUIRED FOR ST          
TASUINGF EQU   X'10'               INVALID GOING FORWARD                        
TALUNEXT EQU   *                                                                
