*          DATA SET TASYSTHRES AT LEVEL 024 AS OF 03/27/96                      
         SPACE 1                                                                
*              TALENT SYSTEM THRESHOLD CUT-OFFS                                 
         SPACE 2                                                                
TATHRES  DC    AL4(120000),AL4(90000),X'820101',X'890625'                       
         DC    AL4(150000),AL4(120000),X'890626',X'901115'                      
         DC    AL4(160000),AL4(130000),X'901116',X'930331'                      
         DC    AL4(200000),AL4(130000),X'930401',X'999999'                      
         DC    X'FF'                                                            
         SPACE 2                                                                
