*          DATA SET TASYSYEARS AT LEVEL 090 AS OF 05/16/16                      
         SPACE 2                                                                
***********************************************************************         
*        CHANGES TO THIS MODULE REQUIRE A RE-LINK OF TASYSTAB AND A   *         
*        PANACAT OF TALDYEARS.  THE LATTER REQUIRES A RE-LINK OF      *         
*        LMTALD (THE LOAD PROGRAM).  TASYSTAB MAY BE MADE LIVE BEFORE *         
*        LMTALD IF A NEW ENTRY WAS ADDED.  IF A CHANGE WAS MADE TO AN *         
*        EXISTING ENTRY, BOTH MUST BE MADE LIVE AT THE SAME TIME.     *         
***********************************************************************         
         SPACE 2                                                                
*              CONTRACT YEAR TABLE                                              
         SPACE 1                                                                
TAYEARS  DS    0C                                                               
         DC    C'75 ',AL1(CN75),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'00',AL2(0,0,0,0,0)                                             
                                                                                
         DC    C'77 ',AL1(CN77),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'00',AL2(0,0,0,0,0)                                             
                                                                                
         DC    C'79 ',AL1(CN79),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'00',AL2(0,0,0,0,0)                                             
                                                                                
         DC    C'80 ',AL1(CN80),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'00',AL2(0,0,0,0,0)                                             
                                                                                
         DC    C'81 ',AL1(CN81),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'64',AL2(00004000,0900,0850,0900,0850)                          
                                                                                
         DC    C'82 ',AL1(CN82),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'65',AL2(00000400,1000,0950,1000,0950)                          
                                                                                
         DC    C'83 ',AL1(CN83),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'66',AL2(00000500,1000,0950,1000,0950)                          
                                                                                
         DC    C'84 ',AL1(CN84),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'67',AL2(00000500,1000,0950,1000,0950)                          
                                                                                
         DC    C'85 ',AL1(CN85),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'67',AL2(00000600,1100,1050,1000,0950)                          
                                                                                
         DC    C'86 ',AL1(CN86),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'67',AL2(00000600,1100,1050,1000,0950)                          
                                                                                
         DC    C'87 ',AL1(CN87),AL1(ALL-AFM,ALL,ALL,ALL)                        
         DC    X'67',AL2(0700,1100,1050,1000,0950)                              
                                                                                
         DC    C'87 ',AL1(CN87),AL1(AFM+NON,ALL,ALL,ALL)                        
         DC    X'69',AL2(0700,1100,1050,1000,0950)                              
                                                                                
         DC    C'88 ',AL1(CN88),AL1(ALL-AFM,ALL,ALL,ALL)                        
         DC    X'69',AL2(0700,1150,1150,1000,0950)                              
                                                                                
         DC    C'89 ',AL1(CN89),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'69',AL2(00001000,1150,1150,1000,0950)                          
                                                                                
         DC    C'90 ',AL1(CN90),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'69',AL2(00001000,1150,1150,1000,0950)                          
                                                                                
         DC    C'91 ',AL1(CN91),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6A',AL2(00001200,1150,1250,1000,0950)                          
                                                                                
         DC    C'92 ',AL1(CN92),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6A',AL2(00001200,1250,1250,1000,0950)                          
                                                                                
         DC    C'93 ',AL1(CN93),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6C',AL2(00001200,1250,1250,1000,1000)                          
                                                                                
         DC    C'94 ',AL1(CN94),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6D',AL2(00001200,1265,1265,1000,1000)                          
                                                                                
         DC    C'95 ',AL1(CN95),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6D',AL2(00001200,1265,1265,1000,1000)                          
                                                                                
         DC    C'96 ',AL1(CN96),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6D',AL2(00001200,1265,1265,1000,1000)                          
                                                                                
         DC    C'97 ',AL1(CN97),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6E',AL2(00001300,1265,1265,1000,1000)                          
                                                                                
         DC    C'97S',AL1(CN97),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6E',AL2(00001300,1265,1265,1000,1000)                          
                                                                                
         DC    C'98 ',AL1(CN98),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6E',AL2(00001300,1265,1265,1000,1000)                          
                                                                                
         DC    C'99 ',AL1(CN99),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'6E',AL2(00001300,1265,1265,1000,1000)                          
                                                                                
         DC    C'00 ',AL1(CN00),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'61',AL2(00001300,1330,1330,1000,1000)                          
                                                                                
         DC    C'00A',AL1(CN00),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'61',AL2(00001300,1330,1330,1000,1000)                          
                                                                                
         DC    C'01 ',AL1(CN01),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'61',AL2(00001300,1330,1330,1000,1000)                          
                                                                                
         DC    C'02 ',AL1(CN02),AL1(AFM+ACT+AFT,ALL,ALL,ALL)                    
         DC    X'61',AL2(00001300,1330,1330,1000,1000)                          
                                                                                
         DC    C'03 ',AL1(CN03),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'62',AL2(00001300,1430,1430,1000,1000)                          
                                                                                
         DC    C'04 ',AL1(CN04),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'62',AL2(00001500,1430,1430,1200,1200)                          
                                                                                
         DC    C'05 ',AL1(CN05),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'62',AL2(00001500,1430,1430,1200,1200)                          
                                                                                
         DC    C'06 ',AL1(CN06),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'63',AL2(00001500,1480,1480,1200,1200)                          
                                                                                
         DC    C'07 ',AL1(CN07),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'63',AL2(00001700,1480,1480,1200,1200)                          
                                                                                
         DC    C'08 ',AL1(CN08),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'63',AL2(00001700,1480,1480,1200,1200)                          
                                                                                
         DC    C'09 ',AL1(CN09),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'F6',AL2(00001700,1550,1550,1200,1200)                          
                                                                                
         DC    C'10 ',AL1(CN10),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'F6',AL2(00001700,1550,1550,1200,1200)                          
                                                                                
         DC    C'11 ',AL1(CN11),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'F6',AL2(00001700,1550,1550,1200,1200)                          
                                                                                
         DC    C'12 ',AL1(CN12),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'F6',AL2(00001700,1550,1550,1200,1200)                          
                                                                                
         DC    C'13 ',AL1(CN13),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'8F',AL2(00001700,1680,1680,1408,1408)                          
                                                                                
         DC    C'14 ',AL1(CN14),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'8F',AL2(00002600,1680,1680,1650,1650)                          
                                                                                
         DC    C'15 ',AL1(CN15),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'8F',AL2(00002600,1680,1680,1650,1650)                          
                                                                                
         DC    C'16 ',AL1(CN16),AL1(ALL,ALL,ALL,ALL)                            
         DC    X'8E',AL2(00002600,1800,1800,1650,1650)                          
         DC    X'FF'                                                            
