*          DATA SET TASYSIERR  AT LEVEL 039 AS OF 03/04/13                      
         SPACE 2                                                                
*              ERROR CODES FOR INVOICES                                         
         SPACE 1                                                                
TAIERRS  DS    0CL37                                                            
         DC    AL1(TAINEINV),CL36'INVOICE IN ERROR'                             
         DC    AL1(TAINEAGY),CL36'BILL - NO AGENCY RECORD'                      
         DC    AL1(TAINEAYE),CL36'BILL - NO AGENCY ELEMENT'                     
         DC    AL1(TAINEPDI),CL36'BILL- NO PAYMENT DETAILS ELEMENT/INV'         
         DC    AL1(TAINEBRE),CL36'BILL - NO BILLING RULES ELEMENT'              
         DC    AL1(TAINECOM),CL36'CHK  - NO COMMERCIAL RECORD'                  
         DC    AL1(TAINEINT),CL36'BILL - NO INTERFACE RECORD'                   
         DC    AL1(TAINECLI),CL36'BILL - NO CLIENT RECORD'                      
         DC    AL1(TAINEPRD),CL36'BILL - NO PRODUCT RECORD'                     
         DC    AL1(TAINEATT),CL36'BILL - NO ATTENTION RECORD'                   
         DC    AL1(TAINEEMP),CL36'BILL - NO EMPLOYER OF RECORD RECORD'          
         DC    AL1(TAINEAMT),CL36'BILL - AMOUNTS DO NOT MATCH'                  
         DC    AL1(TAINECST),CL36'BILL - NO CAST ELEMENT'                       
         DC    AL1(TAINEPDC),CL36'BILL - NO PAYMENT DETAILS ELEM/CHECK'         
         DC    AL1(TAINEW4),CL36'BILL - NO W4 RECORD'                           
         DC    AL1(TAINEW4E),CL36'CHK - NO W4 ELEMENT'                          
         DC    AL1(TAINETID),CL36'BILL - NO TAX ID ELEMENT IN CHECK'            
         DC    AL1(TAINECTI),CL36'CHK NO COMMERCIAL TITLE ELEM/INVOICE'         
         DC    AL1(TAINECOI),CL36'BILL - NO COMML DETAIL ELEM/INVOICE'          
         DC    AL1(TAINEW4A),CL36'CHK - NO W4 ADDRESS ELEMENT'                  
         DC    AL1(TAINETAX),CL36'CHK - INVALID TAX UNIT IN CAST ELEM'          
         DC    AL1(TAINECRP),CL36'CHK - NO W4 RECORD FOR INDIV CORP'            
         DC    AL1(TAINEETI),CL36'CHK - NO EMPLOYER TAX ID ELEMENT'             
         DC    AL1(TAINEAN),CL36'CHK - NO AGENT RECORD'                         
         DC    AL1(TAINEANA),CL36'CHK - NO AGENT ADDRESS ELEMENT'               
         DC    AL1(TAINEDUE),CL36'CHK - NO DUE COMPANY DETAILS ELEMENT'         
         DC    AL1(TAINELNE),CL36'CHK - NO LIEN DETAILS ELEMENT'                
         DC    AL1(TAINENEG),CL36'CHK - CHECK AMT NEG AFTER DUE COMP'           
         DC    AL1(TAINELN),CL36'CHK - NO LIEN RECORD'                          
         DC    AL1(TAINECKY),CL36'CHK -NO CHECK YTD ELEMENT'                    
         DC    AL1(TAINECRC),CL36'CHK -INVALID CREDIT PAYMENT CHECK'            
         DC    AL1(TAINEGCK),CL36'GUAR APPLY - BAD CHECK RECORD'                
         DC    AL1(TAINEGGU),CL36'GUAR APPLY - BAD GUAR. RECORD'                
         DC    AL1(TAINEGTB),CL36'GUAR APPLY - NO ROOM IN GUAR TAB'             
         DC    AL1(TAINEGAP),CL36'GUAR APPLY - APPLY ERROR'                     
         DC    AL1(TAINECAG),CL36'CHK - NO AGENCY RECORD'                       
         DC    AL1(TAINECPI),CL36'CHK - NO PAYMENT DETAILS ELEM/INV'            
         DC    AL1(TAINECCL),CL36'CHK - NO CLIENT RECORD'                       
         DC    AL1(TAINECPR),CL36'CHK - NO PRODUCT RECORD'                      
         DC    AL1(TAINECEM),CL36'CHK - NO EMP OF RECORD RECORD'                
         DC    AL1(TAINECCA),CL36'CHK - CAST ELEMENT'                           
         DC    AL1(TAINECPC),CL36'CHK - NO PAYMENT DETAILS ELEM/CHECK'          
         DC    AL1(TAINECW4),CL36'CHK - W4 RECORD'                              
         DC    AL1(TAINECCO),CL36'CHK - NO COMML DETAILS ELEM/INVOICE'          
         DC    AL1(TAINECFD),CL36'CHK - NO FEDERAL WITHHLD ELEM IN W4'          
         DC    AL1(TAINEDU),CL36'CHK - NO DUE COMPANY RECORD'                   
         DC    AL1(TAINEIOI),CL36'CHK - NO ORIGINAL AGY/INV ELEMENT'            
         DC    AL1(TAINEMAT),CL36'CHK - W4 TYPE DOES NOT MATCH PAYMENT'         
         DC    AL1(TAINECAN),CL36'BILL - CANADIAN PAYMENT'                      
         DC    AL1(TAINEOFF),CL36'BILL - NO OFFICE RECORD'                      
         DC    AL1(TAINEIFE),CL36'BILL - NO INTERFACE ELEMENT'                  
         DC    AL1(TAINECKS),CL36'BILL - NO CHECK RECORDS'                      
         DC    AL1(TAINEINE),CL36'BILL - NO INVOICE ELEMENT'                    
         DC    AL1(TAINECNI),CL36'CHK - CANADIAN SET UP AS INDIVIDUAL'          
         DC    AL1(TAINEBTY),CL36'BILL - UNKNOWN BILLING TYPE'                  
         DC    AL1(TAINWGCN),CL36'GUAR APPLY - CANCEL AND BAL IS ZERO'          
         DC    AL1(TAINWGDU),CL36'GUAR APPLY - DUPLICATE CYCLE EXISTS'          
         DC    AL1(TAINEDU2),CL36'CHK - FLIST NOT FOUND ON DUE COMPANY'         
         DC    AL1(TAINEMS),CL36'BAD RECORD - AGENCY 8800 (EMS)'                
         DC    AL1(TAINEGGC),CL36'GUAR APPLY - BAD GCON RECORD'                 
         DC    AL1(TAINEBOM),CL36'BOVER BILLING TYPE MISMATCH'                  
         DC    AL1(TAINEME2),CL36'MISSING EVTIME2 FOR CANADIAN'                 
         DC    AL1(TAINECP),CL36'CHK - W4 MISSING PROVINCE CODE'                
         DC    X'FF'                                                            
