*          DATA SET TASYSCTRY  AT LEVEL 017 AS OF 07/31/14                      
*              TABLE OF VALID COUNTRIES AND THEIR PROVINCES                     
                                                                                
TACTRYS  DS    0C                                                               
                                                                                
         DC    AL1(CTRYUSX-*,0)                                                 
         DC    CL2'US',CL2'US',C'United States of America'                      
CTRYUSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCAX-*,PROVCA-*+1)                                        
         DC    CL2'CA',CL2'CA',C'Canada'                                        
PROVCA   DC    CL2'AB',CL5'T',C'ALBERTA '                                       
         DC    CL2'BC',CL5'V',C'BRIT COL'                                       
         DC    CL2'MB',CL5'R',C'MANITOBA'                                       
         DC    CL2'NB',CL5'E',C'NEW BRUN'                                       
         DC    CL2'NL',CL5'A',C'NEW FOUN'                                       
         DC    CL2'NS',CL5'B',C'NOVA SCO'                                       
         DC    CL2'NT',CL5'X',C'NW TERR '                                       
         DC    CL2'NU',CL5'X',C'NUNAVUT '                                       
         DC    CL2'ON',CL5'KLMNP',C'ONTARIO '                                   
         DC    CL2'PE',CL5'C',C'PEI     '                                       
         DC    CL2'QC',CL5'GHJ',C'QUEBEC  '                                     
         DC    CL2'SK',CL5'S',C'SASKATCH'                                       
         DC    CL2'YT',CL5'Y',C'YUKON   '                                       
CTRYCAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAFX-*,0)                                                 
         DC    CL2'AF',CL2'AF',C'Afghanistan'                                   
CTRYAFX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAXX-*,0)                                                 
         DC    CL2'AX',CL2'  ',C'Akrotiri Sovereign Base Area'                  
CTRYAXX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYALX-*,0)                                                 
         DC    CL2'AL',CL2'AL',C'Albania'                                       
CTRYALX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAGX-*,0)                                                 
         DC    CL2'AG',CL2'DZ',C'Algeria'                                       
CTRYAGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYANX-*,0)                                                 
         DC    CL2'AN',CL2'AD',C'Andorra'                                       
CTRYANX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAOX-*,0)                                                 
         DC    CL2'AO',CL2'AO',C'Angola'                                        
CTRYAOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAVX-*,0)                                                 
         DC    CL2'AV',CL2'AI',C'Anguilla'                                      
CTRYAVX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAYX-*,0)                                                 
         DC    CL2'AY',CL2'AQ',C'Antarctica'                                    
CTRYAYX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYACX-*,0)                                                 
         DC    CL2'AC',CL2'AG',C'Antigua and Barbuda'                           
CTRYACX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYARX-*,0)                                                 
         DC    CL2'AR',CL2'AR',C'Argentina'                                     
CTRYARX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAMX-*,0)                                                 
         DC    CL2'AM',CL2'AM',C'Armenia'                                       
CTRYAMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAAX-*,0)                                                 
         DC    CL2'AA',CL2'AW',C'Aruba'                                         
CTRYAAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYATX-*,0)                                                 
         DC    CL2'AT',CL2'  ',C'Ashmore and Cartier Islands'                   
CTRYATX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYASX-*,0)                                                 
         DC    CL2'AS',CL2'AU',C'Australia'                                     
CTRYASX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAUX-*,0)                                                 
         DC    CL2'AU',CL2'AT',C'Austria'                                       
CTRYAUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAJX-*,0)                                                 
         DC    CL2'AJ',CL2'AZ',C'Azerbaijan'                                    
CTRYAJX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBFX-*,0)                                                 
         DC    CL2'BF',CL2'BS',C'The Bahamas'                                   
CTRYBFX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBAX-*,0)                                                 
         DC    CL2'BA',CL2'BH',C'Bahrain'                                       
CTRYBAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFQX-*,0)                                                 
         DC    CL2'FQ',CL2'  ',C'Baker Island'                                  
CTRYFQX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBGX-*,0)                                                 
         DC    CL2'BG',CL2'BD',C'Bangladesh'                                    
CTRYBGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBBX-*,0)                                                 
         DC    CL2'BB',CL2'BB',C'Barbados'                                      
CTRYBBX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBSX-*,0)                                                 
         DC    CL2'BS',CL2'  ',C'Bassas da India'                               
CTRYBSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBOX-*,0)                                                 
         DC    CL2'BO',CL2'BY',C'Belarus'                                       
CTRYBOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBEX-*,0)                                                 
         DC    CL2'BE',CL2'BE',C'Belgium'                                       
CTRYBEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBHX-*,0)                                                 
         DC    CL2'BH',CL2'BZ',C'Belize'                                        
CTRYBHX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBNX-*,0)                                                 
         DC    CL2'BN',CL2'BJ',C'Benin'                                         
CTRYBNX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBDX-*,0)                                                 
         DC    CL2'BD',CL2'BM',C'Bermuda'                                       
CTRYBDX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBTX-*,0)                                                 
         DC    CL2'BT',CL2'BT',C'Bhutan'                                        
CTRYBTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBLX-*,0)                                                 
         DC    CL2'BL',CL2'BO',C'Bolivia'                                       
CTRYBLX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBKX-*,0)                                                 
         DC    CL2'BK',CL2'BA',C'Bosnia-Herzegovina'                            
CTRYBKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBCX-*,0)                                                 
         DC    CL2'BC',CL2'BW',C'Botswana'                                      
CTRYBCX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBVX-*,0)                                                 
         DC    CL2'BV',CL2'BV',C'Bouvet Island'                                 
CTRYBVX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBRX-*,0)                                                 
         DC    CL2'BR',CL2'BR',C'Brazil'                                        
CTRYBRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYIOX-*,0)                                                 
         DC    CL2'IO',CL2'IO',C'British Indian Ocean Territory'                
CTRYIOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBXX-*,0)                                                 
         DC    CL2'BX',CL2'BN',C'Brunei'                                        
CTRYBXX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBUX-*,0)                                                 
         DC    CL2'BU',CL2'BG',C'Bulgaria'                                      
CTRYBUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYUVX-*,0)                                                 
         DC    CL2'UV',CL2'BF',C'Burkina Faso'                                  
CTRYUVX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBMX-*,0)                                                 
         DC    CL2'BM',CL2'BU',C'Burma'                                         
CTRYBMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBYX-*,0)                                                 
         DC    CL2'BY',CL2'BI',C'Burundi'                                       
CTRYBYX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCBX-*,0)                                                 
         DC    CL2'CB',CL2'KH',C'Cambodia'                                      
CTRYCBX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCMX-*,0)                                                 
         DC    CL2'CM',CL2'CM',C'Cameroon'                                      
CTRYCMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCVX-*,0)                                                 
         DC    CL2'CV',CL2'CV',C'Cabo Verde'                                    
CTRYCVX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCJX-*,0)                                                 
         DC    CL2'CJ',CL2'KY',C'Cayman Islands'                                
CTRYCJX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCTX-*,0)                                                 
         DC    CL2'CT',CL2'CF',C'Central African Republic'                      
CTRYCTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCDX-*,0)                                                 
         DC    CL2'CD',CL2'TD',C'Chad'                                          
CTRYCDX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCIX-*,0)                                                 
         DC    CL2'CI',CL2'CL',C'Chile'                                         
CTRYCIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCHX-*,0)                                                 
         DC    CL2'CH',CL2'CN',C'People''s Republic of China'                   
CTRYCHX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYKTX-*,0)                                                 
         DC    CL2'KT',CL2'CX',C'Christmas Island'                              
CTRYKTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYIPX-*,0)                                                 
         DC    CL2'IP',CL2'  ',C'Clipperton Island'                             
CTRYIPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCKX-*,0)                                                 
         DC    CL2'CK',CL2'CC',C'Cocos (Keeling) Islands'                       
CTRYCKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCOX-*,0)                                                 
         DC    CL2'CO',CL2'CO',C'Colombia'                                      
CTRYCOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCNX-*,0)                                                 
         DC    CL2'CN',CL2'KM',C'Comoros'                                       
CTRYCNX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCGX-*,0)                                                 
         DC    CL2'CG',CL2'CD',C'Democratic Republic of Congo'                  
CTRYCGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCFX-*,0)                                                 
         DC    CL2'CF',CL2'CG',C'Republic of Congo'                             
CTRYCFX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCWX-*,0)                                                 
         DC    CL2'CW',CL2'CK',C'Cook Islands'                                  
CTRYCWX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCRX-*,0)                                                 
         DC    CL2'CR',CL2'  ',C'Coral Sea Islands Territory'                   
CTRYCRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCSX-*,0)                                                 
         DC    CL2'CS',CL2'CR',C'Costa Rica'                                    
CTRYCSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYIVX-*,0)                                                 
         DC    CL2'IV',CL2'CI',C'Cote d''ivoire (Ivory Coast)'                  
CTRYIVX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYHRX-*,0)                                                 
         DC    CL2'HR',CL2'HR',C'Croatia'                                       
CTRYHRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCUX-*,0)                                                 
         DC    CL2'CU',CL2'CU',C'Cuba'                                          
CTRYCUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCYX-*,0)                                                 
         DC    CL2'CY',CL2'CY',C'Cyprus'                                        
CTRYCYX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYEZX-*,0)                                                 
         DC    CL2'EZ',CL2'CZ',C'Czech Republic'                                
CTRYEZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYDAX-*,0)                                                 
         DC    CL2'DA',CL2'DK',C'Denmark'                                       
CTRYDAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYDXX-*,0)                                                 
         DC    CL2'DX',CL2'  ',C'Dhekelia Sovereign Base Area'                  
CTRYDXX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYDJX-*,0)                                                 
         DC    CL2'DJ',CL2'DJ',C'Djibouti'                                      
CTRYDJX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYDOX-*,0)                                                 
         DC    CL2'DO',CL2'DM',C'Dominica'                                      
CTRYDOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYDRX-*,0)                                                 
         DC    CL2'DR',CL2'DO',C'Dominican Republic'                            
CTRYDRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTTX-*,0)                                                 
         DC    CL2'TT',CL2'TP',C'East Timor'                                    
CTRYTTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYECX-*,0)                                                 
         DC    CL2'EC',CL2'EC',C'Ecuador'                                       
CTRYECX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYEGX-*,0)                                                 
         DC    CL2'EG',CL2'EG',C'Egypt'                                         
CTRYEGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYESX-*,0)                                                 
         DC    CL2'ES',CL2'SV',C'El Salvador'                                   
CTRYESX  EQU   *                                                                
                                                                                
*&&DO                                                                           
         DC    AL1(CTRYUKX-*,0)                                                 
         DC    CL2'UK',CL2'GB',C'England'                                       
CTRYUKX  EQU   *                                                                
*&&                                                                             
                                                                                
         DC    AL1(CTRYEKX-*,0)                                                 
         DC    CL2'EK',CL2'GQ',C'Equatorial Guinea'                             
CTRYEKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYERX-*,0)                                                 
         DC    CL2'ER',CL2'ER',C'Eritrea'                                       
CTRYERX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYENX-*,0)                                                 
         DC    CL2'EN',CL2'EE',C'Estonia'                                       
CTRYENX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYETX-*,0)                                                 
         DC    CL2'ET',CL2'ET',C'Ethiopia'                                      
CTRYETX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYEUX-*,0)                                                 
         DC    CL2'EU',CL2'  ',C'Europa Island'                                 
CTRYEUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFKX-*,0)                                                 
         DC    CL2'FK',CL2'FK',C'Falkland Islands (Islas Malvinas)'             
CTRYFKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFOX-*,0)                                                 
         DC    CL2'FO',CL2'FO',C'Faroe Islands'                                 
CTRYFOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFJX-*,0)                                                 
         DC    CL2'FJ',CL2'FJ',C'Fiji'                                          
CTRYFJX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFIX-*,0)                                                 
         DC    CL2'FI',CL2'FI',C'Finland'                                       
CTRYFIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFRX-*,0)                                                 
         DC    CL2'FR',CL2'FR',C'France'                                        
CTRYFRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFGX-*,0)                                                 
         DC    CL2'FG',CL2'GF',C'French Guiana'                                 
CTRYFGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFPX-*,0)                                                 
         DC    CL2'FP',CL2'PF',C'French Polynesia'                              
CTRYFPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFSX-*,0)                                                 
         DC    CL2'FS',CL2'FQ',C'French Southern and Antarctic Lands'           
CTRYFSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGBX-*,0)                                                 
         DC    CL2'GB',CL2'GA',C'Gabon'                                         
CTRYGBX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGAX-*,0)                                                 
         DC    CL2'GA',CL2'GM',C'The Gambia'                                    
CTRYGAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGZX-*,0)                                                 
         DC    CL2'GZ',CL2'  ',C'Gaza Strip'                                    
CTRYGZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGGX-*,0)                                                 
         DC    CL2'GG',CL2'GE',C'Georgia'                                       
CTRYGGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGMX-*,0)                                                 
         DC    CL2'GM',CL2'DE',C'Germany'                                       
CTRYGMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGHX-*,0)                                                 
         DC    CL2'GH',CL2'GH',C'Ghana'                                         
CTRYGHX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGIX-*,0)                                                 
         DC    CL2'GI',CL2'GI',C'Gibraltar'                                     
CTRYGIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGOX-*,0)                                                 
         DC    CL2'GO',CL2'  ',C'Glorioso Islands'                              
CTRYGOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGRX-*,0)                                                 
         DC    CL2'GR',CL2'GR',C'Greece'                                        
CTRYGRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGLX-*,0)                                                 
         DC    CL2'GL',CL2'GL',C'Greenland'                                     
CTRYGLX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGJX-*,0)                                                 
         DC    CL2'GJ',CL2'GD',C'Grenada'                                       
CTRYGJX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGPX-*,0)                                                 
         DC    CL2'GP',CL2'GP',C'Guadeloupe'                                    
CTRYGPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGTX-*,0)                                                 
         DC    CL2'GT',CL2'GT',C'Guatemala'                                     
CTRYGTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGKX-*,0)                                                 
         DC    CL2'GK',CL2'GG',C'Guernsey'                                      
CTRYGKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGVX-*,0)                                                 
         DC    CL2'GV',CL2'GN',C'Guinea'                                        
CTRYGVX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPUX-*,0)                                                 
         DC    CL2'PU',CL2'GW',C'Guinea-Bissau'                                 
CTRYPUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYGYX-*,0)                                                 
         DC    CL2'GY',CL2'GY',C'Guyana'                                        
CTRYGYX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYHAX-*,0)                                                 
         DC    CL2'HA',CL2'HT',C'Haiti'                                         
CTRYHAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYHMX-*,0)                                                 
         DC    CL2'HM',CL2'HM',C'Heard Island and McDonald Island'              
CTRYHMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYHOX-*,0)                                                 
         DC    CL2'HO',CL2'HN',C'Honduras'                                      
CTRYHOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYHKX-*,0)                                                 
         DC    CL2'HK',CL2'HK',C'Hong Kong'                                     
CTRYHKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYHQX-*,0)                                                 
         DC    CL2'HQ',CL2'  ',C'Howland Island'                                
CTRYHQX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYHUX-*,0)                                                 
         DC    CL2'HU',CL2'HU',C'Hungary'                                       
CTRYHUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYICX-*,0)                                                 
         DC    CL2'IC',CL2'IS',C'Iceland'                                       
CTRYICX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYINX-*,0)                                                 
         DC    CL2'IN',CL2'IN',C'India'                                         
CTRYINX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYIDX-*,0)                                                 
         DC    CL2'ID',CL2'ID',C'Indonesia'                                     
CTRYIDX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYIRX-*,0)                                                 
         DC    CL2'IR',CL2'IR',C'Iran'                                          
CTRYIRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYIZX-*,0)                                                 
         DC    CL2'IZ',CL2'IQ',C'Iraq'                                          
CTRYIZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYEIX-*,0)                                                 
         DC    CL2'EI',CL2'IE',C'Ireland'                                       
CTRYEIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYISX-*,0)                                                 
         DC    CL2'IS',CL2'IL',C'Israel'                                        
CTRYISX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYITX-*,0)                                                 
         DC    CL2'IT',CL2'IT',C'Italy'                                         
CTRYITX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYJMX-*,0)                                                 
         DC    CL2'JM',CL2'JM',C'Jamaica'                                       
CTRYJMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYJNX-*,0)                                                 
         DC    CL2'JN',CL2'  ',C'Jan Mayan'                                     
CTRYJNX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYJAX-*,0)                                                 
         DC    CL2'JA',CL2'JP',C'Japan'                                         
CTRYJAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYDQX-*,0)                                                 
         DC    CL2'DQ',CL2'  ',C'Jarvis Island'                                 
CTRYDQX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYJEX-*,0)                                                 
         DC    CL2'JE',CL2'JE',C'Jersey'                                        
CTRYJEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYJQX-*,0)                                                 
         DC    CL2'JQ',CL2'JT',C'Johnston Atoll'                                
CTRYJQX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYJOX-*,0)                                                 
         DC    CL2'JO',CL2'JO',C'Jordan'                                        
CTRYJOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYJUX-*,0)                                                 
         DC    CL2'JU',CL2'  ',C'Juan de Nova Island'                           
CTRYJUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYKZX-*,0)                                                 
         DC    CL2'KZ',CL2'KZ',C'Kazakhstan'                                    
CTRYKZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYKEX-*,0)                                                 
         DC    CL2'KE',CL2'KE',C'Kenya'                                         
CTRYKEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYKQX-*,0)                                                 
         DC    CL2'KQ',CL2'  ',C'Kingman Reef'                                  
CTRYKQX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYKRX-*,0)                                                 
         DC    CL2'KR',CL2'KI',C'Kiribati'                                      
CTRYKRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYKNX-*,0)                                                 
         DC    CL2'KN',CL2'KP'                                                  
         DC    C'Democratic People''s Republic of (North) Korea'                
CTRYKNX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYKSX-*,0)                                                 
         DC    CL2'KS',CL2'KR',C'Republic of (South) Korea'                     
CTRYKSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYKUX-*,0)                                                 
         DC    CL2'KU',CL2'KW',C'Kuwait'                                        
CTRYKUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYKGX-*,0)                                                 
         DC    CL2'KG',CL2'KG',C'Kyrgyzstan'                                    
CTRYKGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLAX-*,0)                                                 
         DC    CL2'LA',CL2'LA',C'Laos'                                          
CTRYLAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLGX-*,0)                                                 
         DC    CL2'LG',CL2'LV',C'Latvia'                                        
CTRYLGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLEX-*,0)                                                 
         DC    CL2'LE',CL2'LB',C'Lebanon'                                       
CTRYLEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLTX-*,0)                                                 
         DC    CL2'LT',CL2'LS',C'Lesotho'                                       
CTRYLTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLIX-*,0)                                                 
         DC    CL2'LI',CL2'LR',C'Liberia'                                       
CTRYLIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLYX-*,0)                                                 
         DC    CL2'LY',CL2'LY',C'Libya'                                         
CTRYLYX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLSX-*,0)                                                 
         DC    CL2'LS',CL2'LI',C'Liechtenstein'                                 
CTRYLSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLHX-*,0)                                                 
         DC    CL2'LH',CL2'LT',C'Lithuania'                                     
CTRYLHX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLUX-*,0)                                                 
         DC    CL2'LU',CL2'LU',C'Luxembourg'                                    
CTRYLUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMCX-*,0)                                                 
         DC    CL2'MC',CL2'MO',C'Macau'                                         
CTRYMCX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMKX-*,0)                                                 
         DC    CL2'MK',CL2'MK',C'Macedonia'                                     
CTRYMKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMAX-*,0)                                                 
         DC    CL2'MA',CL2'MG',C'Madagascar'                                    
CTRYMAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMIX-*,0)                                                 
         DC    CL2'MI',CL2'MW',C'Malawi'                                        
CTRYMIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMYX-*,0)                                                 
         DC    CL2'MY',CL2'MY',C'Malaysia'                                      
CTRYMYX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMVX-*,0)                                                 
         DC    CL2'MV',CL2'MV',C'Maldives'                                      
CTRYMVX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMLX-*,0)                                                 
         DC    CL2'ML',CL2'ML',C'Mali'                                          
CTRYMLX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMTX-*,0)                                                 
         DC    CL2'MT',CL2'MT',C'Malta'                                         
CTRYMTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYIMX-*,0)                                                 
         DC    CL2'IM',CL2'IM',C'Isle of Man'                                   
CTRYIMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYRMX-*,0)                                                 
         DC    CL2'RM',CL2'MH',C'Marshall Islands'                              
CTRYRMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMBX-*,0)                                                 
         DC    CL2'MB',CL2'MQ',C'Martinique'                                    
CTRYMBX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMRX-*,0)                                                 
         DC    CL2'MR',CL2'MR',C'Mauritania'                                    
CTRYMRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMPX-*,0)                                                 
         DC    CL2'MP',CL2'MU',C'Mauritius'                                     
CTRYMPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMFX-*,0)                                                 
         DC    CL2'MF',CL2'YT',C'Mayotte'                                       
CTRYMFX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMXX-*,0)                                                 
         DC    CL2'MX',CL2'MX',C'Mexico'                                        
CTRYMXX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYFMX-*,0)                                                 
         DC    CL2'FM',CL2'FM',C'Federated States of Micronesia'                
CTRYFMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMQX-*,0)                                                 
         DC    CL2'MQ',CL2'MI',C'Midway Islands'                                
CTRYMQX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMDX-*,0)                                                 
         DC    CL2'MD',CL2'MD',C'Moldova'                                       
CTRYMDX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMNX-*,0)                                                 
         DC    CL2'MN',CL2'MC',C'Monaco'                                        
CTRYMNX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMGX-*,0)                                                 
         DC    CL2'MG',CL2'MN',C'Mongolia'                                      
CTRYMGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMJX-*,0)                                                 
         DC    CL2'MJ',CL2'ME',C'Montenegro'                                    
CTRYMJX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMHX-*,0)                                                 
         DC    CL2'MH',CL2'MS',C'Montserrat'                                    
CTRYMHX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMOX-*,0)                                                 
         DC    CL2'MO',CL2'MA',C'Morocco'                                       
CTRYMOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMZX-*,0)                                                 
         DC    CL2'MZ',CL2'MZ',C'Mozambique'                                    
CTRYMZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYWAX-*,0)                                                 
         DC    CL2'WA',CL2'NA',C'Nambia'                                        
CTRYWAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNRX-*,0)                                                 
         DC    CL2'NR',CL2'NR',C'Nauru'                                         
CTRYNRX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBQX-*,0)                                                 
         DC    CL2'BQ',CL2'  ',C'Navassa Island'                                
CTRYBQX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNPX-*,0)                                                 
         DC    CL2'NP',CL2'NP',C'Nepal'                                         
CTRYNPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNLX-*,0)                                                 
         DC    CL2'NL',CL2'NL',C'Netherlands'                                   
CTRYNLX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNTX-*,0)                                                 
         DC    CL2'NT',CL2'AN',C'Netherlands Antilles'                          
CTRYNTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNCX-*,0)                                                 
         DC    CL2'NC',CL2'NC',C'New Caledonia'                                 
CTRYNCX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNZX-*,0)                                                 
         DC    CL2'NZ',CL2'NZ',C'New Zealand'                                   
CTRYNZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNUX-*,0)                                                 
         DC    CL2'NU',CL2'NI',C'Nicaragua'                                     
CTRYNUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNGX-*,0)                                                 
         DC    CL2'NG',CL2'NE',C'Niger'                                         
CTRYNGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNIX-*,0)                                                 
         DC    CL2'NI',CL2'NG',C'Nigeria'                                       
CTRYNIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNEX-*,0)                                                 
         DC    CL2'NE',CL2'NU',C'Niue'                                          
CTRYNEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNMX-*,0)                                                 
         DC    CL2'NM',CL2'  ',C'No Man''s Land'                                
CTRYNMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNFX-*,0)                                                 
         DC    CL2'NF',CL2'NF',C'Norfolk Island'                                
CTRYNFX  EQU   *                                                                
                                                                                
*&&DO                                                                           
         DC    AL1(CTRYUKX-*,0)                                                 
         DC    CL2'UK',CL2'GB',C'Northern Ireland'                              
CTRYUKX  EQU   *                                                                
*&&                                                                             
                                                                                
         DC    AL1(CTRYNOX-*,0)                                                 
         DC    CL2'NO',CL2'NO',C'Norway'                                        
CTRYNOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYMUX-*,0)                                                 
         DC    CL2'MU',CL2'OM',C'Oman'                                          
CTRYMUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPKX-*,0)                                                 
         DC    CL2'PK',CL2'PK',C'Pakistan'                                      
CTRYPKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPSX-*,0)                                                 
         DC    CL2'PS',CL2'PW',C'Palau'                                         
CTRYPSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLQX-*,0)                                                 
         DC    CL2'LQ',CL2'  ',C'Palmyra Atoll'                                 
CTRYLQX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPMX-*,0)                                                 
         DC    CL2'PM',CL2'PA',C'Panama'                                        
CTRYPMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPPX-*,0)                                                 
         DC    CL2'PP',CL2'PG',C'Papua New Guinea'                              
CTRYPPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPFX-*,0)                                                 
         DC    CL2'PF',CL2'  ',C'Paracel Islands'                               
CTRYPFX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPAX-*,0)                                                 
         DC    CL2'PA',CL2'PY',C'Paraguay'                                      
CTRYPAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPEX-*,0)                                                 
         DC    CL2'PE',CL2'PE',C'Peru'                                          
CTRYPEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYRPX-*,0)                                                 
         DC    CL2'RP',CL2'PH',C'Philippines'                                   
CTRYRPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPCX-*,0)                                                 
         DC    CL2'PC',CL2'PN',C'Pitcairn Island'                               
CTRYPCX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPLX-*,0)                                                 
         DC    CL2'PL',CL2'PL',C'Poland'                                        
CTRYPLX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPOX-*,0)                                                 
         DC    CL2'PO',CL2'PT',C'Portugal'                                      
CTRYPOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYQAX-*,0)                                                 
         DC    CL2'QA',CL2'QA',C'Qatar'                                         
CTRYQAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYREX-*,0)                                                 
         DC    CL2'RE',CL2'RE',C'Reunion'                                       
CTRYREX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYROX-*,0)                                                 
         DC    CL2'RO',CL2'RO',C'Romania'                                       
CTRYROX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYRSX-*,0)                                                 
         DC    CL2'RS',CL2'RU',C'Russia'                                        
CTRYRSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYRWX-*,0)                                                 
         DC    CL2'RW',CL2'RW',C'Rwanda'                                        
CTRYRWX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSCX-*,0)                                                 
         DC    CL2'SC',CL2'KN',C'St Kitts and Nevis'                            
CTRYSCX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSHX-*,0)                                                 
         DC    CL2'SH',CL2'SH',C'St Helena'                                     
CTRYSHX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSTX-*,0)                                                 
         DC    CL2'ST',CL2'LC',C'St Lucia'                                      
CTRYSTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSBX-*,0)                                                 
         DC    CL2'SB',CL2'PM',C'St Pierre and Miquelon'                        
CTRYSBX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYVCX-*,0)                                                 
         DC    CL2'VC',CL2'VC',C'St Vincent and the Grenadines'                 
CTRYVCX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYWSX-*,0)                                                 
         DC    CL2'WS',CL2'WS',C'Samoa'                                         
CTRYWSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSMX-*,0)                                                 
         DC    CL2'SM',CL2'SM',C'San Marino'                                    
CTRYSMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTPX-*,0)                                                 
         DC    CL2'TP',CL2'ST',C'Sao Tome and Principe'                         
CTRYTPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSAX-*,0)                                                 
         DC    CL2'SA',CL2'SA',C'Saudi Arabia'                                  
CTRYSAX  EQU   *                                                                
                                                                                
*&&DO                                                                           
         DC    AL1(CTRYUKX-*,0)                                                 
         DC    CL2'UK',CL2'GB',C'Scotland'                                      
CTRYUKX  EQU   *                                                                
*&&                                                                             
                                                                                
         DC    AL1(CTRYSGX-*,0)                                                 
         DC    CL2'SG',CL2'SN',C'Senegal'                                       
CTRYSGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYRBX-*,0)                                                 
         DC    CL2'RB',CL2'RS',C'Serbia'                                        
CTRYRBX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSEX-*,0)                                                 
         DC    CL2'SE',CL2'SC',C'Seychelles'                                    
CTRYSEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSLX-*,0)                                                 
         DC    CL2'SL',CL2'SL',C'Sierra Leone'                                  
CTRYSLX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSNX-*,0)                                                 
         DC    CL2'SN',CL2'SG',C'Singapore'                                     
CTRYSNX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYLOX-*,0)                                                 
         DC    CL2'LO',CL2'SK',C'Slovakia'                                      
CTRYLOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSIX-*,0)                                                 
         DC    CL2'SI',CL2'SI',C'Slovenia'                                      
CTRYSIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYBPX-*,0)                                                 
         DC    CL2'BP',CL2'SB',C'Solomon Islands'                               
CTRYBPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSOX-*,0)                                                 
         DC    CL2'SO',CL2'SO',C'Somalia'                                       
CTRYSOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSFX-*,0)                                                 
         DC    CL2'SF',CL2'ZA',C'South Africa'                                  
CTRYSFX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSXX-*,0)                                                 
         DC    CL2'SX',CL2'GS'                                                  
         DC    C'South Georgia and South Sandwich Islands'                      
CTRYSXX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSPX-*,0)                                                 
         DC    CL2'SP',CL2'ES',C'Spain'                                         
CTRYSPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYPGX-*,0)                                                 
         DC    CL2'PG',CL2'  ',C'Spratly Islands'                               
CTRYPGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYCEX-*,0)                                                 
         DC    CL2'CE',CL2'LK',C'Sri Lanka'                                     
CTRYCEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSUX-*,0)                                                 
         DC    CL2'SU',CL2'SD',C'Sudan'                                         
CTRYSUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNSX-*,0)                                                 
         DC    CL2'NS',CL2'SR',C'Suriname'                                      
CTRYNSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSVX-*,0)                                                 
         DC    CL2'SV',CL2'SJ',C'Svalbard'                                      
CTRYSVX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYWZX-*,0)                                                 
         DC    CL2'WZ',CL2'SZ',C'Swaziland'                                     
CTRYWZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSWX-*,0)                                                 
         DC    CL2'SW',CL2'SE',C'Sweden'                                        
CTRYSWX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSZX-*,0)                                                 
         DC    CL2'SZ',CL2'CH',C'Switzerland'                                   
CTRYSZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYSYX-*,0)                                                 
         DC    CL2'SY',CL2'SY',C'Syria'                                         
CTRYSYX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTWX-*,0)                                                 
         DC    CL2'TW',CL2'TW',C'Taiwan'                                        
CTRYTWX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTIX-*,0)                                                 
         DC    CL2'TI',CL2'TJ',C'Tajikistan'                                    
CTRYTIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTZX-*,0)                                                 
         DC    CL2'TZ',CL2'TZ',C'United Republic of Tanzania'                   
CTRYTZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTHX-*,0)                                                 
         DC    CL2'TH',CL2'TH',C'Thailand'                                      
CTRYTHX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTOX-*,0)                                                 
         DC    CL2'TO',CL2'TG',C'Togo'                                          
CTRYTOX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTLX-*,0)                                                 
         DC    CL2'TL',CL2'TK',C'Tokelau'                                       
CTRYTLX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTNX-*,0)                                                 
         DC    CL2'TN',CL2'TO',C'Tonga'                                         
CTRYTNX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTDX-*,0)                                                 
         DC    CL2'TD',CL2'TT',C'Trinidad and Tobago'                           
CTRYTDX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTEX-*,0)                                                 
         DC    CL2'TE',CL2'  ',C'Tromelin Island'                               
CTRYTEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTSX-*,0)                                                 
         DC    CL2'TS',CL2'TN',C'Tunisia'                                       
CTRYTSX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTUX-*,0)                                                 
         DC    CL2'TU',CL2'TR',C'Turkey'                                        
CTRYTUX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTXX-*,0)                                                 
         DC    CL2'TX',CL2'TM',C'Turkmenistan'                                  
CTRYTXX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTKX-*,0)                                                 
         DC    CL2'TK',CL2'TC',C'Turks and Caicos Islands'                      
CTRYTKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYTVX-*,0)                                                 
         DC    CL2'TV',CL2'TV',C'Tuvalu'                                        
CTRYTVX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYUGX-*,0)                                                 
         DC    CL2'UG',CL2'UG',C'Uganda'                                        
CTRYUGX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYUPX-*,0)                                                 
         DC    CL2'UP',CL2'UA',C'Ukraine'                                       
CTRYUPX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYAEX-*,0)                                                 
         DC    CL2'AE',CL2'AE',C'United Arab Emirates'                          
CTRYAEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYUKX-*,0)                                                 
         DC    CL2'UK',CL2'GB',C'United Kingdom'                                
CTRYUKX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYUYX-*,0)                                                 
         DC    CL2'UY',CL2'UY',C'Uruguay'                                       
CTRYUYX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYUZX-*,0)                                                 
         DC    CL2'UZ',CL2'UZ',C'Uzbekistan'                                    
CTRYUZX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYNHX-*,0)                                                 
         DC    CL2'NH',CL2'VU',C'Vanuatu'                                       
CTRYNHX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYVTX-*,0)                                                 
         DC    CL2'VT',CL2'  ',C'Vatican City'                                  
CTRYVTX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYVEX-*,0)                                                 
         DC    CL2'VE',CL2'VE',C'Venezuela'                                     
CTRYVEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYVMX-*,0)                                                 
         DC    CL2'VM',CL2'VN',C'Vietnam'                                       
CTRYVMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYVIX-*,0)                                                 
         DC    CL2'VI',CL2'VG',C'Virgin Islands (British)'                      
CTRYVIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYWQX-*,0)                                                 
         DC    CL2'WQ',CL2'WK',C'Wake Island'                                   
CTRYWQX  EQU   *                                                                
                                                                                
*&&DO                                                                           
         DC    AL1(CTRYUKX-*,0)                                                 
         DC    CL2'UK',CL2'GB',C'Wales'                                         
CTRYUKX  EQU   *                                                                
*&&                                                                             
                                                                                
         DC    AL1(CTRYWFX-*,0)                                                 
         DC    CL2'WF',CL2'WF',C'Wallis and Futuna'                             
CTRYWFX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYWEX-*,0)                                                 
         DC    CL2'WE',CL2'  ',C'West Bank'                                     
CTRYWEX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYWIX-*,0)                                                 
         DC    CL2'WI',CL2'EH',C'Western Sahara'                                
CTRYWIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYYMX-*,0)                                                 
         DC    CL2'YM',CL2'YE',C'Yemen'                                         
CTRYYMX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYZAX-*,0)                                                 
         DC    CL2'ZA',CL2'ZM',C'Zambia'                                        
CTRYZAX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYZIX-*,0)                                                 
         DC    CL2'ZI',CL2'ZW',C'Zimbabwe'                                      
CTRYZIX  EQU   *                                                                
                                                                                
         DC    AL1(CTRYOCX-*,0)                                                 
         DC    CL2'OC',CL2'  ',C'Other Countries'                               
CTRYOCX  EQU   *                                                                
         DC    X'FF'                                                            
