*          DATA SET TASYSNAHLD AT LEVEL 009 AS OF 02/25/10                      
         SPACE                                                                  
*              COMML TYPE TAB THAT DON'T GET HLD FEE NOTICES                    
*        ** INCLUDED IN TAGEN41, TAGENDF, TAGENE2, AND TALDCPTR **              
         SPACE                                                                  
NAHLDTAB DS    0C                                                               
         DC    AL1(CTYFGN)                                                      
         DC    AL1(CTYIND)                                                      
         DC    AL1(CTYPUB)                                                      
         DC    AL1(CTYDEM)                                                      
         DC    AL1(CTYSTRM)                                                     
         DC    AL1(CTYCAN)                                                      
         DC    AL1(CTYSDEM)                                                     
         DC    AL1(CTYMUS)                                                      
         DC    AL1(CTYSOAP)                                                     
         DC    AL1(CTYAUD)                                                      
         DC    AL1(CTYPRNT)                                                     
         DC    AL1(CTYGRT)                                                      
         DC    AL1(CTYPROMO)                                                    
         DC    AL1(CTYANIM)                                                     
         DC    AL1(CTYICAT1)                                                    
         DC    AL1(CTYICAT2)                                                    
         DC    AL1(0)                                                           
