*          DATA SET TASYSBTYPD AT LEVEL 020 AS OF 06/28/12                      
         SPACE 3                                                                
*              DSECT FOR BILLING TYPE TABLE                                     
BTYPTABD DSECT                                                                  
BTYPCDE  DS    XL1                 BILLING TYPE CODE                            
BTYPPOTY DS    XL1                 POOL TYPE                                    
BTYPSTAT DS    XL1                 STATUS                                       
BTYPSTNH EQU   X'80'               TAX & HANDLING PRINTED TOGETHER              
BTYPSINV EQU   X'40'               CALC TAX & HANDLING ON INV LEVEL             
BTYPSDFT EQU   X'20'               BILLING TYPE IS DEFUNCT                      
         DS    XL1                 N/D                                          
BTYPSRC  DS    0CL16               STANDARD RATE CARD                           
BTYPFUTA DS    H                   FUTA                                         
BTYPSUTA DS    H                   SUTA                                         
BTYPFICA DS    H                   FICA                                         
BTYPOVFI DS    H                   OVER FICA                                    
BTYPCORP DS    H                   CORPORATE RATE                               
BTYPHAND DS    H                   HANDLING FEE                                 
BTYPCAN  DS    H                   CANADIAN TAXES                               
BTYPOMED DS    H                   OVER MEDICARE                                
         ORG   BTYPOMED                                                         
BTYPWCRP DS    H                   WC FOR CORPS                                 
BTYPNEXT EQU   *                                                                
