*          DATA SET TASYSADJS  AT LEVEL 007 AS OF 03/08/91                      
         SPACE 2                                                                
*              ADJUSTMENT TYPE NAME                                             
         SPACE 1                                                                
TAADJ    DS    0CL13                                                            
         DC    AL1(TAPDADVD),CL12'VOID'                                         
         DC    AL1(TAPDADRI),CL12'REISSUE'                                      
         DC    AL1(TAPDADIS),CL12'ISSUE'                                        
         DC    AL1(TAPDADTR),CL12'TAX REFUND'                                   
         DC    AL1(TAPDADTT),CL12'TAX TRANSFER'                                 
         DC    AL1(TAPDADST),CL12'SSN TRANSFER'                                 
         DC    X'FF',CL12'UNKNOWN'                                              
