*          DATA SET TASYSCSF   AT LEVEL 009 AS OF 10/14/05                      
         SPACE                                                                  
*              CONTRACT SERVICE FEE TABLE                                       
*              INCLUDED BY TAGEN41 AND TAGEN50                                  
*              COMMERCIAL ACTRA TYPE, TV AMOUNT, RADIO AMOUNT                   
         SPACE                                                                  
CSFTBL   DS    0CL9                                                             
         DC    AL1(CCTYNATL),AL4(30000),AL4(15000)                              
         DC    AL1(CCTY04A),AL4(30000),AL4(15000)                               
         DC    AL1(CCTYS7),AL4(30000),AL4(15000)                                
         DC    AL1(CCTYS14),AL4(30000),AL4(15000)                               
         DC    AL1(CCTYS31),AL4(30000),AL4(15000)                               
         DC    AL1(CCTYS45),AL4(30000),AL4(15000)                               
         DC    AL1(CCTYR1),AL4(10000),AL4(5000)                                 
         DC    AL1(CCTYR2),AL4(10000),AL4(5000)                                 
         DC    AL1(CCTYR3),AL4(10000),AL4(5000)                                 
         DC    X'FF'                                                            
