*          DATA SET TASYSUNITS AT LEVEL 025 AS OF 06/01/10                      
         SPACE 1                                                                
*              TALENT SYSTEM UNIT CODES                                         
         SPACE 2                                                                
TAUNITS  DC    C'FEDERAL ',C'FD ',C'  ',C'  ',C'      ',AL1(0)                  
         DC    C'ALABAMA ',C'AL ',C'01',C'01',C'350369',AL1(0)                  
         DC    C'ALASKA  ',C'AK ',C'51',C'02',C'995999',AL1(TALUNTAX)           
         DC    C'ARIZONA ',C'AZ ',C'02',C'04',C'850865',AL1(0)                  
         DC    C'ARKANSAS',C'AR ',C'03',C'05',C'716729',AL1(0)                  
         DC    C'CALIF.  ',C'CA ',C'04',C'06',C'900966',AL1(0)                  
         DC    C'CA CITY ',C'LAX',C'04',C'06',C'      ',AL1(TALUNTAX)           
         DC    C'S. DIEGO',C'SG ',C'  ',C'  ',C'      ',AL1(0)                  
         DC    C'S. FRAN ',C'SF ',C'  ',C'  ',C'      ',AL1(0)                  
         DC    C'COLORADO',C'CO ',C'05',C'08',C'800816'                         
         DC    AL1(TALUSRND)                                                    
         DC    C'DENVER  ',C'DNV',C'05',C'08',C'      ',AL1(TASUINGF)           
         DC    C'CONN.   ',C'CT ',C'06',C'09',C'060069',AL1(0)                  
         DC    C'DELAWARE',C'DE ',C'07',C'10',C'197199',AL1(0)                  
         DC    C'D.C.    ',C'DC ',C'49',C'11',C'200207',AL1(0)                  
         DC    C'FLORIDA ',C'FL ',C'08',C'12',C'320349',AL1(TALUNTAX)           
         DC    C'GEORGIA ',C'GA ',C'09',C'13',C'300319',AL1(TALUOKAD)           
         DC    C'GUAM    ',C'GU ',C'  ',C'  ',C'900999',AL1(0)                  
         DC    C'HAWAII  ',C'HI ',C'50',C'15',C'967968',AL1(0)                  
         DC    C'IDAHO   ',C'ID ',C'10',C'16',C'832838',AL1(TALUSRND)           
         DC    C'ILLINOIS',C'IL ',C'11',C'17',C'600629',AL1(0)                  
         DC    C'INDIANA ',C'IN ',C'12',C'18',C'460479',AL1(0)                  
         DC    C'IOWA    ',C'IA ',C'13',C'19',C'500528',AL1(TALUSRND)           
         DC    C'KANSAS  ',C'KS ',C'14',C'20',C'660679',AL1(TALUOKAD)           
         DC    C'KENTUCKY',C'KY ',C'15',C'21',C'400427',AL1(0)                  
         DC    C'LOUISVLL',C'LJC',C'15',C'21',C'      ',AL1(TASUINGF)           
         DC    C'LA.     ',C'LA ',C'16',C'22',C'700714',AL1(0)                  
         DC    C'NEW ORLN',C'NO ',C'  ',C'  ',C'      ',AL1(0)                  
         DC    C'MAINE   ',C'ME ',C'17',C'23',C'039049',AL1(TALUSRND)           
         DC    C'MARYLAND',C'MD ',C'18',C'24',C'203219',AL1(0)                  
         DC    C'MASS.   ',C'MA ',C'19',C'25',C'010027',AL1(0)                  
         DC    C'MICHIGAN',C'MI ',C'20',C'26',C'480499',AL1(0)                  
         DC    C'DETROIT ',C'DET',C'20',C'26',C'      ',AL1(0)                  
         DC    C'MINN.   ',C'MN ',C'21',C'27',C'550567',AL1(0)                  
         DC    C'MISS.   ',C'MS ',C'22',C'28',C'386397',AL1(TALUSRND)           
         DC    C'MISSOURI',C'MO ',C'23',C'29',C'630658',AL1(TALUSRND)           
         DC    C'ST LOUIS',C'SL ',C'  ',C'  ',C'      ',AL1(0)                  
         DC    C'MONTANA ',C'MT ',C'24',C'30',C'590599',AL1(0)                  
         DC    C'NEBRASKA',C'NE ',C'25',C'31',C'680693',AL1(0)                  
         DC    C'NEVADA  ',C'NV ',C'26',C'32',C'889899',AL1(TALUNTAX)           
         DC    C'N.HAMP  ',C'NH ',C'27',C'33',C'030038',AL1(TALUNTAX)           
         DC    C'N.JERSEY',C'NJ ',C'28',C'34',C'070089',AL1(0)                  
         DC    C'NEW MEX.',C'NM ',C'29',C'35',C'870884',AL1(0)                  
         DC    C'NORTHWST',C'NW ',C'  ',C'  ',C'      ',AL1(TALUOKAD)           
         DC    C'NY STATE',C'NY ',C'30',C'36',C'090149',AL1(0)                  
         DC    C'NY CITY ',C'NYC',C'30',C'36',C'      ',AL1(0)                  
         DC    C'YONKERS ',C'YON',C'30',C'36',C'      ',AL1(TASUINGF)           
         DC    C'NO.CAR  ',C'NC ',C'31',C'37',C'270289',AL1(0)                  
         DC    C'NO.DAK  ',C'ND ',C'32',C'38',C'580588',AL1(0)                  
         DC    C'OHIO    ',C'OH ',C'33',C'39',C'430459',AL1(0)                  
         DC    C'CINCINN ',C'CIN',C'33',C'39',C'      ',AL1(0)                  
         DC    C'CLEVLAND',C'CLV',C'33',C'39',C'      ',AL1(0)                  
         DC    C'TRISTATE',C'CP ',C'  ',C'  ',C'      ',AL1(0)                  
         DC    C'OKLAHOMA',C'OK ',C'34',C'40',C'730749',AL1(TALUSRND)           
         DC    C'OREGON  ',C'OR ',C'35',C'41',C'970979',AL1(0)                  
         DC    C'PENN.   ',C'PA ',C'36',C'42',C'150196',AL1(0)                  
         DC    C'PHILA.  ',C'PHL',C'36',C'42',C'      ',AL1(0)                  
         DC    C'PITTS.  ',C'PIT',C'36',C'42',C'      ',AL1(TASUINGF)           
         DC    C'RHODE IS',C'RI ',C'37',C'44',C'028029',AL1(0)                  
         DC    C'SO.CAR  ',C'SC ',C'38',C'45',C'290299',AL1(0)                  
         DC    C'SO.DAK  ',C'SD ',C'39',C'46',C'570577',AL1(TALUNTAX)           
         DC    C'TENNESEE',C'TN ',C'40',C'47',C'370385'                         
         DC    AL1(TALUNTAX)                                                    
         DC    C'TEXAS   ',C'TX ',C'41',C'48',C'750799'                         
         DC    AL1(TALUNTAX+TALUOKAD)                                           
         DC    C'UTAH    ',C'UT ',C'42',C'49',C'840847',AL1(0)                  
         DC    C'VERMONT ',C'VT ',C'43',C'50',C'050059',AL1(0)                  
         DC    C'VIRGINIA',C'VA ',C'44',C'51',C'200246',AL1(0)                  
         DC    C'WASH.   ',C'WA ',C'45',C'53',C'980994',AL1(TALUNTAX)           
         DC    C'WEST VA.',C'WV ',C'46',C'54',C'247268',AL1(0)                  
         DC    C'WISC.   ',C'WI ',C'47',C'55',C'530549',AL1(0)                  
         DC    C'WYOMING ',C'WY ',C'48',C'56',C'820831',AL1(TALUNTAX)           
         DC    C'P.R.    ',C'PR ',C'52',C'PR',C'006009',AL1(0)                  
         DC    C'VIRG ISL',C'VI ',C'53',C'VI',C'008008',AL1(0)                  
         DC    C'CANADA  ',C'CN ',C'  ',C'  ',C'      ',AL1(TASUINGF)           
         DC    C'OTHERS  ',C'OT ',C'  ',C'  ',C'      ',AL1(0)                  
         DC    X'FF'                                                            
