*          DATA SET TASYSCTRYD AT LEVEL 002 AS OF 07/31/14                      
*              COUNTRY/PROVINCE TABLE DSECT                                     
                                                                                
CTRYTABD DSECT                                                                  
CTRYLEN  DS    AL1                 L'ENTRY                                      
CTRYDSP  DS    AL1                 DISPLACEMENT TO FIRST PROVINCE               
CTRYCODE DS    CL2                 COUNTRY CODE                                 
CTRYISO  DS    CL2                 COUNTRY CODE (ISO 2-DIGIT CTRY CODE)         
CTRYDESC DS    0C                  COUNTRY DESCRIPTION                          
                                                                                
CTRYSUBD DSECT                                                                  
CTRYPROV DS    CL2                 PROVINCE DESCRIPTION                         
CTRYSZIP DS    CL5                 VALID ZIP CODE STARTING CHARACTERS           
CTRYPNAM DS    CL8                 PROVINCE NAME                                
CRTYSLNQ EQU   *-CTRYSUBD                                                       
