*          DATA SET TASYSCATS  AT LEVEL 059 AS OF 05/23/16                      
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
*        CHANGES TO THIS MODULE REQUIRE A RE-LINK OF TASYSTAB AND     *         
*        A PANACAT OF TALDCATS.  THE LATTER REQUIRES A RE-LINK OF     *         
*        LMTALD (THE LOAD PROGRAM.)  TASYSDRIVE REFERENCES TABLE BUT  *         
*        DOES NOT NEED TO BE RE-LINKED                                *         
*                                                                     *         
*  EASYEST MUST ALSO BE UPDATED WHEN CHANGES ARE MADE TO THIS BOOK.   *         
*  IF ADDING A NEW CATEGORY, MAKE SURE CATRTLVL IS CORRECT.           *         
***********************************************************************         
         SPACE 2                                                                
*              CATEGORY TABLE                                                   
         SPACE 1                                                                
TACATS   DS    0C                                                               
         DC    AL1(CAX-*)                                                       
         DC    C'A  ',AL1(CTA),AL1(AFM+NON,0,0,0),X'B0'                         
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Arranger'                                                      
CAX      EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CACPX-*)                                                     
         DC    C'ACP',AL1(CTACP),AL1(AFM+NON,0,0,0),X'C0'                       
         DC    AL1(OKON+OKOFF+HNW2X)                                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Arranger, Copyist'                                             
CACPX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CACRX-*)                                                     
         DC    C'ACR',AL1(CTACR),AL1(AFT+SAG+NON,0,0,0),X'00'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'12',AL2(0)                                                     
         DC    C'Actor/Actress'                                                 
CACRX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CADX-*)                                                      
         DC    C'AD ',AL1(CTAD),AL1(AFT+SAG+NON,0,0,0),X'00'                    
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Assistant Director'                                            
CADX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CAMX-*)                                                      
         DC    C'AM ',AL1(CTAM),AL1(AFM+NON,0,0,0),X'B4'                        
         DC    AL1(OKON+OKOFF+HNW2X)                                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Arranger, Musician'                                            
CAMX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CAMCX-*)                                                     
         DC    C'AMC',AL1(CTAMC),AL1(AFM+NON,0,0,0),X'BC'                       
         DC    AL1(OKON+OKOFF+HNW2X)                                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Arranger, Musician, Copyist'                                   
CAMCX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CANNX-*)                                                     
         DC    C'ANN',AL1(CTANN),AL1(AFT+SAG+NON,0,0,0),X'04'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'12',AL2(0)                                                     
         DC    C'Announcer'                                                     
CANNX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CAOX-*)                                                      
         DC    C'AO ',AL1(CTAO),AL1(AFM+NON,0,0,0),X'B8'                        
         DC    AL1(OKON+OKOFF+HNW2X)                                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Arranger, Orchestrator'                                        
CAOX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CAPRX-*)                                                     
         DC    C'APR',AL1(CTAPR),AL1(AFT+SAG+NON,0,0,0),X'00'                   
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Assistant Producer'                                            
CAPRX    EQU   *                                                                
*                                                                               
         DC    AL1(CBBEX-*)                                                     
         DC    C'BBE',AL1(CTBBE),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'BB Electric'                                                   
CBBEX    EQU   *                                                                
*                                                                               
         DC    AL1(CBGX-*)                                                      
         DC    C'BG ',AL1(CTBG),AL1(AFT+SAG+NON,0,0,0),X'79'                    
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA+INDON)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Background Actor'                                              
CBGX     EQU   *                                                                
*                                                                               
         DC    AL1(CBSX-*)                                                      
         DC    C'BS ',AL1(CTBS),AL1(AFT+SAG+NON,0,0,0),X'7A'                    
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA+INDON)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Background Actor Special'                                      
CBSX     EQU   *                                                                
*                                                                               
         DC    AL1(CBSBX-*)                                                     
         DC    C'BSB',AL1(CTBSB),AL1(AFT+SAG+NON,0,0,0),X'7B'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA+INDON)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Background Actor Silent'                                       
CBSBX    EQU   *                                                                
*                                                                               
         DC    AL1(CCX-*)                                                       
         DC    C'C  ',AL1(CTC),AL1(AFT+SAG+AFM+NON,0,0,0),X'A4'                 
         DC    AL1(OKON+OKOFF+CONTRCTR+OKDOUBLE)                                
         DC    AL1(0)                                                           
         DC    X'12',AL2(0)                                                     
         DC    C'Contractor'                                                    
CCX      EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CCAX-*)                                                      
         DC    C'CA ',AL1(CTCA),AL1(AFM+NON,0,0,0),X'A6'                        
         DC    AL1(OKON+OKOFF+HNW2X+CONTRCTR+OKDOUBLE)                          
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Contractor, Arranger'                                          
CCAX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CCARX-*)                                                     
         DC    C'CAR',AL1(CTCAR),AL1(ACT+NON+UDA,0,0,0),X'00'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Cartoonist'                                                    
CCARX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CCCPX-*)                                                     
         DC    C'CCP',AL1(CTCCP),AL1(AFM+NON,0,0,0),X'AC'                       
         DC    AL1(OKON+OKOFF+HNW2X+CONTRCTR+OKDOUBLE)                          
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Contractor, Copyist'                                           
CCCPX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CCOX-*)                                                      
         DC    C'CO ',AL1(CTCO),AL1(AFM+NON,0,0,0),X'A8'                        
         DC    AL1(OKON+OKOFF+HNW2X+CONTRCTR+OKDOUBLE)                          
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Contractor, Orchestrator'                                      
CCOX     EQU   *                                                                
*                                                                               
         DC    AL1(CCOAX-*)                                                     
         DC    C'COA',AL1(CTCOA),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Costume Assistants'                                            
CCOAX    EQU   *                                                                
*                                                                               
         DC    AL1(CCOSX-*)                                                     
         DC    C'COS',AL1(CTCOS),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Costumer'                                                      
CCOSX    EQU   *                                                                
*                                                                               
         DC    AL1(CCPX-*)                                                      
         DC    C'CP ',AL1(CTCP),AL1(AFM+NON,0,0,0),X'DC'                        
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Copyist'                                                       
CCPX     EQU   *                                                                
*                                                                               
         DC    AL1(CCPTX-*)                                                     
         DC    C'CPT',AL1(CTCPT),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Carpenters'                                                    
CCPTX    EQU   *                                                                
*                                                                               
         DC    AL1(CCVX-*)                                                      
         DC    C'CV ',AL1(CTCV),AL1(AFT+SAG+NON,0,0,0),X'18'                    
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Character Voice'                                               
CCVX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CC3X-*)                                                      
         DC    C'C3 ',AL1(CTC3),AL1(AFT+SAG+NON,0,0,0),X'38'                    
         DC    AL1(OKOFF+SINGER)                                                
         DC    AL1(NOREUSE+NOHLDOFF+INDOFF)                                     
         DC    X'00',AL2(0)                                                     
         DC    C'Group Contractor 3-5'                                          
CC3X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CC6X-*)                                                      
         DC    C'C6 ',AL1(CTC6),AL1(AFT+SAG+NON,0,0,0),X'48'                    
         DC    AL1(OKOFF+SINGER)                                                
         DC    AL1(NOREUSE+NOHLDOFF)                                            
         DC    X'00',AL2(0)                                                     
         DC    C'Group Contractor 6-8'                                          
CC6X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CC9X-*)                                                      
         DC    C'C9 ',AL1(CTC9),AL1(AFT+SAG+NON,0,0,0),X'58'                    
         DC    AL1(OKOFF+SINGER)                                                
         DC    AL1(NOREUSE+NOHLDOFF)                                            
         DC    X'00',AL2(0)                                                     
         DC    C'Group Contractor 9+'                                           
CC9X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CDX-*)                                                       
         DC    C'D  ',AL1(CTD),AL1(AFT+SAG+NON,0,0,0),X'20'                     
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(NOHLDOFF+INDON+INDOFF)                                       
         DC    X'12',AL2(0)                                                     
         DC    C'Duo'                                                           
CDX      EQU   *                                                                
*                                                                               
         DC    AL1(CDECX-*)                                                     
         DC    C'DEC',AL1(CTDEC),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Decorators'                                                    
CDECX    EQU   *                                                                
*                                                                               
         DC    AL1(CDEMX-*)                                                     
         DC    C'DEM',AL1(CTDEM),AL1(ACT+NON+UDA,0,0,0),X'00'                   
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Demonstrator'                                                  
CDEMX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CDIRX-*)                                                     
         DC    C'DIR',AL1(CTDIR),AL1(DGA+NON,0,0,0),X'6A'                       
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Director'                                                      
CDIRX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CDI2X-*)                                                     
         DC    C'DI2',AL1(CTDI2),AL1(DGA+NON,0,0,0),X'6B'                       
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Director'                                                      
CDI2X    EQU   *                                                                
*                                                                               
         DC    AL1(CDOX-*)                                                      
         DC    C'DO ',AL1(CTDO),AL1(NON,0,0,0),X'66'                            
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Dimmer Operator'                                               
CDOX     EQU   *                                                                
*                                                                               
         DC    AL1(CEX-*)                                                       
         DC    C'E  ',AL1(CTE),AL1(ACT+NON+UDA,0,0,0),X'00'                     
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Extra'                                                         
CEX      EQU   *                                                                
*                                                                               
         DC    AL1(CELX-*)                                                      
         DC    C'EL ',AL1(CTEL),AL1(NON,0,0,0),X'66'                            
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Electricians'                                                  
CELX     EQU   *                                                                
*                                                                               
         DC    AL1(ESBX-*)                                                      
         DC    C'ESB',AL1(CTESB),AL1(AFT+SAG+NON,0,0,0),X'83'                   
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Stand In Buyout'                                               
ESBX     EQU   *                                                                
*                                                                               
         DC    AL1(ESIX-*)                                                      
         DC    C'ESI',AL1(CTESI),AL1(AFT+SAG+NON,0,0,0),X'82'                   
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Stand In'                                                      
ESIX     EQU   *                                                                
*                                                                               
         DC    AL1(CEXX-*)                                                      
         DC    C'EX ',AL1(CTEX),AL1(AFT+SAG+NON,0,0,0),X'78'                    
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Extra'                                                         
CEXX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CEXBX-*)                                                     
         DC    C'EXB',AL1(CTEXB),AL1(AFT+SAG+NON,0,0,0),X'80'                   
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Extra Buyout'                                                  
CEXBX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CEXDX-*)                                                     
         DC    C'EXD',AL1(CTEXD),AL1(AFT+SAG+NON,0,0,0),X'76'                   
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Vehicle Driver'                                                
CEXDX    EQU   *                                                                
*                                                                               
         DC    AL1(CGAFX-*)                                                     
         DC    C'GAF',AL1(CTGAF),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Gaffer'                                                        
CGAFX    EQU   *                                                                
*                                                                               
         DC    AL1(CGDX-*)                                                      
         DC    C'GD ',AL1(CTGD),AL1(ACT+NON+SAG+UDA,0,0,0),X'40'                
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'30',AL2(0)                                                     
         DC    C'Group Dancers'                                                 
CGDX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGD3X-*)                                                     
         DC    C'GD3',AL1(CTGD3),AL1(AFT+SAG+NON,0,0,0),X'40'                   
         DC    AL1(OKON)                                                        
         DC    AL1(INDON)                                                       
         DC    X'30',AL2(0)                                                     
         DC    C'Group Dancers 3-5'                                             
CGD3X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGD6X-*)                                                     
         DC    C'GD6',AL1(CTGD6),AL1(AFT+SAG+NON,0,0,0),X'50'                   
         DC    AL1(OKON)                                                        
         DC    AL1(INDON)                                                       
         DC    X'40',AL2(0)                                                     
         DC    C'Group Dancers 6-8'                                             
CGD6X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGD9X-*)                                                     
         DC    C'GD9',AL1(CTGD9),AL1(AFT+SAG+NON,0,0,0),X'60'                   
         DC    AL1(OKON)                                                        
         DC    AL1(INDON)                                                       
         DC    X'50',AL2(0)                                                     
         DC    C'Group Dancers 9+'                                              
CGD9X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGDPX-*)                                                     
         DC    C'GD+',AL1(CTGDP),AL1(AFT+SAG+NON,0,0,0),X'60'                   
         DC    AL1(OKON)                                                        
         DC    AL1(0)                                                           
         DC    X'50',AL2(0)                                                     
         DC    C'Group Dancers 6+'                                              
CGDPX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGEX-*)                                                      
         DC    C'GE ',AL1(CTGE),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Group Extra'                                                   
CGEX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGENX-*)                                                     
         DC    C'GEN',AL1(CTGEN),AL1(ALL-AFM,0,0,0),X'E6'                       
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'General'                                                       
CGENX    EQU   *                                                                
*                                                                               
         DC    AL1(CGOX-*)                                                      
         DC    C'GO ',AL1(CTGO),AL1(NON,0,0,0),X'66'                            
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Generator Operator'                                            
CGOX     EQU   *                                                                
*                                                                               
         DC    AL1(CGRX-*)                                                      
         DC    C'GR ',AL1(CTGR),AL1(NON,0,0,0),X'66'                            
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Grips'                                                         
CGRX     EQU   *                                                                
*                                                                               
         DC    AL1(CGRBX-*)                                                     
         DC    C'GRB',AL1(CTGRB),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'BB Grips'                                                      
CGRBX    EQU   *                                                                
*                                                                               
         DC    AL1(CGRDX-*)                                                     
         DC    C'GRD',AL1(CTGRD),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Dolly Grip'                                                    
CGRDX    EQU   *                                                                
*                                                                               
         DC    AL1(CGRKX-*)                                                     
         DC    C'GRK',AL1(CTGRK),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Key Grip'                                                      
CGRKX    EQU   *                                                                
*                                                                               
         DC    AL1(CGSX-*)                                                      
         DC    C'GS ',AL1(CTGS),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(0)                                                           
         DC    X'30',AL2(0)                                                     
         DC    C'Group Singer'                                                  
CGSX     EQU   *                                                                
*                                                                               
         DC    AL1(CGS3X-*)                                                     
         DC    C'GS3',AL1(CTGS3),AL1(ACT+UDA+NON,0,0,0),X'00'                   
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(NOHLDOFF)                                                    
         DC    X'30',AL2(0)                                                     
         DC    C'Group Singers 3-5'                                             
CGS3X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGS6X-*)                                                     
         DC    C'GS6',AL1(CTGS6),AL1(ACT+UDA+NON,0,0,0),X'00'                   
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(NOHLDOFF)                                                    
         DC    X'40',AL2(0)                                                     
         DC    C'Group Singers 6-8'                                             
CGS6X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGS9X-*)                                                     
         DC    C'GS9',AL1(CTGS9),AL1(ACT+UDA+NON,0,0,0),X'00'                   
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(NOHLDOFF)                                                    
         DC    X'50',AL2(0)                                                     
         DC    C'Group Singers 9+'                                              
CGS9X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGSMX-*)                                                     
         DC    C'GSM',AL1(CTGSM),AL1(ACT+NON+UDA,0,0,0),X'00'                   
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(0)                                                           
         DC    X'30',AL2(0)                                                     
         DC    C'Group Singer with multi'                                       
CGSMX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CGSSX-*)                                                     
         DC    C'GSS',AL1(CTGSS),AL1(ACT+NON+UDA,0,0,0),X'00'                   
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(0)                                                           
         DC    X'30',AL2(0)                                                     
         DC    C'Group Singer sweeting'                                         
CGSSX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CG3X-*)                                                      
         DC    C'G3 ',AL1(CTG3),AL1(AFT+SAG+NON,0,0,0),X'3C'                    
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(NOHLDOFF+INDON+INDOFF)                                       
         DC    X'30',AL2(0)                                                     
         DC    C'Group Singers 3-5'                                             
CG3X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CG6X-*)                                                      
         DC    C'G6 ',AL1(CTG6),AL1(AFT+SAG+NON,0,0,0),X'4C'                    
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(NOHLDOFF+INDOFF)                                             
         DC    X'40',AL2(0)                                                     
         DC    C'Group Singers 6-8'                                             
CG6X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CG9X-*)                                                      
         DC    C'G9 ',AL1(CTG9),AL1(AFT+SAG+NON,0,0,0),X'5C'                    
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(NOHLDOFF+INDOFF)                                             
         DC    X'50',AL2(0)                                                     
         DC    C'Group Singers 9+'                                              
CG9X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CG3DX-*)                                                     
         DC    C'G3D',AL1(CTG3D),AL1(AFT+SAG+NON,0,0,0),X'44'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDON)                                                       
         DC    X'30',AL2(0)                                                     
         DC    C'Group 3 Day'                                                   
CG3DX    EQU   *                                                                
*                                                                               
         DC    AL1(CG5DX-*)                                                     
         DC    C'G5D',AL1(CTG5D),AL1(AFT+SAG+NON,0,0,0),X'54'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDON)                                                       
         DC    X'30',AL2(0)                                                     
         DC    C'Group 5 Day'                                                   
CG5DX    EQU   *                                                                
*                                                                               
         DC    AL1(CG6DX-*)                                                     
         DC    C'G6D',AL1(CTG6D),AL1(AFT+SAG+NON,0,0,0),X'64'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDON)                                                       
         DC    X'30',AL2(0)                                                     
         DC    C'Group 6 Day'                                                   
CG6DX    EQU   *                                                                
*                                                                               
         DC    AL1(CG3MX-*)                                                     
         DC    C'G3M',AL1(CTG3M),AL1(AFT+SAG+NON,0,0,0),X'44'                   
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(NOHLDOFF)                                                    
         DC    X'30',AL2(0)                                                     
         DC    C'Group with multi 3-5'                                          
CG3MX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CG6MX-*)                                                     
         DC    C'G6M',AL1(CTG6M),AL1(AFT+SAG+NON,0,0,0),X'54'                   
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(NOHLDOFF)                                                    
         DC    X'40',AL2(0)                                                     
         DC    C'Group with multi 6-8'                                          
CG6MX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CG9MX-*)                                                     
         DC    C'G9M',AL1(CTG9M),AL1(AFT+SAG+NON,0,0,0),X'64'                   
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(NOHLDOFF)                                                    
         DC    X'50',AL2(0)                                                     
         DC    C'Group with multi 9+'                                           
CG9MX    EQU   *                                                                
*                                                                               
         DC    AL1(CG16X-*)                                                     
         DC    C'G16',AL1(CTG16),AL1(AFT+SAG+NON,0,0,0),X'64'                   
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(INDON+INDOFF)                                                
         DC    X'00',AL2(0)                                                     
         DC    C'Group less than 16 bars'                                       
CG16X    EQU   *                                                                
*                                                                               
         DC    AL1(CHAX-*)                                                      
         DC    C'HA ',AL1(CTHA),AL1(NON,0,0,0),X'66'                            
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Hair Assistants'                                               
CHAX     EQU   *                                                                
*                                                                               
         DC    AL1(CHMX-*)                                                      
         DC    C'HM ',AL1(CTHM),AL1(AFT+SAG+NON,0,0,0),X'7C'                    
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Hand Model'                                                    
CHMX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CHMBX-*)                                                     
         DC    C'HMB',AL1(CTHMB),AL1(AFT+SAG+NON,0,0,0),X'84'                   
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Hand Model Buyout'                                             
CHMBX    EQU   *                                                                
*                                                                               
         DC    AL1(CKHSX-*)                                                     
         DC    C'KHS',AL1(CTKHS),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Key Hair Stylist'                                              
CKHSX    EQU   *                                                                
*                                                                               
         DC    AL1(CKMUX-*)                                                     
         DC    C'KMU',AL1(CTKMU),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Key Make-Up'                                                   
CKMUX    EQU   *                                                                
*                                                                               
         DC    AL1(CLX-*)                                                       
         DC    C'L  ',AL1(CTL),AL1(AFM+NON,0,0,0),X'88'                         
         DC    AL1(OKON+OKOFF+LEADER+OKDOUBLE)                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Leader'                                                        
CLX      EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CLARX-*)                                                     
         DC    C'LA ',AL1(CTLA),AL1(AFM+NON,0,0,0),X'8C'                        
         DC    AL1(OKON+OKOFF+HNW2X+LEADER+OKDOUBLE)                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Leader, Arranger'                                              
CLARX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CLACX-*)                                                     
         DC    C'LAC',AL1(CTLAC),AL1(AFM+NON,0,0,0),X'94'                       
         DC    AL1(OKON+OKOFF+HNW2X+LEADER+OKDOUBLE)                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Leader, Arranger, Copyist'                                     
CLACX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CLAOX-*)                                                     
         DC    C'LAO',AL1(CTLAO),AL1(AFM+NON,0,0,0),X'92'                       
         DC    AL1(OKON+OKOFF+HNW2X+LEADER+OKDOUBLE)                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Leader, Arranger, Orchestrator'                                
CLAOX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CLCPX-*)                                                     
         DC    C'LCP',AL1(CTLCP),AL1(AFM+NON,0,0,0),X'A0'                       
         DC    AL1(OKON+OKOFF+HNW2X+LEADER+OKDOUBLE)                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Leader, Copyist'                                               
CLCPX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CLMX-*)                                                      
         DC    C'LM ',AL1(CTLM),AL1(AFM+NON,0,0,0),X'9C'                        
         DC    AL1(OKON+OKOFF+LEADER+HNW2X)                                     
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Leader, Musician'                                              
CLMX     EQU   *                                                                
*                                                                               
         DC    AL1(CLMPX-*)                                                     
         DC    C'LMP',AL1(CTLMP),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Lamp Operators'                                                
CLMPX    EQU   *                                                                
*                                                                               
         DC    AL1(CLOX-*)                                                      
         DC    C'LO ',AL1(CTLO),AL1(AFM+NON,0,0,0),X'90'                        
         DC    AL1(OKON+OKOFF+HNW2X+LEADER+OKDOUBLE)                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Leader, Orchestrator'                                          
CLOX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CLOCX-*)                                                     
         DC    C'LOC',AL1(CTLOC),AL1(AFM+NON,0,0,0),X'98'                       
         DC    AL1(OKON+OKOFF+HNW2X+LEADER+OKDOUBLE)                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Leader, Orchestrator, Copyist'                                 
CLOCX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CMX-*)                                                       
         DC    C'M  ',AL1(CTM),AL1(AFM+NON,0,0,0),X'D4'                         
         DC    AL1(OKON+OKOFF+OKDOUBLE)                                         
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Musician'                                                      
CMX      EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CMCPX-*)                                                     
         DC    C'MCP',AL1(CTMCP),AL1(AFM+NON,0,0,0),X'D8'                       
         DC    AL1(OKON+OKOFF+HNW2X)                                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Musician, Copyist'                                             
CMCPX    EQU   *                                                                
*                                                                               
         DC    AL1(CMUAX-*)                                                     
         DC    C'MUA',AL1(CTMUA),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Make-Up Assistants'                                            
CMUAX    EQU   *                                                                
*                                                                               
         DC    AL1(CMVX-*)                                                      
         DC    C'MV ',AL1(CTMV),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Multiple Voice'                                                
CMVX     EQU   *                                                                
*                                                                               
         DC    AL1(CNARX-*)                                                     
         DC    C'NAR',AL1(CTNAR),AL1(AFT+SAG+NON,0,0,0),X'10'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDOFF)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Narrator'                                                      
CNARX    EQU   *                                                                
*                                                                               
         DC    AL1(CNPX-*)                                                      
         DC    C'NP ',AL1(CTNP),AL1(AFT+SAG+NON,0,0,0),X'08'                    
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA+INDOFF)                                                
         DC    X'00',AL2(0)                                                     
         DC    C'Non-Principal Performer'                                       
CNPX     EQU   *                                                                
*                                                                               
         DC    AL1(COX-*)                                                       
         DC    C'O  ',AL1(CTO),AL1(AFM+NON,0,0,0),X'C4'                         
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Orchestrator'                                                  
COX      EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(COCPX-*)                                                     
         DC    C'OCP',AL1(CTOCP),AL1(AFM+NON,0,0,0),X'D0'                       
         DC    AL1(OKON+OKOFF+HNW2X)                                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Orchestrator, Copyist'                                         
COCPX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(COMX-*)                                                      
         DC    C'OM ',AL1(CTOM),AL1(AFM+NON,0,0,0),X'C8'                        
         DC    AL1(OKON+OKOFF+HNW2X)                                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Orchestrator, Musician'                                        
COMX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(COMCX-*)                                                     
         DC    C'OMC',AL1(CTOMC),AL1(AFM+NON,0,0,0),X'CC'                       
         DC    AL1(OKON+OKOFF+HNW2X)                                            
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Orchestrator, Musician, Copyist'                               
COMCX    EQU   *                                                                
*                                                                               
         DC    AL1(COTCX-*)                                                     
         DC    C'OTC',AL1(CTOTC),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'All Others'                                                    
COTCX    EQU   *                                                                
*                                                                               
         DC    AL1(CPX-*)                                                       
         DC    C'P  ',AL1(CTP),AL1(AFT+SAG+NON,0,0,0),X'08'                     
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDON+INDOFF)                                                
         DC    X'12',AL2(0)                                                     
         DC    C'Principal Performer'                                           
CPX      EQU   *                                                                
*                                                                               
         DC    AL1(CP2X-*)                                                      
         DC    C'P2 ',AL1(CTP2),AL1(AFT+SAG+NON,0,0,0),X'0B'                    
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Two Role Player'                                               
CP2X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CPEX-*)                                                      
         DC    C'PE ',AL1(CTPE),AL1(NON+UDA,0,0,0),X'10'                        
         DC    AL1(OKON)                                                        
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Principal Extra'                                               
CPEX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CPHX-*)                                                      
         DC    C'PH ',AL1(CTPH),AL1(0,0,0,0),X'0A'                              
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Photographer'                                                  
CPHX     EQU   *                                                                
*                                                                               
         DC    AL1(CPHDX-*)                                                     
         DC    C'PHD',AL1(CTPHD),AL1(AFT+SAG+NON,0,0,0),X'0A'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDON)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Performer Half Day'                                            
CPHDX    EQU   *                                                                
*                                                                               
         DC    AL1(CPIX-*)                                                      
         DC    C'PI ',AL1(CTPI),AL1(AFT+SAG+NON,0,0,0),X'0E'                    
         DC    AL1(OKON)                                                        
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Pilot with Holding Fee'                                        
CPIX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CPILX-*)                                                     
         DC    C'PIL',AL1(CTPIL),AL1(AFT+SAG+NON,0,0,0),X'0C'                   
         DC    AL1(OKON)                                                        
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Pilot'                                                         
CPILX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CPMX-*)                                                      
         DC    C'PM ',AL1(CTPM),AL1(0,0,0,0),X'09'                              
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Print Model'                                                   
CPMX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CPPX-*)                                                      
         DC    C'PP ',AL1(CTPP),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKON)                                                        
         DC    AL1(0)                                                           
         DC    X'10',AL2(0)                                                     
         DC    C'Principal Performer'                                           
CPPX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CPRX-*)                                                      
         DC    C'PR ',AL1(CTPR),AL1(AFT+SAG+NON,0,0,0),X'00'                    
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Producer'                                                      
CPRX     EQU   *                                                                
*                                                                               
         DC    AL1(CPRAX-*)                                                     
         DC    C'PRA',AL1(CTPRA),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Prop Assistants'                                               
CPRAX    EQU   *                                                                
*                                                                               
         DC    AL1(CPRMX-*)                                                     
         DC    C'PRM',AL1(CTPRM),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Prop Master'                                                   
CPRMX    EQU   *                                                                
*                                                                               
         DC    AL1(CPTX-*)                                                      
         DC    C'PT ',AL1(CTPT),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKON)                                                        
         DC    AL1(0)                                                           
         DC    X'10',AL2(0)                                                     
         DC    C'Puppeteer'                                                     
CPTX     EQU   *                                                                
*                                                                               
         DC    AL1(CPTRX-*)                                                     
         DC    C'PTR',AL1(CTPTR),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Painters'                                                      
CPTRX    EQU   *                                                                
*                                                                               
         DC    AL1(CPUPX-*)                                                     
         DC    C'PUP',AL1(CTPUP),AL1(AFT+SAG+NON,0,0,0),X'10'                   
         DC    AL1(OKON)                                                        
         DC    AL1(0)                                                           
         DC    X'12',AL2(0)                                                     
         DC    C'Puppeteer'                                                     
CPUPX    EQU   *                                                                
*                                                                               
         DC    AL1(CP3DX-*)                                                     
         DC    C'P3D',AL1(CTP3D),AL1(AFT+SAG+NON,0,0,0),X'0A'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDON)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Performer 3 Day'                                               
CP3DX    EQU   *                                                                
*                                                                               
         DC    AL1(CP3MX-*)                                                     
         DC    C'P3M',AL1(CTP3M),AL1(AFT+SAG+NON,0,0,0),X'0A'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDON+INDOFF)                                                
         DC    X'00',AL2(0)                                                     
         DC    C'Performer 3 Min'                                               
CP3MX    EQU   *                                                                
*                                                                               
         DC    AL1(CP5DX-*)                                                     
         DC    C'P5D',AL1(CTP5D),AL1(AFT+SAG+NON,0,0,0),X'0A'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDON)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Performer 5 Day'                                               
CP5DX    EQU   *                                                                
*                                                                               
         DC    AL1(CP6DX-*)                                                     
         DC    C'P6D',AL1(CTP6D),AL1(AFT+SAG+NON,0,0,0),X'0A'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(INDON)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Performer 6 Day'                                               
CP6DX    EQU   *                                                                
*                                                                               
         DC    AL1(CP5X-*)                                                      
         DC    C'P5 ',AL1(CTP5),AL1(AFT+SAG+NON,0,0,0),X'0A'                    
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Performer 5 Lines or Less'                                     
CP5X     EQU   *                                                                
*                                                                               
         DC    AL1(CSX-*)                                                       
         DC    C'S  ',AL1(CTS),AL1(AFT+SAG+NON,0,0,0),X'1C'                     
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(NHLDOF88+INDON+INDOFF)                                       
         DC    X'12',AL2(0)                                                     
         DC    C'Solo Singer'                                                   
CSX      EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSAX-*)                                                      
         DC    C'SA ',AL1(CTSA),AL1(AFT+SAG+ACT+UDA+NON,0,0,0),X'2C'            
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(NOHLDOFF)                                                    
         DC    X'10',AL2(0)                                                     
         DC    C'Speciality Act'                                                
CSAX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSBX-*)                                                      
         DC    C'SB ',AL1(CTSB),AL1(ACT+UDA+NON,0,0,0),X'00'                    
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Stand-by'                                                      
CSBX     EQU   *                                                                
         SPACE 1                                                                
*                                                                               
         DC    AL1(CSCSX-*)                                                     
         DC    C'SCS',AL1(CTSCS),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Script Supervisor'                                             
CSCSX    EQU   *                                                                
*                                                                               
         DC    AL1(CSDX-*)                                                      
         DC    C'SD ',AL1(CTSD),AL1(AFT+SAG+ACT+UDA+NON,0,0,0),X'24'            
         DC    AL1(OKON)                                                        
         DC    AL1(INDON)                                                       
         DC    X'10',AL2(0)                                                     
         DC    C'Solo Dancer'                                                   
CSDX     EQU   *                                                                
*                                                                               
         DC    AL1(CSDRX-*)                                                     
         DC    C'SDR',AL1(CTSDR),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Set Dressers'                                                  
CSDRX    EQU   *                                                                
*                                                                               
         DC    AL1(CSEX-*)                                                      
         DC    C'SE ',AL1(CTSE),AL1(AFT+SAG+NON,0,0,0),X'66'                    
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Sound Effects'                                                 
CSEX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSIX-*)                                                      
         DC    C'SI ',AL1(CTSI),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Stand In'                                                      
CSIX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSLX-*)                                                      
         DC    C'SL ',AL1(CTSL),AL1(AFM+NON,0,0,0),X'E0'                        
         DC    AL1(OKON)                                                        
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Sideline Musician'                                             
CSLX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSMX-*)                                                      
         DC    C'SM ',AL1(CTSM),AL1(AFT+SAG+NON,0,0,0),X'28'                    
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(NHLDOF88)                                                    
         DC    X'12',AL2(0)                                                     
         DC    C'Solo/Duo with multi'                                           
CSMX     EQU   *                                                                
*                                                                               
         DC    AL1(CSOX-*)                                                      
         DC    C'SO ',AL1(CTSO),AL1(AFT+SAG+NON,0,0,0),X'65'                    
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(INDOFF)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Stepout'                                                       
CSOX     EQU   *                                                                
*                                                                               
         DC    AL1(CSOCX-*)                                                     
         DC    C'SOC',AL1(CTSOC),AL1(ACT+NON+UDA,0,0,0),X'14'                   
         DC    AL1(OKON)                                                        
         DC    AL1(0)                                                           
         DC    X'10',AL2(0)                                                     
         DC    C'Silent On-Camera'                                              
CSOCX    EQU   *                                                                
*                                                                               
         DC    AL1(CSPEX-*)                                                     
         DC    C'SPE',AL1(CTSPE),AL1(NON,0,0,0),X'66'                           
         DC    AL1(OKOFF)                                                       
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Special Effects'                                               
CSPEX    EQU   *                                                                
*                                                                               
         DC    AL1(CSSSX-*)                                                     
         DC    C'SS ',AL1(CTSS),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKON+OKOFF+SINGER)                                           
         DC    AL1(NHLDOF88)                                                    
         DC    X'12',AL2(0)                                                     
         DC    C'Solo Singer'                                                   
CSSSX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSSMX-*)                                                     
         DC    C'SSM',AL1(CTSSM),AL1(ACT+NON+UDA,0,0,0),X'00'                   
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(NHLDOF88)                                                    
         DC    X'12',AL2(0)                                                     
         DC    C'Solo/Duo with multi'                                           
CSSMX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSS1X-*)                                                     
         DC    C'SS1',AL1(CTSS1),AL1(AFT+SAG+ACT+NON+UDA,0,0,0),X'68'           
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(NHLDOF88)                                                    
         DC    X'12',AL2(0)                                                     
         DC    C'Solo/Duo sweetening'                                           
CSS1X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSS2X-*)                                                     
         DC    C'SS2',AL1(CTSS2),AL1(AFT+SAG+ACT+NON+UDA,0,0,0),X'6C'           
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(NHLDOF88)                                                    
         DC    X'12',AL2(0)                                                     
         DC    C'Solo/Duo sweetening'                                           
CSS2X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSS3X-*)                                                     
         DC    C'SS3',AL1(CTSS3),AL1(AFT+SAG+ACT+NON+UDA,0,0,0),X'70'           
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(NHLDOF88)                                                    
         DC    X'12',AL2(0)                                                     
         DC    C'Solo/Duo sweetening'                                           
CSS3X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSS4X-*)                                                     
         DC    C'SS4',AL1(CTSS4),AL1(AFT+SAG+ACT+NON+UDA,0,0,0),X'74'           
         DC    AL1(OKON+OKOFF+SWMULT+SINGER)                                    
         DC    AL1(NHLDOF88)                                                    
         DC    X'12',AL2(0)                                                     
         DC    C'Solo/Duo sweetening'                                           
CSS4X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSTX-*)                                                      
         DC    C'ST ',AL1(CTST),AL1(AFT+SAG+ACT+NON+UDA,0,0,0),X'30'            
         DC    AL1(OKON)                                                        
         DC    AL1(INDON)                                                       
         DC    X'10',AL2(0)                                                     
         DC    C'Stunt Performer'                                               
CSTX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSVX-*)                                                      
         DC    C'SV ',AL1(CTSV),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Single Voice/Solo Singer'                                      
CSVX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CSYNX-*)                                                     
         DC    C'SYN',AL1(CTSYN),AL1(AFM+NON,0,0,0),X'D6'                       
         DC    AL1(OKON+OKOFF+OKDOUBLE)                                         
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Synthesizer'                                                   
CSYNX    EQU   *                                                                
*                                                                               
         DC    AL1(CS3DX-*)                                                     
         DC    C'S3D',AL1(CTS3D),AL1(AFT+SAG+NON,0,0,0),X'1C'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA+INDON)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Solo/Duo 3 Day'                                                
CS3DX    EQU   *                                                                
*                                                                               
         DC    AL1(CS5DX-*)                                                     
         DC    C'S5D',AL1(CTS5D),AL1(AFT+SAG+NON,0,0,0),X'1C'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA+INDON)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Solo/Duo 5 Day'                                                
CS5DX    EQU   *                                                                
*                                                                               
         DC    AL1(CS6DX-*)                                                     
         DC    C'S6D',AL1(CTS6D),AL1(AFT+SAG+NON,0,0,0),X'1C'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA+INDON)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Solo/Duo 6 Day'                                                
CS6DX    EQU   *                                                                
*                                                                               
         DC    AL1(CS16X-*)                                                     
         DC    C'S16',AL1(CTS16),AL1(AFT+SAG+NON,0,0,0),X'1D'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA+INDON+INDOFF)                                          
         DC    X'00',AL2(0)                                                     
         DC    C'Solo/Duo less than 16 bars'                                    
CS16X    EQU   *                                                                
*                                                                               
         DC    AL1(CU5X-*)                                                      
         DC    C'U5 ',AL1(CTU5),AL1(AFT+SAG+NON,0,0,0),X'45'                    
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Under 5 lines'                                                 
CU5X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CU52X-*)                                                     
         DC    C'U52',AL1(CTU52),AL1(AFT+SAG+NON,0,0,0),X'47'                   
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(0)                                                           
         DC    X'00',AL2(0)                                                     
         DC    C'Under 5 lines'                                                 
CU52X    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CUSX-*)                                                      
         DC    C'US ',AL1(CTUS),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKON)                                                        
         DC    AL1(EXTRA+NOHLD)                                                 
         DC    X'00',AL2(0)                                                     
         DC    C'Understudy'                                                    
CUSX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CVOX-*)                                                      
         DC    C'VO ',AL1(CTVO),AL1(ACT+NON+UDA,0,0,0),X'00'                    
         DC    AL1(OKOFF)                                                       
         DC    AL1(0)                                                           
         DC    X'02',AL2(0)                                                     
         DC    C'Voice Over'                                                    
CVOX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CWX-*)                                                       
         DC    C'W  ',AL1(CTW),AL1(WGA+NON,0,0,0),X'7A'                         
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Writer'                                                        
CWX      EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CWBX-*)                                                      
         DC    C'WB ',AL1(CTWB),AL1(WGA+NON,0,0,0),X'7F'                        
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Breakdown Writer'                                              
CWBX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CWHX-*)                                                      
         DC    C'WH ',AL1(CTWH),AL1(WGA+NON,0,0,0),X'7D'                        
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Head Writer'                                                   
CWHX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CWSX-*)                                                      
         DC    C'WS ',AL1(CTWS),AL1(WGA+NON,0,0,0),X'7E'                        
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Script Writer'                                                 
CWSX     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CW2X-*)                                                      
         DC    C'W2 ',AL1(CTW2),AL1(WGA+NON,0,0,0),X'7B'                        
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Writer'                                                        
CW2X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CW2BX-*)                                                     
         DC    C'W2B',AL1(CTW2B),AL1(WGA+NON,0,0,0),X'87'                       
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Breakdown Writer'                                              
CW2BX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CW2HX-*)                                                     
         DC    C'W2H',AL1(CTW2H),AL1(WGA+NON,0,0,0),X'85'                       
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Head Writer'                                                   
CW2HX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CW2SX-*)                                                     
         DC    C'W2S',AL1(CTW2S),AL1(WGA+NON,0,0,0),X'86'                       
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Script Writer'                                                 
CW2SX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CW3X-*)                                                      
         DC    C'W3 ',AL1(CTW3),AL1(WGA+NON,0,0,0),X'89'                        
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Writer'                                                        
CW3X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CW3BX-*)                                                     
         DC    C'W3B',AL1(CTW3B),AL1(WGA+NON,0,0,0),X'8A'                       
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Breakdown Writer'                                              
CW3BX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CW3HX-*)                                                     
         DC    C'W3H',AL1(CTW3H),AL1(WGA+NON,0,0,0),X'8B'                       
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Head Writer'                                                   
CW3HX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CW3SX-*)                                                     
         DC    C'W3S',AL1(CTW3S),AL1(WGA+NON,0,0,0),X'8D'                       
         DC    AL1(OKOFF)                                                       
         DC    AL1(WRITER)                                                      
         DC    X'00',AL2(0)                                                     
         DC    C'Script Writer'                                                 
CW3SX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CXX-*)                                                       
         DC    C'X  ',AL1(CTX),AL1(AFT+SAG+NON,0,0,0),X'81'                     
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Extra'                                                         
CXX      EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CX2X-*)                                                      
         DC    C'X2 ',AL1(CTX2),AL1(AFT+SAG+NON,0,0,0),X'83'                    
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(EXTRA)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Extra'                                                         
CX2X     EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CZZZX-*)                                                     
         DC    C'ZZZ',AL1(CTZZZ),AL1(ALL,0,0,0),X'E8'                           
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Other'                                                         
CZZZX    EQU   *                                                                
         SPACE 1                                                                
         DC    AL1(CZZX-*)                                                      
         DC    C'ZZ ',AL1(CTZZ),AL1(ALL,0,0,0),X'E8'                            
         DC    AL1(OKON+OKOFF)                                                  
         DC    AL1(NOHLD)                                                       
         DC    X'00',AL2(0)                                                     
         DC    C'Other'                                                         
CZZX     EQU   *                                                                
         SPACE 1                                                                
         DC    X'FF'                                                            
