*          DATA SET TASYSBTYPS AT LEVEL 065 AS OF 09/10/13                      
         SPACE 2                                                                
*              BILLING TYPES                                                    
         SPACE 1                                                                
         DS    0H                                                               
TABTYPS  DS    0CL20                                                            
         DC    AL1(TABRTY1,0),AL1(0,0)                                          
         DC    H'1773',H'0',H'0',H'1102',H'0',H'0410',H'700'                    
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY2,0),AL1(BTYPSDFT,0)                                   
         DC    H'1773',H'0',H'0',H'1102',H'0',H'0410',H'700'                    
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY6,0),AL1(BTYPSINV,0)                                   
         DC    H'1465',H'1785',3H'0',H'0450',H'700',H'0340'                     
*                                                                               
         DC    AL1(TABRTY7,0),AL1(BTYPSINV,0)                                   
         DC    H'1609',4H'0',H'0800',H'700',H'0116'                             
*                                                                               
         DC    AL1(TABRTY8,0),AL1(BTYPSINV,0)                                   
         DC    H'1611',4H'0',H'1000',H'700',H'0116'                             
*                                                                               
         DC    AL1(TABRTY9,TAPOTY1),AL1(BTYPSTNH+BTYPSDFT,0)                    
         DC    H'1581',H'1501',H'0881',H'0261',H'0410',H'0410',H'700'           
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY10,TAPOTY1),AL1(0,0)                                   
         DC    H'1581',H'1501',H'0881',H'0261',H'0410',H'0410',H'700'           
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY11,0),AL1(BTYPSTNH+BTYPSINV+BTYPSDFT,0)                
         DC    5H'0',H'1900',H'700',H'0000'                                     
*                                                                               
         DC    AL1(TABRTY12,TAPOTY1),AL1(0,0)                                   
         DC    H'1363',H'1363',H'1363',H'0261',H'0600',H'0600',H'700'           
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY13,TAPOTY1),AL1(BTYPSTNH,0)                            
         DC    H'1363',H'1363',H'1363',H'0261',H'0410',H'0410',H'700'           
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY14,TAPOTY1),AL1(0,0)                                   
         DC    H'1581',H'1581',H'0881',H'0261',H'0650',H'0650',H'700'           
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY15,TAPOTY1),AL1(0,0)                                   
         DC    H'1581',H'1501',H'0881',H'0261',H'0410',H'0410',H'700'           
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY16,0),AL1(0,0)                                         
         DC    H'1773',2H'0',H'1102',H'0',H'0410',H'700',H'0116'                
*                                                                               
         DC    AL1(TABRTY18,0),AL1(BTYPSINV,0)                                  
         DC    H'1611',4H'0',H'1000',H'700',H'0116'                             
*                                                                               
         DC    AL1(TABRTY20,0),AL1(0,0)                                         
         DC    H'2001',H'0',H'0',H'1102',H'0',H'0410',H'700'                    
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY21,0),AL1(BTYPSINV,0)                                  
         DC    H'1611',4H'0',H'1000',H'700',H'0116'                             
*                                                                               
         DC    AL1(TABRTY22,TAPOTY1),AL1(BTYPSDFT,0)                            
         DC    H'1363',H'1363',H'1363',H'0261',H'0600',H'0600',H'700'           
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY23,0),AL1(0,0)                                         
         DC    H'1463',H'410',2H'0',H'525',H'525',H'825',H'116'                 
*                                                                               
         DC    AL1(TABRTY24,TAPOTY1),AL1(0,0)                                   
         DC    H'1581',H'1501',H'0881',H'0261',H'0410',H'0325',H'000'           
         DC    H'0116'                                                          
*                                                                               
         DC    AL1(TABRTY25,TAPOTY1),AL1(0,0)                                   
         DC    H'0',H'0',H'0',H'0',H'0',H'0',H'0'                               
         DC    H'0'                                                             
*                                                                               
         DC    AL1(TABRTY26,TAPOTY1),AL1(0,0)                                   
         DC    H'0',H'0',H'0',H'0',H'0',H'0',H'0'                               
         DC    H'0'                                                             
*                                                                               
         DC    AL1(TABRTY99,0),AL1(0,0)                                         
         DC    8H'0'                                                            
*                                                                               
         DC    AL1(TABRTYE,0),AL1(0,0)                                          
         DC    H'1697',H'0',H'0',H'1097',H'0',H'0385',H'700'                    
         DC    H'0096'                                                          
*                                                                               
         DC    X'FF'                                                            
