*          DATA SET TASYSLOCS  AT LEVEL 008 AS OF 11/21/95                      
*              TABLE OF VALID LOCATION EXPRESSIONS FOR FGR                      
         SPACE 1                                                                
*                                  BYTES 1-9 = CHARACTER EXPRESSION             
TALOCS   DS    0CL10               BYTE  10  = EQUATE                           
         DC    CL9'UK       ',AL1(UK)                                           
         DC    CL9'EURO     ',AL1(EUR)                                          
         DC    CL9'JAPN     ',AL1(JAP)                                          
         DC    CL9'AP       ',AL1(AP)                                           
         DC    CL9'REST     ',AL1(REST)                                         
         DC    CL9'UK+EURO  ',AL1(UK+EUR)                                       
         DC    CL9'UK+JAPN  ',AL1(UK+JAP)                                       
         DC    CL9'UK+AP    ',AL1(UK+AP)                                        
         DC    CL9'UK+REST  ',AL1(UK+REST)                                      
         DC    CL9'EURO+JAPN',AL1(EUR+JAP)                                      
         DC    CL9'EURO+AP  ',AL1(EUR+AP)                                       
         DC    CL9'EURO+REST',AL1(EUR+REST)                                     
         DC    CL9'JAPN+AP  ',AL1(JAP+AP)                                       
         DC    CL9'JAPN+REST',AL1(JAP+REST)                                     
         DC    CL9'AP+REST  ',AL1(AP+REST)                                      
         DC    CL9'UK+EU+JAP',AL1(UK+EUR+JAP)                                   
         DC    CL9'UK+EUR+AP',AL1(UK+EUR+AP)                                    
         DC    CL9'UK+EU+RES',AL1(UK+EUR+REST)                                  
         DC    CL9'UK+JAP+AP',AL1(UK+JAP+AP)                                    
         DC    CL9'UK+JA+RES',AL1(UK+JAP+REST)                                  
         DC    CL9'UK+AP+RES',AL1(UK+AP+REST)                                   
         DC    CL9'EU+JAP+AP',AL1(EUR+JAP+AP)                                   
         DC    CL9'EU+JA+RES',AL1(EUR+JAP+REST)                                 
         DC    CL9'EU+AP+RES',AL1(EUR+AP+REST)                                  
         DC    CL9'JA+AP+RES',AL1(JAP+AP+REST)                                  
         DC    CL9'UK+E+J+AP',AL1(UK+EUR+JAP+AP)                                
         DC    CL9'U+E+J+RES',AL1(UK+EUR+JAP+REST)                              
         DC    CL9'U+E+A+RES',AL1(UK+EUR+AP+REST)                               
         DC    CL9'U+J+A+RES',AL1(UK+JAP+AP+REST)                               
         DC    CL9'E+J+A+RES',AL1(EUR+JAP+AP+REST)                              
         DC    CL9'W/WIDE   ',AL1(WWIDE)                                        
         DC    CL9'WWIDE    ',AL1(WWIDE)                                        
         DC    CL9'U+E+J+A+R',AL1(WWIDE)                                        
         DC    CL9'ALL      ',AL1(WWIDE)                                        
         DC    X'FF'                                                            
