*          DATA SET TASYSMEDS  AT LEVEL 007 AS OF 07/09/12                      
         SPACE 2                                                                
*              EXPANSION OF MEDIA CODES                                         
         SPACE 1                                                                
TAMEDS   DS    0CL6                                                             
         DC    AL1(TV),CL5'TV'                                                  
         DC    AL1(RADIO),CL5'RADIO'                                            
         DC    AL1(CABLE),CL5'CABLE'                                            
         DC    AL1(PRINT),CL5'PRINT'                                            
         DC    AL1(INTERNET),CL5'INET'                                          
         DC    AL1(NEWMEDIA),CL5'NWMED'                                         
         DC    AL1(EVENT),CL5'EVENT'                                            
         DC    X'FF'                                                            
