*          DATA SET TATNRFILE  AT LEVEL 024 AS OF 10/26/90                      
*              DSECT TO COVER T&R RECORD LAYOUTS                                
         SPACE 3                                                                
TRRECD   DSECT                                                                  
TRRECORD DS    0C                                                               
         EJECT                                                                  
*              AGENCY RECORD                                                    
         SPACE 1                                                                
         ORG   TRRECORD                                                         
TRAYREC  DS    CL2                 TYPE 10                                      
TRAYAGY  DS    CL4                 KEY                                          
TRAYSUPR DS    CL4                 SUPER NUMBER                                 
TRAYBLTO DS    CL2                 KEY                                          
TRAYNAME DS    CL30                NAME                                         
TRAYADD1 DS    CL30                ADDRESS                                      
TRAYADD2 DS    CL30                                                             
TRAYADD3 DS    CL30                                                             
TRAYATTN DS    CL30                ATTENTION                                    
TRAYTEL  DS    CL10                TELEPHONE NUMBER 334                         
TRAYBTYP DS    CL2                 BILL TYPE                                    
TRAYPCT1 DS    PL4                 PAYROLL PERCENT 1                            
TRAYPCT2 DS    PL4                 PAYROLL PERCENT 2                            
TRAYPCT3 DS    PL4                 PAYROLL PERCENT 3                            
TRAYPCT4 DS    PL4                 PAYROLL PERCENT 4                            
TRAYTNH  DS    PL4                 TAX AND HANDLING                             
TRAYLITM DS    PL4                 LINE ITEM CHARGE                             
TRAYFICA DS    PL4                 FICA PERCENT                                 
TRAYFICR DS    CL1                 FICA CREDIT FLAG Y OR N                      
TRAYCNTX DS    CL1                 CANADIAN TAX FLAG Y OR N                     
TRAYOFF  DS    CL2                 OFFICE CODE                                  
TRAYHOLD DS    CL1                 HOLD FLAG Y OR N                             
TRAYINVC DS    CL2                 INVOICE COPIES                               
TRAYNINV DS    CL6                 NEXT INVOICE                                 
TRAYETFL DS    CL1                 ET SYSTEM FLAG Y OR N                        
TRAYHFFL DS    CL1                 HOLDING FEE FLAG Y OR N                      
TRAYHFMW DS    CL1                 MONTH OR WEEK FOR HOLDING FEES               
TRAYHFWK DS    CL2                 N'WEEKS NOTICE                               
TRAYHFNA DS    CL1                 NO ACTION FLAG                               
         SPACE 3                                                                
*              ATTENTION RECORD                                                 
         SPACE 1                                                                
         ORG   TRRECORD                                                         
TRATREC  DS    CL2                 TYPE 1C                                      
TRATAGY  DS    CL4                 KEY                                          
TRATCODE DS    CL2                 CODE                                         
TRATNAME DS    CL30                NAME                                         
TRATADD1 DS    CL30                ADDRESS                                      
TRATADD2 DS    CL30                                                             
TRATADD3 DS    CL30                                                             
TRATATTN DS    CL30                ATTENTION                                    
         EJECT                                                                  
*              CLIENT RECORD                                                    
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRCLREC  DS    CL2                 TYPE 20                                      
TRCLCLI  DS    CL5                 KEY                                          
TRCLNAME DS    CL30                NAME                                         
         SPACE 3                                                                
*              PRODUCT RECORD                                                   
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRPRREC  DS    CL2                 TYPE 30                                      
TRPRPRD  DS    CL4                 KEY                                          
TRPRNAME DS    CL26                NAME                                         
         EJECT                                                                  
*              COMMERCIAL RECORD                                                
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRCOREC  DS    CL2                 TYPE 40 (72 AT THE MO)                       
TRCOAGY  DS    CL4                 AGENCY 10=AFTRA 20=SAG 30=AFM                
*                                  40=OTHER 50=SEG 70=ACTRA 80=UDA              
TRCOUN   DS    CL2                 UNION                                        
TRCOCID  DS    CL11                COMMERCIAL ID (ISCII)                        
TRCOLIFT DS    CL10                LIFT ID                                      
TRCOFCYC DS    CL6                 FIRST CYCLE DATE                             
TRCOFAIR DS    CL6                 FIRST AIR DATE                               
TRCOVERI DS    CL6                 DATE VERIFIED                                
TRCOVEBY DS    CL8                 VERIFIED BY                                  
TRCODUB  DS    CL6                 DUB DATE                                     
TRCOMED  DS    CL1                 MEDIA CODE RADIO-1 TV=2 OTH=3                
TRCOLEN  DS    CL2                 BASIC LENGTH                                 
TRCOVLEN DS    CL2                 VERSION LENGTH                               
TRCOAFMR DS    CL1                 1 2 OR 5                                     
TRCOBLTO DS    CL2                 BILL TO CODE                                 
TRCOHFFL DS    CL1                 HOLDING FEE: PRINT NOTICE Y/N                
TRCORLFL DS    CL1                 RELEASE FLAG Y/N                             
TRCOCLI  DS    CL5                 CLIENT                                       
TRCONAME DS    CL30                TITLE                                        
TRCOPRD  DS    CL20                PRODUCT DESC.                                
TRCOCOMM DS    CL40                COMMERCIAL COMMENT                           
TRCOYEAR DS    CL3                 YEAR CODE                                    
TRCOLOCL DS    CL4                 UNION LOCAL                                  
TRCOBRND DS    CL4                 BRAND CODE                                   
TRCOOAGY DS    CL4                 ORIGINAL AGENCY                              
TRCOOUN  DS    CL2                 ORIGINAL UNION                               
TRCOOCID DS    CL10                ORIGINAL ID                                  
TRCOLCID DS    CL10                LAST CID                                     
TRCODLFL DS    CL1                 DELETE FLAG Y/N                              
TRCOSPFL DS    CL1                 SPANISH FLAG Y/N                             
TRCOCBFL DS    CL1                 CABLE FLAG Y/N                               
TRCOADD  DS    CL2                 ADDENDUM CODE                                
TRCOCAST DS    CL3                 CAST COUNT                                   
         DS    CL2                                                              
TRCOFDTE DS    CL6                 FILM DATE                                    
TRCOFSTU DS    CL16                FILM STUDIO                                  
TRCOFCTY DS    CL16                FILM CITY                                    
TRCORDTE DS    CL6                 RECORD DATE                                  
TRCORSTU DS    CL16                RECORD STUDIO                                
TRCORCTY DS    CL16                RECORD CITY                                  
         DS    CL2                                                              
TRCOAFM1 DS    CL10                AFM CONTRACT 1                               
TRCOAFM2 DS    CL10                AFM CONTRACT 2                               
TRCODEPT DS    CL2                 DEPARTMENT                                   
         EJECT                                                                  
*              CAST RECORD                                                      
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRCAREC  DS    CL2                 TYPE 80 (74 AT THE MO)                       
TRCAAGY  DS    CL4                 AGENCY                                       
TRCAUN   DS    CL2                 UNION                                        
*                                  10=AFTRA 20=SAG 30=AFM                       
*                                  40=OTHER 50=SEG 70=ACTRA 80=UDA              
TRCACID  DS    CL11                COMMERCIAL ID (ISCII)                        
TRCASORT DS    CL4                 SORT KEY                                     
TRCALAST DS    CL16                LAST NAME                                    
TRCAINIT DS    CL1                 FIRST INITIAL                                
TRCASSN  DS    CL9                 SOCIAL SEC NUMBER                            
TRCACAT  DS    CL3                 CATEGORY CODE                                
TRCAYEAR DS    CL3                 YEAR CODE                                    
TRCACAM  DS    CL1                 Y=ON N=OFF                                   
TRCASTA  DS    CL2                 STATE WORKED                                 
TRCALOC  DS    CL3                 LOCAL WORKED                                 
TRCAAGNT DS    CL4                 AGENT CODE                                   
TRCAVERS DS    CL1                 IN BASIC AND LIFT=0 NOT IN LIFT=1            
TRCAMULT DS    CL1                 MULTI TRACK                                  
TRCASWET DS    CL1                 SWEETENINGS                                  
TRCANDUB DS    CL2                 N'DOUBLES                                    
TRCAFSDT DS    CL6                 FIRST SERVICES DATE                          
TRCAEXDT DS    CL6                 EXPIRATION DATE                              
TRCAHFDT DS    CL6                 HOLDING FEE NOTICES SENT                     
TRCAHFTY DS    CL1                 HOLDING FEE TYPE 0/9/8                       
TRCACHFF DS    CL1                 CAST HOLD FEE FLAG SPACE/8/9                 
TRCAOV1  DS    CL3                 OVERSCALE % 1                                
TRCAOV2  DS    CL3                 OVERSCALE % 1                                
TRCAGUFL DS    CL1                 GUARANTEE FLAG                               
TRCAMIFL DS    CL1                 MINOR FLAG                                   
TRCACORP DS    CL1                 CORPORATION NUMBER                           
TRCALOCL DS    CL4                 UNION LOCAL                                  
TRCALTFL DS    CL1                 LIFT TALENT FLAG S/L/N                       
TRCAHGAM DS    CL9                 HOLDING FEE GUARANTEE AMOUNT                 
TRCAHGBL DS    CL9                 HOLDING FEE GUARANTEE BALANCE                
TRCAPGBL DS    CL9                 PRIOR GUARANTEE BALANCE                      
TRCAHFC  DS    CL6                 HOLDING FEE CYCLE START                      
TRCAPHFC DS    CL6                 PRIOR HOLDING FEE CYCLE START                
TRCAHFEX DS    CL6                 HOLDING FEE EXPIRE DATE                      
TRCAFFDT DS    CL6                 FIRST FIXED CYCLE DATE                       
TRCAGUAR DS    CL4                 GUARANTEE CODE                               
TRCAGUTY DS    CL2                 GUARANTEE TYPE                               
TRCAGUEX DS    CL6                 GUARANTEE EXPIRY DATE                        
TRCACOMM DS    CL30                COMMENTS                                     
         EJECT                                                                  
*              W4 RECORD                                                        
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRW4REC  DS    CL2                 TYPE 60                                      
TRW4KEY  DS    0C                  KEY                                          
TRW4SSN  DS    CL9                 SSN                                          
         DS    CL2                                                              
TRW4ADD1 DS    CL30                ADDRESS                                      
TRW4ADD2 DS    CL30                                                             
TRW4ADD3 DS    CL30                                                             
TRW4ZIP  DS    CL9                                                              
         DS    CL2                                                              
TRW4ACT  DS    CL8                                                              
TRW4UDA  DS    CL8                                                              
         DS    CL2                 CORPORATIONS                                 
TRW4CRP1 DS    CL9                                                              
TRW4CRP2 DS    CL9                                                              
         DS    CL2                                                              
TRW4TYPE DS    CL1                                                              
TRW4CORP DS    0CL32               NAMES                                        
TRW4LAST DS    CL16                                                             
TRW4FRST DS    CL16                                                             
TRW4SEX  DS    CL1                 CODES                                        
TRW4I9DT DS    CL4                                                              
TRW4W4DT DS    CL6                                                              
TRW4RACE DS    CL1                                                              
TRW4FREQ DS    CL1                                                              
TRW4SYTD DS    CL1                 FLAGS                                        
TRW4DUE  DS    CL1                                                              
TRW4LIEN DS    CL1                                                              
TRW4GUAR DS    CL1                                                              
TRW4DEL  DS    CL1                                                              
         DS    CL2                                                              
TRW4MARI DS    CL1                                                              
TRW4FEDX DS    CL1                 FEDERAL                                      
TRW4FNUM DS    CL2                                                              
TRW4FFIX DS    CL4                                                              
TRW4STID DS    CL2                 STATE                                        
TRW4STAX DS    CL1                                                              
TRW4SNUM DS    CL2                                                              
TRW4SFIX DS    CL4                 LOCAL                                        
TRW4LCID DS    CL3                                                              
TRW4LFIX DS    CL4                                                              
TRW4RECI DS    CL1                                                              
TRW4MPRF DS    CL4                 MPRF PRECENT ????                            
TRW4PERM DS    CL4                 PERM CHAR PERCENT ????                       
         EJECT                                                                  
*              LIEN RECORD                                                      
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRLNREC  DS    CL2                 TYPE 71                                      
TRLNSSN  DS    CL9                 SS NUMBER                                    
TRLNTYPE DS    CL2                 TYPE                                         
TRLNRANK DS    CL2                 RANK (01-05)                                 
TRLNDUE  DS    CL9                 DUE                                          
TRLNBAL  DS    CL9                 BALANCE                                      
TRLNCOL  DS    CL9                 COLLECTED                                    
TRLNXMPT DS    CL9                 EXEMPT                                       
TRLNAMT  DS    CL9                 DEDUCTION AMOUNT                             
TRLNPCT  DS    CL5                 DEDUCTION PERCENT                            
TRLNEXP  DS    CL6                 EXPIRY DATE                                  
TRLNPAYE DS    CL9                 PAYEE                                        
         EJECT                                                                  
*              USAGE RECORD                                                     
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRUSREC  DS    CL2                 TYPE 90                                      
TRUSAGY  DS    CL4                 AGENCY                                       
TRUSUN   DS    CL2                 UNION                                        
*                                  10=AFTRA 20=SAG 30=AFM                       
*                                  40=OTHER 50=SEG 70=ACTRA 80=UDA              
TRUSCID  DS    CL11                COMMERCIAL ID (ISCII)                        
TRUSMED  DS    CL1                 MEDIA                                        
TRUSWKS  DS    CL2                 N'WEEKS                                      
TRUSSTRT DS    CL6                 CYCLE START                                  
TRUSEND  DS    CL6                 CYCLE END                                    
TRUSINV  DS    CL6                 INVOICE NUMBER                               
TRUSAPPL DS    CL1                 APPLY CODE                                   
TRUSDATE DS    CL6                 INVOICE DATE                                 
TRUSCNTX DS    CL1                 CANADIAN TAX FLAG                            
TRUSTYPE DS    CL2                 PAYMENT TYPE                                 
TRUSUSE  DS    CL3                 DDS USE CODE                                 
TRUSUTYP DS    XL1                 DDS USE TYPE                                 
TRUSAGE  DS    CL20                USAGE DETAILS - VARIES WITH PAYMENT          
         ORG   TRUSAGE                                                          
TRUSMAJ  DS    CL1                 MAJORS                                       
TRUSUNS  DS    CL3                 N'UNITS                                      
TRUSUMAJ DS    CL1                 MAJORS UPGRADE                               
TRUSUUNS DS    CL3                 N'UNITS UPGRADE                              
         ORG   TRUSAGE                                                          
TRUSSUN  DS    CL3                 START USE NUMBER                             
TRUSSUNL DS    CL3                 START USE NUMBER LIFT                        
TRUSSUNB DS    CL3                 START USE NUMBER BASIC                       
TRUSEUN  DS    CL3                 END USE NUMBER                               
TRUSEUNL DS    CL3                 END USE NUMBER LIFT                          
TRUSEUNB DS    CL3                 END USE NUMBER BASIC                         
TRUSG13  DS    CL1                 G13 USE Y/N                                  
TRUSFBC  DS    CL1                 FROM B OR C                                  
         ORG   TRUSAGE                                                          
TRUSPCDY DS    CL2                 PENALTIES COMPANY                            
TRUSPCPC DS    CL3                                                              
TRUSPCAD DS    CL2                                                              
TRUSPADY DS    CL2                 PENALTIES AGENCY                             
TRUSPAPC DS    CL3                                                              
TRUSPAAD DS    CL2                                                              
         ORG   TRUSAGE                                                          
TRUSDCL  DS    CL1                 DEALER CLASS A/B                             
TRUSDNY  DS    CL1                 WITH NY? Y/N                                 
         EJECT                                                                  
*              INVOICE RECORD                                                   
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRINREC  DS    CL2                 TYPE 80                                      
TRINAGY  DS    CL4                 AGENCY                                       
TRINUN   DS    CL2                 UNION                                        
*                                  10=AFTRA 20=SAG 30=AFM                       
*                                  40=OTHER 50=SEG 70=ACTRA 80=UDA              
TRINCID  DS    CL11                COMMERCIAL ID (ISCII)                        
TRINDEPT DS    CL2                 DEPARTMENT                                   
TRINIAGY DS    CL4                 INVOICE AGENCY                               
TRININV  DS    CL6                 INVOICE NUMBER                               
TRINOAGY DS    CL4                 ORIGINAL AGENCY                              
TRINOUN  DS    CL2                 ORIGINAL UNION                               
TRINOCID DS    CL11                ORIGINAL COMMERCIAL ID (ISCII)               
TRINEST  DS    CL16                ESTIMATE NUMBER                              
TRINEPER DS    CL2                 ESTIMATE PERIOD (NN)                         
TRINPO   DS    CL10                PO NUMBER                                    
TRINNADD DS    CL1                 NON ADD FLAG (Y/N)                           
TRINSERE DS    CL1                 SESSION/REUSE (S/R)                          
TRINCATX DS    CL1                 CANADIAN TAX (Y/N)                           
TRINPWPC DS    CL4                 P&W PERCENT (2 DEC)                          
TRINAPPC DS    CL1                 APPLY CODE                                   
TRINBLTO DS    CL2                 BILL TO CODE                                 
TRINCLI  DS    CL5                 CLIENT CODE                                  
TRINLCID DS    CL10                LIFT CID                                     
TRINCTIT DS    CL30                COMMERCIAL TITLE                             
TRINPROD DS    CL20                PRODUCT DESC                                 
TRINFSTU DS    CL16                FILM STUDIO                                  
TRINRSTU DS    CL16                RECORD STUDIO                                
TRINFCTY DS    CL16                FILM CITY                                    
TRINRCTY DS    CL16                RECORD CITY                                  
TRINFDTE DS    CL6                 FILM DATE                                    
TRINRDTE DS    CL6                 RECORD DATE                                  
TRINAFM1 DS    CL10                AFM CONTRACT 1                               
TRINAFM2 DS    CL10                AFM CONTRACT 2                               
TRINAFML DS    CL16                AFM LEADER                                   
TRINAFMR DS    CL1                 AFM RATE (1/2/5)                             
TRINYEAR DS    CL3                 YEAR CODE                                    
TRINFCYC DS    CL6                 FIRST FIXED CYCLE                            
TRINFAIR DS    CL6                 FIRST AIR DATE                               
TRINFDUB DS    CL6                 FIRST DUB DATE                               
TRINMED  DS    CL1                 MEDIA CODE (1=RAD, 2=TV, 3=OTHER)            
TRINLOCL DS    CL4                 LOCAL UNION                                  
TRINLEN  DS    CL2                 LENGTH (SECONDS)                             
TRINELEN DS    CL2                 EDIT LENGTH (SECONDS)                        
TRINBRND DS    CL4                 BRAND CODE                                   
TRINCAST DS    CL3                 CAST COUNT                                   
TRINSPAN DS    CL1                 SPANISH FLAG (Y/N)                           
TRINCABL DS    CL1                 CABLE FLAG (Y/N)                             
TRINPDTE DS    CL6                 PAID DATE                                    
TRINPBY  DS    CL8                 PAID BY                                      
TRINVDTE DS    CL6                 VERIFIED DATE                                
TRINVBY  DS    CL8                 VERIFIED BY                                  
TRINCDTE DS    CL6                 CHECK DATE                                   
TRINBDTE DS    CL6                 BILL DATE                                    
TRINPTYP DS    CL2                 PAYMENT TYPE (OLD)                           
TRINUSE  DS    CL3                 PAYMENT TYPE (DDS)                           
TRINUTYP DS    CL1                 USE TYPE (DDS)                               
TRINWKS  DS    CL2                 CYCLE WEEKS                                  
TRINCSTR DS    CL6                 CYCLE START                                  
TRINCEND DS    CL6                 CYCLE END                                    
TRINOFF  DS    CL2                 OFFICE CODE                                  
TRINCCON DS    CL5                 CANADIAN CONVERSION RATE (2 DEC)             
TRINGROS DS    CL9                 GROSS AMOUNT                                 
TRINMISC DS    CL9                 MISC. AMOUNT                                 
TRINPTAX DS    CL9                 PAYROLL TAX                                  
TRINFICA DS    CL9                 FICA                                         
TRINFUTA DS    CL9                 FUTA                                         
TRINSUI  DS    CL9                 SUI                                          
TRINWC   DS    CL9                 WC (WHAT IS THIS?)                           
TRINHAND DS    CL9                 HANDLING                                     
TRINPNW  DS    CL9                 P&W                                          
TRINSPNW DS    CL9                 SUBJECT TO P&W                               
TRINADUE DS    CL9                 AMOUNT DUE                                   
TRINGHND DS    CL9                 GROSS HANDLING                               
TRINMDED DS    CL9                 MISCELLANEOUS DEDUCTIONS                     
TRINCIFL DS    CL1                 CREDIT INVOICE FLAG (Y/N)                    
TRINGUFL DS    CL1                 GUARANTEE FLAG (Y/N)                         
TRINPOFL DS    CL1                 PAYTAX OVERRIDE (Y/N)                        
TRINHOVR DS    CL1                 HANDLING OVERRIDE (Y/N)                      
TRINCOMM DS    CL40                HISTORY COMMENTS                             
TRINICOM DS    CL30                INVOICE COMMENTS                             
TRINVERS DS    CL1                 VERSION 1=PAY LIFT 0=PAY BOTH                
         SPACE 1                                                                
TRINAGE  DS    CL20                USAGE DETAILS - VARIES WITH PAYMENT          
         ORG   TRINAGE                                                          
TRINMAJ  DS    CL1                 MAJORS                                       
TRINUNS  DS    CL3                 N'UNITS                                      
TRINUMAJ DS    CL1                 MAJORS UPGRADE                               
TRINUUNS DS    CL3                 N'UNITS UPGRADE                              
         ORG   TRINAGE                                                          
TRINSUN  DS    CL3                 START USE NUMBER                             
TRINSUNL DS    CL3                 START USE NUMBER LIFT                        
TRINSUNB DS    CL3                 START USE NUMBER BASIC                       
TRINEUN  DS    CL3                 END USE NUMBER                               
TRINEUNL DS    CL3                 END USE NUMBER LIFT                          
TRINEUNB DS    CL3                 END USE NUMBER BASIC                         
TRING13  DS    CL1                 G13 USE Y/N                                  
TRINFBC  DS    CL1                 FROM B OR C                                  
         ORG   TRINAGE                                                          
TRINPCDY DS    CL2                 PENALTIES COMPANY                            
TRINPCPC DS    CL3                                                              
TRINPCAD DS    CL2                                                              
TRINPADY DS    CL2                 PENALTIES AGENCY                             
TRINPAPC DS    CL3                                                              
TRINPAAD DS    CL2                                                              
         ORG   TRINAGE                                                          
TRINDCL  DS    CL1                 DEALER CLASS A/B                             
TRINDNY  DS    CL1                 WITH NY? Y/N                                 
         EJECT                                                                  
*              CLASS A RECORD                                                   
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRAAREC  DS    CL2                 TYPE 81                                      
TRAAAGY  DS    CL4                 AGENCY                                       
TRAAUN   DS    CL2                 UNION                                        
*                                  10=AFTRA 20=SAG 30=AFM                       
*                                  40=OTHER 50=SEG 70=ACTRA 80=UDA              
TRAACID  DS    CL11                COMMERCIAL ID (ISCII)                        
TRAADEPT DS    CL2                 DEPARTMENT                                   
TRAAIAGY DS    CL4                 INVOICE AGENCY                               
TRAAINV  DS    CL6                 INVOICE NUMBER                               
TRAAOAGY DS    CL4                 AGENCY                                       
TRAAOUN  DS    CL2                 UNION                                        
TRAAOCID DS    CL11                COMMERCIAL ID (ISCII)                        
         SPACE 1                                                                
TRAADET  DS    0CL25               20 OF THESE                                  
TRAAUSE  DS    CL3                 USE NUMBER                                   
TRAAUDTE DS    CL6                 USE DATE                                     
TRAANET  DS    CL1                 NETWORK                                      
TRAAPROG DS    CL14                PROGRAM NAME                                 
TRAAVERS DS    CL1                 VERSION (Y/N)                                
         EJECT                                                                  
*              CHECK RECORD                                                     
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRCKREC  DS    CL2                 TYPE 82                                      
TRCKSSN  DS    CL9                 SS NUMBER                                    
TRCKAGY  DS    CL4                 AGENCY                                       
TRCKUN   DS    CL2                 UNION                                        
*                                  10=AFTRA 20=SAG 30=AFM                       
*                                  40=OTHER 50=SEG 70=ACTRA 80=UDA              
TRCKCID  DS    CL11                COMMERCIAL ID (ISCII)                        
TRCKDEPT DS    CL2                 DEPARTMENT                                   
TRCKIAGY DS    CL4                 INVOICE AGENCY                               
TRCKINV  DS    CL6                 INVOICE NUMBER                               
TRCKOAGY DS    CL4                 AGENCY                                       
TRCKOUN  DS    CL2                 UNION                                        
TRCKOCID DS    CL11                COMMERCIAL ID (ISCII)                        
TRCKCAT  DS    CL3                 CATEGORY CODE                                
TRCKYEAR DS    CL3                 YEAR CODE                                    
TRCKCAM  DS    CL1                 CAMERA (Y=ON N=OFF)                          
TRCKRSTA DS    CL2                 RES. STATE                                   
TRCKRLOC DS    CL3                 RES. LOCAL                                   
TRCKWSTA DS    CL2                 WORK STATE                                   
TRCKWLOC DS    CL3                 WORK LOCAL                                   
TRCKAGNT DS    CL4                 AGENT CODE                                   
TRCKVERS DS    CL1                 VERSION (0=BASIC+LIFT 1=NOT IN LIFT)         
TRCKCORP DS    CL1                 CORP (N OR Y)                                
TRCKCTID DS    CL9                 CORP TAX ID                                  
TRCKMULT DS    CL1                 MULTI TRACKING                               
TRCKSWET DS    CL1                 SWEETENING                                   
TRCKDUBS DS    CL2                 DOUBLES                                      
TRCKFSRV DS    CL6                 FIRST SERVICES DATE                          
TRCKCEXP DS    CL6                 COMMERCIAL EXPIRY DATE                       
TRCKOS1  DS    CL3                 OVERSCALE PERCENT 1                          
TRCKOS2  DS    CL3                 OVERSCALE PERCENT 2                          
TRCKCGFL DS    CL1                 CYCLE GUARANTEE FLAG Y/N                     
TRCKMIFL DS    CL1                 MINOR FLAG Y=UNDER FLAG OR N                 
TRCKHFFC DS    CL6                 HOLDING FEE FIRST CYCLE DATE                 
TRCKHFAM DS    CL9                 HOLDING FEE AMOUNT                           
TRCKGBAL DS    CL9                 GUARANTEE BALANCE                            
TRCKGDTE DS    CL6                 GUARANTEE DATE                               
TRCKLOCL DS    CL4                 LOCAL                                        
TRCKHFEX DS    CL6                 HOLDING FEE EXPIRY DATE                      
TRCKWHST DS    CL2                 WITHHOLDING STATE                            
TRCKWHLO DS    CL3                 WITHHOLDING LOCAL                            
TRCKNUM  DS    CL8                 CHECK NUMBER                                 
TRCKDTE  DS    CL6                 CHECK DATE                                   
TRCKPDTE DS    CL6                 PAYROLL DATE                                 
TRCKSERE DS    CL1                 SESSION/REUSE CODE                           
TRCKGROS DS    CL9                 GROSS                                        
TRCKREIM DS    CL9                 REIMBURSED                                   
TRCKREEX DS    CL9                 REIMBURSED EXPENSES                          
TRCKFIT  DS    CL9                 FIT                                          
TRCKFICA DS    CL9                 FICA                                         
TRCKSIT  DS    CL9                 SIT                                          
TRCKSUI  DS    CL9                 SUI                                          
TRCKSDI  DS    CL9                 SDA                                          
TRCKLIT  DS    CL9                 LIT                                          
TRCKLIT2 DS    CL9                 LIT2                                         
TRCKCTFL DS    CL1                 CANADIAN TAX FLAG                            
TRCKCTAX DS    CL9                 CANADIAN TAX                                 
TRCKMPR  DS    CL9                 MPR FUND                                     
TRCKPERM DS    CL9                 PERM CHARITIES                               
TRCKMISC DS    CL9                 MISCELLANEOUS DEDUCTIONS                     
TRCKNET  DS    CL9                 NET AMOUNT                                   
TRCKPNW  DS    CL9                 P&W                                          
TRCKHNW  DS    CL9                 H&W                                          
TRCKDUCO DS    CL9                 DUE COMPANY                                  
TRCKLIEN DS    CL9                 LIEN AMOUNT                                  
TRCKASPW DS    CL9                 AMOUNT SUB P&W ?????                         
TRCKAMPD DS    CL9                 AMOUNT PAID                                  
TRCKGAPL DS    CL9                 GUARANTEE APPLIED                            
TRCKAAPL DS    CL9                 AMOUNT APPLIED                               
TRCKTYGR DS    CL9                 TEMP YTD GROSS ???                           
TRCKTYSG DS    CL9                 TEMP YTD ST GROSS ???                        
TRCKSEHR DS    CL4                 SESSION HOURS (2 DEC)                        
TRCKSOHR DS    CL4                 SESSION OT HOURS (2 DEC)                     
TRCKSDHR DS    CL4                 SESSION DT HOURS (2 DEC)                     
TRCKSTHR DS    CL4                 SESSION TRAVEL HOURS (2 DEC)                 
TRCKSWHR DS    CL4                 SESSION PDWF HOURS (2 DEC)                   
TRCKDAYS DS    CL2                 DAYS                                         
TRCKSPTS DS    CL2                 SPOTS                                        
TRCKPWPC DS    CL4                 P&W PERCENT (2 DEC)                          
TRCKCLER DS    CL6                 CHECK CLEARED DATE                           
TRCKSTAT DS    CL1                 CHECK STATUS P=PRINTED V=VOIDED              
*                                               C=CLEARD  A=ADJUST              
TRCKCOM  DS    CL30                CHECK COMMENTS                               
TRCKACOD DS    CL1                 APPLY CODE                                   
TRCKICOD DS    CL1                 INCLUDE CODE                                 
TRCKGCOD DS    CL4                 GUARANTEE ID CODE                            
TRCKTAGS DS    CL2                 TAGS                                         
TRCKUCST DS    CL2                 UC STATE                                     
TRCKNADD DS    CL1                 NON ADD FLAG                                 
TRCKCRIN DS    CL1                 CREDIT INVOICE FLAG                          
         EJECT                                                                  
*              HISTORY COMMENT RECORD                                           
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRHCREC  DS    CL2                 TYPE 83                                      
TRHCAGY  DS    CL4                 AGENCY                                       
TRHCUN   DS    CL2                 UNION                                        
*                                  10=AFTRA 20=SAG 30=AFM                       
*                                  40=OTHER 50=SEG 70=ACTRA 80=UDA              
TRHCCID  DS    CL11                COMMERCIAL ID (ISCII)                        
TRHCCOMM DS    CL40                COMMENT                                      
         EJECT                                                                  
*              GUARANTEE RECORD                                                 
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRGUREC  DS    CL2                 TYPE 6C                                      
TRGUSSN  DS    CL9                 SS#                                          
TRGUGUA  DS    CL4                 CODE                                         
TRGUTYPE DS    CL2                 TYPE 01-06                                   
TRGUAGY  DS    CL4                 AGENCY                                       
TRGUATT  DS    CL2                 ATTENTION                                    
TRGUCLI  DS    CL5                 CLIENT                                       
TRGUAMT  DS    CL9                 AMOUNT                                       
TRGUUSED DS    CL9                 USED SO FAR                                  
TRGUBAL  DS    CL9                 BALANCE                                      
TRGUINIT DS    CL9                 INITIAL PAYMENT                              
TRGUSTRT DS    CL6                 START DATE                                   
TRGUEND  DS    CL6                 END DATE                                     
TRGUPAGE DS    CL3                 PAGE COUNT                                   
TRGUHIST DS    CL40                HISTORY COMMENT                              
TRGUCOMM DS    CL40                COMMENT                                      
TRGUCORP DS    CL1                 CORP CODE                                    
TRGUPAGY DS    CL4                 PRIMARY AGENCY (TYPE 6)                      
TRGUPUN  DS    CL2                         UNION                                
TRGUPCID DS    CL10                        CID                                  
         SPACE 3                                                                
*              GUARANTEE TRACKING RECORD                                        
         SPACE 3                                                                
         ORG   TRRECORD                                                         
TRGTREC  DS    CL2                 TYPE A8                                      
TRGTSSN  DS    CL9                 SS#                                          
TRGTGUA  DS    CL4                 CODE                                         
TRGTTYPE DS    CL2                 TYPE 01-06                                   
TRGTPAGE DS    CL3                 PAGE NUMBER                                  
TRGTTRPT DS    CL2                 PAYMENT TYPE OLD T&R                         
TRGTPTYP DS    CL4                 PAYMENT TYPE NEW 3+1                         
TRGTCYCS DS    CL6                 CYCLE START                                  
TRGTCYCE DS    CL6                 CYCLE END                                    
TRGTPAY  DS    CL9                 PAY AMOUNT                                   
TRGTPNH  DS    CL9                 P&H                                          
TRGTCRD  DS    CL9                 CREDITS TAKEN                                
TRGTBAL  DS    CL9                 BALANCE                                      
TRGTAGY  DS    CL4                 AGENCY                                       
TRGTINV  DS    CL6                 INVOICE NUMBER                               
TRGTCAGY DS    CL4                 COMMERCIAL AGENCY                            
TRGTUNI  DS    CL2                 UNION                                        
TRGTCID  DS    CL10                COMMERCIAL ID                                
TRGTCAT  DS    CL3                 CATEGORY                                     
TRGTCAM  DS    CL1                 CAMERA                                       
TRGTYEAR DS    CL3                 UNION YEAR                                   
TRGTOV   DS    CL3                 OVERSCALE 1                                  
TRGTOV2  DS    CL3                 OVERSCALE 2                                  
TRGTHIST DS    CL40                HISTORY COMMENT                              
