*          DATA SET TAUCDSECT  AT LEVEL 080 AS OF 03/05/15                      
         SPACE                                                                  
*              TAPE/DISK DSECTS                                                 
         SPACE 2                                                                
*        PA DSECT                                                               
*                                                                               
TUPAD    DSECT                                                                  
TUPAREC  DS    0C                  PA RECORD                                    
TUPAID   DS    CL1                 RECORD IDEA                                  
TUPAIDAQ EQU   C'A'                  HEADER RECORD                              
TUPAIDEQ EQU   C'E'                  EMPLOYER RECORD                            
TUPAIDSQ EQU   C'S'                  EMPLOYEE RECORD                            
TUPAIDTQ EQU   C'T'                  TOTAL    RECORD                            
*                                                                               
*        HEADER RECORD                                                          
*                                                                               
TUPAATYP DS    CL1                 REPORT TYPE                                  
TUPAORGQ EQU   C'O'                  ORIGINAL REPORT                            
TUPAAMDQ EQU   C'A'                  AMENDED  REPORT                            
*                                                                               
TUPAFIL1 DS    CL1                 FILLER 1                                     
TUPAFIL2 DS    CL1                 FILLER 2                                     
TUPAFIL3 DS    CL1                 FILLER 3                                     
TUPAFIL4 DS    CL1                 FILLER 4                                     
TUPAFIL5 DS    CL1                 FILLER 5                                     
TUPAFIL6 DS    CL1                 FILLER 6                                     
TUPAFIL7 DS    CL1                 FILLER 7                                     
TUPAFIL8 DS    CL1                 FILLER 8                                     
TUPAFIL9 DS    CL1                 FILLER 9                                     
*                                                                               
         ORG   TUPAATYP                                                         
*                                                                               
*        EMPLOYER RECORD                                                        
*                                                                               
TUPASEIN DS    CL9                 STATE EMPLOYER ACCOUNT NUMBER                
TUPACKDG DS    CL1                 CHECK DIGIT - LEAVE BLANK                    
TUPAPER  DS    CL5                 FILING PERIOD - QYYYY                        
TUPA#EM1 DS    CL5                 # OF EMPLOYEES IN MONTH 1                    
TUPA#EM2 DS    CL5                 # OF EMPLOYEES IN MONTH 2                    
TUPA#EM3 DS    CL5                 # OF EMPLOYEES IN MONTH 3                    
TUPAGRST DS    CL13                TOTAL GROSS   WAGES                          
TUPATWHD DS    CL13                TOTAL WITHHOLDING                            
TUPATTXW DS    CL13                TOTAL TAXABLE WAGES                          
TUPATECN DS    CL13                TOTAL EMPLOYER CONTRIBUTIONS                 
*                                                                               
         ORG   TUPAATYP                                                         
*                                                                               
         DS    CL9                 STATE EMPLOYER ID                            
TUPASSN  DS    CL9                 EMPLOYEE SOCIAL SEC #                        
TUPALNAM DS    CL25                EMPLOYEE LAST   NAME                         
TUPAFNAM DS    CL15                EMPLOYEE FIRST  NAME                         
TUPAMNAM DS    CL15                EMPLOYEE MIDDLE NAME                         
TUPAEGRS DS    CL11                EMPLOYEE GROSS   WAGES                       
TUPAETAX DS    CL11                EMPLOYEE TAXABLE WAGES                       
TUPACRWK DS    CL2                 EMPLOYEE WEEKS WORKED                        
TUPAEFL1 DS    CL1                 FILLER 1                                     
TUPAEFL2 DS    CL1                 FILLER 2                                     
*                                                                               
         ORG                                                                    
TUPARECL EQU   *-TUPAREC           LENGTH OF RECORD                             
*                                                                               
         EJECT                                                                  
*                                                                               
*        NJ (TP ONLY) TAPE DSECT                                                
         SPACE                                                                  
TUNJTPD  DSECT                                                                  
TUNJID   DS    CL1                 RECORD IDENTIFIER                            
TUNJIDX  EQU   C'X'                1ST RECORD ON TAPE                           
TUNJIDM  EQU   C'M'                2ND RECORD ON TAPE (REPLACES A)              
*UNJIDA  EQU   C'A'                2ND RECORD ON TAPE                           
TUNJIDB  EQU   C'B'                1 RECORD PER EMPLOYEE                        
TUNJF1   DS    CL119                                                            
TUNJQTRX DS    CL1                 QUARTER                                      
TUNJYRX  DS    CL1                 YEAR                                         
         DS    CL34                                                             
TUNJAUTH DS    CL4                 0280                                         
         SPACE                                                                  
         ORG   TUNJF1                                                           
TUNJREG  DS    CL12                00734199006000                               
         DS    CL2                                                              
TUNJEMNM DS    CL36                EMPLOYER NAME                                
TUNJEMAD DS    CL35                         ADDRESS                             
TUNJEMCT DS    CL20                         CITY                                
TUNJEMST DS    CL5                          STATE                               
TUNJEMZP DS    CL9                          ZIP CODE                            
TUNJQTRA DS    CL1                 QUARTER                                      
TUNJYRA  DS    CL1                 REPORTING YEAR                               
TUNJNEMP DS    CL6                 NUMBER OF EMPLOYEES                          
TUNJTOTW DS    CL14                TOTAL GROSS EARNINGS                         
TUNJEMID DS    CL9                 FED EMP ID 363613299                         
         DS    XL9                                                              
         SPACE                                                                  
         ORG   TUNJF1                                                           
TUNJSSN  DS    CL9                 SS NUMBER                                    
TUNJSSNM DS    CL30                EMPLOYEE NAME                                
TUNJSSWG DS    CL12                GROSS EARNINGS FOR QTR XXXXXXXXXX.XX         
TUNJWKS  DS    CL2                 WEEKS WORKED DURING QUARTER                  
         DS    XL106                                                            
         EJECT                                                                  
         SPACE                                                                  
*        OHIO (TP ONLY) TAPE DSECT                                              
         SPACE                                                                  
TUOHTPD  DSECT                                                                  
TUOTID   DS    C                   RECORD ID                                    
TUOTIDE  EQU   C'E'                FIRST RECORD ON TAPE                         
TUOTIDW  EQU   C'W'                ONE PER EMPLOYEE                             
TUOTIDT  EQU   C'T'                LAST RECORD ON TAPE                          
TUOTF1   DS    CL4                                                              
TUOTEMID DS    CL9                 FED EMPLOYER ID NUMBER 363613299             
TUOTQTRE DS    CL1                 QUARTER 1,2,3 OR 4                           
TUOTYRE  DS    CL2                 REPORTING YEAR                               
TUOTFZR  DS    CL3                 VALUE C'000'                                 
         DS    CL3                                                              
TUOTEMNM DS    CL50                EMPLOYER NAME - TALENT PARTNERS              
TUOTEMAD DS    CL40                         ADDRESS 303 E. OHIO STREET          
TUOTEMCT DS    CL25                         CITY    CHICAGO                     
TUOTEMST DS    CL10                         STATE   ILLINOIS                    
TUOTFPC  DS    CL5                 FOREIGN POSTAL CODE                          
TUOTZIP  DS    CL5                 ZIP CODE - 60611                             
TUOTNMCD DS    CL1                 NAME CODE                                    
TUOTNCDS EQU   C'S'                                                             
         DS    CL1                                                              
TUOTBFCT DS    CL2                 BLOCKING FACTOR = '25'                       
         DS    CL5                                                              
TUOTTXCD DS    CL1                 TAX TYPE CODE                                
TUOTSTCD DS    CL2                 STATE CODE      = '39'                       
         DS    CL2                                                              
TUOTSTAC DS    CL15                STATE ACCOUNT NO 000939919003                
         DS    CL88                                                             
         SPACE                                                                  
         ORG   TUOTF1                                                           
TUOTSSN  DS    CL9                 SS NUMBER                                    
TUOTSSNM DS    CL27                SS NAME - LAST - FIRST                       
         DS    CL102                                                            
TUOTWAGE DS    CL9                 GROSS EARNINGS FOR QUARTER                   
         DS    CL53                                                             
TUOTWKS  DS    CL2                 WEEKS WORKED FOR QUARTER                     
         DS    CL72                                                             
         SPACE                                                                  
         ORG   TUOTF1                                                           
TUOTECNT DS    CL7                 TOTAL EMPLOYEES ON TAPE                      
         DS    CL26                                                             
TUOTWGT  DS    CL13                TOTAL GROSS EARNINGS FOR QUARTER             
         DS    CL228                                                            
         EJECT                                                                  
         SPACE                                                                  
*        FLORIDA (TP ONLY) TAPE DSECT                                           
         SPACE                                                                  
TUFLTPD  DSECT                                                                  
TUFTID   DS    CL1                 RECORD ID                                    
TUFTIDA  EQU   C'A'                FIRST RECORD ON TAPE                         
TUFTIDB  EQU   C'B'                BYPASS RECORD                                
TUFTIDE  EQU   C'E'                EMPLOYER RECORD                              
TUFTIDW  EQU   C'W'                BYPASS                                       
TUFTIDS  EQU   C'S'                ONE RECORD PER EMPLOYEE                      
TUFTIDI  EQU   C'I'                                                             
TUFTIDT  EQU   C'T'                SECOND TO LAST RECORD ON TAPE                
TUFTIDF  EQU   C'F'                LAST RECORD ON TAPE                          
*                                                                               
TUFTREC  DS    CL274                                                            
*                                                                               
         ORG   TUFTREC                                                          
         DS    CL157                                                            
TUFTENCD DS    CL1                 NAME CODE                                    
TUFTENCS EQU   C'S'                'S' SURNAME APPEARS FIRST IN REC             
TUFTENCF EQU   C'F'                'F' FIRST NAME APPEARS FIRST IN REC          
         DS    CL116                                                            
*                                                                               
         ORG   TUFTREC             'S' RECORD                                   
TUFTSSN  DS    CL9                 SS NUMBER                                    
TUFTSSNM DS    CL27                   NAME - LAST - FIRST                       
         DS    CL86                                                             
TUFTSTCD DS    CL2                 STATE CODE '12'                              
TUFTSUNC DS    CL2                 UNIT CODE (OR BLANK)                         
TUFTSQTR DS    CL2                 QTR END MONTH                                
TUFTSYY  DS    CL2                 REPORTING YEAR                               
TUFTWAGE DS    CL9                 GROSS EARNINGS FOR QTR XXXXXXX.XX            
         DS    CL9                                                              
TUFTWKS  DS    CL2                 WEEKS WORKED FOR QTR                         
         DS    CL13                                                             
TUFTACCT DS    CL12                ACCOUNT NUMBER AND SUFFIX (LEFT-BL)          
         DS    CL35                                                             
TUFTTXTY DS    CL1                 EMPLOYMENT SECURITY                          
TUFTTXTB EQU   C'B'                                                             
         DS    CL63                                                             
         EJECT                                                                  
*        TAPE DSECT VERSION ONE                                                 
*        CURRENTLY FOR OREGON/TP AND HAWAII/TP                                  
         SPACE                                                                  
TUVER1D  DSECT                                                                  
TUV1ID   DS    CL1                 RECORD ID                                    
TUV1IDA  EQU   C'A'                FIRST RECORD ON TAPE                         
TUV1IDB  EQU   C'B'                SECOND RECORD ON TAPE                        
TUV1IDE  EQU   C'E'                THIRD RECORD ON TAPE                         
TUV1IDS  EQU   C'S'                ONE RECORD PER EMPLOYEE                      
TUV1IDT  EQU   C'T'                SECOND TO LAST RECORD ON TAPE                
TUV1IDF  EQU   C'F'                LAST RECORD ON TAPE                          
*                                                                               
TUV1YEAR DS    CL4                 REPORTING YEAR                               
TUV1EMID DS    CL9                 FED EMPLOYER ID NUMBER                       
TUV1C3   DS    CL1                                                              
TUV1MM   DS    CL2                 MONTH                                        
TUV1YY   DS    CL2                 YR                                           
         ORG   TUV1C3                                                           
TUV1TAXT DS    CL4                 "UTAX" FOR MASS.                             
         DS    CL1                                                              
         DS    CL4                                                              
TUV1EMNM DS    CL50                EMPLOYER NAME                                
TUV1EMAD DS    CL40                         ADDRESS                             
TUV1EMCT DS    CL25                         CITY                                
TUV1EMST DS    CL2                          STATE                               
         DS    CL13                                                             
TUV1ZIP  DS    CL5                 ZIP CODE - 60611                             
TUV1ZIP2 DS    CL5                 EXTENSION  '-    '                           
TUV1F1   DS    CL112                                                            
         ORG   TUV1F1              ( MASS. )                                    
TUV1CNTP DS    CL30                CONTACT PERSON                               
TUV1CNTF DS    CL10                CONTACT PHONE                                
TUV1CNTX DS    CL4                 EXTENSION                                    
         DS    CL68                                                             
TUV1LNQ  EQU   *-TUV1ID                                                         
         SPACE                                                                  
         ORG   TUV1C3              'B' RECORD                                   
         SPACE                                                                  
TUV1BCMP DS    CL8                 NAME OF MAIN FRAME - IBM                     
TUV1BLBL DS    CL2                 INTERNAL LABLING - SL=IBM STANDARD           
*                                  LABLE, NS=NON STANDARD, NL - NOLABLE         
TUV1BPAR DS    CL1                 'O' - ODD PARITY ONLY                        
TUV1BDEN DS    CL2                 DENSITY - 16 = 1600 CPI, 62 = 6250           
*                                  CPI FO R 9 TRACK TAPE, 38= 38K IBM           
*                                  COMPATIBLE 3480 CARTRIDGE                    
TUV1BRCD DS    CL3                 RECORDING CODE - EBC - EBCIDIC               
*                                  ASC = ASCII                                  
TUV1BTRK DS    CL1                 N'TRACKS-'9'-9 TRACK,'C'- CARTRIDGE          
         DS    CL3                 BLANKS                                       
TUV1BCNM DS    CL44                COPY RETURN NAME                             
TUV1BCAD DS    CL35                            ADDR                             
TUV1BCCT DS    CL20                            CITY                             
TUV1BCST DS    CL2                             STATE                            
TUV1BCZP DS    CL5                             ZIP                              
TUV1BCZ2 DS    CL5                             EXTENSION  '-    '               
         DS    CL1                 BLANK                                        
TUV1BRNM DS    CL44                RETURN NAME                                  
TUV1BRAD DS    CL35                       ADDR                                  
TUV1BRCT DS    CL20                       CITY                                  
TUV1BRST DS    CL2                        STATE                                 
         DS    CL5                                                              
TUV1BRZP DS    CL5                        ZIP                                   
TUV1BRZ2 DS    CL5                        EXTENSION  '-    '                    
         DS    CL13                BLANKS                                       
         SPACE                                                                  
         ORG   TUV1YEAR            'E' RECORD                                   
         DS    0CL4                (YEAR FOR HAWAII)                            
TUV1EPER DS    CL2                 ELSE, LAST MM OF RPT'G PER (03,06)           
TUV1EYY  DS    CL2                 FOLLOWED BY RPT'G YEAR                       
TUV1EEID DS    CL9                 FED EMPLOYER ID NUMBER                       
         DS    0CL144              (FILLER FOR WISCONSIN)                       
         DS    0CL9                                                             
TUV1EENT DS    CL2                 (MASS.) ENTITY CODE                          
TUV1EQTR DS    CL1                 (MASS.) QTR                                  
TUV1EYR  DS    CL2                 (MASS.) YEAR                                 
         DS    CL4                                                              
*                                                                               
TUV1EENM DS    CL50                EMPLOYER NAME                                
TUV1EEAD DS    CL40                         ADDRESS                             
TUV1EECT DS    CL25                         CITY                                
TUV1EEST DS    CL10                         STATE                               
TUV1EZIP DS    CL5                 ZIP CODE                                     
TUV1EZP2 DS    CL5                 EXTENSION - '-    '                          
*                                                                               
TUV1ENCD DS    CL1                 NAME CDE-'S'-SURNAME 1ST, 'F'-FIRST          
TUV1EEMT DS    CL1                 EMPLOYMENT TYPE (CT&UT ONLY=R)               
TUV1EBF  DS    CL2                 BLOCKING FACTOR = '25'                       
         DS    CL6                 BLANKS                                       
TUV1EMSC DS    CL2                 MASS STATE CODE, "25"                        
         DS    CL105                                                            
*                                                                               
         ORG   TUV1EBF             (WISCONSIN)                                  
         DS    CL7                 BLANK                                        
TUV1ETTC DS    CL1                 TAX TYPE CODE ('B')                          
*                                                                               
TUV1ESTC DS    CL2                 STATE CODE '48'                              
TUV1EUNN DS    CL5                 UNIT NUMBER - ZEROES                         
*                                                                               
TUV1EZER DS    CL3                 ZEROES                                       
TUV1ESAC DS    CL9                 STATE ACCOUNT NO.                            
         ORG   TUV1EZER                                                         
TUV1ESA2 DS    CL10                STATE ACCOUNT FOR 10 (HAWAII)                
TUV1ERCC DS    CL2                 (WISCONSIN) ALWAYS '01'                      
         DS    CL88                BLANKS                                       
         SPACE                                                                  
         ORG   TUV1EZER                                                         
TUV1EUCN DS    CL7                 STATE UNEMP COMP # (CONNECTICUT)             
         DS    CL93                BLANKS                                       
*                                                                               
         ORG   TUV1EZER                                                         
TUV1EUUT DS    CL8                 STATE REGISTRATION # (UTAH)                  
         DS    CL92                BLANKS                                       
*                                                                               
         ORG   TUV1EZER                                                         
TUV1EZR2 DS    CL2                 ZEROES                                       
TUV1ESA3 DS    CL10                STATE ACCOUNT FOR 10 (LEFT ZEROS)            
         DS    CL88                BLANKS                                       
*                                                                               
         SPACE                                                                  
         ORG   TUV1YEAR            'S' RECORD                                   
TUV1SSSN DS    CL9                 SS NUMBER                                    
TUV1SNME DS    CL27                NAME - LAST - FIRST                          
TUV1SADD DS    CL40                STREET ADDRESS                               
TUV1SCTY DS    CL25                CITY ADDRESS                                 
TUV1SSTA DS    CL10                STATE ADDRESS                                
TUV1SZPX DS    CL5                 ZIP EXTENSION, HYPHEN FIRST                  
TUV1SZIP DS    CL5                 ZIP                                          
         DS    CL1                                                              
TUV1SSTC DS    CL2                 STATE CODE '48'                              
TUV1SRCC DS    CL2                 BLANKS / WISCONSIN (01)                      
TUV1SPER DS    CL2                 LAST MM OF REPORTING PERIO (03,06)           
TUV1SYY  DS    CL2                 REPRTING YEAR                                
TUV1SWG  DS    CL9                 GROSS EARNINGS FOR QTR XXXXXXX.XX            
TUV1TXWG DS    CL9                 TAXABLE EARNINGS FOR QTR                     
TUV1SX   DS    CL126                                                            
*                                                                               
         ORG   TUV1SX                                                           
         DS    CL9                                                              
TUV1SWKS DS    CL2                 WEEKS WORKED FOR QTR                         
         DS    CL13                                                             
TUV1SSAC DS    CL7                 STATE EMPLOYER ACCOUNT NUMBER                
         DS    CL2                                                              
TUV1STAB DS    CL2                 STATE ABBREVIATION (NE)                      
         DS    CL26                                                             
TUV1SHRS DS    CL3                 HOURS WORKED FOR QTR (WKS*8)                 
         DS    CL71                                                             
*                                                                               
         ORG   TUV1SADD            (MASS. ONLY)                                 
         DS    CL102                                                            
TUV1STGW DS    CL9                 QTR TOTAL GROSS WAGES                        
         DS    CL53                                                             
TUV1SWWK DS    CL2                 WEEKS WORKED                                 
         DS    CL72                                                             
*                                                                               
         ORG   TUV1YEAR            'T' RECORD                                   
TUV1TCNT DS    CL7                 TOTAL EMPLOYEES FOR PRECEDING EMP            
TUV1TWG  DS    CL13                TOTAL GROSS EARNINGS FOR QTR                 
         DS    CL254                                                            
*                                                                               
         ORG   TUV1TWG             UTAH ONLY                                    
         DS    CL26                                                             
TUV1TWG2 DS    CL13                                                             
         DS    CL228                                                            
*                                                                               
         ORG   TUV1TWG             MASS. ONLY                                   
TUV1TTTY DS    CL4                 "UTAX"                                       
TUV1TWG3 DS    CL14                                                             
         DS    CL249                                                            
*                                                                               
         ORG   TUV1YEAR            'F' RECORD                                   
TUV1FCNT DS    CL7                 TOTAL EMPLOYEES ON TAPE                      
         DS    CL1                                                              
TUV1FTXW DS    CL16                TAXABLE WAGES   | CONNETICUT ONLY            
         DS    CL1                                 V                            
TUV1FXWG DS    CL16                EXCESS WAGES (GROSS-TAXABLE)                 
         DS    CL1                                                              
TUV1FGWG DS    CL16                GROSS WAGES                                  
         DS    CL1                                                              
TUV1FREM DS    CL11                REMITTANCE AMOUNT                            
         DS    CL1                                                              
TUV1FM1C DS    CL5                 NUMBER OF EMPLOYEES, 1ST MONTH               
         DS    CL1                                                              
TUV1FM2C DS    CL5                                      2ND MONTH               
         DS    CL1                                                              
TUV1FM3C DS    CL5                                      3RD MONTH               
         DS    CL186                                                            
*                                                                               
         ORG   TUV1YEAR            MASS. ONLY                                   
TUV1FCWK DS    CL10                NUMBER OF EMPLOYEES                          
TUV1FCEM DS    CL10                NUMBER OF EMPLOYERS                          
TUV1FTTY DS    CL4                 "UTAX"                                       
TUV1FGRW DS    CL15                GROSS WAGES                                  
         DS    CL235               GROSS WAGES                                  
         EJECT                                                                  
*        TAPE DSECT VERSION 3                                                   
*        MINNESOTA ONLY                                                         
         SPACE 1                                                                
TUVER3D  DSECT                                                                  
TUV3ID   DS    CL1                 RECORD IDENTIFIER                            
TUV3IDS  EQU   C'S'                EMPLOYEE RECORD                              
*                                                                               
TUV3SSSN DS    CL9                 SS NUMBER                                    
TUV3SNML DS    CL20                NAME - LAST                                  
TUV3SNMF DS    CL12                NAME - FIRST                                 
TUV3SNMM DS    CL1                 NAME - MIDDLE                                
TUV3SSTC DS    CL2                 STATE CODE                                   
         DS    CL18                                                             
TUV3SWG  DS    CL14                GROSS EARNINGS FOR QTR XXXXXXX.XX            
         DS    CL54                                                             
TUV3SHRS DS    CL3                 HOURS WORKED                                 
         DS    CL8                                                              
TUV3SLT2 DS    CL4                 =C'UTAX'                                     
TUV3SSA2 DS    CL8                 STATE UNEMPLOYMENT ACCOUNT NUMBER            
         DS    CL7                                                              
TUV3SPLN DS    CL4                 PLANT CODE 0000           (MN ONLY)          
         DS    CL44                                                             
TUV3SOFF DS    CL1                 OFFICER CODE                                 
         DS    CL1                                                              
TUV3SMN1 DS    CL1                 1=EMPLOYEE WORKED IN THIS MONTH              
TUV3SMN2 DS    CL1                 1=EMPLOYEE WORKED IN THIS MONTH              
TUV3SMN3 DS    CL1                 1=EMPLOYEE WORKED IN THIS MONTH              
TUV3SQTR DS    CL6                 REPORTING QUARTER AND YEAR                   
         DS    CL54                                                             
TUV3EOL  DS    CL1                 EOL INDICATOR                                
TUV3EOLQ EQU   C'X'                                                             
         ORG                                                                    
*        TAPE DSECT VERSION FOUR (ICESA FORMAT)                                 
*        SEE TAPETAB IN TAREP2BUC FOR STATES THAT USE THIS FORMAT               
         SPACE                                                                  
TUVER4D  DSECT                                                                  
TUV4ID   DS    CL1                 RECORD ID                                    
TUV4IDA  EQU   C'A'                FIRST RECORD ON TAPE                         
TUV4IDB  EQU   C'B'                SECOND RECORD ON TAPE                        
TUV4IDE  EQU   C'E'                THIRD RECORD ON TAPE                         
TUV4IDS  EQU   C'S'                ONE RECORD PER EMPLOYEE                      
TUV4IDT  EQU   C'T'                SECOND TO LAST RECORD ON TAPE                
TUV4IDF  EQU   C'F'                LAST RECORD ON TAPE                          
TUV4IDN  EQU   C'N'                FIRST RECORD ON TAPE (NC ONLY)               
*                                                                               
TUV4YEAR DS    CL4                 REPORTING YEAR                               
TUV4EMID DS    CL9                 FED EMPLOYER ID NUMBER                       
TUV4LIT  DS    CL4                 =C'UTAX'                                     
         DS    CL5                                                              
TUV4EMNM DS    CL50                EMPLOYER NAME                                
TUV4EMAD DS    CL40                         ADDRESS                             
TUV4EMCT DS    CL25                         CITY                                
TUV4EMST DS    CL2                          STATE                               
         DS    CL3                                                              
TUV4SEAN DS    CL10                STATE EMPLOYER ACCT NUMBER                   
TUV4ZIP  DS    CL5                 ZIP CODE - 60611                             
TUV4ZIP2 DS    CL5                 EXTENSION  '-    ' (NOT FILLED IN)           
TUV4EMN2 DS    CL30                EMPLOYER NAME                                
TUV4TEL  DS    CL10                TELEPHONE                                    
         DS    CL4                                                              
TUV4CEML DS    CL27                EMAIL                                        
         DS    CL8                                                              
TUV4TDAY DS    CL8                 MEDIA CREATION DATE MMDDYYYY                 
TUV4CPER DS    CL25                TRANSMITTER CONTACT PERSON                   
         ORG   TUV4CPER                                                         
         DS    CL15                                                             
TUV4OHTR DS    CL10                OHIO THIRD PARTY ADMIN ID                    
         DS    CL1                                                              
TUV4LNQ  EQU   *-TUV4ID                                                         
         SPACE                                                                  
         ORG   TUV4LIT             'B' RECORD                                   
TUV4BCMP DS    CL8                 NAME OF MAIN FRAME - IBM                     
TUV4BLBL DS    CL2                 INTERNAL LABLING - SL=IBM STANDARD           
*                                  LABLE, NS=NON STANDARD, NL - NOLABLE         
         DS    CL1                                                              
TUV4BDEN DS    CL2                 DENSITY - 16 = 1600 CPI, 62 = 6250           
*                                  CPI FO R 9 TRACK TAPE, 38= 38K IBM           
*                                  COMPATIBLE 3480 CARTRIDGE                    
TUV4BRCD DS    CL3                 RECORDING CODE - EBC, ASC                    
TUV4BTRK DS    CL2                 TRACKS-'09'/9 TRACK,'12'/CARTRIDGE           
TUV4BFCT DS    CL2                 BLOCKING FACTOR = '25'                       
TUV4BLIT DS    CL4                 =C'UTAX'                                     
         DS    CL58                BLANKS                                       
TUV4BNM  DS    CL50                CONTACT NAME                                 
TUV4BRNM DS    CL44                RETURN NAME                                  
TUV4BRAD DS    CL35                       ADDR                                  
TUV4BRCT DS    CL20                       CITY                                  
TUV4BRST DS    CL2                        STATE                                 
         DS    CL5                                                              
TUV4BRZP DS    CL5                        ZIP                                   
TUV4BRZ2 DS    CL5                        EXT ZIP '-    ' (NOT FILLED)          
TUV4BFT  DS    CL2                 FILING TYPE  MC=MAGNETIC CARTRIDGE,          
*                                  MT=MAGNETIC TAPE                             
         DS    CL12                BLANKS                                       
         SPACE                                                                  
         ORG   TUV4LIT             'E' RECORD                                   
TUV4EOSW DS    CL1                 OHIO - OUT OF STATE WAGES                    
         DS    CL8                 BLANK                                        
TUV4EENM DS    CL50                EMPLOYER NAME                                
TUV4EEAD DS    CL40                         ADDRESS                             
TUV4EECT DS    CL25                         CITY                                
TUV4EEST DS    CL10                         STATE                               
TUV4EZP2 DS    CL5                 EXTENSION - '-    '                          
TUV4EZIP DS    CL5                 ZIP CODE                                     
         DS    CL1                 BLANK                                        
TUV4TYEM DS    CL1                 TYPE EMPLOYMENT                              
TUV4EMTR EQU   C'R'                                                             
TUV4EBF  DS    CL2                 BLOCKING FACTOR = '25'                       
         DS    CL4                 BLANKS                                       
TUV4ELIT DS    CL4                 =C'UTAX'                                     
TUV4ESTC DS    CL2                 STATE CODE                                   
TUV4ESAC DS    CL15                STATE UI EMPLOYER ACCOUNT NUMBER             
TUV4EPER DS    CL2                 LAST MM OF REPORTING PERIO (03,06)           
TUV4EWRK DS    CL1                 C'O' - NO E RECORDS/C'1' - E RECORDS         
TUV4ETAX DS    CL1                 'T'-TAXABLE EMP/'R'-REIMBURSABLE EMP         
         DS    CL5                                                              
TUV4ERET DS    CL7                 REMITTER # FOR 6, SPACE 1 - NC ONLY          
         DS    CL5                                                              
TUV4EEIN DS    CL9                 EIN OF PREPARER - MAINE ONLY                 
TUV4EPLC DS    CL7                 PROCESSOR LICENSE CODE - MAINE ONLY          
TUV4EEMP DS    CL4                 TOTAL # OF EMPLOYEES - MAINE ONLY            
         DS    CL29                                                             
TUV4EWID DS    CL11                WITHHOLDING ACCT # - MAINE ONLY              
         DS    CL7                                                              
         SPACE                                                                  
         ORG   TUV4YEAR            'S' RECORD                                   
TUV4SSSN DS    CL9                 SS NUMBER                                    
TUV4SNML DS    CL20                NAME - LAST                                  
TUV4SNMF DS    CL12                NAME - FIRST                                 
TUV4SNMM DS    CL1                 NAME - MIDDLE                                
TUV4SSTC DS    CL2                 STATE CODE                                   
TUV4SARC DS    0CL1                ADJUSTMENT REASON CODE - MA                  
TUV4SPER DS    CL2                 LAST MM OF REPORTING PERIO (03,06)           
TUV4SYY  DS    CL2                 REPORTING YEAR                               
TUV4SWG2 DS    CL14                TRY SAME AS TUV4SWG                          
TUV4SWG  DS    CL14                GROSS EARNINGS FOR QTR XXXXXXX.XX            
TUV4SNSU DS    CL14                NON TAXABLE SUI                              
TUV4SSUI DS    CL14                TAXABLE SUI                                  
*                                                                               
TUV4SORG EQU   *                                                                
         DS    CL22                FOR IL ONLY                                  
TUV4SLIT DS    CL4                 =C'UTAX'                                     
TUV4SSAC DS    CL15                STATE UNEMPLOYMENT ACCOUNT NUMBER            
         DS    CL130               BLANKS                                       
*                                                                               
         ORG   TUV4SORG            FOR ALL OTHER STATES                         
TUV4SZR1 DS    CL15                FILL WITH ZEROS (IL)                         
TUV4SZR2 DS    CL9                 FILL WITH ZEROS (IL)                         
TUV4SWKS DS    CL2                 WEEKS WORKED                                 
TUV4SHRS DS    CL3                 HOURS WORKED - MA                            
         DS    CL08                                                             
TUV4SLT2 DS    CL4                 =C'UTAX'                                     
TUV4SSA3 DS    0CL8                STATE UNEMP ACCT NUMBER - NM                 
TUV4SSA2 DS    CL15                STATE UNEMPLOYMENT ACCOUNT NUMBER            
TUV4SPLN DS    CL4                 PLANT CODE 0000           (MN ONLY)          
         DS    CL11                                                             
TUV4SPIT DS    CL14                STATE TAXABLE WAGES       (CA ONLY)          
TUV4SPTW DS    CL14                SATE INCOME TAX W/HELD    (CA ONLY)          
TUV4SSNL DS    CL1                 SEASONAL CODE (ME ONLY)                      
TUV4SSNN EQU   C'N'                NONSEASONAL EMPLOYEE                         
         DS    CL4                                                              
TUV4SOFF DS    CL1                 OFFICER CODE                                 
TUV4SWGP DS    CL1                 WAGE PLAN CODE            (CA ONLY)          
TUV4SWGS EQU   C'S'                S                                            
TUV4SMN1 DS    CL1                                                              
TUV4SMN2 DS    CL1                                                              
TUV4SMN3 DS    CL1                                                              
TUV4SQTR DS    CL6                 REPORTING QUARTER AND YEAR                   
         ORG   TUV4SQTR                                                         
TUV4SYR2 DS    CL4                 REPORTING YEAR - YYYY (NM ONLY)              
TUV4SQT2 DS    CL2                 REPORTING QTR - QQ (NM ONLY)                 
TUV4ZWGE DS    CL1                 1=ZERO WAGES FOR QUARTER                     
         ORG   TUV4SQTR                                                         
TUV4SWAN DS    CL11                WITHHOLDING ACCOUNT # (ME ONLY)              
TUV4SFEM DS    CL1                 FEMALE = 1, MALE =0                          
TUV4SSPS DS    CL8                 SEASONAL PERIOD START MMDDYYYY               
TUV4SSPE DS    CL8                 SEASONAL PERIOD END   MMDDYYYY               
         DS    CL34                                                             
         ORG                                                                    
         SPACE                                                                  
         ORG   TUV4YEAR            'T' RECORD                                   
TUV4TCNT DS    CL7                 TOTAL EMPLOYEES FOR PRECEDING EMP            
TUV4TLIT DS    CL4                 =C'UTAX'                                     
TUV4TWG2 DS    CL14                TRY SAME AS TUV4TWG                          
         ORG   TUV4TWG2                                                         
TUV4TEAN DS    CL10                EC EMPLOYER ACCOUNT NUMBER                   
         DS    CL4                                                              
TUV4TWG  DS    CL14                TOTAL WAGES FOR EMPLOYER                     
TUV4TNSU DS    CL14                NON TAXABLE SUI                              
TUV4TSUI DS    CL14                TAXABLE SUI                                  
TUV4TTIP DS    CL13                ZERO FIELD - NOT USED                        
TUV4TERT DS    CL6                 TAX RATE .XXXXX                              
TUV4TDUE DS    CL13                TOTAL TAXES DUE                              
TUV4TPRV DS    CL11                PREVIOUS QUARTER(S) UNDERPAYMENT             
TUV4TINT DS    CL11                INTEREST                                     
TUV4TPEN DS    CL11                PENALTY                                      
TUV4TCRD DS    CL11                CREDIT/OVERPAYMENT                           
TUV4TCRT DS    CL4                 CONTRIBUTION RATE (ME ONLY)                  
TUV4TASR DS    CL4                 EMPLOYER ASSESSMENT RATE/AMOUNT              
         DS    CL7                                                              
         ORG   TUV4TASR                                                         
TUV4TSCH DS    CL11                SURCHARGE DUE (KY ONLY)                      
TUV4TART DS    CL4                 EMPLOYEE ASSESSMENT RATE   (PA ONLY)         
TUV4TASS DS    CL11                EMPLOYEE ASSESSMENT AMOUNT (PA ONLY)         
*                                                                               
TUV4TPAY DS    CL11                TOTAL PAYMENT DUE                            
TUV4TREM DS    CL13                TOTAL AMOUNT REMITTED (ME ONLY)              
TUV4TPIT DS    CL14                STATE TAXABLE WAGES        (CA ONLY)         
TUV4TPTW DS    CL14                SATE INCOME TAX W/HELD     (CA ONLY)         
TUV4TMN1 DS    CL7                 N'EMPLOYEES PAID THROUGH 12TH DAY            
TUV4TMN2 DS    CL7                 "                                            
TUV4TMN3 DS    CL7                 "                                            
TUV4TFM1 DS    CL7                 N' FEMALES PAID THROUGH 12TH DAY             
TUV4TFM2 DS    CL7                 "                                            
TUV4TFM3 DS    CL7                 "                                            
         ORG   TUV4TFM1                                                         
TUV4TCTY DS    CL3                 COUNTY CODE (TX ONLY)                        
TUV4TQTR DS    CL6                 REPORTING QUARTER AND YEAR (IL ONLY)         
         DS    CL1                                                              
TUV4CNTL DS    CL9                 DOCUMENT CONTROL NUMBER '1'                  
         DS    CL10                                                             
         ORG   TUV4CNTL                                                         
TUV4CNT2 DS    CL10                DOCUMENT CONTROL NUMBER 10 CHAR (IL)         
TUV4TACC DS    CL7                 STATE UNEMPLOYMENT INSURANCE ACC #           
         DS    CL2                                                              
         SPACE                                                                  
         ORG   TUV4YEAR            'F' RECORD                                   
TUV4FCNT DS    CL10                TOTAL EMPLOYEES ON TAPE                      
TUV4FCN2 DS    CL10                TOTAL EMPLOYERS ON TAPE                      
TUV4FLIT DS    CL4                 =C'UTAX'                                     
TUV4FWG2 DS    CL15                TRY SAME AS TUV4FWG                          
TUV4FWG  DS    CL15                TOTAL WAGES ON TAPE                          
TUV4FNSU DS    CL15                TOTAL NON TAXABLE SUI ON TAPE                
TUV4FSUI DS    CL15                TOTAL TAXABLE SUI ON TAPE                    
TUV4FZER DS    CL15                ZEROS (IL)                                   
TUV4FTIP DS    CL15                TIP INCOME -ZERO FILLED                      
TUV4FMN1 DS    CL8                 EMPLOYEES MONTH 1                            
TUV4FMN2 DS    CL8                 EMPLOYEES MONTH 2                            
TUV4FMN3 DS    CL8                 EMPLOYEES MONTH 3                            
         DS    CL137                                                            
         ORG   TUV4YEAR            'N' RECORD                                   
TUV4NAC# DS    CL7                 NC EMPLOYER ACCOUNT NUMBER                   
TUV4NQTR DS    CL1                 CALENDAR QUARTER                             
TUV4NYR  DS    CL4                 CALENDAR YEAR                                
TUV4NMN1 DS    CL5                 N'EMPLOYEES PAID THROUGH 12TH DAY            
TUV4NMN2 DS    CL5                 "                                            
TUV4NMN3 DS    CL5                 "                                            
TUV4NWG  DS    CL11                QUARTERLY WAGES                              
TUV4NNSU DS    CL11                EXCESS OVER UI WAGE BASE                     
TUV4NSUI DS    CL11                TOTAL LESS EXCESS WAGES                      
TUV4NRMR DS    CL6                 REMITTER NUMBER                              
TUV4NFRM DS    CL1                 FORMAT ID - 'I'                              
         DS    CL207               SPACES                                       
*                                                                               
TUV4NLNQ EQU   *-TUV4ID            RECORD LENGTH                                
*                                                                               
         SPACE                                                                  
         EJECT                                                                  
*        TAPE DSECT VERSION 5                                                   
*        MICHIGAN ONLY                                                          
         SPACE 1                                                                
TUVER5D  DSECT                                                                  
TUV5ID   DS    CL1                 RECORD IDENTIFIER                            
TUV5IDE  EQU   C'E'                EMPLOYER/ESTABLISHMENT RECORD                
TUV5IDS  EQU   C'S'                EMPLOYEE RECORD                              
*                                                                               
TUV5EUAC DS    CL7                 UA ACCOUNT NUMBER                            
TUV5EUMU DS    CL3                 UA MULTI UNIT NUMBER                         
TUV5EYR  DS    CL4                 YEAR (CCYY)                                  
TUV5EQTR DS    CL1                 CALENDAR QUARTER (1,2,3,4)                   
         DS    CL24                                                             
TUV5ENOE DS    CL7                 NUMBER OF EMPLOYEES                          
TUV5EWGS DS    CL13                TOTAL WAGES                                  
         DS    CL12                                                             
*                                                                               
TUV5LNQ  EQU   *-TUV5ID                                                         
         ORG   TUV5EUAC           'S' RECORD                                    
TUV5SEAC DS    CL7                 EMPLOYER UA ACCOUNT NUMBER                   
TUV5SEMU DS    CL3                 EMPLOYER MULTI UNIT NUMBER                   
TUV5SYR  DS    CL4                 YEAR (CCYY)                                  
TUV5SQTR DS    CL1                 QUARTER (1,2,3,4)                            
TUV5SSSN DS    CL9                 SS NUMBER                                    
         DS    CL7                                                              
TUV5SNML DS    CL16                NAME - LAST                                  
TUV5SNMF DS    CL12                NAME - FIRST                                 
TUV5SNMM DS    CL1                 NAME - MIDDLE INITIAL                        
TUV5SGRS DS    CL10                TOTAL WAGES FOR EMPLOYEE                     
TUV5SSTA DS    CL1                 STATUS. 'F' FOR FAMILY OR BLANK              
         ORG                                                                    
         EJECT                                                                  
*        WASHINGTON ONLY                                                        
TUVER6D  DSECT                                                                  
TUV6ID   DS    CL1                                                              
TUV6IDE  EQU   C'E'                EMPLOYER                                     
TUV6IDS  EQU   C'S'                EMPLOYEE                                     
TUV6IDT  EQU   C'T'                TOTAL                                        
TUV6IDF  EQU   C'F'                FINAL                                        
*                                                                               
*                                  'E' EMPLOYER RECORD                          
TUV6YEAR DS    CL4                 YEAR                                         
TUV6EMID DS    CL9                 FED EMPLOYER ID NUMBER                       
TUV6ERFN DS    CL8                 EMPLOYMENT REFERENCE NUMBER                  
TUV6ECKD DS    CL1                 CHECK DIGIT                                  
         ORG   TUV6ERFN                                                         
TUV6ERID DS    CL9                 EMPLOYER ID                                  
TUV6EMNM DS    CL50                EMPLOYER NAME                                
TUV6EMAD DS    CL40                EMPLOYER ADDRESS                             
TUV6EMCT DS    CL25                         CITY                                
TUV6EMST DS    CL2                          STATE                               
         DS    CL8                                                              
TUV6EZIP DS    CL5                 ZIP                                          
         DS    CL122                                                            
         EJECT                                                                  
         ORG   TUV6YEAR            'S' EMPLOYEE RECORD                          
TUV6SSSN DS    CL9                 EMPLOYEE SS#                                 
TUV6SNML DS    CL20                NAME - LAST                                  
TUV6SNMF DS    CL12                NAME - FIRST                                 
TUV6SNMM DS    CL1                 NAME - MIDDLE                                
TUV6SSTC DS    CL2                 STATE CODE                                   
         DS    CL4                                                              
TUV6SWG  DS    CL14                WAGES                                        
         DS    CL67                                                             
TUV6SHRS DS    CL4                 HOURS                                        
         DS    CL12                                                             
TUV6SERF DS    CL8                 EMPOYER REFERENCE NUMBER                     
TUV6SCKD DS    CL1                 CHECK DIGIT                                  
         ORG   TUV6SERF                                                         
TUV6SEID DS    CL9                 EMPLOYER ID                                  
         DS    CL59                                                             
TUV6SRPR DS    CL6                 REPORTING PERIOD                             
         DS    CL55                                                             
         EJECT                                                                  
         ORG   TUV6YEAR            'T' TOTAL RECORD                             
         DS    CL7                                                              
TUV6TENT DS    CL4                 CONSTANT "UTAX"                              
         DS    CL14                                                             
TUV6TGWG DS    CL14                GROSS WAGES                                  
TUV6TXWG DS    CL14                EXCESS WAGES                                 
TUV6TTWG DS    CL14                TAXABLE WAGES                                
         DS    CL13                                                             
TUV6TRTE DS    CL6                 UI TAX RATE                                  
TUV6TQTD DS    CL13                UI TAXES DUE                                 
         DS    CL11                                                             
TUV6TINT DS    CL11                INTEREST DUE ON LATE PAYMENT                 
TUV6TPNL DS    CL11                PENALTY DUE ON LATE PAYMENT                  
TUV6TCRD DS    CL11                CREDIT / PRIOR BALANCE                       
TUV6TEAF DS    CL4                 EAF RATE                                     
TUV6TEAA DS    CL11                TAXABLE WAGE * EAF RATE                      
TUV6TNCO DS    CL4                 NUMBER OF CORPORATE OFFICERS EXEMPT          
TUV6TCOE DS    CL11                EXEMPT CORPORATE OFFICERS EARNINGS           
TUV6TTPD DS    CL11                TOTAL PAYMENT DUE                            
         DS    CL36                                                             
TUV6TRYQ DS    CL5                 FOUR DIGIT YEAR AND ONE DIGIT QTR            
TUV6TM1C DS    CL7                 NUMBER OF EMPLOYEES IN MONTH 1               
TUV6TM2C DS    CL7                                        MONTH 2               
TUV6TM3C DS    CL7                                        MONTH 3               
         DS    CL10                                                             
TUV6TRFN DS    CL8                 EMPLOYMENT REFERENCE NUMBER                  
TUV6TCKD DS    CL1                 CHECK DIGIT                                  
         ORG   TUV6TRFN                                                         
TUV6TEID DS    CL9                 EMPLOYER ID                                  
         DS    CL9                                                              
         EJECT                                                                  
         ORG   TUV6YEAR            'F' FINAL RECORD                             
TUV6FSCT DS    CL10                TOTAL NUMBER OF EMPLOYEES ON TAPE            
TUV6FECT DS    CL10                TOTAL NUMBER OF EMPLOYERS ON TAPE            
TUV6FENT DS    CL4                 CONSTANT "UTAX"                              
TUV6FGWG DS    CL15                GROSS WAGES                                  
         DS    CL9                                                              
TUV6FVER DS    CL8                 CONSTANT "07172001"                          
         DS    CL218                                                            
         EJECT                                                                  
*        PUERTO RICO ONLY                                                       
TUVER7D  DSECT                                                                  
TUV7SSNO DS    CL9                 SS#                                          
         DS    CL1                                                              
TUV7TRAN DS    CL2                 TRANSACTION = W4                             
TUV7LST4 DS    CL4                 LAST NAME, FIRST 4 CHARS                     
TUV7OPER DS    CL8                 OPERATOR = 12345678                          
TUV7TERM DS    CL4                 TERMINAL = SWCA                              
TUV7DATE DS    CL6                 TODAY'S DATE - YYMMDD                        
TUV7TIME DS    CL6                 TIME - HHMMSS                                
TUV7YEAR DS    CL2                 YEAR, JUST LAST 2 DIGITS                     
TUV7QTR  DS    CL1                 QUARTER (1,2,3,4)                            
TUV7CODE DS    CL1                 CODE = 2                                     
TUV7COD2 EQU   C'2'                                                             
TUV7EARN DS    CL7                 EARNINGS                                     
TUV7STAC DS    CL9                 STATE ACCT                                   
         DS    CL4                                                              
TUV7ZERO DS    CL8                 ZEROS                                        
         DS    CL2                                                              
TUV7IND  DS    CL1                 INDICATOR = 1                                
TUV7IND1 EQU   C'1'                                                             
TUV7ZER2 DS    CL6                 ZEROS                                        
TUV7DAT2 DS    CL6                 TODAY'S DATE - YYMMDD                        
TUV7ZER3 DS    CL6                 ZEROS                                        
TUV7ORIG DS    CL2                 ORIGINATION CODE = 04 (CD)                   
TUV7EMNM DS    CL16                EMPLOYEE FIRST                               
TUV7EMN2 DS    CL1                 EMPLOYEE MIDDLE INITIAL                      
TUV7EMN3 DS    CL16                EMPLOYEE LAST NAME                           
TUV7EMN4 DS    CL16                EMPLOYEE 2ND LAST NAME                       
TUV7PWIN DS    CL1                 PARTIAL WAGE INDICATOR (N)                   
         DS    CL5                                                              
TUV7LNQ  EQU   *-TUVER7D                                                        
         EJECT                                                                  
*        GEORGIA ONLY                                                           
TUVER8D  DSECT                                                                  
TUV8ID   DS    CL1                 RECORD IDENTIFIER                            
TUV8IDS  EQU   C'S'                ONLY SUPPLEMENTAL REQUIRED                   
*                                                                               
TUV8SSNO DS    CL9                 SS#                                          
TUV8LST  DS    CL20                LAST NAME                                    
TUV8FST  DS    CL12                FIRST NAME                                   
TUV8MID  DS    CL1                 MIDDLE INITIAL                               
TUV8STAC DS    CL2                 STATE CODE, "13"                             
         DS    CL23                                                             
TUV8WAGE DS    CL9                 WAGES                                        
         DS    CL76                                                             
TUV8EMPA DS    CL8                 EMPLOYER ACCOUNT NUMBER                      
         DS    CL53                                                             
TUV8MM   DS    CL2                 LAST MONTH                                   
TUV8YYYY DS    CL4                 LAST 4 DIGIT YEAR                            
         DS    CL55                                                             
TUV8LNQ  EQU   *-TUVER8D                                                        
         EJECT                                                                  
*        TENNESSEE ONLY                                                         
TUVER9D  DSECT                                                                  
TUV9SSNO DS    CL9                 SS#                                          
TUV9NAME DS    CL27                LAST/FIRST/MID INIT                          
TUV9WAGE DS    CL9                 WAGES                                        
TUV9QYR  DS    CL3                 QUARTER/YEAR                                 
TUV9ACCT DS    CL6                 ACCOUNT NUMBER                               
TUV9LNQ  EQU   *-TUVER9D                                                        
         EJECT                                                                  
*        COLORADO ONLY                                                          
TUVR10D  DSECT                                                                  
TUV10SSN DS    CL9                 SS#                                          
TUV10S1  DS    CL1                 \                                            
TUV10LNM DS    CL20                LAST NAME                                    
TUV10S2  DS    CL1                 \                                            
TUV10FNM DS    CL12                FIRST NAME                                   
TUV10S3  DS    CL1                 \                                            
TUV10MID DS    CL1                 MIDDLE INIT                                  
TUV10S4  DS    CL1                 \                                            
TUV10QYR DS    CL4                 QUARTER AND YEAR                             
TUV10S5  DS    CL1                 \                                            
TUV10GWG DS    CL15                GROSS WAGES                                  
TUV10S6  DS    CL1                 \                                            
TUV10EAC DS    CL9                 EMPLOYER ACCT NUMBER                         
TUV10S7  DS    CL1                 \                                            
TUV10SNL DS    CL1                 SEASONAL                                     
TUV10LNQ EQU   *-TUVR10D                                                        
         EJECT                                                                  
*        UCDISK DSECTS (SEE PGDSKTAB IN TAREP1BE FOR TABLE)                     
         SPACE 1                                                                
*        FOR EMPLOYER PG, UNITS FL/OH/NY/IL                                     
TUPGDSKD DSECT                                                                  
TUDPGCD  DS    CL2                 RECORD CODE = 44                             
TUDPGCO  DS    CL2                 '7 '                                         
         DS    CL1                                                              
TUDPGST  DS    CL2                 STATE                                        
         DS    CL10                                                             
TUDPGWKS DS    CL2                 WEEKS WORKED FOR QUARTER                     
TUDPGSSN DS    CL9                 SS NUMBER                                    
TUDPGFIN DS    CL1                 FIRST NAME INITIAL                           
TUDPGMIN DS    CL1                 MIDDLE INITIAL                               
         DS    CL1                                                              
TUDPGNAM DS    CL17                LAST NAME                                    
         DS    CL6                                                              
TUDPGZER DS    6CL9                CHARACTER ZEROES                             
TUDPGWAG DS    CL9                 GROSS EARNINGS FOR QTR                       
TUDPGFD  DS    CL10                FEDERAL ID NUMBER                            
         DS    CL73                                                             
         SPACE 2                                                                
*        FOR EMPLOYER PG/DM/TP, UNIT CA                                         
TUCADSKD DSECT                                                                  
TUCAID   DS    CL1                 RECORD CODE FIRST CHARACTER                  
TUCAID1Q EQU   C'1'                                                             
TUCAID2Q EQU   C'2'                                                             
TUCAID2  DS    CL1                             SECOND CHARACTER                 
TUCAIDAQ EQU   C'A'                                                             
TUCAIDEQ EQU   C'E'                                                             
TUCAIDSQ EQU   C'S'                                                             
TUCAORG  DS    0X                                                               
*                                                                               
         DS    CL22                '1A' RECORD                                  
TUCATRNM DS    CL50                TRANSMITTER NAME - TALENT PARTNERS           
TUCATRAD DS    CL40                            ADDRESS                          
         DS    CL14                                                             
*                                                                               
         ORG   TUCAORG             '2A' RECORD                                  
TUCATRCT DS    CL25                TRANSMITTER CITY    CHICAGO                  
TUCATRST DS    CL10                            STATE   ILLINOIS                 
TUCATFPC DS    CL5                 FOREIGN POSTAL CODE                          
TUCATZIP DS    CL5                 ZIP CODE - 60611                             
         DS    CL81                                                             
*                                                                               
         ORG   TUCAORG             '1E' RECORD                                  
         DS    CL22                                                             
TUCAEMNM DS    CL50                EMPLOYER NAME - TALENT PARTNERS              
TUCAEMAD DS    CL40                         ADDRESS                             
         DS    CL14                                                             
*                                                                               
         ORG   TUCAORG             '2E' RECORD                                  
TUCAEMCT DS    CL25                EMPLOYER CITY    CHICAGO                     
TUCAEMST DS    CL10                         STATE   ILLINOIS                    
TUCAEFPC DS    CL5                 FOREIGN POSTAL CODE                          
TUCAEZIP DS    CL5                 ZIP CODE - 60611                             
TUCANMCD DS    CL1                 NAME CODE                                    
TUCANMCS EQU   C'S'                                                             
         DS    CL80                                                             
*                                                                               
         ORG   TUCAORG             '1S' RECORD                                  
TUCASSSN DS    CL9                 SS NUMBER                                    
TUCASNME DS    CL27                   NAME - LAST - FIRST                       
         DS    CL86                                                             
TUCASCD  DS    CL2                 STATE CODE '06'                              
TUCASWGP DS    CL1                 WAGE PLAN 'S'                                
TUCASWGS EQU   C'S'                                                             
         DS    CL1                                                              
*                                                                               
         ORG   TUCAORG             '2S' RECORD                                  
TUCASSAC DS    CL10                STATE ACCOUNT NO. 3587041900                 
TUCASZRO DS    CL2                 C'00'                                        
TUCASMM  DS    CL2                 QUARTER ENDING MONTH 03,06,09,12             
TUCASYY  DS    CL2                 QUARTER ENDING YEAR                          
TUCASWG  DS    CL9                 GROSS EARNINGS FOR QTR XXXXXXX.XX            
         DS    CL26                                                             
TUCASWG2 DS    CL9                 GROSS EARNINGS FOR QTR XXXXXXX.XX            
TUCASSTX DS    CL8                 STATE INCOME TAX WITHHELD                    
         DS    CL58                                                             
         SPACE                                                                  
         ORG   TUCAORG             '1S'                                         
TUCAID3  DS    CL1                                                              
TUCAIDTQ EQU   C'T'                   T RECORD                                  
TUCASTCT DS    CL7                 TOTAL NUMBER OF EMPLOYEES                    
         DS    CL1                                                              
TUCASTCD DS    CL2                 STATE CODE C'06'                             
         DS    CL1                                                              
TUCASTWG DS    CL14                TOTAL GROSS EARNINGS FOR QTR                 
         DS    CL1                                                              
TUCASTTX DS    CL14                PERSONAL INCOME TAX WITHHELD                 
         DS    CL1                                                              
TUCASTM1 DS    CL7                 EMPLOYEES MONTH 1                            
         DS    CL1                                                              
TUCASTM2 DS    CL7                 EMPLOYEES MONTH 2                            
         DS    CL1                                                              
TUCASTM3 DS    CL7                 EMPLOYEES MONTH 3                            
         DS    CL1                                                              
TUCASTW2 DS    CL14                TOTAL GROSS EARNINGS FOR QTR                 
         DS    CL46                                                             
         EJECT                                                                  
*                                                                               
*        FOR EMPLOYER TP/PP, UNIT NM                                            
TUNMDSKD DSECT                                                                  
*                                  DATA HEADER                                  
TUNMDOCN DS    CL8                 DOCUMENT NUMBER - YYYYMMDD                   
         DS    CL12                                                             
TUNMREP  DS    CL7                 REPORT - DOL_903                             
         DS    CL43                                                             
TUNMVER  DS    CL3                 VERSION - 1.0                                
         DS    CL47                                                             
         DS    CL163                                                            
TUNMLNQ  EQU   *-TUNMDSKD                                                       
*                                                                               
*                                  HEADER RECORD                                
         ORG   TUNMDOCN                                                         
TUNMROWH DS    CL13                ES_903_HEADER                                
         DS    CL3                                                              
TUNMEAN  DS    CL7                                                              
TUNMFEIN DS    CL9                                                              
TUNMQTR  DS    CL8                 QUARTER ENDING - YYYYMMDD                    
         DS    CL243                                                            
*                                                                               
*                                  EMPLOYER RECORD                              
         ORG   TUNMDOCN                                                         
TUNMROWE DS    CL15                ES_903_EMPLOYER                              
         DS    CL1                                                              
TUNMCRS  DS    CL11                                                             
TUNMENAM DS    CL27                EMPLOYER NAME                                
TUNMEADD DS    CL40                EMPLOYER ADDRESS                             
TUNMECTY DS    CL25                EMPLOYER CITY                                
TUNMESTA DS    CL2                 EMPLOYER STATE                               
TUNMEZIP DS    CL5                 EMPLOYER ZIP                                 
         DS    CL4                                                              
TUNMETOT DS    CL153               TOTALS                                       
*                                                                               
*                                  TOTAL RECORD                                 
         ORG   TUNMETOT                                                         
TUNMTXRT DS    CL4                 TAX RATE - UP TO 2 DECIMALS                  
TUNMTWAG DS    CL12                TOTAL WAGES                                  
TUNMEXCW DS    CL12                EXCESS WAGES                                 
TUNMTAXW DS    CL12                TAXABLE WAGES                                
TUNMTAXD DS    CL12                TAX DUE                                      
TUNMINTD DS    CL14                INTEREST DUE                                 
TUNMRPEN DS    CL14                LATE REPORT PENALTY                          
TUNMPPEN DS    CL14                LATE PAYMENT PENALTY                         
TUNMPAYA DS    CL14                PAYMENT AMOUNT                               
TUNMMTH1 DS    CL7                 MONTH 1 EMPLOYMENT                           
TUNMMTH2 DS    CL7                 MONTH 2 EMPLOYMENT                           
TUNMMTH3 DS    CL7                 MONTH 3 EMPLOYMENT                           
TUNMTOTW DS    CL12                TOTAL WITHHOLDING                            
TUNMWORK DS    CL12                TOTAL WORKERS COMP                           
*                                                                               
*                                  EMPLOYEE RECORD                              
         ORG   TUNMDOCN                                                         
TUNMROWS DS    CL16                ES_903_EMPLOYEES                             
TUNMSSN  DS    CL9                 EMPLOYEE SSN                                 
TUNMSNAM DS    CL27                EMPLOYEE NAME                                
TUNMSGRO DS    CL11                QUARTER GROSS WAGES                          
TUNMSEXC DS    CL11                QUARTER EXCESS WAGES                         
TUNMSWTH DS    CL7                 WITHHOLDING                                  
TUNMSWRK DS    CL4                 WORKERS COMP                                 
         DS    CL198                                                            
         EJECT                                                                  
*                                                                               
*        FOR EMPLOYER TP/PP, UNIT RI                                            
TURIDSKD DSECT                                                                  
TURIID   DS    CL1                 RECORD IDENTIFIER CODE                       
TURIIDTQ EQU   C'T'                TOTAL RECORD                                 
TURIIDWQ EQU   C'W'                WAGE RECORD                                  
TURIQWAG DS    CL12                TOTAL QUATERLY WAGES                         
TURITWAG DS    CL12                SUM OF ALL WAGES ON W RECORDS                
TURIMAG  DS    CL9                 MAGNETIC TAPE REPORTER CODE                  
TURISSN  DS    CL9                 SSN (W RECORD)                               
TURIEMP  DS    CL10                RHODE ISLAND EMPLOYER CODE                   
TURILNAM DS    CL9                 EMPLOYEE LAST NAME (W RECORD)                
TURIFRIN DS    CL1                 EMPLOYEE FIRST INITIAL (W RECORD)            
TURIWAGE DS    CL12                WAGES REPORTED FOR QUARTER  (W REC)          
TURIYEAR DS    CL2                 YEAR - LAST 2 DIGITS                         
TURIQRT  DS    CL1                 QUARTER - 1,2,3,4                            
TURIEMPN DS    CL11                EMPLOYER NAME                                
TURIWKS  DS    CL2                 NUMBER OF WEEKS (W RECORD)                   
TURIHRS  DS    CL4                 NUNBER OF HOURS (W RECORD)                   
         DS    CL181               BLANK                                        
TURILNQ  EQU   *-TURIDSKD                                                       
         EJECT                                                                  
*                                                                               
*        FOR EMPLOYER TP/PP, UNIT FL                                            
TUFLDSKD DSECT                                                                  
*                                                                               
TUFLID   DS    CL2                 RECORD ID - 00,01,02,03,RX,99                
*                                                                               
TUFLEIN  DS    CL9                 EIN  (FROM EMTAX RECORD)                     
TUFLEID  DS    CL7                 EMPLOYER ID#                                 
TUFL00LQ EQU   *-TUFLDSKD          LENGTH OF HEADER RECORD                      
         DS    CL286                                                            
TUFLLNQ  EQU   *-TUFLDSKD                                                       
*                                                                               
*                                  EMPLOYER RECORD (01)                         
         ORG   TUFLEIN                                                          
TUFLFEIN DS    CL9                 EIN (FROM EMTAX RECORD)                      
TUFLEID2 DS    CL7                 EMPLOYER ID#                                 
TUFLENAM DS    CL57                NAME                                         
TUFLEADD DS    CL22                ADDRESS                                      
TUFLECTY DS    CL22                CITY                                         
TUFLESTA DS    CL2                 STATE                                        
TUFLEZIP DS    CL9                 ZIP CODE                                     
TUFLYEAR DS    CL4                 FILING YEAR                                  
TUFLQRTR DS    CL2                 FILING QUARTER                               
TUFLTOTS DS    0C                  TOTALS AREA                                  
TUFL01LQ EQU   *-TUFLDSKD+TUFLRXLN LENGTH OF EMPLOYER RECORD                    
*                                                                               
*                                  EMPLOYEE RECORD (02)                         
         ORG   TUFLEIN                                                          
TUFLSSN  DS    CL9                 SOCIAL SECURITY NUMBER                       
TUFLFNAM DS    CL15                EMPLOYEE FIRST NAME                          
TUFLMNAM DS    CL1                 EMPLOYEE MIDDLE NAME                         
TUFLLNAM DS    CL20                EMPLOYEE LAST NAME                           
TUFLGROS DS    CL11                QTRLY GROSS WAGES                            
TUFLTAXW DS    CL11                QTRLY TAXABLE WAGES                          
TUFLOUTW DS    CL11                OUT OF STATE WAGES (0.00)                    
TUFLOUTT DS    CL11                OUT OF STATE TAXABLE WAGES (0.00)            
TUFLTST  DS    CL2                 TAX STATE - XX                               
TUFLCEIW DS    CL11                CONTRACTED TO EDUCATIONAL INST WAGES         
TUFL02LQ EQU   *-TUFLDSKD          LENGTH OF EMPLOYEE RECORD                    
*                                                                               
*                                  TOTAL RECORD (03)                            
         ORG   TUFLEIN                                                          
TUFLMTH1 DS    CL7                 COVERED WORKERS, 1ST MONTH                   
TUFLMTH2 DS    CL7                 COVERED WORKERS, 2ND MONTH                   
TUFLMTH3 DS    CL7                 COVERED WORKERS, 3RD MONTH                   
TUFL03LQ EQU   *-TUFLDSKD          LENGTH OF TOTAL RECORD                       
*                                                                               
*                                  EXTRA TOTAL RECORD (RX)                      
         ORG   TUFLEIN                                                          
TUFLTGRS DS    CL15                TOTAL WAGES                                  
TUFLEXCW DS    CL11                EXCESS WAGES                                 
TUFLTTAX DS    CL15                TAXABLE WAGES                                
TUFLTAXD DS    CL11                TAX DUE = TAXABLE WAGES * TAX RATE           
TUFLINT  DS    CL9                 INTEREST (0.00)                              
TUFLPEN  DS    CL9                 PENALTIES (0.00)                             
TUFLPAYA DS    CL11                TOTAL TAX DUE                                
TUFLCNAM DS    CL27                CONTACT NAME                                 
TUFLCPHN DS    CL10                CONTACT PHONE NUMBER                         
TUFLCEML DS    CL50                CONTACT EMAIL ADDRESS                        
TUFLRXLN EQU   *-TUFLEIN           LENGTH OF RX REC (MINUS 1ST 3 BYTES)         
*                                                                               
*                                  FINAL RECORD (99)                            
         ORG   TUFLEIN                                                          
TUFLSBDT DS    CL8                 SUBMISSION DATE-YYYYMMDD                     
TUFL99LQ EQU   *-TUFLDSKD          LENGTH OF FINAL RECORD                       
         DS    CL294                                                            
*                                                                               
*        FOR EMPLOYER TP/PP, UNIT HI                                            
TUHIDSKD DSECT                                                                  
*                                                                               
TUHIID   DS    CL2                 RECORD ID - RE, RS, RT                       
*                                                                               
TUHIBAT  DS    CL24                BATCH NUMBER                                 
TUHIEID  DS    CL10                EMPLOYER NUMBER (UI ACCOUNT NUMBER)          
TUHIQDTE DS    CL6                 QUARTER END DATE - MMDDYY                    
TUHIDLQ  DS    CL6                 DELINQENT DATE                               
TUHIELNQ EQU   *-TUHIBAT           EMPLOYER DETAILS LENGTH                      
*                                                                               
         ORG   TUHIBAT                                                          
TUHISSN  DS    CL9                 EMPLOYEE SSN                                 
TUHINAME DS    CL26                EMPLOYEE NAME - LAST, FIRST MI               
TUHIGROS DS    CL13                EMPLOYEE WAGES                               
TUHISLNQ EQU   *-TUHISSN           EMPLOYEE DETAILS LENGTH                      
TUHIRTOT DS    CL15                RUNNING TOTAL WAGES FOR 14 EMPLOYEES         
TUHIDATE DS    CL6                 TODAY'S DATE - MMDDYY                        
TUHIS2LN EQU   *-TUHIRTOT          EMPLYEE DETAILS LENGTH 2                     
         DS    CL204                                                            
TUHILNQ  EQU   *-TUHIDSKD                                                       
         EJECT                                                                  
*                                                                               
*        TAPE DSECT ICESA                                                       
*        CURRENTLY FOR TENNESSEE                                                
*                                                                               
TUVERICD DSECT                                                                  
TUVICSSN DS    CL9                 SOCIAL SECURITY                              
TUVICEMP DS    CL27                EMPLOYEE NAME                                
TUVICWAG DS    CL11                TOTAL WAGES                                  
TUVICQTR DS    CL1                 QUARTER                                      
TUVICYR  DS    CL2                 YEAR                                         
TUVICACC DS    CL8                 ACCOUNT NUMBER                               
TUVICLNQ EQU   *-TUVICSSN                                                       
         EJECT                                                                  
*                                                                               
*        FOR EMPLOYER TP/PP/P+     ILLINOIS                                     
TUILDSKD DSECT                                                                  
TUILID   DS    CL1                 RECORD CODE FIRST CHARACTER                  
TUILIDEQ EQU   C'E'                EMPLOYER RECORD                              
TUILIDSQ EQU   C'S'                EMPLOYEE RECORD                              
TUILEFID DS    CL9                 EMPLOYER FED EMPLOYER ID NUMBER              
TUILEUIA DS    CL7                 STATE EMPLOYER UI ACCOUNT NUMBER             
TUILETWP DS    CL14                TOTAL WAGES PAID TO WORKERS                  
TUILEWNA DS    CL14                WAGES NOT ALLOCATED                          
*                                                                               
         ORG   TUILEFID            EMPLOYEE RECORD                              
TUILSFNM DS    CL12                EMPLOYEE FIRST NAME                          
TUILSLNM DS    CL20                EMPLOYEE LAST NAME                           
TUILSSSN DS    CL11                EMPLOYEE SSN                                 
TUILSWGS DS    CL14                EMPLOYEE WAGES                               
         EJECT                                                                  
*                                                                               
*        FOR EMPLOYER TP/PP, UNIT AK                                            
TUAKDSKD DSECT                                                                  
*                                                                               
TUAKREC  DS    0C                  AK RECORD                                    
TUAKRID  DS    CL1                                                              
TUAKEHDQ EQU   C'A'                EMPLOYER  HEADER                             
TUAKDETQ EQU   C'B'                EMPLOYEE DETAILS                             
TUAKEACC DS    CL8                 EMPLOYER ACCOUNT NUMBER                      
TUAKRPYR DS    CL4                 REPORT YEAR FORMAT CCYY (EX 2007)            
TUAKRPQT DS    CL1                 REPORT QUARTER                               
TUAKZERO DS    CL1                 ZERO REPORT Y/N                              
TUAKWOST DS    CL1                 WAGES REPORTED TO OTHER STATES               
TUAKLEXW DS    CL11                LESS EXCESS WAGES                            
         DS    CL11                NOT USED NOW LEAVE BLANK                     
TUAKREMT DS    CL11                REMIT AMOUNT.  OPTIONAL                      
TUAKMON1 DS    CL6                 EMPLOYEE COUNT MONTH1                        
TUAKMON2 DS    CL6                 EMPLOYEE COUNT MONTH2                        
TUAKMON3 DS    CL6                 EMPLOYEE COUNT MONTH3                        
*                                                                               
         ORG   TUAKZERO                                                         
TUAKSSN  DS    CL9                 EMPLOYEE SSN                                 
TUAKLNAM DS    CL25                EMPLOYEE FIRST NAME                          
TUAKFNAM DS    CL15                EMPLOYEE LAST NAME                           
TUAKMNAM DS    CL1                 EMPLOYEE MIDDLE INITIAL                      
TUAKWAGE DS    CL9                 TOTAL REPORTABLE WAGES                       
         DS    CL1                 PROJECT CODE- LEAVE BLANK                    
         DS    CL20                HOURLY RATE - LEAVE BLANK                    
TUAKOCOD DS    CL10                OCCUPATIONAL CODE                            
TUAKGCOD DS    CL2                 GEOGRAPHICAL CODE                            
TUAKRECL EQU   *-TUAKREC                                                        
         EJECT                                                                  
*        FOR EMPLOYER TP/PP, UNIT IDAHO                                         
TUIDDSKD DSECT                                                                  
*                                                                               
TUIDREC  DS    0C                  ID RECORD                                    
TUIDEACC DS    CL10                EMPLOYER ACCOUNT NUMBER                      
TUIDSSN  DS    CL9                 EMPLOYEE SSN                                 
TUIDEMPN DS    CL36                EMPLOYER NAME                                
TUIDFNAM DS    CL15                FIRST NAME                                   
TUIDMNAM DS    CL1                 MIDDLE INITIAL                               
TUIDLNAM DS    CL20                LAST NAME                                    
TUIDRPQT DS    CL1                 QTR                                          
TUIDYEAR DS    CL4                 REPORT YEAR                                  
TUIDWAGE DS    CL11                GROSS WAGES                                  
TUIDRECL EQU   *-TUIDREC                                                        
         EJECT                                                                  
*                                                                               
DRADSECT DSECT                                                                  
DRA      DS    0CL512                                                           
DRAID    DC    CL2'RA'             RECORD IDENTIFER  'RA'                       
DRAFEIN  DS    CL9                 FEIN                                         
         DS    CL17                                                             
DRARESUB DS    CL1                 "0"                                          
         DS    CL8                                                              
DRACPNAM DS    CL57                COMPANY NAME LEFT JUSTIFY W SPACES           
DRAMATTN DS    CL22                MAILING ADDRESS ATTENION LINE                
DRAMADD  DS    CL22                MAILING ADDRESS                              
DRAMCTY  DS    CL22                CITY                                         
DRAMSTA  DS    CL2                 STATE OF COMMONWEATH/TERRITORY               
DRAMZIP  DS    CL5                 COMPANY MAILING ZIPCODE                      
DRAMZIPX DS    CL4                 ZIP CODE ABBREVIATION                        
         DS    CL45                                                             
DRASBNAM DS    CL57                SUBMITTER NAME                               
DRALADD  DS    CL22                LOCATION ADDRESS                             
DRADADD  DS    CL22                DELIVERY ADDRESS                             
DRACITY  DS    CL22                SUBMITTER PHYSIACAL CITY                     
DRASTAT  DS    CL2                 SUBMITTER PHYSICAL STATE                     
DRAZIP   DS    CL5                 SUBMITTER PHYSICAL ZIP                       
DRAZIPX  DS    CL4                 SUBMITTER PHYSICAL ZIP EXTENSION             
         DS    CL45                                                             
DRACNAM  DS    CL27                CONTACT NAME                                 
DRACPH3  DS    CL15                CONTACT PHONE #                              
DRACPHX  DS    CL5                 CONTACT PHONE EXTENSION                      
         DS    CL3                                                              
DRACEML  DS    CL40                CONTACT EMAIL                                
         DC    CL3' '                                                           
DRACFAX  DS    CL10                CONTACT FAX                                  
         DC    CL14' '                                                          
DRALNQ   EQU   *-DRA                                                            
         EJECT                                                                  
*=====================================================================          
*       DC - RV RECORD LAYOUT      EMPLOYER TOTALS                              
*=====================================================================          
DRVDSECT DSECT                                                                  
DRV      DS    0CL512                                                           
DRVID    DC    CL2'RV'             RECORD IDENTIFER  'RV'                       
DRVACTNM DS    CL15                DC STATE EMPLOYER ACCT NUMBER                
DRVREPD  DS     CL6                 REPORTING PERIOD                            
         DS    CL10                                                             
DRVGWAGE DS    CL20                GROSS WAGES                                  
DRVTXWAG DS    CL20                TAXABLE WAGES                                
DRVEXNTW DS    CL20                EXCESS NON TAXABLE WAGES                     
         DS    CL10                                                             
DRVEMON1 DS    CL5                 NUM OF EMPLOYEE 1ST MON OF QTR               
DRVEMON2 DS    CL5                 NUM OF EMPLOYEE 2ND MON OF QTR               
DRVEMON3 DS    CL5                 NUM OF EMPLOYEE 3RD MON OF QTR               
         DS    CL394                                                            
DRVLNQ   EQU   *-DRV                                                            
         EJECT                                                                  
*=====================================================================          
*       DC - RS RECORD LAYOUT - EMPLOYEE STATE WAGE RECORD                      
*=====================================================================          
DRSDSECT DSECT                                                                  
DRS      DS    0CL512                                                           
DRSID    DC    CL2'RS'             RECORD IDENTIFER  'RS'                       
         DS    CL7                                                              
DRSSSN   DS    CL9                 EMPLOYEE SSN                                 
DRSFNAM  DS    CL15                EMPLOYEE FIRST NAME                          
DRSMNAM  DS    CL15                EMPLOYEE MIDDLE NAME                         
DRSLNAM  DS    CL20                EMPLOYEE LAST NAME                           
DRSSUFF  DS    CL4                 EMPLOYEE SUFFIX                              
         DS    CL122                                                            
DRSADJR  DS    CL2                 NUMERIC - ADJUSTMENT CODE                    
DRSRPER  DS    CL6                 REPORTING PERIOD                             
DRSGWAGE DS    CL11                GROSS WAGES                                  
         DS    CL10                                                             
DRSOREL  DS    CL1                 OWNER/OFFICER RELATIONSHIP                   
DRSHRSWK DS    CL3                 NUMBERS HOUR WORKED                          
         DS    CL20                                                             
DRSEACTN DS    CL20                EMPLOUER ACCOUNT NUMBER (SUI)                
         DS    CL8                                                              
DRSADJRE DS    CL32                ADJUSTMENT REASION                           
         DS    CL205                                                            
DRSLNQ   EQU   *-DRS                                                            
         EJECT                                                                  
*=====================================================================          
*       DC - RF RECORD LAYOUT - TOTALS  FOR THE FILE                            
*=====================================================================          
DRFDSECT DSECT                                                                  
DRF      DS    0CL512                                                           
DRFID    DC    CL2'RF'             RECORD IDENTIFER  'RS'                       
         DS    CL5                                                              
DRFNMRS  DS    CL9                 TOTAL NUMBER OF RS RECORDS                   
DRFTOTW  DS    CL20                TOTAL WAGES REPORTED IN FILE                 
         DS    CL476                                                            
DRFLNQ   EQU   *-DRF                                                            
         EJECT                                                                  
*=====================================================================          
*       MAINE WITHHOLDING                                                       
*=====================================================================          
WHMEWHD  DSECT                                                                  
WHMEWREC DS    0C                                                               
WHRECTYP DS    CL1                 WITHOLDING OR UNEMPLOYMENT RECORD?           
WHRECWITH EQU   C'W'               WITHHOLDING RECORD                           
WHMEWID  DS    CL1                 RECORD ID                                    
WHMEWIDAQ EQU   C'A'                TRANSMITTER RECORT                          
WHMEWIDEQ EQU   C'E'                EMPLOYER RECORD                             
WHMEWIDSQ EQU   C'S'                EMPLOYEE RECORD                             
WHMEWIDTQ EQU   C'T'                TOTAL RECORD                                
WHMEWIDFQ EQU   C'F'                FINAL RECORD                                
WHMEWYEAR DS    CL4                 TAX YEAR                                    
*                                                                               
*                                                                               
*        TRANSMITTER RECORD        A RECORD                                     
*                                                                               
WHMEAFEI DS    CL9                 STATE EMPLOYER ACCOUNT NUMBER                
WHMEAENT DS    CL4                 "WITH"                                       
         DS    CL5                 NOT USED                                     
WHMEANAM DS    CL50                TRANSMITTER NAME                             
*                                                                               
WHMEAADD DS    CL40                TRANSMITTER STREET ADDRESS                   
WHMEACTY DS    CL25                TRANSMITTER CITY                             
WHMEASTA DS    CL2                 TRANSMITTER STATE                            
         DS    CL13                                                             
WHMEAZIP DS    CL5                 TRANSMITTER ZIP CODE                         
WHMEAZPX DS    CL5                 TRANSMITTER ZIP CODE EXTENSTION              
WHMEACON DS    CL30                TRANSMITTER CONTACT                          
WHMEAPHO DS    CL10                TRANSMITTER CONTACT PHONE                    
WHMEAEXT DS    CL4                 TRANSMITTER TELHONE EXTENSION                
*                                                                               
*                                                                               
         ORG   WHMEAFEI                                                         
*                                                                               
*        EMPLOYER RECORD           E RECORD                                     
*                                                                               
WHMEEFEI DS    CL9                 FEDERAL EIN FOR EMPLOYER                     
         DS    CL9                                                              
WHMEENAM DS    CL50                EMPLOYER NAME                                
*                                                                               
WHMEEADD DS    CL40                EMPLOYER STREET ADDRESS                      
WHMEECTY DS    CL25                EMPLOYER CITY                                
WHMEESTA DS    CL2                 EMPLOYER STATE                               
         DS    CL8                                                              
WHMEEZPX DS    CL5                 TRANSMITTER ZIP CODE EXTENSTION              
WHMEEZIP DS    CL5                 TRANSMITTER ZIP CODE                         
*                                                                               
         DS    CL8                                                              
WHMEEENT DS    CL4                 "WITH"                                       
WHMEESID DS    CL2                 STATE IDENTIFIER CODE MAINE=23               
         DS    CL15                                                             
WHMEEPER DS    CL2                 PERIOD COVERED ,LAST MONTH OF QTR            
WHMEENOW DS    CL1                 NO WITHHOLDINGS? 0 OR 1                      
         DS    CL18                                                             
WHMEEPRP DS    CL9                 PREPARER EIN                                 
WHMEELIC DS    CL7                 PROCESSOR LICENSE CODE                       
WHMEENME DS    CL4                 NUMBER OF EMPLOEES IN FOLLOWING              
         DS    CL29                                                             
WHMEEWAI DS    CL11                WITHOLDING ACCOUNT ID                        
         DS    CL7                                                              
*                                                                               
         ORG   WHMEWYEAR                                                        
*                                                                               
*        EMPLOYEE RECORD           S RECORD                                     
*                                                                               
WHMESSSN DS    CL9                 EMPLOYEE SSN                                 
WHMESLNM DS    CL20                EMPLOYEE LAST NAME                           
WHMESFNM DS    CL12                EMPLOYEE FIRST NAME                          
WHMESMNM DS    CL1                 EMPLOYEE MIDDLE INITIAL                      
WHMESSTA DS    CL2                 STATE CODE MAIN="23"                         
WHMESQYR DS    CL6                 REPORT QTR AND YEAR -LAST MONTH +YR          
         DS    CL91                                                             
WHMESTEN DS    CL4                 TAXING ENTITY "WITH"                         
         DS    CL44                                                             
WHMESQTX DS    CL14                QTRLY TAX WITHHELD                           
         DS    CL10                                                             
WHMESACT DS    CL11                WITHHOLDING ACCT ID 20046728200              
         DS    CL50                                                             
*                                                                               
*                                                                               
         ORG   WHMEWYEAR                                                        
*                                                                               
*        TOTAL RECORD              T RECORD                                     
*                                                                               
WHMETSNM DS    CL7                 NUM OF S RECORDS                             
WHMETTEN DS    CL4                 TAX ENTITY "WITH"                            
         DS    CL99                                                             
WHMETVPY DS    CL11                VOUCHER PAYMENTS                             
WHMETITD DS    CL11                INCOME TAX WITHOLDING DUE                    
         DS    CL41                                                             
WHMETTAD DS    CL11                TOTAL AMPIMT DUE THIS RETURN                 
         DS    CL27                                                             
WHMETQTW DS    CL14                QTRLY MAINE INCOME TAX WITHHELD              
*                                                                               
*                                                                               
*                                                                               
         ORG   WHMEWYEAR                                                        
*                                                                               
*        FINAL RECORD              F RECORD                                     
*                                                                               
WHMEFSNM DS    CL10                NUM OF S RECORDS                             
WHMEFENM DS    CL10                NUM OF E RECORDS                             
WHMEFTEN DS    CL4                 TAX ENTITY "WITH"                            
         DS    CL15                                                             
WHMEFQWT DS    CL15                QTRLY WITHOLDING REPORTED                    
*                                                                               
         ORG                                                                    
WHMEWRECL EQU   *-WHMEWREC           LENGTH OF RECORD                           
*=====================================================================          
*       MAINE UNEMPLOYMENT                                                      
*=====================================================================          
UNMEWHD  DSECT                                                                  
UNMEWREC DS    0C                                                               
UNRECTYP DS    CL1                 UNEMPLOYMENT RECORD?                         
UNRECUNEM EQU   C'U'               UNEMPLOYMENT RECORD                          
UNMEWID  DS    CL1                 RECORD ID                                    
UNMEWIDAQ EQU   C'A'                TRANSMITTER RECORT                          
UNMEWIDEQ EQU   C'E'                EMPLOYER RECORD                             
UNMEWIDSQ EQU   C'S'                EMPLOYEE RECORD                             
UNMEWIDTQ EQU   C'T'                TOTAL RECORD                                
UNMEWIDFQ EQU   C'F'                FINAL RECORD                                
UNMEWYEAR DS    CL4                 TAX YEAR                                    
*                                                                               
*                                                                               
*        TRANSMITTER RECORD        A RECORD                                     
*                                                                               
UNMEAFEI DS    CL9                 STATE EMPLOYER ACCOUNT NUMBER                
UNMEAENT DS    CL4                 "WAGE"                                       
         DS    CL5                 NOT USED                                     
UNMEANAM DS    CL50                TRANSMITTER NAME                             
*                                                                               
UNMEAADD DS    CL40                TRANSMITTER STREET ADDRESS                   
UNMEACTY DS    CL25                TRANSMITTER CITY                             
UNMEASTA DS    CL2                 TRANSMITTER STATE                            
         DS    CL13                                                             
UNMEAZIP DS    CL5                 TRANSMITTER ZIP CODE                         
UNMEAZPX DS    CL5                 TRANSMITTER ZIP CODE EXTENSTION              
UNMEACON DS    CL30                TRANSMITTER CONTACT                          
UNMEAPHO DS    CL10                TRANSMITTER CONTACT PHONE                    
UNMEAEXT DS    CL4                 TRANSMITTER TELHONE EXTENSION                
*                                                                               
*                                                                               
         ORG   UNMEAFEI                                                         
*                                                                               
*        EMPLOYER RECORD           E RECORD                                     
*                                                                               
UNMEEFEI DS    CL9                 FEDERAL EIN FOR EMPLOYER                     
         DS    CL9                                                              
UNMEENAM DS    CL50                EMPLOYER NAME                                
*                                                                               
UNMEEADD DS    CL40                EMPLOYER STREET ADDRESS                      
UNMEECTY DS    CL25                EMPLOYER CITY                                
UNMEESTA DS    CL2                 EMPLOYER STATE                               
         DS    CL8                                                              
UNMEEZPX DS    CL5                 TRANSMITTER ZIP CODE EXTENSTION              
UNMEEZIP DS    CL5                 TRANSMITTER ZIP CODE                         
*                                                                               
         DS    CL8                                                              
UNMEEENT DS    CL4                 "WAGE"                                       
UNMEESID DS    CL2                 STATE IDENTIFIER CODE MAINE=23               
UNMEEUCA DS    CL10                MAINE ACC # 0212523003                       
         DS    CL5                                                              
UNMEEPER DS    CL2                 PERIOD COVERED ,LAST MONTH OF QTR            
UNMEENOW DS    CL1                 NO WITHHOLDINGS? 0 OR 1                      
         DS    CL18                                                             
UNMEEPRP DS    CL9                 PREPARER EIN                                 
UNMEELIC DS    CL7                 PROCESSOR LICENSE CODE                       
*                                                                               
         ORG   UNMEWYEAR                                                        
*                                                                               
*        EMPLOYEE RECORD           S RECORD                                     
*                                                                               
UNMESSSN DS    CL9                 EMPLOYEE SSN                                 
UNMESLNM DS    CL20                EMPLOYEE LAST NAME                           
UNMESFNM DS    CL12                EMPLOYEE FIRST NAME                          
UNMESMNM DS    CL1                 EMPLOYEE MIDDLE INITIAL                      
UNMESSTA DS    CL2                 STATE CODE MAIN="23"                         
UNMESQYR DS    CL6                 REPORT QTR AND YEAR -LAST MONTH +YR          
         DS    CL12                                                             
UNMESTWA DS    CL14                TOTAL QTRLY WAGES                            
UNMESEXW DS    CL14                EXCESS UC WAGES                              
UNMESUTW DS    CL14              TOTAL UC WAGES PAID MINUS EXCESS WAGES         
         DS    CL37                                                             
UNMESTEN DS    CL4                 TAXING ENTITY "WAGE"                         
UNMESUCA DS    CL10                MAINE UC EMPLYER ACC NUMBER                  
         DS    CL48                                                             
UNMESSEA DS    CL1                 SEASONAL CODE                                
         DS    CL5                                                              
UNMESWPC DS    CL1                 WAGE PLAN CODE                               
UNMESMN1 DS    CL1                 MONTH1- 1 IF RECEIVE PAY ON MONTH1           
UNMESMN2 DS    CL1                 MONTH2- 1 IF RECEIVE PAY ON MONTH2           
UNMESMN3 DS    CL1                 MONTH3- 1 IF RECEIVE PAY ON MONTH3           
         DS    CL11                                                             
UNMESFEM DS    CL1                 1 = YES FEMALE, 0 = NO MALE                  
*                                                                               
*                                                                               
         ORG   UNMEWYEAR                                                        
*                                                                               
*        TOTAL RECORD              T RECORD                                     
*                                                                               
UNMETSNM DS    CL7                 NUM OF S RECORDS                             
UNMETTEN DS    CL4                 TAX ENTITY "WAGE"                            
UNMETUCA DS    CL10                UC EMPLOYER ACCT NUMBER                      
         DS    CL4                                                              
UNMETTWG DS    CL14                TOTAL REPORTABLE UC WAGES                    
UNMETEXW DS    CL14                QTR WAGES EXCESS OF STATE UC TAXABLE         
UNMETTTW DS    CL14                TOTAL TAXABLE WAGES LESS EXCESS WAGE         
         DS    CL19                                                             
UNMETUCD DS    CL13                UC CONTRIBUTION DUE  TAXABLE UC*RATE         
UNMETCSS DS    CL11                COMPETITIVE SKILL SCHOLARSHIP FUND           
         DS    CL33                                                             
UNMETUCR DS    CL4                 UC CONTRIBUTION RATE                         
UNMETCSR DS    CL4                 CSSF ASSESSMENT RATE                         
         DS    CL22                                                             
UNMETCSD DS    CL11                CSSF DUE                                     
         DS    CL41                                                             
UNMETMN1 DS    CL7                 NUM EMPLOYERS IN 1ST MON OF QTR              
UNMETMN2 DS    CL7                 NUM EMPLOYERS IN 2ND MON OF QTR              
UNMETMN3 DS    CL7                 NUM EMPLOYERS IN 3RD MON OF QTR              
UNMETFM1 DS    CL7                 NUM FEMALE EMPLOYEES IN MON1                 
UNMETFM2 DS    CL7                 NUM FEMALE EMPLOYEES IN MON2                 
UNMETFM3 DS    CL7                 NUM FEMALE EMPLOYEES IN MON3                 
         DS    CL7                                                              
*                                                                               
*                                                                               
*                                                                               
         ORG   UNMEWYEAR                                                        
*                                                                               
*        FINAL RECORD              F RECORD                                     
*                                                                               
UNMEFSNM DS    CL10                NUM OF S RECORDS                             
UNMEFENM DS    CL10                NUM OF E RECORDS                             
UNMEFTEN DS    CL4                 TAX ENTITY "WAGE"                            
         DS    CL15                                                             
UNMEFTGW DS    CL15                QTRLY GROSS WAGESEPORTED                     
*                                                                               
         ORG                                                                    
UNMEWRECL EQU   *-UNMEWREC           LENGTH OF RECORD                           
