*          DATA SET TAYTDTAB   AT LEVEL 004 AS OF 01/21/91                      
*                                                                               
*        YTD TABLE FOR ALL PERFORMERS                                           
*                                                                               
         SPACE 1                                                                
YTDTABD  DSECT                                                                  
*                                                                               
YTDSSN   DS    CL9                 SS NUMBER                                    
YTDDATE  DS    PL3                 DATE OF CURRENT BILLING                      
YTDCURR  DS    CL1                 CURRENCY                                     
YTDEMP   DS    CL3                 EMPLOYER                                     
         DS    CL4                                                              
YTDFCURR DS    F                   CURRENT (RUN) Y-T-D EARNINGS                 
YTDSCURR DS    F                   CURRENT (RUN) Y-T-D SUI TAXABLE              
         DS    CL8                                                              
YTDLEN   EQU   *-YTDTABD                                                        
