*          DATA SET TEKEY      AT LEVEL 002 AS OF 06/20/73                      
TEKEY    DS    CL13 .              KEY                                          
         ORG   TEKEY                                                            
TEFCODE  DS    X'0A'               FILE CODE                                    
TERCODE  DS    X'04'               RECORD CODE                                  
TEAGY    DS    CL1 . B             AGENCY                                       
TEMED    DS    CL1 . A             MEDIA                                        
TECLT    DS    CL2 . A             CLIENT                                       
         DS    CL7 . B             SPARE                                        
TELEN    DS    CL2 . B             RECORD LENGTH                                
TECNTL   DS    C                   CONTROL                                      
TELINKS  DS    CL8 . B             LINKS                                        
