*          DATA SET THLRECN    AT LEVEL 008 AS OF 06/16/75                      
THLKEY   DS    CL13 .               KEY                                         
         ORG   THLKEY                                                           
THLFCODE DS    X'0A'                FILE CODE                                   
THLRCODE DS    X'05'                RECORD CODE                                 
THLAGY   DS    CL1 . B              AGENCY                                      
THLMED   DS    CL1 . A              MEDIA                                       
THLCLT   DS    CL2 . A              CLIENT                                      
THLPRD   DS    CL2 . A             PRODUCT CODE                                 
         DS    CL5 . B             SPARE                                        
THLLEN   DS    CL2 . B              RECORD LENGTH                               
THLCNTL  DS    C                    CONTROL                                     
THLLINKS DS    CL8 . B              LINKS                                       
THLECD1  DS    CL2                                                              
THL1     DS    CL60                HL 1                                         
THLECD2  DS    CL2                 X'0252'                                      
THL2     DS    CL60                HL 2                                         
THLECD3  DS    CL2                 X'0352'                                      
THL3     DS    CL60                HL 3                                         
THLECD4  DS    CL2                 X'0452'                                      
THL4     DS    CL60                HL 4                                         
THLECD4A DS    CL2                                                              
THL5     DS    CL60                HL 5                                         
THLECD4B DS    CL2                                                              
THL6     DS    CL60                HL6                                          
THLECD5  DS    CL2                 X'052A'                                      
TFN1     DS    CL60                FN 1                                         
THLECD6  DS    CL2                 X'062A'                                      
TFN2     DS    CL60                FN 2                                         
THLECD7  DS    CL2                 C'072A'                                      
TFN3     DS    CL60                FN 3                                         
TFHNCD   DS    CL2                 021A                                         
TFHN     DS    CL24                FILM HOUSE NAME                              
TFHSACD  DS    CL2                 0216                                         
TFHSA    DS    CL20                STREET ADDRESS                               
TFHCTCD  DS    CL2                 0216                                         
TFHCT    DS    CL20                CITY ADDRESS                                 
TFHSZCD  DS    CL2                 020A                                         
TFHSZ    DS    CL8                 STATE/ZIP                                    
TFTWIXCD DS    CL2                 0210                                         
TFTWIX   DS    CL14                TWIX NO                                      
TFHC1CD  DS    CL2                 023E                                         
TFHC1    DS    CL60                COMMENT LINE 1                               
TFHC2CD  DS    CL2                 023E                                         
TFHC2    DS    CL60                COMMENT LINE 2                               
TFHC3CD  DS    CL2                 023E                                         
TFHC3    DS    CL60                COMMENT LINE 3                               
TFHOPTCD DS    CL2                 0203                                         
TFHOPT   DS    CL1                 PRINT FIRST TLCST DATE OPTION                
