*          DATA SET TIMTALD    AT LEVEL 002 AS OF 08/10/06                      
*TIME+TALENT DOLLAR DSECT                                                       
*TABLE BUILT IN NEWRI20 FOR EACH CLIENT                                         
* FIRST LINE IN TABLE HAS COMPRESSED CLIENT IN TTNET                            
* SUBSEQUENT LINE ENTRIES CONTAIN DATA FOR THAT CLIENT                          
TIMTALD  DS    0CL14                                                            
TTNET    DS    CL4                 NETWORK                                      
TTDATE   DS    CL2                 DATE                                         
TTMULT   DS    XL4                 MULTIPLIER                                   
TTDIV    DS    XL4                 DIVSOR                                       
TTLENE   EQU   *-TTNET                                                          
