*          DATA SET TIMXXXD    AT LEVEL 003 AS OF 11/06/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TB22FFD      DATE 11/06/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
AVGMSGH  DS    XL8                                                              
AVGMSG   DS    CL30     2    2   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      4    2    7  A  P N             T        Y              
AVGSC1H  DS    XL8                                                              
AVGSC1   DS    CL2      4   15    2  A  U N             T        Y              
AVGSL1H  DS    XL8                                                              
AVGSL1   DS    CL1      4   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
AVGSC2H  DS    XL8                                                              
AVGSC2   DS    CL2      5   15    2  A  U N             T        Y              
AVGSL2H  DS    XL8                                                              
AVGSL2   DS    CL1      5   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
AVGSC3H  DS    XL8                                                              
AVGSC3   DS    CL2      6   15    2  A  U N             T        Y              
AVGSL3H  DS    XL8                                                              
AVGSL3   DS    CL1      6   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
AVGSC4H  DS    XL8                                                              
AVGSC4   DS    CL2      7   15    2  A  U N             T        Y              
AVGSL4H  DS    XL8                                                              
AVGSL4   DS    CL1      7   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
AVGSC5H  DS    XL8                                                              
AVGSC5   DS    CL2      8   15    2  A  U N             T        Y              
AVGSL5H  DS    XL8                                                              
AVGSL5   DS    CL1      8   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
AVGSC6H  DS    XL8                                                              
AVGSC6   DS    CL2      9   15    2  A  U N             T        Y              
AVGSL6H  DS    XL8                                                              
AVGSL6   DS    CL1      9   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
AVGSC7H  DS    XL8                                                              
AVGSC7   DS    CL2     10   15    2  A  U N             T        Y              
AVGSL7H  DS    XL8                                                              
AVGSL7   DS    CL1     10   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
AVGSC8H  DS    XL8                                                              
AVGSC8   DS    CL2     11   15    2  A  U N             T        Y              
AVGSL8H  DS    XL8                                                              
AVGSL8   DS    CL1     11   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
AVGSC9H  DS    XL8                                                              
AVGSC9   DS    CL2     12   15    2  A  U N             T        Y              
AVGSL9H  DS    XL8                                                              
AVGSL9   DS    CL1     12   18    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
AVGSC10H DS    XL8                                                              
AVGSC10  DS    CL2     13   15    2  A  U N             T        Y              
AVGSL10H DS    XL8                                                              
AVGSL10  DS    CL1     13   18    1  A  U N             T        Y              
AVGLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
AVGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 384  BYTES                            
