*          DATA SET TLTELEM    AT LEVEL 002 AS OF 06/20/73                      
TLTELEM  DS    0C                  ***LETTER DATE ELEMENT***                    
TLTCODE  DS    X'31'               ELEMENT CODE                                 
TLTLEN   DS    CL1 . B             ELEMENT LENGHT                               
         DS    CL4 . X             SPARE                                        
TLTPRD   DS    CL2 . C             PRODUCT 'FFFF' = POL OR ALL                  
TLTDTE   DS    CL3 . B             DATE OF MOST RECENT LETTER                   
TLTSTRT  DS    CL3 . B             PERIOD START                                 
TLTEND   DS    CL3 . B             PERIOD END                                   
TLTDTEP  DS    CL3 . B             PREVIOUS LETTER DATE                         
