*          DATA SET TLTSELEM   AT LEVEL 001 AS OF 01/04/75                      
TLSELEM  DS    0C                  ***FILM SIMULATION ELEMENT***                
TLSCODE  DS    X'05'               ELEMENT CODE                                 
TLSLEN   DS    CL1                 ELEMENT LENGTH                               
TLSPRD   DS    CL2                 PRODUCT CODE                                 
*                                                                               
*        VARIABLE NUMBER OF 12 BYTE FIELDS                                      
*                                                                               
TLSFNO   DS    CL2                 ISCI FILM NUMBER                             
TLSLUD   DS    CL2                 LAST USE DATE                                
TLSCAN   DS    CL2                 CANNISTER NUMBER                             
