*          DATA SET TLXRECD    AT LEVEL 002 AS OF 09/27/06                      
***********************************************************************         
*                                                                     *         
*          TALENT EXTRACT                                             *         
*          EXTRACT RECORD DSECTS BY RECORD TYPE                       *         
*          AVAILABLE RECORD TYPE RANGE - 05300 TO 05399               *         
*                                                                     *         
*DXHDRD    00000  HEADER RECORD (COMMON ACROSS SYSTEMS)               *         
*                                                                     *         
*          SPARE - 05321-05399                                        *         
*                                                                     *         
*DXTRLD    99999  TRAILER RECORD (COMMON ACROSS SYSTEMS)              *         
*                                                                     *         
*        NOTES ON TLXTRACT (SEE TLXCTLD)                              *         
*        -----------------                                            *         
*        TLXTRACT CONTAINS THE CODE L FOR ALL RECORDS WHEN A LOAD     *         
*        MODE EXTRACT IS PERFORMED. ALL RECORDS IN THE DATABASE WILL  *         
*        BE REPLACED BY THE EXTRACTED FILE.                           *         
*                                                                     *         
*        FOR AN UPDATE MODE EXTRACT, GXRECACT CONTAINS C (CHANGE),    *         
*        A (ADD) OR D (DELETE) FOR ALL RECORDS EXCEPT MONEY RECORDS.  *         
*        MONEY RECORDS CONTAIN M (MERGE). THE CONTENTS OF A MERGED    *         
*        RECORD ARE ADDED TO THE EXISTING RECORD OF THE SAME KEY, OR  *         
*        ADDED AS A NEW RECORD IF THE KEY DOES NOT ALREADY EXIST. IF  *         
*        THE RESULT OF ADDING THE CONTENTS TO AN EXISTING RECORD IS   *         
*        A RECORD WITH ALL ZERO VALUES, IT CAN THEN BE DELETED. FOR   *         
*        AN ADD, ONE POSITIVE MERGE RECORD IS CREATED. FOR A DELETE,  *         
*        AN IDENTICAL RECORD IS CREATED, BUT WITH ALL VALUES NEGATED. *         
*        FOR A CHANGE, TWO RECORDS ARE CREATED - A NEGATIVE DELETE OF *         
*        THE OLD VALUES AND A POSITIVE ADD OF THE NEW VALUES. THESE   *         
*        MAY BE COMBINED IF THE KEYS ARE THE SAME.                    *         
*                                                                     *         
***********************************************************************         
         EJECT                                                                  
       ++INCLUDE DXHDRD                                                         
         EJECT                                                                  
       ++INCLUDE DXTRLD                                                         
         EJECT                                                                  
       ++INCLUDE TLXCTLD                                                        
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - AGENCY RECORD (05300)                              *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX00AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX00NAME DS    CL36    R CHAR      AGENCY NAME                                  
         DS    C                                                                
TX00SNME DS    CL16    O CHAR      AGENCY SHORT NAME                            
         DS    C                                                                
TX00ADD1 DS    CL30    R CHAR      ADDRESS 1                                    
         DS    C                                                                
TX00ADDQ EQU   *-TX00ADD1          LENGTH OF EACH ADDRESS LINE                  
TX00ADD2 DS    CL30    O CHAR      ADDRESS 2                                    
         DS    C                                                                
TX00ADD3 DS    CL30    O CHAR      ADDRESS 3                                    
         DS    C                                                                
TX00ADD4 DS    CL30    O CHAR      ADDRESS 4                                    
         DS    C                                                                
TX00ATTN DS    CL36    R CHAR      ATTENTION NAME                               
         DS    C                                                                
TX00TEL  DS    CL12    O CHAR      TELEPHONE                                    
         DS    C                                                                
TX00EMAL DS    CL180   R CHAR      EMAIL ADDRESS                                
         DS    C                                                                
TX00FAX  DS    CL12    O CHAR      FAX NUMBER                                   
         DS    C                                                                
TX00OFFC DS    CL1     R CHAR      OFFICE CODE                                  
         DS    C                                                                
TX00RCV  DS    CL12    R CHAR      RECEIVABLE ACCOUNT                           
         DS    C                                                                
TX00BTYP DS    CL3     R SINT      BILLING TYPE                                 
         DS    C                                                                
TX00HFEQ DS    CL3     R SINT      HOLDING FEE NOTICE FREQUENCY                 
         DS    C                                                                
TX00MFEQ DS    CL1     O CHAR      MONTHLY HOLDING FEE NOTICE (Y/N)             
         DS    C                                                                
TX00NO2N DS    CL1     O CHAR      DOESN'T WANT SECOND NOTICE (Y/N)             
         DS    C                                                                
TX00CTOT DS    CL1     O CHAR      SHOW AGY COMMISSION ON TOTALS (Y/N)          
         DS    C                                                                
TX00ANYN DS    CL1     O CHAR      AGY DOESN'T WANT ANY NOTICES (Y/N)           
         DS    C                                                                
TX00HLDS DS    CL1     O CHAR      GENERATE HOLDING FEE (P,E OR B)              
         DS    C                                                                
TX00FIL1 DS    CL1     O CHAR      FILTER 1                                     
         DS    C                                                                
TX00FIL2 DS    CL1     O CHAR      FILTER 2                                     
         DS    C                                                                
TX00FIL3 DS    CL1     O CHAR      FILTER 3                                     
         DS    C                                                                
TX00FIL4 DS    CL1     O CHAR      FILTER 4                                     
         DS    C                                                                
TX00BCOP DS    CL3     R SINT      BILLING COPIES                               
         DS    C                                                                
TX00TPCU DS    CL8     O CHAR      TPC USERID                                   
         DS    C                                                                
TX00STFF DS    CL8     O CHAR      STAFF ID OF TP STAFF                         
         DS    C                                                                
TX00BDUE DS    CL3     O SINT      BILLING DAYS DUE                             
         DS    C                                                                
TX00ESET DS    CL3     O CHAR      ESTIMATE SETUP                               
         DS    C                                                                
TX00AGRP DS    CL6     O CHAR      AGENCY GROUP CODE                            
         DS    C                                                                
TX00RINV DS    CL5     O INT       RESET INVOICE NUMBER                         
         DS    C                                                                
TX00NINV DS    CL12    O CHAR      NEXT INVOICE NUMBER                          
         DS    C                                                                
TX00PINV DS    CL6     O CHAR      PRINTED INVOICE NUMBER                       
         DS    C                                                                
TX00RADV DS    CL5     O INT       RESET ADVICE NUMBER                          
         DS    C                                                                
TX00NADV DS    CL6     O CHAR      NEXT ADVICE NUMBER                           
         DS    C                                                                
TX00LBOX DS    CL1     O CHAR      LOCK BOX CODE                                
         DS    C                                                                
TX00SIGN DS    CL6     O CHAR      SIGNATORY                                    
         DS    C                                                                
TX00COMT DS    CL59    O CHAR      COMMENT                                      
         DS    C                                                                
TX00GRUL DS    CL1     O CHAR      GRT HANDLING RULE                            
         DS    C                                                                
TX00GRAT DS    CL5     O INT       GRT HANDLING RATE                            
         DS    C                                                                
TX00GLMT DS    CL8     O INT       GUARANTEE LIMIT                              
         DS    C                                                                
TX00FUTA DS    CL5     O INT       FUTA RATE                                    
         DS    C                                                                
TX00SUTA DS    CL5     O INT       SUTA RATE                                    
         DS    C                                                                
TX00FICA DS    CL5     O INT       FICA RATE                                    
         DS    C                                                                
TX00OFIC DS    CL5     O INT       OVER FICA RATE                               
         DS    C                                                                
TX00WCOR DS    CL5     O INT       WC CORP RATE                                 
         DS    C                                                                
TX00CORR DS    CL5     O INT       CORP RATE                                    
         DS    C                                                                
TX00HFR  DS    CL5     O INT       HANDLING FEE RATE                            
         DS    C                                                                
TX00CHFR DS    CL5     O INT       CANADIAN HANDLING FEE RATE                   
         DS    C                                                                
TX00COD  DS    CL1     O CHAR      COD AGENCY (Y/N)                             
         DS    C                                                                
TX00APO  DS    CL1     O CHAR      AUTH/PO REQUIRED (Y/N)                       
         DS    C                                                                
TX0013W  DS    CL1     O CHAR      13 WEEK CYCLES (Y/N)                         
         DS    C                                                                
TX00CTX  DS    CL1     O CHAR      CANADIAN TAX WITHHELD (Y/N)                  
         DS    C                                                                
TX00CTXU DS    CL1     O CHAR      CANADIAN TAX WITHHELD ON US$ (Y/N)           
         DS    C                                                                
TX00FTRK DS    CL1     O CHAR      NO FTRACK REPORTS (N/Y)                      
         DS    C                                                                
TX00EREQ DS    CL1     O CHAR      ESTIMATE REQUIRED (Y/N)                      
         DS    C                                                                
TX00SHUT DS    CL1     O CHAR      PRINT ON AGENCY SHUTTLE (Y/N)                
         DS    C                                                                
TX00DEFT DS    CL1     O CHAR      NO DEFAULT JOBS ALLOWED (Y/N)                
         DS    C                                                                
TX00FULL DS    CL1     O CHAR      FULL GTRACK AND FTRACK REPORTS (Y/N)         
         DS    C                                                                
TX00RETR DS    CL1     O CHAR      RETRO INVOICES GENERATED (Y/N)               
         DS    C                                                                
TX00HAND DS    CL1     O CHAR      HAND DELIVERY (Y/N)                          
         DS    C                                                                
TX00MAIL DS    CL1     O CHAR      MAIL DELIVERY (Y/N)                          
         DS    C                                                                
TX00PCH  DS    CL1     O CHAR      POUCH SHIPMENT TO CHICAGO (Y/N)              
         DS    C                                                                
TX00OVER DS    CL1     O CHAR      OVERNIGHT DELIVERY (Y/N)                     
         DS    C                                                                
TX00MCHI DS    CL1     O CHAR      MAILED FROM CHICAGO (Y/N)                    
         DS    C                                                                
TX00LOCK DS    CL1     O CHAR      AGENCY IS LOCKED (Y/N)                       
         DS    C                                                                
TX00PRIM DS    CL1     O CHAR      PRIORITY MAIL (Y/N)                          
         DS    C                                                                
TX00SOAP DS    CL1     O CHAR      SOAP RESIDUAL AGENCY (Y/N)                   
         DS    C                                                                
TX0030M  DS    CL1     O CHAR      30 MINUTE SOAP SERIAL (Y/N)                  
         DS    C                                                                
TX00NOSD DS    CL1     O CHAR      NO SENDING GENERATED ADVICES (Y/N)           
         DS    C                                                                
TX00CAST DS    CL1     O CHAR      CAST SUPPRESSED WHEN ADDING (Y/N)            
         DS    C                                                                
TX00TNX  DS    CL1     O CHAR      TNX/TAG PRINT AT AGENCY (Y/N)                
         DS    C                                                                
TX00AADV DS    CL1     O CHAR      AUTO NUMBERED ADVICES (Y/N)                  
         DS    C                                                                
TX00GTRK DS    CL1     O CHAR      NO GTRACK REPORTS (Y/N)                      
         DS    C                                                                
TX00CLPO DS    CL1     O CHAR      CLOSE THE PO (Y/N)                           
         DS    C                                                                
TX00LATE DS    CL1     O CHAR      LATE NIGHT USES (Y/N)                        
         DS    C                                                                
TX00NHAN DS    CL1     O CHAR      NO HANDLING ON PRINT CHECKS (Y/N)            
         DS    C                                                                
TX00CODP DS    CL1     O CHAR      COD AGY ON PROD INT (Y/N)                    
         DS    C                                                                
TX00CLER DS    CL1     O CHAR      DO NOT CLEAR EST# ON ADVICE (Y/N)            
         DS    C                                                                
TX00ADSX DS    CL1     O CHAR      ADVICE SESSIONS PULL EXTRAS (Y/N)            
         DS    C                                                                
TX00VPON DS    CL1     O CHAR      VALIDATE PO NUMBER (Y/N)                     
         DS    C                                                                
TX00SPTI DS    CL1     O CHAR      CAN USE SPOT INTERFACE (Y/N)                 
         DS    C                                                                
TX00NETI DS    CL1     O CHAR      CAN USE NET INTERFACE (Y/N)                  
         DS    C                                                                
TX00NWRK DS    CL1     O CHAR      NETWORK REQUIRED FOR CLA USES (Y/N)          
         DS    C                                                                
TX00STDR DS    CL1     O CHAR      USE STANDARD RATE CARD (Y/N)                 
         DS    C                                                                
TX00PINT DS    CL1     O CHAR      ON PRODUCTION INTERFACE (Y/N)                
         DS    C                                                                
TX00CPIN DS    CL1     O CHAR      CLIENT LVL PROD INTERFACE (Y/N)              
         DS    C                                                                
TX00QRTR DS    CL1     O CHAR      EST PERIOD = QUARTERS (Y/N)                  
         DS    C                                                                
TX0075K  DS    CL1     O CHAR      NO CHARGE ABOVE $75000                       
         DS    C                                                                
TX00OEMP DS    CL3     O CHAR      OVERRIDE EMPLOYER                            
         DS    C                                                                
TX00VEND DS    CL5     O CHAR      VENDOR#                                      
         DS    C                                                                
TX00COFF DS    CL4     O CHAR      COMPANY CODE AND OFFICE                      
         DS    C                                                                
TX00SFEE DS    CL6     O CHAR      SIGNATORY FEE %                              
         DS    C                                                                
TX00CAMT DS    CL10    O CHAR      CAP AMOUNT                                   
*                                                                               
TX00X    DS    CL2                 RECORD END                                   
TX00LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - LIMITED NETWORK RECORD (05301) AGENCY SUBSET       *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX01AGY  DS    CL6     R CHAR      AGENCY                                       
         DS    C                                                                
TX01LUID DS    CL10    O CHAR      LIMITED NETWORK ID                           
*                                                                               
TX01X    DS    CL2                 RECORD END                                   
TX01LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - AGENCY GROUP RECORD (05302)                        *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX02AGG  DS    CL6     R CHAR      AGENCY GROUP CODE                            
         DS    C                                                                
TX02NAME DS    CL36    R CHAR      AGENCY GROUP NAME                            
         DS    C                                                                
TX02SNME DS    CL16    O CHAR      AGENCY GROUP SHORT NAME                      
*                                                                               
TX02X    DS    CL2                 RECORD END                                   
TX02LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - W-4 RECORD (05303)                                 *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX03SSN  DS    CL9     R CHAR      SSN, FEIN, CANADIAN SIN                      
         DS    C                                                                
TX03FNME DS    CL16    R CHAR      FIRST NAME                                   
         DS    C                                                                
TX03MNME DS    CL16    O CHAR      MIDDLE NAME                                  
         DS    C                                                                
TX03LNME DS    CL16    R CHAR      LAST NAME                                    
         DS    C                                                                
TX03SUFF DS    CL4     O CHAR      SUFFIX                                       
         DS    C                                                                
TX03TEL  DS    CL20    O CHAR      TELEPHONE                                    
         DS    C                                                                
TX03AKAF DS    CL16    O CHAR      AKA FIRST NAME                               
         DS    C                                                                
TX03AKAL DS    CL16    O CHAR      AKA LAST NAME                                
         DS    C                                                                
TX03CNME DS    CL32    O CHAR      CORPORATION NAME                             
         DS    C                                                                
TX03ADD1 DS    CL30    R CHAR      ADDRESS 1                                    
         DS    C                                                                
TX03ADD2 DS    CL30    O CHAR      ADDRESS 2                                    
         DS    C                                                                
TX03ADD3 DS    CL30    O CHAR      ADDRESS 3                                    
         DS    C                                                                
TX03CITY DS    CL25    R CHAR      CITY                                         
         DS    C                                                                
TX03STAT DS    CL2     R CHAR      STATE                                        
         DS    C                                                                
TX03ZIP  DS    CL10    R CHAR      ZIP                                          
         DS    C                                                                
TX03SEX  DS    CL1     O CHAR      SEX CODE                                     
         DS    C                                                                
TX03TID  DS    CL1     O CHAR      TAX ID CODE                                  
         DS    C                                                                
TX03TUNT DS    CL3     O CHAR      TAX UNIT                                     
         DS    C                                                                
TX03CNUM DS    CL1     O CHAR      CORPORATE NUMBER                             
         DS    C                                                                
TX03CID  DS    CL14    O CHAR      CORPORATION FEDERAL TAX ID                   
         DS    C                                                                
TX03INDD DS    CL8     O DATE      INDEMNIFICATION DATE                         
         DS    C                                                                
TX03AFML DS    CL3     O CHAR      AFM LOCAL CHAPTER                            
         DS    C                                                                
TX03ACTR DS    CL9     O CHAR      ACTRA MEMBERSHIP ID                          
         DS    C                                                                
TX03TYPE DS    CL1     R CHAR      TYPE                                         
         DS    C                                                                
TX03NYTD DS    CL1     O CHAR      NO YTD ON CHECKS (Y/N)                       
         DS    C                                                                
TX03DUE  DS    CL1     O CHAR      DUE COMPANY RECORDS PRESENT (Y/N)            
         DS    C                                                                
TX03LIEN DS    CL1     O CHAR      LIEN RECORDS PRESENT (Y/N)                   
         DS    C                                                                
TX03SIRS DS    CL1     O CHAR      SENT TO IRS.10 EXEMPTS (Y/N)                 
         DS    C                                                                
TX03NCHG DS    CL1     O CHAR      CAN'T CHANGE # OF EXEMPTS (Y/N)              
         DS    C                                                                
TX03NWIT DS    CL1     O CHAR      NO WITHHOLDING YET (Y/N)                     
         DS    C                                                                
TX03GRTS DS    CL1     O CHAR      GUARANTEES PRESENT (Y/N)                     
         DS    C                                                                
TX03SCHK DS    CL1     O CHAR      SORT CHECK FIRST (Y/N)                       
         DS    C                                                                
TX03NPEN DS    CL1     O CHAR      NO PENSION YET (Y/N)                         
         DS    C                                                                
TX03NDUE DS    CL1     O CHAR      NO DUE COMPANY WITHHELD (Y/N)                
         DS    C                                                                
TX03DIRD DS    CL1     O CHAR      DIRECT DEPOSIT CHECKS (Y/N)                  
         DS    C                                                                
TX03WIRE DS    CL1     O CHAR      WIRE TRANSFER CHECKS (Y/N)                   
         DS    C                                                                
TX03FADD DS    CL1     O CHAR      FOREIGN ADDRESS (Y/N)                        
         DS    C                                                                
TX03LOCK DS    CL1     O CHAR      LOCKED (Y/N)                                 
         DS    C                                                                
TX03IRSL DS    CL1     O CHAR      IRS LOCK ON FEDL WITHHOLDING (Y/N)           
         DS    C                                                                
TX03NFIC DS    CL1     O CHAR      NO FICA WITHHOLDING (Y/N)                    
         DS    C                                                                
TX03SLET DS    CL1     R CHAR      SPECIAL LETTER ON FILE (Y/N)                 
         DS    C                                                                
TX03EMPL DS    CL3     O CHAR      EMPLOYER                                     
         DS    C                                                                
TX03FARA DS    CL3     O CHAR      FEDERAL AREA (FD)                            
         DS    C                                                                
TX03SARA DS    CL3     O CHAR      STATE AREA                                   
         DS    C                                                                
TX03CARA DS    CL3     O CHAR      CITY AREA                                    
         DS    C                                                                
TX03FMAR DS    CL1     O CHAR      FEDERAL MARITAL STATUS (M/S)                 
         DS    C                                                                
TX03SMAR DS    CL1     O CHAR      STATE MARITAL STATUS (M/S)                   
         DS    C                                                                
TX03CMAR DS    CL1     O CHAR      CITY MARITAL STATUS (M/S)                    
         DS    C                                                                
TX03FEXP DS    CL3     O SINT      FEDERAL EXEMPTIONS                           
         DS    C                                                                
TX03SEXP DS    CL3     O SINT      STATE EXEMPTIONS                             
         DS    C                                                                
TX03CEXP DS    CL3     O SINT      CITY EXEMPTIONS                              
         DS    C                                                                
TX03FFIX DS    CL10    O INT       FEDERAL FIXED %                              
         DS    C                                                                
TX03SFIX DS    CL10    O INT       STATE FIXED %                                
         DS    C                                                                
TX03CFIX DS    CL10    O INT       CITY FIXED %                                 
         DS    C                                                                
TX03RSTE DS    CL2     O CHAR      RECIPROCAL STATE                             
         DS    C                                                                
TX03RACE DS    CL2     O CHAR      RACE                                         
         DS    C                                                                
TX03FEQW DS    CL1     O CHAR      FREQUENCY OF WITHHOLDING                     
         DS    C                                                                
TX03DOB  DS    CL8     O DATE      DATE OF BIRTH                                
         DS    C                                                                
TX03DED  DS    CL10    O INT       DEDUCT %                                     
         DS    C                                                                
TX03TRUS DS    CL9     O CHAR      TRUSTEE SSN                                  
         DS    C                                                                
TX03MLIF DS    CL10    O INT       MINOR LIFETIME EARNING                       
         DS    C                                                                
TX03ATP  DS    CL10    O INT       AMOUNT COLLECTED & WITHHELD FOR TP           
         DS    C                                                                
TX03APG  DS    CL10    O INT       AMOUNT COLLECTED & WITHHELD FOR PG           
         DS    C                                                                
TX03APP  DS    CL10    O INT       AMOUNT COLLECTED & WITHHELD FOR PP           
         DS    C                                                                
TX03OTYP DS    CL1     O CHAR      OTHER WITHHOLDING TYPE                       
         DS    C                                                                
TX03MOTN DS    CL10    O INT       MOTION PICTURE RELIEF FUND %                 
         DS    C                                                                
TX03PCHR DS    CL10    O INT       PERMANENT CHARITY %                          
         DS    C                                                                
TX03GSTN DS    CL10    O CHAR      GST NUMBER                                   
         DS    C                                                                
TX03COMT DS    CL180   O CHAR      COMMENT                                      
         DS    C                                                                
TX03FIL1 DS    CL1     O CHAR      FILTER 1                                     
         DS    C                                                                
TX03FIL2 DS    CL1     O CHAR      FILTER 2                                     
         DS    C                                                                
TX03FIL3 DS    CL1     O CHAR      FILTER 3                                     
         DS    C                                                                
TX03FIL4 DS    CL1     O CHAR      FILTER 4                                     
         DS    C                                                                
TX03PNME DS    CL36    O CHAR      PAYEE NAME                                   
         DS    C                                                                
TX03PAD1 DS    CL30    O CHAR      PAYEE ADDRESS 1                              
         DS    C                                                                
TX03PAD2 DS    CL30    O CHAR      PAYEE ADDRESS 2                              
         DS    C                                                                
TX03PAD3 DS    CL30    O CHAR      PAYEE ADDRESS 3                              
         DS    C                                                                
TX03PAD4 DS    CL30    O CHAR      PAYEE ADDRESS 4                              
         DS    C                                                                
TX03PEXD DS    CL8     O DATE      PAYEE EXPIRY DATE                            
*                                                                               
TX03X    DS    CL2                 RECORD END                                   
TX03LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - AGENT RECORD (05304)                               *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX04AGT  DS    CL4     R CHAR      AGENT CODE                                   
         DS    C                                                                
TX04NAME DS    CL36    R CHAR      AGENT NAME                                   
         DS    C                                                                
TX04SNME DS    CL16    O CHAR      AGENT SHORT NAME                             
         DS    C                                                                
TX04ADD1 DS    CL30    O CHAR      ADDRESS 1                                    
         DS    C                                                                
TX04ADDQ EQU   *-TX04ADD1          LENGTH OF EACH ADDRESS LINE                  
TX04ADD2 DS    CL30    O CHAR      ADDRESS 2                                    
         DS    C                                                                
TX04ADD3 DS    CL30    O CHAR      ADDRESS 3                                    
         DS    C                                                                
TX04ADD4 DS    CL30    O CHAR      ADDRESS 4                                    
         DS    C                                                                
TX04EMAL DS    CL180   O CHAR      EMAIL ADDRESS                                
         DS    C                                                                
TX04ATTN DS    CL36    O CHAR      ATTENTION NAME                               
         DS    C                                                                
TX04SSN  DS    CL9     O CHAR      SSN                                          
         DS    C                                                                
TX04TEL  DS    CL12    O CHAR      TELEPHONE                                    
         DS    C                                                                
TX04FAX  DS    CL12    O CHAR      FAX                                          
         DS    C                                                                
TX04ISAG DS    CL1     O CHAR      IGNORE SAG ON CHECKS (Y/N)                   
         DS    C                                                                
TX04OVER DS    CL1     O CHAR      ALLOWABLE OVERRIDE (Y/N)                     
         DS    C                                                                
TX04OTRC DS    CL4     O CHAR      OLD TALENT RESIDUAL CODE                     
                                                                                
TX04X    DS    CL2                 RECORD END                                   
TX04LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CLIENT RECORD (05305)                              *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX05AGY  DS    CL6     O CHAR      AGENCY CODE                                  
         DS    C                                                                
TX05CLI  DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
TX05NAME DS    CL36    R CHAR      CLIENT NAME                                  
         DS    C                                                                
TX05SNME DS    CL16    O CHAR      CLIENT SHORT NAME                            
         DS    C                                                                
TX05ADD1 DS    CL30    O CHAR      ADDRESS 1                                    
         DS    C                                                                
TX05ADDQ EQU   *-TX05ADD1          LENGTH OF EACH ADDRESS LINE                  
TX05ADD2 DS    CL30    O CHAR      ADDRESS 2                                    
         DS    C                                                                
TX05ADD3 DS    CL30    O CHAR      ADDRESS 3                                    
         DS    C                                                                
TX05ADD4 DS    CL30    O CHAR      ADDRESS 4                                    
         DS    C                                                                
TX05ATTN DS    CL36    O CHAR      ATTENTION NAME                               
         DS    C                                                                
TX05EMAL DS    CL180   O CHAR      EMAIL ADDRESS                                
         DS    C                                                                
TX05SIGN DS    CL180   O CHAR      SIGNATORY                                    
         DS    C                                                                
TX05CGRP DS    CL6     O CHAR      CLIENT GROUP                                 
         DS    C                                                                
TX05LOCK DS    CL1     O CHAR      AGENCY IS LOCKED (Y/N)                       
         DS    C                                                                
TX05CODC DS    CL1     O CHAR      COD CLIENT (Y/N)                             
         DS    C                                                                
TX05CLER DS    CL1     O CHAR      DO NOT CLEAR EST# ON ADVICE (Y/N)            
         DS    C                                                                
TX05HLDS DS    CL1     O CHAR      GENERATE HOLDING FEE (P,E OR B)              
         DS    C                                                                
TX05BTYP DS    CL3     O SINT      BILLING TYPE                                 
         DS    C                                                                
TX05NWRK DS    CL1     O CHAR      NETWORK REQUIRED FOR CLA USES (Y/N)          
         DS    C                                                                
TX05STDR DS    CL1     O CHAR      USE STANDARD RATE CARD (Y/N)                 
         DS    C                                                                
TX05PINT DS    CL1     O CHAR      ON PRODUCTION INTERFACE (Y/N)                
         DS    C                                                                
TX05NPIN DS    CL1     O CHAR      EXCLUDE FROM CLIENT INTERFACE (Y/N)          
         DS    C                                                                
TX05QRTR DS    CL1     O CHAR      EST PERIOD = QUARTERS (Y/N)                  
         DS    C                                                                
TX0575K  DS    CL1     O CHAR      NO CHARGE ABOVE $75000                       
         DS    C                                                                
TX05OEMP DS    CL3     O CHAR      OVERRIDE EMPLOYER                            
         DS    C                                                                
TX05FUTA DS    CL5     O INT       FUTA RATE                                    
         DS    C                                                                
TX05SUTA DS    CL5     O INT       SUTA RATE                                    
         DS    C                                                                
TX05FICA DS    CL5     O INT       FICA RATE                                    
         DS    C                                                                
TX05OFIC DS    CL5     O INT       OVER FICA RATE                               
         DS    C                                                                
TX05WCOR DS    CL5     O INT       WC CORP RATE                                 
         DS    C                                                                
TX05CORR DS    CL5     O INT       CORP RATE                                    
         DS    C                                                                
TX05HFR  DS    CL5     O INT       HANDLING FEE RATE                            
         DS    C                                                                
TX05CHFR DS    CL5     O INT       CANADIAN HANDLING FEE RATE                   
         DS    C                                                                
TX05GRUL DS    CL1     O CHAR      GRT HANDLING RULE                            
         DS    C                                                                
TX05PCLI DS    CL3     O CHAR      PRODUCTION CLIENT CODE                       
*                                                                               
TX05X    DS    CL2                 RECORD END                                   
TX05LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PRODUCT RECORD (05306)                             *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX06AGY  DS    CL6     O CHAR      AGENCY CODE                                  
         DS    C                                                                
TX06CLI  DS    CL6     O CHAR      CLIENT CODE                                  
         DS    C                                                                
TX06PRD  DS    CL6     R CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX06BRND DS    CL1     R CHAR      BRAND PRODUCT (Y/N)                          
         DS    C                                                                
TX06NAME DS    CL36    R CHAR      PRODUCT NAME                                 
         DS    C                                                                
TX06SNME DS    CL16    O CHAR      PRODUCT SHORT NAME                           
         DS    C                                                                
TX06CGRP DS    CL6     O CHAR      CLIENT GROUP                                 
         DS    C                                                                
TX06PGRP DS    CL6     O CHAR      PRODUCT GROUP                                
         DS    C                                                                
TX06OACR DS    CL5     O INT       OVERRIDE AGENCY COMMISSION RATE              
         DS    C                                                                
TX06PTYP DS    CL6     O CHAR      PRODUCT TYPE                                 
         DS    C                                                                
TX06ADD1 DS    CL30    O CHAR      ADDRESS 1                                    
         DS    C                                                                
TX06ADDQ EQU   *-TX06ADD1          LENGTH OF EACH ADDRESS LINE                  
TX06ADD2 DS    CL30    O CHAR      ADDRESS 2                                    
         DS    C                                                                
TX06ADD3 DS    CL30    O CHAR      ADDRESS 3                                    
         DS    C                                                                
TX06ADD4 DS    CL30    O CHAR      ADDRESS 4                                    
         DS    C                                                                
TX06ATTN DS    CL36    O CHAR      ATTENTION NAME                               
         DS    C                                                                
TX06EMAL DS    CL180   O CHAR      EMAIL ADDRESS                                
         DS    C                                                                
TX06PPRD DS    CL3     O CHAR      PRODUCTION PRODUCT CODE                      
*         DS    C                                                               
*TX06MCDE DS    CL10    O CHAR      MATERIAL CODE                               
*         DS    C                                                               
*TX06CSTC DS    CL10    O CHAR      COST CENTER                                 
*                                                                               
TX06X    DS    CL2                 RECORD END                                   
TX06LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CAST RECORD (05307)                                *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX07AGTC DS    CL4     O CHAR      AGENT CODE                                   
         DS    C                                                                
TX07SSN  DS    CL9     R CHAR      SOCIAL SECURITY NUMBER                       
         DS    C                                                                
TX07ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX07CAT  DS    CL3     R CHAR      CATEGORY                                     
         DS    C                                                                
TX07SEQ  DS    CL5     R INT       SEQUENCE                                     
         DS    C                                                                
TX07MUS  DS    CL1     R CHAR      MEMBER IS A MUSICIAN (Y/N)                   
         DS    C                                                                
TX07S40  DS    CL1     R CHAR      SPARE X'40' BIT ON (Y/N)                     
         DS    C                                                                
TX07EXT  DS    CL1     R CHAR      MEMBER IS AN EXTRA (Y/N)                     
         DS    C                                                                
TX07S10  DS    CL1     R CHAR      SPARE X'10' BIT ON (Y/N)                     
         DS    C                                                                
TX07CAM  DS    CL1     R CHAR      MEMBER IS OFF CAMERA (Y/N)                   
         DS    C                                                                
TX07S04  DS    CL1     R CHAR      SPARE X'04' BIT ON (Y/N)                     
         DS    C                                                                
TX07GRT  DS    CL1     R CHAR      MEMBER IS NOT A GUAR (Y/N)                   
         DS    C                                                                
TX07S01  DS    CL1     R CHAR      SPARE X'01' BIT ON (Y/N)                     
         DS    C                                                                
TX07SORT DS    CL8     R INT       SORT KEY                                     
         DS    C                                                                
TX07AGR  DS    CL5     O INT       AGENT COMMISSION RATE                        
         DS    C                                                                
TX07OCAM DS    CL3     R CHAR      ON/OFF CAMERA                                
         DS    C                                                                
TX07UNCO DS    CL3     R CHAR      UNION CODE                                   
         DS    C                                                                
TX07LOCL DS    CL3     R CHAR      LOCAL                                        
         DS    C                                                                
TX07CTYR DS    CL3     R CHAR      CONTRACT YEAR                                
         DS    C                                                                
TX07FSER DS    CL8     O DATE      FIRST SERVICES DATE                          
         DS    C                                                                
TX07LSER DS    CL8     O DATE      LAST SERVICES DATE                           
         DS    C                                                                
TX07EXP  DS    CL8     O DATE      EXPIRATION DATE                              
         DS    C                                                                
TX07SHDT DS    CL8     O DATE      SHOOT DATE                                   
         DS    C                                                                
TX07CNUM DS    CL1     O CHAR      CORPORATION NUMBER                           
         DS    C                                                                
TX07TUNT DS    CL3     R CHAR      TAX UNIT CODE                                
         DS    C                                                                
TX07OVRT DS    CL10    O INT       2ND OVERSCALE RATE FIELD                     
         DS    C                                                                
TX07NDUB DS    CL1     O CHAR      NUMBER OF DOUBLES                            
         DS    C                                                                
TX07ONLF DS    CL1     O CHAR      ON LIFT (Y/N)                                
         DS    C                                                                
TX07OOLF DS    CL1     O CHAR      ONLY ON LIFT (Y/N)                           
         DS    C                                                                
TX07CHKA DS    CL1     O CHAR      CHECKS SHOULD GO TO AGENT (Y/N)              
         DS    C                                                                
TX07DCBL DS    CL1     O CHAR      DON'T APPLY FIXED CYC GRT CBL (Y/N)          
         DS    C                                                                
TX07DPAX DS    CL1     O CHAR      DON'T APPLY FIXED CYC GRT PAX (Y/N)          
         DS    C                                                                
TX07DTRK DS    CL1     O CHAR      DON'T WANT FIXED CYC TRACKING (Y/N)          
         DS    C                                                                
TX07AOFP DS    CL1     O CHAR      AGENT OVERRIDE FROM PAY (Y/N)                
         DS    C                                                                
TX07PCAN DS    CL1     O CHAR      PAY CANADIAN RATES (Y/N)                     
         DS    C                                                                
TX07DCAN DS    CL1     O CHAR      DON'T PAY CANADIAN RATES (Y/N)               
         DS    C                                                                
TX07CELE DS    CL1     O CHAR      CELEBRITY (Y/N)                              
         DS    C                                                                
TX07NFOR DS    CL1     O CHAR      NO FOREIGN USE (Y/N)                         
         DS    C                                                                
TX07NIND DS    CL1     O CHAR      NO INDUSTRIAL USE (Y/N)                      
         DS    C                                                                
TX07NINT DS    CL1     O CHAR      NO INTERACTIVE USE (Y/N)                     
         DS    C                                                                
TX07PAYC DS    CL1     O CHAR      PAYEE CODE                                   
         DS    C                                                                
TX07EDTB DS    CL1     O CHAR      EXPIRATION DATE BASIS                        
         DS    C                                                                
TX07FCYC DS    CL8     O DATE      FIRST CYCLE DATE                             
         DS    C                                                                
TX07GRTC DS    CL4     O CHAR      GUARANTEE CODE                               
         DS    C                                                                
TX07LFRM DS    CL10    O INT       LIFTED FROM (INTERNAL CID)                   
         DS    C                                                                
TX07DSHF DS    CL1     O CHAR      DON'T SEND HOLDING FEE NOTICE (Y/N)          
         DS    C                                                                
TX07CSDH DS    CL8     O DATE      CYCLE START DATE OF LAST HF NOTICE           
         DS    C                                                                
TX07DFHF DS    CL8     O DATE      DATE FIRST HF NOTICE SENT                    
         DS    C                                                                
TX07D2HF DS    CL8     O DATE      DATE SECOND HF NOTICE SENT                   
         DS    C                                                                
TX07SCSD DS    CL8     O DATE      SEASONAL CYCLE START DATE                    
         DS    C                                                                
TX07RDES DS    CL180   O CHAR      ROLE DESCRIPTION                             
         DS    C                                                                
TX07TRKS DS    CL36    O CHAR      TRACKS A CAST MEMBER IS ON                   
         DS    C                                                                
TX07VERS DS    CL36    O CHAR      VERSIONS A CAST MEMBER IS ON                 
         DS    C                                                                
TX07RESN DS    CL1     O CHAR      RELESED STATUS - NEW                         
         DS    C                                                                
TX07REDN DS    CL8     O DATE      RELEASED DATE - NEW                          
         DS    C                                                                
TX07RESP DS    CL1     O CHAR      RELEASED STATUS - PREVIOUS                   
         DS    C                                                                
TX07REDP DS    CL8     O DATE      RELEASED DATE - PREVIOUS                     
         DS    C                                                                
TX07EFF  DS    CL8     O DATE      EFFECTIVE DATE                               
         DS    C                                                                
TX07COMT DS    CL180   O CHAR      COMMENT                                      
         DS    C                                                                
TX07CSTR DS    CL8     O DATE      CYCLE START DATE                             
         DS    C                                                                
TX07CEND DS    CL8     O DATE      CYCLE END DATE                               
         DS    C                                                                
TX07SAMT DS    CL10    O INT       SCALE AMOUNT                                 
         DS    C                                                                
TX07AAPP DS    CL10    O INT       AMOUNT TO BE APPLIED                         
         DS    C                                                                
TX07BAL  DS    CL10    O INT       BALANCE                                      
         DS    C                                                                
TX07LPAG DS    CL3     O SINT      LAST PAGE PRINTED                            
         DS    C                                                                
TX07TRKE DS    CL1     O CHAR      TRACKING ENABLED (Y/N)                       
         DS    C                                                                
TX07ISGR DS    CL1     O CHAR      IS A GUARANTEE (Y/N)                         
         DS    C                                                                
TX07SEAC DS    CL1     O CHAR      SEASONAL COMMERCIAL (Y/N)                    
         DS    C                                                                
TX07USEC DS    CL3     O CHAR      USE CODE                                     
         DS    C                                                                
TX07INVN DS    CL12    O CHAR      INVOICE NUMBER                               
         DS    C                                                                
TX07TYPU DS    CL3     O SINT      TYPE OF PAYMENT FOR USE                      
         DS    C                                                                
TX07AREA DS    CL3     O CHAR      DEAL AREA                                    
         DS    C                                                                
TX07USE  DS    CL3     O CHAR      DEAL USE USE                                 
         DS    C                                                                
TX07DEAL DS    CL10    O INT       DEAL AMOUNT                                  
         DS    C                                                                
TX07AGR2 DS    CL5     O INT       DEAL AGENT COMMISSION RATE                   
         DS    C                                                                
TX07TERM DS    CL3     O SINT      DEAL TERM TERM                               
         DS    C                                                                
TX07PUBD DS    CL8     O DATE      DEAL PUBLICATION DATE                        
         DS    C                                                                
TX07EXP2 DS    CL8     O DATE      DEAL EXPIRATION DATE                         
         DS    C                                                                
TX07CCOM DS    CL180   O CHAR      CHECK COMMENT                                
*                                                                               
TX07X    DS    CL2                 RECORD END                                   
TX07LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - OVERSCALE AMOUNT RECORD (05308) CAST SUBSET        *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX08AGTC DS    CL4     O CHAR      AGENT CODE                                   
         DS    C                                                                
TX08SSN  DS    CL9     R CHAR      SOCIAL SECURITY NUMBER                       
         DS    C                                                                
TX08ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX08CAT  DS    CL3     R CHAR      CATEGORY                                     
         DS    C                                                                
TX08SEQ  DS    CL5     R INT       SEQUENCE                                     
         DS    C                                                                
TX08USE  DS    CL3     O CHAR      USE CODE                                     
         DS    C                                                                
TX08AMT  DS    CL10    O INT       OVERSCALE AMOUNT                             
*                                                                               
TX08X    DS    CL2                 RECORD END                                   
TX08LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - OVERSCALE PERCENT RECORD (05309) CAST SUBSET       *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX09AGTC DS    CL4     O CHAR      AGENT CODE                                   
         DS    C                                                                
TX09SSN  DS    CL9     R CHAR      SOCIAL SECURITY NUMBER                       
         DS    C                                                                
TX09ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX09CAT  DS    CL3     R CHAR      CATEGORY                                     
         DS    C                                                                
TX09SEQ  DS    CL5     R INT       SEQUENCE                                     
         DS    C                                                                
TX09USE  DS    CL3     O CHAR      USE CODE                                     
         DS    C                                                                
TX09PCT  DS    CL10    O INT       OVERSCALE PERCENT                            
*                                                                               
TX09X    DS    CL2                 RECORD END                                   
TX09LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CAST ERRORD RECORD (05310) CAST SUBSET             *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX10AGTC DS    CL4     O CHAR      AGENT CODE                                   
         DS    C                                                                
TX10SSN  DS    CL9     R CHAR      SOCIAL SECURITY NUMBER                       
         DS    C                                                                
TX10ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX10CAT  DS    CL3     R CHAR      CATEGORY                                     
         DS    C                                                                
TX10SEQ  DS    CL5     R INT       SEQUENCE                                     
         DS    C                                                                
TX10ESUB DS    CL3     O SINT      ERROR CODE SUB ELEMENT DEFINITIONS           
         DS    C                                                                
TX10DTER DS    0CL15               DATE/TIME OF ERROR                           
TX10DERR DS    CL8     O DATE      DATE OF ERROR                                
         DS    C                                                                
TX10TERR DS    CL6     O TIME      TIME OF ERROR                                
         DS    C                                                                
TX10CSTR DS    CL8     O DATE      CYCLE START DATE                             
         DS    C                                                                
TX10CEND DS    CL8     O DATE      CYCLE END DATE                               
         DS    C                                                                
TX10INVN DS    CL12    O CHAR      INVOICE NUMBER                               
         DS    C                                                                
TX10USEE DS    CL3     O SINT      USE CODE EQUATE                              
*                                                                               
TX10X    DS    CL2                 RECORD END                                   
TX10LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - COMMERCIAL RECORD (05311)                          *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX11AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX11CLI  DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
TX11PRD  DS    CL6     O CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX11CID  DS    CL12    R CHAR      COMMERCIAL ID                                
         DS    C                                                                
TX11ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX11FCYC DS    CL8     R DATE      FIRST FIXED CYCLE                            
         DS    C                                                                
TX11FAIR DS    CL8     O DATE      FIRST AIR DATE                               
         DS    C                                                                
TX11EXPD DS    CL8     O DATE      EXPIRATION DATE                              
         DS    C                                                                
TX11VDAT DS    CL8     O DATE      CAST VERIFICATION DATE                       
         DS    C                                                                
TX11VID  DS    CL8     O CHAR      USER ID OF CAST VERIFIER                     
         DS    C                                                                
TX11VSID DS    CL8     O CHAR      CAST VERIFIER STAFF ID                       
         DS    C                                                                
TX11DUBD DS    CL8     O DATE      DUB DATE                                     
         DS    C                                                                
TX11UNCO DS    CL1     O CHAR      UNVERIFIED BY COMMERCIAL (Y/N)               
         DS    C                                                                
TX11UNMU DS    CL1     O CHAR      UNVERIFIED BY MUSICIAN (Y/N)                 
         DS    C                                                                
TX11UNNM DS    CL1     O CHAR      UNVERIFIED BY NON-MUSICIAN (Y/N)             
         DS    C                                                                
TX11VONE DS    CL1     O CHAR      COMMERCIAL WAS VERIFIED ONCE (Y/N)           
         DS    C                                                                
TX11SCYC DS    CL1     R CHAR      SPLIT CYCLES?                                
         DS    C                                                                
TX11STYP DS    CL1     O CHAR      SESSION TYPE                                 
         DS    C                                                                
TX11CGRP DS    CL6     O CHAR      CLIENT GROUP                                 
         DS    C                                                                
TX11MED  DS    CL1     R CHAR      MEDIA                                        
         DS    C                                                                
TX11LSEC DS    CL3     R INT       LENGTH IN SECONDS                            
         DS    C                                                                
TX11CTYP DS    CL1     O CHAR      COMMERCIAL TYPE                              
         DS    C                                                                
TX11ANON DS    CL1     O CHAR      ANNOUNCER IS ONLY NON-MUSICIAN (Y/N)         
         DS    C                                                                
TX11SCOL DS    CL1     O CHAR      SOME CAST MEMBERS ON THE LIFT (Y/N)          
         DS    C                                                                
TX11CCHG DS    CL1     O CHAR      COMM/CAST CHGED SINCE LAST HF (Y/N)          
         DS    C                                                                
TX11LPAY DS    CL8     O DATE      LAST DATE PAID                               
         DS    C                                                                
TX11FDT2 DS    CL8     O DATE      2ND SEASON FIRST AIR DATE                    
         DS    C                                                                
TX11TRKI DS    CL2     O CHAR      TRACK ID                                     
         DS    C                                                                
TX11TRKL DS    CL3     O INT       TRACK LENGTH                                 
         DS    C                                                                
TX11ARTE DS    CL1     O CHAR      AFM RATE                                     
         DS    C                                                                
TX11ATTC DS    CL2     O CHAR      ATTENTION CODE                               
         DS    C                                                                
TX11LOCK DS    CL1     O CHAR      LOCKED (Y/N)                                 
         DS    C                                                                
TX11NFEE DS    CL1     O CHAR      NO HODING FEE (Y/N)                          
         DS    C                                                                
TX11RELD DS    CL1     O CHAR      RELEASED (Y/N)                               
         DS    C                                                                
TX11CAND DS    CL1     O CHAR      CANADIAN DOLLARS (Y/N)                       
         DS    C                                                                
TX11CANR DS    CL1     O CHAR      CANADIAN RATES (Y/N)                         
         DS    C                                                                
TX11WDTE DS    CL1     O CHAR      WORK DATE ON CHECKS (Y/N)                    
         DS    C                                                                
TX11SOAP DS    CL1     O CHAR      SOAP RESIDUALS (Y/N)                         
         DS    C                                                                
TX11ETYP DS    CL6     O CHAR      EDIT TYPE                                    
         DS    C                                                                
TX11ADTE DS    CL8     O DATE      ACTIVE DATE                                  
         DS    C                                                                
TX11IDTE DS    CL8     O DATE      INACTIVE DATE                                
         DS    C                                                                
TX11BRND DS    CL6     O CHAR      BRAND PRODUCT                                
         DS    C                                                                
TX11COGR DS    CL6     O CHAR      COMMERCIAL GROUP                             
         DS    C                                                                
TX11ETYR DS    CL3     O SINT      EDIT TYPE YEAR                               
         DS    C                                                                
TX11AUSE DS    CL3     O SINT      ALLOWABLE USES                               
         DS    C                                                                
TX11FUSE DS    CL3     O SINT      REMAINING FREE USES                          
         DS    C                                                                
TX11LFID DS    CL12    O CHAR      LIFT ID                                      
         DS    C                                                                
TX11LFSC DS    CL3     O SINT      LIFT LENGTH IN SECONDS                       
         DS    C                                                                
TX11CSTY DS    CL1     R CHAR      COMMERCIAL STUDIO TYPE                       
         DS    C                                                                
TX11FDTE DS    CL8     R DATE      FILM SHOOT DATE                              
         DS    C                                                                
TX11FSTU DS    CL12    R CHAR      FILM SHOOT STUDIO                            
         DS    C                                                                
TX11FCTY DS    CL12    R CHAR      FILM CITY                                    
         DS    C                                                                
TX11COMT DS    CL180   O CHAR      COMMENT                                      
         DS    C                                                                
TX11CTIT DS    CL36    R CHAR      COMMERCIAL TITLE                             
         DS    C                                                                
TX11ATIT DS    CL36    O CHAR      AFM TITLE                                    
         DS    C                                                                
TX11PNME DS    CL36    O CHAR      PRODUCT NAME                                 
         DS    C                                                                
TX11ATYP DS    CL3     O SINT      ACTRA TYPE                                   
         DS    C                                                                
TX11FIL1 DS    CL1     O CHAR      FILTER 1                                     
         DS    C                                                                
TX11FIL2 DS    CL1     O CHAR      FILTER 2                                     
         DS    C                                                                
TX11FIL3 DS    CL1     O CHAR      FILTER 3                                     
         DS    C                                                                
TX11FIL4 DS    CL1     O CHAR      FILTER 4                                     
         DS    C                                                                
TX11OEFD DS    CL8     O DATE      OLD AGENCY EFFECTIVE DATE                    
         DS    C                                                                
TX11OAGY DS    CL6     O CHAR      TO/FROM OLD AGENCY                           
         DS    C                                                                
TX11OCID DS    CL12    O CHAR      TO/FROM COMMID                               
         DS    C                                                                
TX11OCOM DS    CL10    O INT       TO/FROM INTERNAL COMM ID NUMBER              
         DS    C                                                                
TX11COPT DS    CL1     O CHAR      COPIED TO (Y/N)                              
         DS    C                                                                
TX11COPF DS    CL1     O CHAR      COPIED FROM (Y/N)                            
         DS    C                                                                
TX11PHID DS    CL9     O CHAR      PHOTOGRAPHER TAXPAYER ID                     
         DS    C                                                                
TX11PHNM DS    CL36    O CHAR      PHOTOGRAPHER NAME                            
         DS    C                                                                
TX11SAGC DS    CL6     O CHAR      SERVICES FOR AGENCY CODE                     
         DS    C                                                                
TX11SAGN DS    CL36    O CHAR      SERVICES FOR AGENCY NAME                     
*                                                                               
TX11X    DS    CL2                 RECORD END                                   
TX11LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - AFM RECORD (05312) COMMERCIAL SUBSET               *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX12AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX12CLI  DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
TX12PRD  DS    CL6     O CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX12CID  DS    CL12    R CHAR      COMMERCIAL ID                                
         DS    C                                                                
TX12ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX12AFMN DS    CL1     R SINT      AFM NUMBER                                   
         DS    C                                                                
TX12AFMC DS    CL12    O CHAR      AFM CONTRACT                                 
         DS    C                                                                
TX12TRA  DS    CL1     O CHAR      TRA                                          
         DS    C                                                                
TX12LFT  DS    CL1     O CHAR      LFT                                          
         DS    C                                                                
TX12LENG DS    CL5     O INT       LEN                                          
         DS    C                                                                
TX12UNIT DS    CL8     O INT       UNITS                                        
         DS    C                                                                
TX12BASC DS    CL12    O CHAR      BASIC                                        
         DS    C                                                                
TX12TTIT DS    CL36    O CHAR      TRACK TITLE                                  
         DS    C                                                                
TX12MTYP DS    CL1     O CHAR      MUSIC TYPE                                   
*                                                                               
TX12X    DS    CL2                 RECORD END                                   
TX12LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - STAFF RECORD (05313)                               *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX13USER DS    CL8     R CHAR      USER ID NUMBER                               
         DS    C                                                                
TX13SID  DS    CL8     R CHAR      STAFF ID                                     
         DS    C                                                                
TX13FNME DS    CL12    R CHAR      FIRST NAME                                   
         DS    C                                                                
TX13LNME DS    CL12    R CHAR      LAST NAME                                    
         DS    C                                                                
TX13TYPE DS    CL1     R CHAR      TYPE                                         
         DS    C                                                                
TX13MANG DS    CL8     O CHAR      MANAGER                                      
         DS    C                                                                
TX13TEL  DS    CL12    O CHAR      TELEPHONE                                    
         DS    C                                                                
TX13CGRP DS    CL6     O CHAR      CLIENT GROUP ACCESS                          
         DS    C                                                                
TX13SNME DS    CL16    O CHAR      SHORT NAME                                   
         DS    C                                                                
TX13EMAL DS    CL180   R CHAR      EMAIL ADDRESS                                
         DS    C                                                                
TX13PSW  DS    CL8     R CHAR      PASSWORD                                     
*                                                                               
TX13X    DS    CL2                 RECORD END                                   
TX13LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - LIMITED AGENCY RECORD (05314) STAFF SUBSET         *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX14USER DS    CL8     R CHAR      USER ID NUMBER                               
         DS    C                                                                
TX14SID  DS    CL8     R CHAR      STAFF ID                                     
         DS    C                                                                
TX14LAGY DS    CL6     O CHAR      LIMITED AGENCY                               
*                                                                               
TX14X    DS    CL2                 RECORD END                                   
TX14LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - LIMITED CLIENT RECORD (05315) STAFF SUBSET         *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX15USER DS    CL8     R CHAR      USER ID NUMBER                               
         DS    C                                                                
TX15SID  DS    CL8     R CHAR      STAFF ID                                     
         DS    C                                                                
TX15LAGY DS    CL6     O CHAR      LIMITED AGENCY                               
         DS    C                                                                
TX15LCLI DS    CL6     O CHAR      LIMITED CLIENT                               
*                                                                               
TX15X    DS    CL2                 RECORD END                                   
TX15LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE RECORD (05316)                           *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX16SSN  DS    CL9     R CHAR      SOCIAL SECURITY NUMBER                       
         DS    C                                                                
TX16GRT  DS    CL4     R CHAR      GUARANTEE CODE                               
         DS    C                                                                
TX16AGY  DS    CL6     R CHAR      AGENCY                                       
         DS    C                                                                
TX16CLI  DS    CL6     O CHAR      CLIENT                                       
         DS    C                                                                
TX16SDAT DS    CL8     R DATE      PERIOD START DATE                            
         DS    C                                                                
TX16EDAT DS    CL8     R DATE      PERIOD END DATE                              
         DS    C                                                                
TX16ATTC DS    CL2     O CHAR      ATTENTION CODE                               
         DS    C                                                                
TX16CORC DS    CL1     O CHAR      CORP CODE                                    
         DS    C                                                                
TX16DBAL DS    CL1     O CHAR      DESCENDING BALANCE (Y/N)                     
         DS    C                                                                
TX16PPH  DS    CL1     O CHAR      PAY P&H (Y/N)                                
         DS    C                                                                
TX16POVR DS    CL1     O CHAR      PAY OVERAGE (Y/N)                            
         DS    C                                                                
TX16ADDP DS    CL1     O CHAR      ADDED TO PAY PROGRAM (Y/N)                   
         DS    C                                                                
TX16INSP DS    CL1     O CHAR      INSTALLMENT PAYMENT PAID (Y/N)               
         DS    C                                                                
TX16NOG  DS    CL1     O CHAR      DON'T APPLT GRT (Y/N)                        
         DS    C                                                                
TX16REFG DS    CL1     O CHAR      GRT BALANCE WAS REFRESHED (Y/N)              
         DS    C                                                                
TX16LOKG DS    CL1     O CHAR      GRT RECORD IS LOCKED (Y/N)                   
         DS    C                                                                
TX16TPAY DS    CL10    R INT       TOTAL GUARANTEE PAYMENT                      
         DS    C                                                                
TX16BAL  DS    CL10    R INT       BALANCE                                      
         DS    C                                                                
TX16IOVR DS    CL1     O CHAR      IGNORE OVERAGE ON ESTIMATING (Y/N)           
         DS    C                                                                
TX16LPAG DS    CL5     O INT       LAST PAGE NUMBER PRINTED                     
         DS    C                                                                
TX16PIAM DS    CL10    O INT       PAYMENT INSTALLMENT AMOUNT                   
         DS    C                                                                
TX16ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL NUMBER                   
         DS    C                                                                
TX16IGRT DS    CL12    O CHAR      INVOICE THAT ADDED GRT                       
         DS    C                                                                
TX16GPST DS    CL8     O DATE      GRT CYCLE PERIOD START DATE                  
         DS    C                                                                
TX16GPEN DS    CL8     O DATE      GRT CYCLE PERIOD END DATE                    
         DS    C                                                                
TX16GTOT DS    CL10    O INT       GRT CYCLE TOTAL GUARANTEE AMOUNT             
         DS    C                                                                
TX16GBAL DS    CL10    O INT       GRT CYCLE BALANCE                            
         DS    C                                                                
TX16COMT DS    CL180   O CHAR      COMMENT                                      
*                                                                               
TX16X    DS    CL2                 RECORD END                                   
TX16LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - EPISODE RECORD (05317) CAST SUBSET                 *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
         ORG   TLXREDET                                                         
TX17AGTC DS    CL4     O CHAR      AGENT CODE                                   
         DS    C                                                                
TX17SSN  DS    CL9     R CHAR      SOCIAL SECURITY NUMBER                       
         DS    C                                                                
TX17ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX17CAT  DS    CL3     R CHAR      CATEGORY                                     
         DS    C                                                                
TX17SEQ  DS    CL5     R INT       SEQUENCE                                     
         DS    C                                                                
TX17EPI  DS    CL5     O INT       EPISODE NUMBER                               
         DS    C                                                                
TX17HEAD DS    CL1     O CHAR      HEAD WRITER (Y/N)                            
         DS    C                                                                
TX17SCRT DS    CL1     O CHAR      SCRIPT WRITER (Y/N)                          
         DS    C                                                                
TX17BRAK DS    CL1     O CHAR      BREAKDOWN WRITER (Y/N)                       
         DS    C                                                                
TX17PHAP DS    CL5     O INT       P&H AMOUNT PAID                              
         DS    C                                                                
TX17PAYA DS    CL8     O INT       PAYMENT AMOUNT                               
         DS    C                                                                
TX17ACRD DS    CL8     O INT       APPLIED CREDITS                              
*                                                                               
TX17X    DS    CL2                 RECORD END                                   
TX17LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - COMMERCIAL VERSION RECORD (05318) COMMERICAL SUBSET*         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX18AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX18CLI  DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
TX18PRD  DS    CL6     O CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX18CID  DS    CL12    R CHAR      COMMERCIAL ID                                
         DS    C                                                                
TX18ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX18VER  DS    CL1     O CHAR      VERSION                                      
         DS    C                                                                
TX18VERI DS    CL12    O CHAR      VERSION ID                                   
         DS    C                                                                
TX18VERL DS    CL3     O SINT      VERSION LENGTH IN SECONDS                    
*                                                                               
TX18X    DS    CL2                 RECORD END                                   
TX18LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - MUSIC CODE RECORD (05319) COMMERICAL SUBSET        *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX19AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX19CLI  DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
TX19PRD  DS    CL6     O CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX19CID  DS    CL12    R CHAR      COMMERCIAL ID                                
         DS    C                                                                
TX19ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX19MUSN DS    CL1     R SINT      MUSIC CODE NUMBER                            
         DS    C                                                                
TX19MUSC DS    CL8     O CHAR      MUSIC CODE                                   
*                                                                               
TX19X    DS    CL2                 RECORD END                                   
TX19LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - COMMERCIAL PRODUCT RECORD (05320) COMMERICAL SUBSET*         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX20AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX20CLI  DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
TX20PRD  DS    CL6     O CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX20CID  DS    CL12    R CHAR      COMMERCIAL ID                                
         DS    C                                                                
TX20ICOM DS    CL8     R CHAR      INTERNAL COMMERCIAL CODE                     
         DS    C                                                                
TX20PRDC DS    CL6     O CHAR      PRODUCT CODE                                 
*                                                                               
TX20X    DS    CL2                 RECORD END                                   
TX20LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PID RECORD (05321) W-4 SUBSET                      *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX21SSN  DS    CL9     R CHAR      SSN, FEIN, CANADIAN SIN                      
         DS    C                                                                
TX21PID  DS    CL6     R CHAR      PID                                          
*                                                                               
TX21X    DS    CL2                 RECORD END                                   
TX21LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - HOLDING FEES DOCUMENT ID NUMBER (05322) CAST SUBSET*         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX22HFID DS    CL16    R CHAR      HOLDING FEE DOC ID (COMM+CYCLE ST)           
*                                                                               
TX22X    DS    CL2                 RECORD END                                   
TX22LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - TOTALS RECORD (05399)                              *         
***********************************************************************         
         SPACE 1                                                                
TLXRECD  DSECT                                                                  
         ORG   TLXREDET                                                         
TX99REC  DS    CL5     R CHAR      RECORD NUMBER (053XX)                        
         DS    C                                                                
TX99CNT  DS    XL4     R CHAR      REC COUNT                                    
*                                                                               
TX99X    DS    CL2                 RECORD END                                   
TX99LEN  EQU   *-TLXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* BUFFERIN ADDRESSES TO PASS FROM TLXTRACT TO TLXROUTS                *         
***********************************************************************         
         SPACE 1                                                                
TLXBADD  DSECT                                                                  
TLXABUF  DS    AL4                 HID BUFFER ADDRESS                           
TLXBUFFN DS    AL4                 BUFFERIN ADDRESS                             
TLXCFAC  DS    AL4                 COMFACS ADDRESS                              
TLXBLEN  EQU   *-TLXBADD           RECORD LENGTH                                
         EJECT                                                                  
