*          DATA SET TLXRECID   AT LEVEL 002 AS OF 08/30/10                      
***********************************************************************         
* TALENT SYSTEM EXTRACT RECORD TYPES                                  *         
***********************************************************************         
                                                                                
*NOTE THERE IS A 3 CHAR CODE ASSOCIATED WITH EACH OF THESE RECORDS              
*WHICH UNIQUELY DEFINES THE RECORD TYPE. IT IS USED WHEN RUNNING THE            
*EXTRACT FOR A SINGLE RECORD TYPE. IT ALSO GIVES THE NAME OF THE AX             
*BOOK WHICH RELATES TO THIS RECORD, AND THE RECORD`S ENTRY IN TLXCNVX           
*WHICH BUILDS THE VARIABLE LENGTH TABLE ENTRIES FOR SQL RECORDS                 
*THE 3 CHAR CODE IS THE 4.5.6 CHARS OF THE EQUATE NAME -E.G. FOR THE            
*ADJUSTED RATE RECORD, THE 3 CHAR CODE IS ADR.                                  
                                                                                
TLXAGYQ  DC    CL5'05300'          AGENCY RECORD                                
TLXNETQ  DC    CL5'05301'          NETWORK ID RECORD                            
TLXAGGQ  DC    CL5'05302'          AGENCY GROUP RECORD                          
TLXW4Q   DC    CL5'05303'          W-4 RECORD                                   
TLXAGTQ  DC    CL5'05304'          AGENT RECORD                                 
TLXCLIQ  DC    CL5'05305'          CLIENT RECORD                                
TLXPRDQ  DC    CL5'05306'          PRODUCT RECORD                               
TLXCSTQ  DC    CL5'05307'          CAST RECORD                                  
TLXOVAQ  DC    CL5'05308'          OVERSCALE AMOUNT (CAST RECORD)               
TLXOVPQ  DC    CL5'05309'          OVERSCALE PERCENT (CAST RECORD)              
TLXCERQ  DC    CL5'05310'          CAST ERROR (CAST RECORD)                     
TLXCOMQ  DC    CL5'05311'          COMMERCIAL RECORD                            
TLXAFMQ  DC    CL5'05312'          AFM RECORD (COMMERCIAL RECORD0               
TLXSTFQ  DC    CL5'05313'          STAFF RECORD                                 
TLXLAGQ  DC    CL5'05314'          LIMITED AGENCY RECORD                        
TLXLCLQ  DC    CL5'05315'          LIMITED CLIENT RECORD                        
TLXGRTQ  DC    CL5'05316'          GUARANTEE RECORD                             
TLXEPSQ  DC    CL5'05317'          EPISODE (CAST RECORD)                        
TLXCMVQ  DC    CL5'05318'          COMMERCIAL VERSION (COMMERCIAL REC)          
TLXMCDQ  DC    CL5'05319'          MUSIC CODE (COMMERCIAL REC)                  
TLXCMPQ  DC    CL5'05320'          COMMERCIAL PRODUCT (COMMERCIAL REC)          
TLXPIDQ  DC    CL5'05321'          PID RECORD (W-4)                             
TLXHFIQ  DC    CL5'05322'          HOLDING FEE DOC ID # (CAST SUBSET)           
*                                                                               
* FOR PWC TALENT EXTRACT                                                        
*                                                                               
TLPWCMLQ DC    CL5'05330'          COMMERCIAL (PERFORMER SESSION)               
TLPWRESQ DC    CL5'05331'          RESIDUALS                                    
TLPWSESQ DC    CL5'05332'          SESSION HOLDING                              
TLPWUSEQ DC    CL5'05333'          USE AUTH                                     
TLPWFNLQ DC    CL5'05334'          FINAL CAST                                   
TLPWPRFQ DC    CL5'05339'          PERFORMER REF                                
TLPWAGYQ DC    CL5'05340'          AGENCY REF                                   
TLPWPRDQ DC    CL5'05341'          PRODUCT REF                                  
TLPWNETQ DC    CL5'05342'          NETWORK REF                                  
TLPWUTYQ DC    CL5'05343'          USE TYPE REF                                 
TLPWMDCQ DC    CL5'05344'          MEDIA CATEGORY REF                           
TLPWCMTQ DC    CL5'05345'          COMMERICAL TYPE REF                          
TLPWADVQ DC    CL5'05346'          ADVERTISER REF                               
TLPWCTGQ DC    CL5'05347'          CATEGORY REF                                 
TLPWOVRQ DC    CL5'05348'          OVERSCALE REF                                
*                                                                               
* COLUMN DEFINITION RECORDS                                                     
*                                                                               
TLPWCMLH DC    CL5'05350'          COMMERCIAL COLUMN DEFS                       
TLPWRESH DC    CL5'05351'          RESIDUALS                                    
TLPWSESH DC    CL5'05352'          SESSION HOLDING                              
TLPWUSEH DC    CL5'05353'          USE AUTH                                     
TLPWFNLH DC    CL5'05354'          FINAL CAST                                   
TLPWPRFH DC    CL5'05359'          PERFORMER REF                                
TLPWAGYH DC    CL5'05360'          AGENCY REF                                   
TLPWPRDH DC    CL5'05361'          PRODUCT REF                                  
TLPWNETH DC    CL5'05362'          NETWORK REF                                  
TLPWUTYH DC    CL5'05363'          USE TYPE REF                                 
TLPWMDCH DC    CL5'05364'          MEDIA CATEGORY REF                           
TLPWCMTH DC    CL5'05365'          COMMERICAL TYPE REF                          
TLPWADVH DC    CL5'05366'          ADVERTISER REF                               
TLPWCTGH DC    CL5'05367'          CATEGORY REF                                 
TLPWOVRH DC    CL5'05368'          OVERSCALE REF                                
*                                                                               
TLXRUNQ  DC    CL5'05399'          RUN DATE RECORD                              
