*          DATA SET TOXRECD    AT LEVEL 115 AS OF 02/14/18                      
***********************************************************************         
*                                                                     *         
*          TALENT EXTRACT                                             *         
*          EXTRACT RECORD DSECTS BY RECORD TYPE                       *         
*          AVAILABLE RECORD TYPE RANGE - 05000 TO 05999               *         
*                                                                     *         
*DXHDRD    00000  HEADER RECORD (COMMON ACROSS SYSTEMS)               *         
*                                                                     *         
*          SPARE - 05000-05999                                        *         
*                                                                     *         
*DXTRLD    99999  TRAILER RECORD (COMMON ACROSS SYSTEMS)              *         
*                                                                     *         
*        NOTES ON TOXTRACT (SEE TOXCTLD)                              *         
*        -----------------                                            *         
*        TOXTRACT CONTAINS THE CODE L FOR ALL RECORDS WHEN A LOAD     *         
*        MODE EXTRACT IS PERFORMED. ALL RECORDS IN THE DATABASE WILL  *         
*        BE REPLACED BY THE EXTRACTED FILE.                           *         
*                                                                     *         
*        FOR AN UPDATE MODE EXTRACT, GXRECACT CONTAINS C (CHANGE),    *         
*        A (ADD) OR D (DELETE) FOR ALL RECORDS EXCEPT MONEY RECORDS.  *         
*        MONEY RECORDS CONTAIN M (MERGE). THE CONTENTS OF A MERGED    *         
*        RECORD ARE ADDED TO THE EXISTING RECORD OF THE SAME KEY, OR  *         
*        ADDED AS A NEW RECORD IF THE KEY DOES NOT ALREADY EXIST. IF  *         
*        THE RESULT OF ADDING THE CONTENTS TO AN EXISTING RECORD IS   *         
*        A RECORD WITH ALL ZERO VALUES, IT CAN THEN BE DELETED. FOR   *         
*        AN ADD, ONE POSITIVE MERGE RECORD IS CREATED. FOR A DELETE,  *         
*        AN IDENTICAL RECORD IS CREATED, BUT WITH ALL VALUES NEGATED. *         
*        FOR A CHANGE, TWO RECORDS ARE CREATED - A NEGATIVE DELETE OF *         
*        THE OLD VALUES AND A POSITIVE ADD OF THE NEW VALUES. THESE   *         
*        MAY BE COMBINED IF THE KEYS ARE THE SAME.                    *         
*                                                                     *         
***********************************************************************         
         EJECT                                                                  
       ++INCLUDE DXHDRD                                                         
         EJECT                                                                  
       ++INCLUDE DXTRLD                                                         
         EJECT                                                                  
       ++INCLUDE TOXCTLD                                                        
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - AGENCY RECORD (05000)                              *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX00AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX00NAME DS    CL36    R CHAR      AGENCY NAME                                  
         DS    C                                                                
TX0013WK DS    CL1     R CHAR      CALCULATE 13 WKS AS 3 MNTHS                  
         DS    C                                                                
TX00AGRP DS    CL6     O CHAR      AGENCY GROUP                                 
         DS    C                                                                
TX00OFC  DS    CL1     R CHAR      OFFICE CODE                                  
         DS    C                                                                
TX00LOCK DS    CL1     R CHAR      LOCKED?                                      
         DS    C                                                                
TX00ADR1 DS    CL30    R CHAR      ADDRESS LINE 1                               
         DS    C                                                                
TX00ADR2 DS    CL30    O CHAR      ADDRESS LINE 2                               
         DS    C                                                                
TX00ADR3 DS    CL30    O CHAR      ADDRESS LINE 3                               
         DS    C                                                                
TX00ADR4 DS    CL30    O CHAR      ADDRESS LINE 4                               
         DS    C                                                                
TX00PHON DS    CL12    R CHAR      PHONE NUMBER                                 
         DS    C                                                                
TX00ATTN DS    CL30    O CHAR      ATTENTION NAME                               
         DS    C                                                                
TX00EMAL DS    CL35    O CHAR      EMAIL ADDRESS                                
         DS    C                                                                
TX00GHFN DS    CL1     R CHAR      GENERATE HOLDING FEE NOTICES?                
         DS    C                                                                
TX00G2HF DS    CL1     R CHAR      GENERATE 2ND HOLDING FEE NOTICES?            
         DS    C                                                                
TX00HFMW DS    CL1     O CHAR      MONTHLY OR WEEKLY HOLDING FEE?               
         DS    C                                                                
TX00HFNA DS    CL3     O INT       HOLDING FEE NOTICE ADVANCE                   
         DS    C                                                                
TX00SAC  DS    CL1     R CHAR      SHOW AGENCY COMMISSION?                      
         DS    C                                                                
TX00PEHF DS    CL2     O CHAR      PAPER/ELECTRONIC HOLDING FEE?                
         DS    C                                                                
TX00PREM DS    CL1     R CHAR      PREMIUM SERVICE?                             
         DS    C                                                                
TX00SA   DS    CL6     O CHAR      SIGNATORY AGENCY                             
         DS    C                                                                
TX00STUD DS    CL10    O CHAR      STUDIO CODE                                  
         DS    C                                                                
TX00BTYP DS    CL2     R CHAR      BILLING TYPE                                 
         DS    C                                                                
TX00FUTA DS    CL5     R CHAR      FUTA RATE                                    
         DS    C                                                                
TX00SUTA DS    CL5     R CHAR      SUTA RATE                                    
         DS    C                                                                
TX00FICA DS    CL5     R CHAR      FICA RATE                                    
         DS    C                                                                
TX00OFIC DS    CL5     R CHAR      OVER FICA RATE                               
         DS    C                                                                
TX00WCCR DS    CL5     R CHAR      WC CORP RATE                                 
         DS    C                                                                
TX00HANC DS    CL5     R CHAR      CORP HANDLING RATE                           
         DS    C                                                                
TX00HANI DS    CL5     R CHAR      INDIVIDUAL HANDLING RATE                     
         DS    C                                                                
TX00HNCN DS    CL5     R CHAR      CANADIAN HANDLING RATE                       
         DS    C                                                                
TX00AGRT DS    CL1     O CHAR      APPLIED GUARANTEE RULE                       
         DS    C                                                                
TX00SRUL DS    CL1     O CHAR      SIGNATORY RULE                               
         DS    C                                                                
TX00SRAT DS    CL6     O CHAR      SIGNATORY FEE RATE                           
         DS    C                                                                
TX00SCAP DS    CL10    O CHAR      SIGNATORY FEE CAP                            
         DS    C                                                                
TX00EMPR DS    CL3     O CHAR      OVERRIDE EMPLOYER                            
         DS    C                                                                
TX00STFC DS    CL8     O CHAR      STAFF CODE                                   
         DS    C                                                                
TX00T10I DS    CL1     R CHAR      ON T10 INTERFACE?                            
         DS    C                                                                
TX00POWO DS    CL1     R CHAR      PO REQUIRED WITHOUT VALIDATION?              
         DS    C                                                                
TX00POWV DS    CL1     R CHAR      PO REQUIRED WITH VALIDATION?                 
         DS    C                                                                
TX00CLPO DS    CL1     R CHAR      CLOSE PRINT PURCHASE ORDERS?                 
         DS    C                                                                
TX00ESJR DS    CL1     R CHAR      ESTIMATE/JOB REQUIRED?                       
         DS    C                                                                
TX00BSUT DS    CL5     O CHAR      BUSINESS UNIT                                
         DS    C                                                                
TX00VALJ DS    CL1     R CHAR      VALIDATE ESTIMATE/JOB?                       
         DS    C                                                                
TX00EJVF DS    CL3     O CHAR      ESTIMATE/JOB VALIDATION FORMAT               
         DS    C                                                                
TX00BILC DS    CL3     R CHAR      BILLING COPIES                               
         DS    C                                                                
TX00DJOB DS    CL15    O CHAR      DEFAULT JOB NUMBER                           
         DS    C                                                                
TX00VEJ  DS    CL1     R CHAR      VALIDATE ESTIMATE/JOB FOR BBDO               
         DS    C                                                                
TX00GUHA DS    CL4     O INT       GUARANTEE HANDLING                           
         DS    C                                                                
TX00GULM DS    CL6     O INT       GUARANTEE LIMIT                              
         DS    C                                                                
TX00ASNM DS    CL16    O CHAR      AGENCY SHORT NAME                            
         DS    C                                                                
TX00ATPS DS    CL1     R CHAR      AGENCY HAS TP SIGNATORY?                     
*                                                                               
TX00X    DS    CL2                 RECORD END                                   
TX00LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CLIENT RECORD (05001)                              *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX01AGY  DS    CL6     O CHAR      AGENCY CODE                                  
         DS    C                                                                
TX01CLI  DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
TX01NAME DS    CL36    R CHAR      CLIENT NAME                                  
         DS    C                                                                
TX01CGRP DS    CL6     O CHAR      CLIENT GROUP                                 
         DS    C                                                                
TX01LOCK DS    CL1     R CHAR      LOCKED?                                      
         DS    C                                                                
TX01ADR1 DS    CL30    R CHAR      ADDRESS LINE 1                               
         DS    C                                                                
TX01ADR2 DS    CL30    O CHAR      ADDRESS LINE 2                               
         DS    C                                                                
TX01ADR3 DS    CL30    O CHAR      ADDRESS LINE 3                               
         DS    C                                                                
TX01ADR4 DS    CL30    O CHAR      ADDRESS LINE 4                               
         DS    C                                                                
TX01ATTN DS    CL36    O CHAR      ATTENTION NAME                               
         DS    C                                                                
TX01EMAL DS    CL35    O CHAR      EMAIL ADDRESS                                
         DS    C                                                                
TX01PEHF DS    CL2     O CHAR      PAPER/ELECTRONIC HOLDING FEE?                
         DS    C                                                                
TX01SA   DS    CL6     O CHAR      SIGNATORY AGENCY                             
         DS    C                                                                
TX01BTYP DS    CL2     O CHAR      BILLING TYPE                                 
         DS    C                                                                
TX01FUTA DS    CL5     O CHAR      FUTA RATE                                    
         DS    C                                                                
TX01SUTA DS    CL5     O CHAR      SUTA RATE                                    
         DS    C                                                                
TX01FICA DS    CL5     O CHAR      FICA RATE                                    
         DS    C                                                                
TX01OFIC DS    CL5     O CHAR      OVER FICA RATE                               
         DS    C                                                                
TX01WCCR DS    CL5     O CHAR      WC CORP RATE                                 
         DS    C                                                                
TX01HANC DS    CL5     O CHAR      CORP HANDLING RATE                           
         DS    C                                                                
TX01HANI DS    CL5     O CHAR      INDIVIDUAL HANDLING RATE                     
         DS    C                                                                
TX01HNCN DS    CL5     O CHAR      CANADIAN HANDLING RATE                       
         DS    C                                                                
TX01AGRT DS    CL1     O CHAR      APPLIED GUARANTEE RULE                       
         DS    C                                                                
TX01EMPR DS    CL3     O CHAR      OVERRIDE EMPLOYER                            
*                                                                               
TX01X    DS    CL2                 RECORD END                                   
TX01LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PRODUCT RECORD (05002)                             *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX02AGY  DS    CL6     O CHAR      AGENCY CODE                                  
         DS    C                                                                
TX02CLI  DS    CL6     O CHAR      CLIENT CODE                                  
         DS    C                                                                
TX02PRD  DS    CL6     R CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX02NAME DS    CL36    R CHAR      PRODUCT NAME                                 
         DS    C                                                                
TX02LOCK DS    CL1     R CHAR      LOCKED?                                      
         DS    C                                                                
TX02SN   DS    CL16    O CHAR      SHORT NAME                                   
         DS    C                                                                
TX02BRND DS    CL1     R CHAR      BRAND?                                       
         DS    C                                                                
TX02ADR1 DS    CL30    R CHAR      ADDRESS LINE 1                               
         DS    C                                                                
TX02ADR2 DS    CL30    O CHAR      ADDRESS LINE 2                               
         DS    C                                                                
TX02ADR3 DS    CL30    O CHAR      ADDRESS LINE 3                               
         DS    C                                                                
TX02ADR4 DS    CL30    O CHAR      ADDRESS LINE 4                               
         DS    C                                                                
TX02ATTN DS    CL36    O CHAR      ATTENTION NAME                               
         DS    C                                                                
TX02EMAL DS    CL35    O CHAR      EMAIL ADDRESS                                
         DS    C                                                                
TX02MC   DS    CL10    O CHAR      MATERIAL CODE                                
         DS    C                                                                
TX02PGPK DS    CL18    O CHAR      PRODUCT GROUP PRIMARY KEY                    
         DS    C                                                                
TX02CC   DS    CL10    O CHAR      COST CENTER                                  
         DS    C                                                                
TX02PTPK DS    CL12    O CHAR      PRODUCT TYPE PRIMARY KEY                     
         DS    C                                                                
TX02ACR  DS    CL6     O INT       AGENCY COMISSION RATE                        
         DS    C                                                                
TX02CSF  DS    CL1     R CHAR      CSF?                                         
         DS    C                                                                
TX02NCSF DS    CL1     R CHAR      NO CSF?                                      
*                                                                               
TX02X    DS    CL2                 RECORD END                                   
TX02LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - ASSET RECORD (05003)                               *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX03ASS  DS    CL8     R CHAR      PRIMARY KEY                                  
         DS    C                                                                
TX03AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX03CLI  DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
TX03PRD  DS    CL6     O CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX03FFCD DS    CL8     O DATE      FIRST FIXED CYCLE DATE                       
         DS    C                                                                
TX03EXPD DS    CL8     O DATE      EXPIRATION DATE                              
         DS    C                                                                
TX03MED  DS    CL1     R CHAR      MEDIA                                        
         DS    C                                                                
TX03REL  DS    CL1     R CHAR      RELEASED?                                    
         DS    C                                                                
TX03AUSE DS    CL3     O INT       ALLOWABLE USES                               
         DS    C                                                                
TX03RUSE DS    CL3     O INT       REMAINING USES                               
         DS    C                                                                
TX03SFAD DS    CL8     O DATE      SECOND SEASON FIRST AIR DATE                 
         DS    C                                                                
TX03GHF  DS    CL1     R CHAR      GENERATE HOLDING FEES?                       
         DS    C                                                                
TX03LOCK DS    CL1     R CHAR      LOCKED?                                      
         DS    C                                                                
TX03CRAT DS    CL1     R CHAR      CANADIAN RATES?                              
         DS    C                                                                
TX03ACT  DS    CL3     O INT       ACTRA TYPE                                   
         DS    C                                                                
TX03SDAT DS    CL8     O DATE      SHOOT DATE                                   
         DS    C                                                                
TX03SSTU DS    CL12    O CHAR      SHOOT STUDIO                                 
         DS    C                                                                
TX03SCIT DS    CL12    O CHAR      SHOOT CITY                                   
         DS    C                                                                
TX03PRDN DS    CL16    O CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX03VDTE DS    CL8     O DATE      VERIFICATION DATE                            
         DS    C                                                                
TX03VTIM DS    CL8     O CHAR      VERIFICATION TIME                            
         DS    C                                                                
TX03ADST DS    CL2     O CHAR      ADDENDUM STATE                               
         DS    C                                                                
TX03LFID DS    CL12    O CHAR      LIFT ID                                      
         DS    C                                                                
TX03LFLN DS    CL3     O INT       LIFT LEN                                     
         DS    C                                                                
TX03AEXP DS    CL8     O CHAR      ACTRA EXPIRATION DATE                        
         DS    C                                                                
TX03CPPK DS    CL6     O CHAR      COMMERCIAL POOL PRIMARY KEY                  
         DS    C                                                                
TX03SPCY DS    C       O CHAR      SPLIT CYCLES?                                
         DS    C                                                                
TX03BLTO DS    CL8     O CHAR      BILL-TO PRIMARY KEY                          
         DS    C                                                                
TX03CNTY DS    CL1     O CHAR      CONTRACT TYPE                                
         DS    C                                                                
TX03PPID DS    CL6     O CHAR      PHOTOGRAPHER PID                             
         DS    C                                                                
TX03PNAM DS    CL16    O CHAR      PHOTOGRAPHER NAME                            
         DS    C                                                                
TX03SFAG DS    CL6     O CHAR      SERVICES FOR AGENCY                          
         DS    C                                                                
TX03SFNM DS    CL16    O CHAR      SERVICES FOR AGENCY NAME                     
         DS    C                                                                
TX03FILT DS    CL6     O CHAR      FILTERS                                      
         DS    C                                                                
TX03WDOC DS    CL1     R CHAR      WORK DATE ON CHECKS?                         
         DS    C                                                                
TX03SRES DS    CL1     R CHAR      SOAP RESIDUALS?                              
*                                                                               
TX03X    DS    CL2                 RECORD END                                   
TX03LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - VERSION RECORD (05004)                             *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX04ASS  DS    CL8     R CHAR      PRIMARY KEY                                  
         DS    C                                                                
TX04VERN DS    CL3     R SINT      VERSION NUMBER                               
         DS    C                                                                
TX04VERI DS    CL12    R CHAR      VERSION ID                                   
         DS    C                                                                
TX04TIT  DS    CL36    R CHAR      TITLE                                        
         DS    C                                                                
TX04TYPE DS    CL1     O CHAR      TYPE                                         
         DS    C                                                                
TX04FAD  DS    CL8     O DATE      FIRST AIR DATE                               
         DS    C                                                                
TX04LN   DS    CL3     O SINT      LENGTH                                       
         DS    C                                                                
TX04FD   DS    CL8     O DATE      FILM DATE                                    
         DS    C                                                                
TX04FSTU DS    CL12    O CHAR      FILM STUDIO                                  
         DS    C                                                                
TX04FC   DS    CL12    O CHAR      FILM CITY                                    
         DS    C                                                                
TX04FSTA DS    CL2     O CHAR      FILM STATE                                   
         DS    C                                                                
TX04RD   DS    CL8     O DATE      RECORD DATE                                  
         DS    C                                                                
TX04RSTU DS    CL12    O CHAR      RECORD STUDIO                                
         DS    C                                                                
TX04RC   DS    CL12    O CHAR      RECORD CITY                                  
         DS    C                                                                
TX04RSTA DS    CL2     O CHAR      RECORD STATE                                 
         DS    C                                                                
TX04MD   DS    CL8     O DATE      MUSIC DATE                                   
         DS    C                                                                
TX04MSTU DS    CL12    O CHAR      MUSIC STUDIO                                 
         DS    C                                                                
TX04MC   DS    CL12    O CHAR      MUSIC CITY                                   
         DS    C                                                                
TX04MSTA DS    CL2     O CHAR      MUSIC STATE                                  
         DS    C                                                                
TX04CMNT DS    CL60    O CHAR      COMMENT                                      
         DS    C                                                                
TX04TITL DS    CL36    O CHAR      TITLE FOR AFM                                
         DS    C                                                                
TX04DUBD DS    CL8     O DATE      DUB DATE                                     
         DS    C                                                                
TX04EDYR DS    CL4     O CHAR      EDIT YEAR                                    
         DS    C                                                                
TX04EDT  DS    CL6     O CHAR      EDIT TYPE                                    
         DS    C                                                                
TX04ACT  DS    CL8     O DATE      ACTIVE DATE                                  
         DS    C                                                                
TX04INAC DS    CL8     O DATE      INACTIVE DATE                                
*                                                                               
TX04X    DS    CL2                 RECORD END                                   
TX04LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - ALIAS RECORD (05005)                               *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX05AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX05CLI  DS    CL3     R CHAR      SPOT/NET CLIENT                              
         DS    C                                                                
TX05PRD  DS    CL3     R CHAR      SPOT/NET PRODUCT                             
         DS    C                                                                
TX05MED  DS    CL1     R CHAR      MEDIA                                        
         DS    C                                                                
TX05ADID DS    CL12    R CHAR      TRAFFIC COMMERCIAL ID                        
         DS    C                                                                
TX05ASS  DS    CL8     O CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX05VERN DS    CL3     O SINT      VERSION NUMBER                               
*                                                                               
TX05X    DS    CL2                 RECORD END                                   
TX05LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - W-4 RECORD (05006)                                 *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX06PID  DS    CL6     R CHAR      SSN, FEIN, CANADIAN SIN                      
         DS    C                                                                
TX06TYPE DS    CL1     R CHAR      TYPE                                         
         DS    C                                                                
TX06FNAM DS    CL16    O CHAR      FIRST NAME                                   
         DS    C                                                                
TX06LNAM DS    CL16    O CHAR      LAST NAME                                    
         DS    C                                                                
TX06CNME DS    CL32    O CHAR      CORPORATION NAME                             
         DS    C                                                                
TX06AKAF DS    CL16    O CHAR      AKA FIRST NAME                               
         DS    C                                                                
TX06AKAL DS    CL16    O CHAR      AKA LAST NAME                                
         DS    C                                                                
TX06PHON DS    CL12    O CHAR      PHONE NUMBER                                 
         DS    C                                                                
TX06MN   DS    CL16    O CHAR      MIDDLE NAME                                  
         DS    C                                                                
TX06AL1  DS    CL30    R CHAR      ADDRESS LINE 1                               
         DS    C                                                                
TX06AL2  DS    CL30    O CHAR      ADDRESS LINE 2                               
         DS    C                                                                
TX06AL3  DS    CL30    O CHAR      ADDRESS LINE 3                               
         DS    C                                                                
TX06CITY DS    CL25    O CHAR      CITY                                         
         DS    C                                                                
TX06STAT DS    CL2     O CHAR      STATE                                        
         DS    C                                                                
TX06ZIP  DS    CL10    O CHAR      ZIP CODE                                     
         DS    C                                                                
TX06SUFF DS    CL4     O CHAR      SUFFIX                                       
         DS    C                                                                
TX06SEX  DS    CL1     O CHAR      SEX CODE                                     
         DS    C                                                                
TX06ETH  DS    CL2     O CHAR      ETHNICITY                                    
         DS    C                                                                
TX06FILT DS    CL4     O CHAR      FILTERS                                      
         DS    C                                                                
TX06ID   DS    CL8     O CHAR      INDEMNIFICATION DATE                         
         DS    C                                                                
TX06AFM  DS    CL3     O CHAR      AFM LOCAL                                    
         DS    C                                                                
TX06AMN  DS    CL9     O CHAR      ACTRA MEMBERSHIP NUMBER                      
         DS    C                                                                
TX06YTD  DS    CL1     R CHAR      YTD ON CHECKS?                               
         DS    C                                                                
TX06SCF  DS    CL1     R CHAR      SORT CHECKS FIRST?                           
         DS    C                                                                
TX06ILFW DS    CL1     R CHAR      IRS LOCK ON FEDERAL WITHHOLDINGS?            
         DS    C                                                                
TX06LCK  DS    CL1     R CHAR      LOCKED?                                      
         DS    C                                                                
TX06FW   DS    CL1     R CHAR      FICA WITHHOLDINGS?                           
         DS    C                                                                
TX06DCW  DS    CL1     R CHAR      DUE COMPANY WITHHOLDINGS?                    
         DS    C                                                                
TX06PEN  DS    CL1     R CHAR      PENSION?                                     
         DS    C                                                                
TX06DD   DS    CL1     R CHAR      DIRECT DEPOSIT?                              
         DS    C                                                                
TX06WTC  DS    CL1     R CHAR      WIRE TRANSFER CHECKS?                        
         DS    C                                                                
TX06SLF  DS    CL1     R CHAR      SPECIAL LETTER ON FILE?                      
         DS    C                                                                
TX06FTMS DS    CL1     O CHAR      FEDERAL TAX MARITAL STATUS                   
         DS    C                                                                
TX06FTE  DS    CL3     O CHAR      FEDERAL TAX EXEMPTIONS                       
         DS    C                                                                
TX06FTFP DS    CL5     O CHAR      FEDERAL TAX FIXED PERCENTAGE                 
         DS    C                                                                
TX06STA  DS    CL3     O CHAR      STATE TAX AREA                               
         DS    C                                                                
TX06STMS DS    CL1     O CHAR      STATE TAX MARITAL STATUS                     
         DS    C                                                                
TX06STE  DS    CL3     O CHAR      STATE TAX EXEMPTIONS                         
         DS    C                                                                
TX06STFP DS    CL5     O CHAR      STATE TAX FIXED PERCENTAGE                   
         DS    C                                                                
TX06CTA  DS    CL3     O CHAR      CITY TAX AREA                                
         DS    C                                                                
TX06CTMS DS    CL1     O CHAR      CITY TAX MARITAL STATUS                      
         DS    C                                                                
TX06CTE  DS    CL3     O CHAR      CITY TAX EXEMPTIONS                          
         DS    C                                                                
TX06CTFP DS    CL5     O CHAR      CITY TAX FIXED PERCENTAGE                    
         DS    C                                                                
TX06EARN DS    CL11    O CHAR      EARNINGS                                     
         DS    C                                                                
TX06RS   DS    CL2     O CHAR      RECIPROCAL STATE                             
         DS    C                                                                
TX06DOB  DS    CL8     O DATE      DATE OF BIRTH                                
         DS    C                                                                
TX06DP   DS    CL5     O INT       DEDUCTION %                                  
         DS    C                                                                
TX06TP   DS    CL6     O CHAR      TRUSTEE PID                                  
         DS    C                                                                
TX06MFP  DS    CL5     O INT       MPR FUND %                                   
         DS    C                                                                
TX06PCP  DS    CL5     O INT       PERMANENT CHARITY %                          
         DS    C                                                                
TX06GST  DS    CL10    O CHAR      GST NUMBER                                   
         DS    C                                                                
TX06CMNT DS    CL70    O CHAR      COMMENT                                      
         DS    C                                                                
TX06PN   DS    CL36    O CHAR      PAYEE NAME                                   
         DS    C                                                                
TX06PAL1 DS    CL30    O CHAR      PAYEE ADDRESS LINE 1                         
         DS    C                                                                
TX06PAL2 DS    CL30    O CHAR      PAYEE ADDRESS LINE 2                         
         DS    C                                                                
TX06PAL3 DS    CL30    O CHAR      PAYEE ADDRESS LINE 3                         
         DS    C                                                                
TX06PED  DS    CL8     O CHAR      PAYEE EXPIRATION DATE                        
         DS    C                                                                
TX06CNTR DS    CL2     O CHAR      COUNTRY                                      
         DS    C                                                                
TX06EA   DS    CL35    O CHAR      EMAIL ADDRESS                                
         DS    C                                                                
TX06TF   DS    CL1     R CHAR      TAX FOREIGNER?                               
         DS    C                                                                
TX06PCTY DS    CL25    O CHAR      PAYEE CITY                                   
         DS    C                                                                
TX06PS   DS    CL2     O CHAR      PAYEE STATE                                  
         DS    C                                                                
TX06PZ   DS    CL10    O CHAR      PAYEE ZIP CODE                               
         DS    C                                                                
TX06PC   DS    CL2     O CHAR      PAYEE COUNTRY                                
         DS    C                                                                
TX06PAD  DS    CL8     O DATE      PAYEE ACTIVE DATE                            
         DS    C                                                                
TX06ENHA DS    CL1     R CHAR      ELIGIBLE FOR NEW HIRE ACT                    
         DS    C                                                                
TX06NHAE DS    CL1     R CHAR      NEW HIRE ACT ELIGIBILITY PENDING?            
         DS    C                                                                
TX06NHAD DS    CL8     O DATE      NEW HIRE ACT DATE                            
         DS    C                                                                
TX06EFT  DS    CL1     R CHAR      EFT?                                         
*                                                                               
TX06X    DS    CL2                 RECORD END                                   
TX06LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PERFORMER RECORD (05007)                           *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX07PER  DS    CL12    R CHAR      PRIMARY KEY (TLCACOM+TLCASEQ)                
         DS    C                                                                
TX07ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX07PID  DS    CL6     R CHAR      PID                                          
         DS    C                                                                
TX07FFCD DS    CL8     O DATE      FIRST FIXED CYCLE DATE                       
         DS    C                                                                
TX07EXPD DS    CL8     O DATE      EXPIRATION DATE                              
         DS    C                                                                
TX07LSD  DS    CL8     O DATE      LAST SERVICES DATE                           
         DS    C                                                                
TX07CAT  DS    CL3     O CHAR      CATEGORY                                     
         DS    C                                                                
TX07CAM  DS    CL3     O CHAR      CAMERA                                       
         DS    C                                                                
TX07UNIT DS    CL3     O CHAR      TAX UNIT                                     
         DS    C                                                                
TX07FSD  DS    CL8     O DATE      FIRST SERVICES DATE                          
         DS    C                                                                
TX07UN   DS    CL3     O CHAR      UNION                                        
         DS    C                                                                
TX07LCL  DS    CL3     O CHAR      LOCAL                                        
         DS    C                                                                
TX07CKEY DS    CL7     O CHAR      W4 ASSOCIATED CORPORATION KEY                
         DS    C                                                                
TX07SDAT DS    CL8     O DATE      SHOOT DATE                                   
         DS    C                                                                
TX07EXPB DS    CL1     O CHAR      EXPIRATION BASIS                             
         DS    C                                                                
TX07GUAR DS    CL10    O CHAR      GUARANTEE PRIMARY KEY                        
         DS    C                                                                
TX07AGNT DS    CL4     O CHAR      AGENT                                        
         DS    C                                                                
TX07CMNT DS    CL57    O CHAR      COMMENT                                      
         DS    C                                                                
TX07AFP  DS    CL5     O INT       AGENCY FEE PERCENTAGE                        
         DS    C                                                                
TX07CNYR DS    CL3     O CHAR      CONTRACT YEAR                                
         DS    C                                                                
TX07DOUB DS    CL1     O INT       DOUBLES                                      
         DS    C                                                                
TX07EQPF DS    CL1     O INT       EQUITY PERFORMER                             
         DS    C                                                                
TX07PYEE DS    CL1     O CHAR      PAYEE                                        
         DS    C                                                                
TX07EURO DS    CL1     R CHAR      PAY PERFORMER IN EUROS                       
         DS    C                                                                
TX07CTAN DS    CL1     R CHAR      CHECKS TO AGENT?                             
         DS    C                                                                
TX07PRAT DS    CL10    O INT       PERFORMANCE RATE                             
         DS    C                                                                
TX07CCMT DS    CL60    O CHAR      CHECK COMMENT                                
         DS    C                                                                
TX07APCB DS    CL1     R CHAR      APPLY CBL WHEN BSS/HLD OVRSCALE AMT?         
         DS    C                                                                
TX07APPX DS    CL1     R CHAR      APPLY PAX WHEN BSS/HLD OVRSCALE AMT?         
         DS    C                                                                
TX07APRE DS    CL1     R CHAR      APPLY REUSE TO SESS FEE/HFEE FTRACK?         
         DS    C                                                                
TX07NCNR DS    CL1     R CHAR      PROHIBIT FROM BEING PAID CAN RATES?          
         DS    C                                                                
TX07FTRK DS    CL1     R CHAR      DAILY FTRACK REPORT PRINTED?                 
         DS    C                                                                
TX07FGRU DS    CL1     R CHAR      PERMORMER RECEIVES FOREIGN USE?              
         DS    C                                                                
TX07INTR DS    CL1     R CHAR      PERMORMER RECEIVES INTERACTIVE USE?          
         DS    C                                                                
TX07INDR DS    CL1     R CHAR      PERMORMER RECEIVES INDUSTRIAL USE?           
*                                                                               
TX07X    DS    CL2                 RECORD END                                   
TX07LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - FIXED CYCLE (05008)                                *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX08PER  DS    CL12    R CHAR      PRIMARY KEY (TLCACOM+TLCASEQ)                
         ORG   TX08PER                                                          
TX08ASS  DS    CL8     O CHAR      ASSET PRIMARY KEY                            
         DS    CL4                                                              
         DS    C                                                                
TX08INV  DS    CL6     O CHAR      CREATED BY INVOICE NUMBER                    
         DS    C                                                                
TX08CSD  DS    CL8     O DATE      CYCLE START DATE                             
         DS    C                                                                
TX08CED  DS    CL8     O DATE      CYCLE END DATE                               
         DS    C                                                                
TX08USE  DS    CL3     O CHAR      USE                                          
         DS    C                                                                
TX08SSEQ DS    CL3     O INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX08STYP DS    CL3     R INT       USE SUB TYPE                                 
         DS    C                                                                
TX08SCAL DS    CL11    O INT       SCALE AMOUNT                                 
         DS    C                                                                
TX08APPL DS    CL11    O INT       AMOUNT TO BE APPLIED                         
         DS    C                                                                
TX08BALN DS    CL11    O INT       BALANCE                                      
*                                                                               
TX08X    DS    CL2                 RECORD END                                   
TX08LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - VERSION-PERFORMER (05009)                          *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX09ASS  DS    CL8     O CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX09VERN DS    CL3     R CHAR      VERSION NUMBER                               
         DS    C                                                                
TX09PER  DS    CL12    R CHAR      PRIMARY KEY (TLCACOM+TLCASEQ)                
*                                                                               
TX09X    DS    CL2                 RECORD END                                   
TX09LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - INVOICE RECORD (05010)                             *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX10PINV DS    CL18    O CHAR      INVOICE PRIMARY KEY                          
         DS    C                                                                
TX10AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX10INV  DS    CL6     R CHAR      INVOICE NUMBER                               
         DS    C                                                                
TX10ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX10VERN DS    CL3     O SINT      VERSION NUMBER                               
         DS    C                                                                
TX10VERI DS    CL12    O CHAR      VERSION ID                                   
         DS    C                                                                
TX10PAYD DS    CL8     O DATE      PAY DATE                                     
         DS    C                                                                
TX10BILD DS    CL8     O DATE      BILL DATE                                    
         DS    C                                                                
TX10USE  DS    CL3     O CHAR      USE                                          
         DS    C                                                                
TX10CSD  DS    CL8     O DATE      CYCLE START DATE                             
         DS    C                                                                
TX10CED  DS    CL8     O DATE      CYCLE END DATE                               
         DS    C                                                                
TX10CURR DS    CL1     O CHAR      CURRENCY                                     
         DS    C                                                                
TX10GA   DS    CL11    O INT       GROSS AMOUNT                                 
         DS    C                                                                
TX10AC   DS    CL11    O INT       APPLIED CREDITS                              
         DS    C                                                                
TX10GC   DS    CL11    O INT       GUARANTEE CREDITS                            
         DS    C                                                                
TX10IP   DS    CL11    O INT       INDIVIDUAL PAYMENT                           
         DS    C                                                                
TX10CP   DS    CL11    O INT       CORP PAYMENT                                 
         DS    C                                                                
TX10RE   DS    CL11    O INT       REIMBURSED EXPENSES                          
         DS    C                                                                
TX10SPNH DS    CL11    O INT       SUBJECT TO PENSION AND HEALTH                
         DS    C                                                                
TX10CNVR DS    CL11    O INT       CONVERSION RATE                              
         DS    C                                                                
TX10ACOM DS    CL11    O INT       AGENCY COMMISSION                            
         DS    C                                                                
TX10SF   DS    CL11    O INT       SIGNATORY FEE                                
         DS    C                                                                
TX10PNH  DS    CL11    O INT       PENSION AND HEALTH                           
         DS    C                                                                
TX10HNW  DS    CL11    O INT       HEALTH AND WELFARE                           
         DS    C                                                                
TX10INR  DS    CL11    O INT       INSURANCE AND RETIREMENT                     
         DS    C                                                                
TX10PT   DS    CL11    O INT       PAYROLL TAXES                                
         DS    C                                                                
TX10HAND DS    CL11    O INT       HANDLING                                     
         DS    C                                                                
TX10CH   DS    CL11    O INT       CORP HANDLING                                
         DS    C                                                                
TX10MD   DS    CL11    O INT       MISCELLANEOUS DEDUCTIONS                     
         DS    C                                                                
TX10DUES DS    CL11    O INT       DUES                                         
         DS    C                                                                
TX10FC   DS    CL11    O INT       FICA CREDIT                                  
         DS    C                                                                
TX10GST  DS    CL11    O INT       GST                                          
         DS    C                                                                
TX10PST  DS    CL11    O INT       PST                                          
         DS    C                                                                
TX10CSF  DS    CL11    O INT       CSF                                          
         DS    C                                                                
TX10IT   DS    CL11    O INT       INVOICE TOTAL                                
         DS    C                                                                
TX10STYP DS    CL3     R INT       USE SUB TYPE                                 
         DS    C                                                                
TX10CLI  DS    CL6     R CHAR      CLIENT                                       
         DS    C                                                                
TX10PDC  DS    CL6     R CHAR      PRODUCT CODE                                 
         DS    C                                                                
TX10AUID DS    CL6     O CHAR      ASSIGNMENT USER ID                           
         DS    C                                                                
TX10ASC  DS    CL8     O CHAR      ASSIGNMENT STAFF CODE                        
         DS    C                                                                
TX10AD   DS    CL8     O DATE      ASSIGNMENT DATE                              
         DS    C                                                                
TX10AT   DS    CL8     O CHAR      ASSIGNMENT TIME                              
         DS    C                                                                
TX10PUID DS    CL6     O CHAR      PAYMENT USER ID                              
         DS    C                                                                
TX10PSC  DS    CL8     O CHAR      PAYMENT STAFF CODE                           
         DS    C                                                                
TX10PAD  DS    CL8     O DATE      PAYMENT ASSIGNMENT DATE                      
         DS    C                                                                
TX10PAT  DS    CL8     O CHAR      PAYMENT ASSIGNMENT TIME                      
         DS    C                                                                
TX10HLUD DS    CL32    O CHAR      HISTORY LIST USE DETAILS                     
         DS    C                                                                
TX10CAN  DS    CL1     R CHAR      CANCELLED?                                   
         DS    C                                                                
TX10CBIN DS    CL18    O CHAR      CANCELLED BY INVOICE NUMBER                  
         DS    C                                                                
TX10CANO DS    CL1     R CHAR      CANCELLOR?                                   
         DS    C                                                                
TX10CBUI DS    CL6     O CHAR      CANCELLED BY USER ID                         
         DS    C                                                                
TX10CBSC DS    CL8     O CHAR      CANCELLED BY STAFF CODE                      
         DS    C                                                                
TX10LHCD DS    CL8     O DATE      LAST HISTORY/CHANGE DATE                     
         DS    C                                                                
TX10LHCU DS    CL6     O CHAR      LAST HISTORY/CHANGE USER ID                  
         DS    C                                                                
TX10LHCS DS    CL8     O CHAR      LAST HISTORY/CHANGE STAFF CODE               
         DS    C                                                                
TX10AUTH DS    CL16    O CHAR      AUTH/PO NUMBER                               
         DS    C                                                                
TX10OASC DS    CL6     O CHAR      OVERRIDE AGENCY FOR STUDIO CODE              
         DS    C                                                                
TX10LICD DS    CL8     O DATE      LAST ISPLIT/CHANGE DATE                      
         DS    C                                                                
TX10LICU DS    CL6     O CHAR      LAST ISPLIT/CHANGE USER ID                   
         DS    C                                                                
TX10LICS DS    CL8     O CHAR      LAST ISPLIT/CHANGE STAFF CODE                
         DS    C                                                                
TX10DD   DS    CL8     O DATE      DUE DATE                                     
         DS    C                                                                
TX10URG  DS    CL1     R CHAR      URGENT?                                      
         DS    C                                                                
TX10APID DS    CL6     O CHAR      APPROVAL USER ID                             
         DS    C                                                                
TX10APSC DS    CL8     O CHAR      APPROVAL STAFF CODE                          
         DS    C                                                                
TX10APDT DS    CL8     O DATE      APPROVAL DATE                                
         DS    C                                                                
TX10APTM DS    CL8     O TIME      APPROVAL TIME                                
         DS    C                                                                
TX10BHPP DS    CL1     R CHAR      BEING HELD UNTIL PUR PAY REC?                
         DS    C                                                                
TX10PRUI DS    CL6     O CHAR      PUR RELEASE USER ID                          
         DS    C                                                                
TX10PRSC DS    CL8     O CHAR      PUR RELEASE STAFF CODE                       
         DS    C                                                                
TX10PRDT DS    CL8     O DATE      PUR RELEASE DATE                             
         DS    C                                                                
TX10PRTM DS    CL8     O TIME      PUR RELEASE TIME                             
         DS    C                                                                
TX10MAJS DS    CL9     O CHAR      MAJORS                                       
         DS    C                                                                
TX10UNIT DS    CL11    O CHAR      UNITS                                        
         DS    C                                                                
TX10INTF DS    CL1     R CHAR      INTERFACE?                                   
         DS    C                                                                
TX10SUN  DS    CL11    O INT       STARTING USE NUMBER                          
         DS    C                                                                
TX10NUSE DS    CL11    O INT       NUMBER OF USES                               
         DS    C                                                                
TX10RET  DS    CL1     O CHAR      RETROACTIVE PAYMENT                          
         DS    C                                                                
TX10IMAJ DS    CL9     O CHAR      INITIAL MAJORS                               
         DS    C                                                                
TX10IUNT DS    CL11    O INT       INITIAL UNITS                                
         DS    C                                                                
TX10TAGS DS    CL2     O INT       TAGS                                         
         DS    C                                                                
TX10DUM  DS    CL1     O CHAR      DUMMY INVOICE                                
         DS    C                                                                
TX10HCMT DS    CL40    O CHAR      HISTORY COMMENT                              
         DS    C                                                                
TX10ICMT DS    CL60    O CHAR      INVOICE COMMENT                              
         DS    C                                                                
TX10LFT  DS    CL1     R CHAR      PAYMENT TO LIFT?                             
         DS    C                                                                
TX10CRED DS    CL1     R CHAR      CREDIT INVOICE?                              
         DS    C                                                                
TX10LID  DS    CL12    O CHAR      LIFT ID                                      
         DS    C                                                                
TX10LLN  DS    CL3     R INT       LIFT LENGTH                                  
         DS    C                                                                
TX10CKDT DS    CL8     O DATE      CHECK DATE                                   
         DS    C                                                                
TX10INVC DS    CL6     R CHAR      INVOICE NUMBER BEING CREDITED                
         DS    C                                                                
TX10MEDC DS    CL1     O CHAR      MEDIA CODE                                   
         DS    C                                                                
TX10CMTY DS    CL1     O CHAR      COMMERCIAL/ASSET TYPE                        
         DS    C                                                                
TX10CMTT DS    CL36    O CHAR      COMMERCIAL/ASSET TITLE                       
         DS    C                                                                
TX10CMLN DS    CL3     O INT       COMMERCIAL/ASSET LENGTH (SECONDS)            
         DS    C                                                                
TX10PRNM DS    CL16    O CHAR      PRODUCT NAME                                 
         DS    C                                                                
TX10CTID DS    CL1     O CHAR      CONTRACT TYPE ID                             
         DS    C                                                                
TX10ADST DS    CL2     O CHAR      ADDENDUM STATE                               
         DS    C                                                                
TX10FFIX DS    CL8     O DATE      FIRST FIXED CYCLE DATE                       
         DS    C                                                                
TX10FAIR DS    CL8     O DATE      FIRST AIR DATE                               
         DS    C                                                                
TX10WCAN DS    CL1     R CHAR      WITHHOLD CANADIAN TAXES?                     
         DS    C                                                                
TX10EMCD DS    CL3     O CHAR      EMPLOYER CODE                                
         DS    C                                                                
TX10FMDT DS    CL8     O DATE      FILM DATE                                    
         DS    C                                                                
TX10FMST DS    CL12    O CHAR      FILM STUDIO                                  
         DS    C                                                                
TX10FMCT DS    CL12    O CHAR      FILM CITY                                    
         DS    C                                                                
TX10RCDT DS    CL8     O DATE      RECORD DATE                                  
         DS    C                                                                
TX10RCST DS    CL12    O CHAR      RECORD STUDIO                                
         DS    C                                                                
TX10RCCT DS    CL12    O CHAR      RECORD CITY                                  
         DS    C                                                                
TX10MSDT DS    CL8     O DATE      MUSIC DATE                                   
         DS    C                                                                
TX10MSST DS    CL12    O CHAR      MUSIC STUDIO                                 
         DS    C                                                                
TX10MSCT DS    CL12    O CHAR      MUSIC CITY                                   
         DS    C                                                                
TX10DBDT DS    CL8     O DATE      DUB DATE                                     
         DS    C                                                                
TX10AFM1 DS    CL12    O CHAR      AFM CONTRACT IDS 1                           
         DS    C                                                                
TX10AFM2 DS    CL12    O CHAR      AFM CONTRACT IDS 2                           
         DS    C                                                                
TX10TRKI DS    CL1     O CHAR      TRACK ID                                     
         DS    C                                                                
TX10TRKL DS    CL3     O CHAR      TRACK LENGTH                                 
         DS    C                                                                
TX10ACSG DS    CL6     O CHAR      AGENCY/CLIENT'S SIGNATORY                    
         DS    C                                                                
TX10RTIN DS    CL6     O CHAR      RETRO INVOICE NUMBER                         
         DS    C                                                                
TX10SLUN DS    CL3     O CHAR      STARTING LIFT USE NUMBER                     
         DS    C                                                                
TX10ELUS DS    CL3     O CHAR      ENDING LIFT USE NUMBER                       
         DS    C                                                                
TX10ISEQ DS    CL3     R CHAR      INVOICE SEQUENCE NUMBER                      
*                                                                               
TX10X    DS    CL2                 RECORD END                                   
TX10LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - TRACK (05011)                                      *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX11ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX11TRK  DS    CL1     R CHAR      TRACK                                        
         DS    C                                                                
TX11TIT  DS    CL36    O CHAR      TITLE                                        
         DS    C                                                                
TX11LN   DS    CL3     O SINT      LENGTH                                       
*                                                                               
TX11X    DS    CL2                 RECORD END                                   
TX11LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - TRACK-PERFROMER (05012)                            *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX12ASS  DS    CL8     O CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX12TRK  DS    CL1     R CHAR      TRACK                                        
         DS    C                                                                
TX12PER  DS    CL12    R CHAR      PRIMARY KEY (TLCACOM+TLCASEQ)                
*                                                                               
TX12X    DS    CL2                 RECORD END                                   
TX12LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - TRACK-VERSION (05013)                              *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX13TASS DS    CL8     R CHAR      TRACK ASSET PRIMARY KEY                      
         DS    C                                                                
TX13TRK  DS    CL1     R CHAR      TRACK                                        
         DS    C                                                                
TX13VASS DS    CL8     O CHAR      VERSION ASSET PRIMARY KEY                    
         DS    C                                                                
TX13VERN DS    CL3     R SINT      VERSION NUMBER                               
*                                                                               
TX13X    DS    CL2                 RECORD END                                   
TX13LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - TRACK PERFROMER-ASSET PERFORMER (05014)            *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX14TPER DS    CL12    R CHAR      TRACK PRIMARY KEY (TATRCOM+TATRCSQ)          
         DS    C                                                                
TX14PER  DS    CL12    R CHAR      PRIMARY KEY (TLCACOM+TLCASEQ)                
         ORG   TX14PER                                                          
TX14ASS  DS    CL8     O CHAR      ASSET PRIMARY KEY                            
         DS    CL4                                                              
*                                                                               
TX14X    DS    CL2                 RECORD END                                   
TX14LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PRIMARY INVOICE-SUBSIDIARY INVOICE (05015)         *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX15PINV DS    CL18    R CHAR      PRIMARY INVOICE PRIMARY KEY                  
         DS    C                                                                
TX15SINV DS    CL18    R CHAR      SUBSIDIARY INVOICE PRIMARY KEY               
         DS    C                                                                
TX15ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX15X    DS    CL2                 RECORD END                                   
TX15LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - MEDIA RECORD (05016)                               *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX16MED  DS    CL1     R CHAR      MEDIA CODE                                   
         DS    C                                                                
TX16DESC DS    CL5     R CHAR      DESCRIPTION                                  
*                                                                               
TX16X    DS    CL2                 RECORD END                                   
TX16LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - ASSET TYPES RECORD (05017)                         *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX17ASST DS    CL1     R CHAR      ASSET TYPE CODE                              
         DS    C                                                                
TX17DESC DS    CL7     R CHAR      DESCRIPTION                                  
*                                                                               
TX17X    DS    CL2                 RECORD END                                   
TX17LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - W4 TYPE RECORD (05018)                             *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX18W4T  DS    CL1     R CHAR      W4 TYPE                                      
         DS    C                                                                
TX18DESC DS    CL11    R CHAR      DESCRIPTION                                  
*                                                                               
TX18X    DS    CL2                 RECORD END                                   
TX18LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PERFORMER TYPE RECORD (05019)                      *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX19PERC DS    CL3     R CHAR      PERFORMER CATEGORY CODE                      
         DS    C                                                                
TX19DESC DS    CL32    R CHAR      DESCRIPTION                                  
         DS    C                                                                
TX19EHON DS    CL1     R CHAR      ELIGIBLE FOR HOLDING FEES ON CAM?            
         DS    C                                                                
TX19EHOF DS    CL1     R CHAR      ELIGIBLE FOR HOLDING FEES OFF CAM?           
         DS    C                                                                
TX19UWRK DS    CL1     R CHAR      FOR UNION WORK?                              
         DS    C                                                                
TX19AFM  DS    CL1     R CHAR      FOR AFM?                                     
         DS    C                                                                
TX19SING DS    CL1     R CHAR      SINGER?                                      
         DS    C                                                                
TX19EXTR DS    CL1     R CHAR      EXTRA?                                       
         DS    C                                                                
TX194AFT DS    CL1     R CHAR      FOR AFT                                      
         DS    C                                                                
TX194SAG DS    CL1     R CHAR      FOR SAG                                      
         DS    C                                                                
TX194NON DS    CL1     R CHAR      FOR NON                                      
         DS    C                                                                
TX194ACT DS    CL1     R CHAR      FOR ACT                                      
         DS    C                                                                
TX194DGA DS    CL1     R CHAR      FOR DGA                                      
         DS    C                                                                
TX194WGA DS    CL1     R CHAR      FOR WGA                                      
         DS    C                                                                
TX194UDA DS    CL1     R CHAR      FOR UDA                                      
         DS    C                                                                
TX194ONC DS    CL1     R CHAR      FOR ON CAMERA                                
         DS    C                                                                
TX194OFC DS    CL1     R CHAR      FOR OFF CAMERA                               
*                                                                               
TX19X    DS    CL2                 RECORD END                                   
TX19LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - USE TYPE RECORD (05020)                            *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX20USET DS    CL3     R CHAR      USE TYPE CODE                                
         DS    C                                                                
TX20DESC DS    CL36    R CHAR      DESCRIPTION                                  
         DS    C                                                                
TX20SERE DS    CL1     R CHAR      SESSION OR REUSE?                            
*                                                                               
TX20X    DS    CL2                 RECORD END                                   
TX20LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CLIENT GROUP RECORD (05021)                        *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX21CODE DS    CL6     R CHAR      CLIENT GROUP CODE                            
         DS    C                                                                
TX21NAME DS    CL36    R CHAR      CLIENT GROUP NAME                            
*                                                                               
TX21X    DS    CL2                 RECORD END                                   
TX21LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - USE SUBTYPE RECORD (05022)                         *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX22USET DS    CL3     R CHAR      USE TYPE CODE                                
         DS    C                                                                
TX22STYP DS    CL3     R INT       USE SUBTYPE                                  
         DS    C                                                                
TX22DESC DS    CL36    R CHAR      DESCRIPTION                                  
         DS    C                                                                
TX22CLMO DS    CL3     O CHAR      CYCLE LENGTH MONTHS                          
         DS    C                                                                
TX22CLWK DS    CL3     O CHAR      CYCLE LENGTH WEEKS                           
         DS    C                                                                
TX22CLDY DS    CL3     O CHAR      CYCLE LENGTH DAYS                            
*                                                                               
TX22X    DS    CL2                 RECORD END                                   
TX22LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - ACTRA TYPE CODE (05023)                            *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX23CODE DS    CL3     R INT       ACTRA TYPE CODE                              
         DS    C                                                                
TX23DESC DS    CL12    R CHAR      DESCRIPTION                                  
*                                                                               
TX23X    DS    CL2                 RECORD END                                   
TX23LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - AGENCY GROUP RECORD (05024)                        *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX24AGRP DS    CL6     R CHAR      AGENCY GROUP                                 
         DS    C                                                                
TX24NAME DS    CL36    R CHAR      NAME                                         
*                                                                               
TX24X    DS    CL2                 RECORD END                                   
TX24LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - W4 ASSOCIATED CORPORATION (05025)                  *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX25W4AC DS    CL7     R CHAR      PRIMARY KEY (PID + CORP #)                   
         DS    C                                                                
TX25PID  DS    CL6     R CHAR      W4 PID                                       
         DS    C                                                                
TX25CPID DS    CL6     R CHAR      CORPORATION PID                              
*                                                                               
TX25X    DS    CL2                 RECORD END                                   
TX25LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PRINT COMMERCIAL PRODUCT (05026)                             
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX26ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX26CODE DS    CL6     R CHAR      PRODUCT CODE                                 
*                                                                               
TX26X    DS    CL2                 RECORD END                                   
TX26LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - DEAL (05027)                                                 
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX27PER  DS    CL12    R CHAR      PERFORMER PRIMARY KEY                        
         DS    C                                                                
TX27SEQ  DS    CL3     R INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX27AREA DS    CL3     O CHAR      AREA                                         
         DS    C                                                                
TX27USE  DS    CL3     R CHAR      PRINT USE                                    
         DS    C                                                                
TX27MON  DS    CL3     R CHAR      MONTHS                                       
         DS    C                                                                
TX27AMT  DS    CL11    O INT       AMOUNT                                       
         DS    C                                                                
TX27PDTE DS    CL8     O DATE      PUBLICATION DATE                             
         DS    C                                                                
TX27EDTE DS    CL8     O DATE      EXPIRATION DATE                              
         DS    C                                                                
TX27ACP  DS    CL5     O INT       AGENCY COMMISSION PERCENTAGE                 
         DS    C                                                                
TX27ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX27X    DS    CL2                 RECORD END                                   
TX27LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - AREA (05028)                                                 
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX28CODE DS    CL3     R CHAR      AREA CODE                                    
         DS    C                                                                
TX28NAME DS    CL36    R CHAR      NAME                                         
*                                                                               
TX28X    DS    CL2                 RECORD END                                   
TX28LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PRINT USE (05029)                                            
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX29USE  DS    CL3     R CHAR      PRINT USE CODE                               
         DS    C                                                                
TX29NAME DS    CL28    R CHAR      NAME                                         
*                                                                               
TX29X    DS    CL2                 RECORD END                                   
TX29LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE (05030)                                            
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX30GUAR DS    CL10    R CHAR      GUARANTEE PRIMARY KEY                        
         DS    C                                                                
TX30PID  DS    CL6     R CHAR      W4 PID                                       
         DS    C                                                                
TX30CODE DS    CL4     R CHAR      GUARANTEE CODE                               
         DS    C                                                                
TX30TYPE DS    CL1     R CHAR      TYPE                                         
         DS    C                                                                
TX30W4C  DS    CL7     O CHAR      W4-ASSOCIATED CORP PRIMARY KEY               
         DS    C                                                                
TX30GCON DS    CL12    O CHAR      GUARANTEE CONTRACT PRIMARY KEY               
         DS    C                                                                
TX30OP   DS    CL1     R CHAR      OVERAGE PAID?                                
         DS    C                                                                
TX30IFE  DS    CL1     R CHAR      IGNORE FOR ESTIMATING?                       
         DS    C                                                                
TX30PPNH DS    CL1     R CHAR      PAY P&H ON USE?                              
         DS    C                                                                
TX30LOCK DS    CL1     R CHAR      LOCKED?                                      
         DS    C                                                                
TX30MSC  DS    CL1     R CHAR      MULTI-SERVICE CONTRACT?                      
         DS    C                                                                
TX30DBAL DS    CL1     R CHAR      DESCENDING BALANCE                           
         DS    C                                                                
TX30PCAP DS    CL8     R CHAR      PER CYCLE ASSET PRIMARY KEY                  
         DS    C                                                                
TX30CIPK DS    CL18    O CHAR      CREATED BY INVOICE PRIMARY KEY               
*                                                                               
TX30X    DS    CL2                 RECORD END                                   
TX30LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE AGENCY-CLIENT (05031)                              
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX31GUAR DS    CL10    R CHAR      GUARANTEE PRIMARY KEY                        
         DS    C                                                                
TX31AGY  DS    CL6     R CHAR      AGENCY                                       
         DS    C                                                                
TX31CLI  DS    CL6     O CHAR      CLIENT                                       
         DS    C                                                                
TX31PAC  DS    CL1     R CHAR      PRIMARY AGENCY/CLIENT                        
*                                                                               
TX31X    DS    CL2                 RECORD END                                   
TX31LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE PERIOD-CYCLE (05032)                               
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX32GUAR DS    CL10    R CHAR      GUARANTEE PRIMARY KEY                        
         DS    C                                                                
TX32SEQ  DS    CL3     R INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX32SDTE DS    CL8     R DATE      START DATE                                   
         DS    C                                                                
TX32EDTE DS    CL8     R DATE      END DATE                                     
         DS    C                                                                
TX32AMT  DS    CL11    R INT       AMOUNT                                       
         DS    C                                                                
TX32BAL  DS    CL11    R INT       BALANCE                                      
*                                                                               
TX32X    DS    CL2                 RECORD END                                   
TX32LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE CONTRACT (05033)                                   
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX33GUAR DS    CL12    R CHAR      GUARANTEE PRIMARY KEY                        
         DS    C                                                                
TX33PID  DS    CL6     R CHAR      W4 PID                                       
         DS    C                                                                
TX33GCON DS    CL6     R CHAR      GUARANTEE CONTRACT CODE                      
*                                                                               
TX33X    DS    CL2                 RECORD END                                   
TX33LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE CONTRACT YEAR (05034)                              
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX34GCON DS    CL12    R CHAR      GUARANTEE CONTRACT PRIMARY KEY               
         DS    C                                                                
TX34SEQ  DS    CL3     R INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX34SDTE DS    CL8     R DATE      START DATE                                   
         DS    C                                                                
TX34EDTE DS    CL8     R DATE      END DATE                                     
         DS    C                                                                
TX34PNH  DS    CL11    R INT       PENSION AND HEALTH LIMIT                     
         DS    C                                                                
TX34BAL  DS    CL11    R INT       BALANCE                                      
*                                                                               
TX34X    DS    CL2                 RECORD END                                   
TX34LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE COMMENT LINE (05035)                               
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX35GUAR DS    CL10    R CHAR      GUARANTEE PRIMARY KEY                        
         DS    C                                                                
TX35SEQ  DS    CL3     R INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX35CMNT DS    CL76    R CHAR      COMMENT LINE                                 
*                                                                               
TX35X    DS    CL2                 RECORD END                                   
TX35LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE CONTRACT YEAR TRACKING (05036)                     
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX36GCON DS    CL12    R CHAR      GUARANTEE CONTRACT PRIMARY KEY               
         DS    C                                                                
TX36SDTE DS    CL8     R DATE      START DATE                                   
         DS    C                                                                
TX36EDTE DS    CL8     R DATE      END DATE                                     
         DS    C                                                                
TX36UNI  DS    CL3     R CHAR      UNION                                        
         DS    C                                                                
TX36AMT  DS    CL11    R INT       APPLICATION AMOUNT                           
*                                                                               
TX36X    DS    CL2                 RECORD END                                   
TX36LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - VERSION COMMENT LINE (05037)                                 
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX37VASS DS    CL8     R CHAR      VERSION ASSET PRIMARY KEY                    
         DS    C                                                                
TX37VERN DS    CL3     R INT       VERSION NUMBER                               
         DS    C                                                                
TX37TPC  DS    CL1     R CHAR      TPC OR CLIENT? (T/C)                         
         DS    C                                                                
TX37SEQ  DS    CL3     R INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX37CMNT DS    CL78    R CHAR      COMMENT LINE                                 
*                                                                               
TX37X    DS    CL2                 RECORD END                                   
TX37LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - AGENT (05038)                                                
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX38AGNT DS    CL4     R CHAR      AGENT PRIMARY KEY                            
         DS    C                                                                
TX38NAME DS    CL36    R CHAR      NAME                                         
         DS    C                                                                
TX38SNAM DS    CL16    O CHAR      SHORT NAME                                   
         DS    C                                                                
TX38PID  DS    CL6     O CHAR      PID                                          
         DS    C                                                                
TX38ADR1 DS    CL30    O CHAR      ADDRESS LINE 1                               
         DS    C                                                                
TX38ADR2 DS    CL30    O CHAR      ADDRESS LINE 2                               
         DS    C                                                                
TX38ADR3 DS    CL30    O CHAR      ADDRESS LINE 3                               
         DS    C                                                                
TX38ADR4 DS    CL30    O CHAR      ADDRESS LINE 4                               
         DS    C                                                                
TX38EMAI DS    CL60    O CHAR      EMAIL                                        
         DS    C                                                                
TX38PHON DS    CL10    O CHAR      PHONE NUMBER                                 
         DS    C                                                                
TX38FAX  DS    CL10    O CHAR      FAX NUMBER                                   
*                                                                               
TX38X    DS    CL2                 RECORD END                                   
TX38LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE TRACKING (05039)                                   
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX39GUAR DS    CL10    R CHAR      GUARANTEE PRIMARY KEY                        
         DS    C                                                                
TX39SEQ  DS    CL5     R INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX39AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX39INV  DS    CL6     O CHAR      INVOICE NUMBER                               
         DS    C                                                                
TX39VERS DS    CL12    O CHAR      VERSION ID                                   
         DS    C                                                                
TX39CAT  DS    CL3     O CHAR      CATEGORY CODE                                
         DS    C                                                                
TX39CAM  DS    CL3     O CHAR      CAMERA                                       
         DS    C                                                                
TX39CSD  DS    CL8     O DATE      CYCLE START DATE                             
         DS    C                                                                
TX39CED  DS    CL8     O DATE      CYCLE END DATE                               
         DS    C                                                                
TX39USE  DS    CL3     O CHAR      USE TYPE CODE                                
         DS    C                                                                
TX39USES DS    CL3     R CHAR      USE SUBTYPE                                  
         DS    C                                                                
TX39APP  DS    CL11    O INT       APPLIED AMOUNT                               
         DS    C                                                                
TX39PNH  DS    CL11    O INT       PENSION AND HEALTH                           
         DS    C                                                                
TX39BAL  DS    CL11    O INT       BALANCE                                      
         DS    C                                                                
TX39CYR  DS    CL3     R CHAR      CONTRACT YEAR                                
         DS    C                                                                
TX39OVA  DS    CL11    O CHAR      OVERSCALE AMOUNT                             
         DS    C                                                                
TX39OV1  DS    CL11    O CHAR      OVERSCALE PERCENTAGE 1                       
         DS    C                                                                
TX39OV2  DS    CL11    O CHAR      OVERSCALE PERCENTAGE 2                       
*                                                                               
TX39X    DS    CL2                 RECORD END                                   
TX39LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - GUARANTEE EXCLUDED USE (05040)                               
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX40GUAR DS    CL10    R CHAR   C  GUARANTEE PRIMARY KEY                        
         DS    C                                                                
TX40SEQ  DS    CL3     R INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX40UTC  DS    CL3     R CHAR      USE TYPE CODE                                
*                                                                               
TX40X    DS    CL2                 RECORD END                                   
TX40LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - OFFICE USE (05041)                                           
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX41OFC  DS    CL1     R CHAR      OFFICE                                       
         DS    C                                                                
TX41OFN  DS    CL36    R CHAR      OFFICE NAME                                  
         DS    C                                                                
TX41AD1  DS    CL30    R CHAR      ADDRESS LINE 1                               
         DS    C                                                                
TX41AD2  DS    CL30    O CHAR      ADDRESS LINE 2                               
         DS    C                                                                
TX41AD3  DS    CL30    O CHAR      ADDRESS LINE 3                               
         DS    C                                                                
TX41PHN  DS    CL12    R CHAR      PHONE NUMBER                                 
         DS    C                                                                
TX41PQID DS    CL6     O CHAR      PRINT QUEUE ID                               
         DS    C                                                                
TX41AD4  DS    CL30    O CHAR      ADDRESS LINE 4                               
*                                                                               
TX41X    DS    CL2                 RECORD END                                   
TX41LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - OVERSCALE AMOUNT RECORD (05042)                              
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX42PER  DS    CL12    R CHAR      PERF PRIMARY KEY (TLCACOM+TLCASEQ)           
         DS    C                                                                
TX42USEC DS    CL3     R CHAR      USE CODE                                     
         DS    C                                                                
TX42OVAM DS    CL11    O INT       OVERSCALE AMOUNT                             
         DS    C                                                                
TX42ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX42X    DS    CL2                 RECORD END                                   
TX42LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - OVERSCALE PERCENTAGE RECORD (05043)                          
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX43PER  DS    CL12    R CHAR      OVERSCALE PERCENTAGE PRIMARY KEY             
         DS    C                                                                
TX43USEC DS    CL3     R CHAR      USE CODE                                     
         DS    C                                                                
TX43OVPC DS    CL11    O INT       OVERSCALE PERCENTAGE                         
         DS    C                                                                
TX43ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX43X    DS    CL2                 RECORD END                                   
TX43LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - OVERSCALE 2ND PERCENTAGE RECORD (05044)                      
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX44PER  DS    CL12    R CHAR      OVERSCALE 2ND PERCENTAGE PRIMARY KEY         
         DS    C                                                                
TX44USEC DS    CL3     R CHAR      USE CODE                                     
         DS    C                                                                
TX44OVPC DS    CL11    O INT       OVERSCALE PERCENTAGE                         
         DS    C                                                                
TX44ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX44X    DS    CL2                 RECORD END                                   
TX44LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - STAFF RECORD (05045)                                         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX45UID  DS    CL6     R CHAR      USERID                                       
         DS    C                                                                
TX45STAF DS    CL8     R CHAR      STAFF CODE                                   
         DS    C                                                                
TX45FNAM DS    CL12    O CHAR      FIRST NAME                                   
         DS    C                                                                
TX45LNAM DS    CL12    O CHAR      LAST NAME                                    
         DS    C                                                                
TX45SNAM DS    CL16    O CHAR      SHORT NAME                                   
         DS    C                                                                
TX45SPWD DS    CL8     O CHAR      PASSWORD                                     
         DS    C                                                                
TX45CAT  DS    CL1     O CHAR      CATEGORY                                     
         DS    C                                                                
TX45MAN  DS    CL8     O CHAR      MANAGER                                      
         DS    C                                                                
TX45PNM  DS    CL12    O CHAR      PHONE NUMBER                                 
         DS    C                                                                
TX45EML  DS    CL50    O CHAR      EMAIL                                        
         DS    C                                                                
TX45USNM DS    CL33    O CHAR      USER ID NAME                                 
         DS    C                                                                
TX45SA   DS    CL2     R CHAR      SECURITE AGENCY                              
*                                                                               
TX45X    DS    CL2                 RECORD END                                   
TX45LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - STAFF LIMITED AGENCY/CLIENT (05046)                          
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX46UID  DS    CL6     R CHAR      USERID                                       
         DS    C                                                                
TX46STAF DS    CL8     R CHAR      STAFF CODE                                   
         DS    C                                                                
TX46AGYC DS    CL6     O CHAR      AGENCY CODE                                  
         DS    C                                                                
TX46CLIC DS    CL6     O CHAR      CLIENT CODE                                  
*                                                                               
TX46X    DS    CL2                 RECORD END                                   
TX46LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PREVIOUS VERSION ID (05047)                                  
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX47VASS DS    CL8     R CHAR      VERSION ASSET PRIMARY KEY                    
         DS    C                                                                
TX47VERN DS    CL3     R INT       VERSION NUMBER                               
         DS    C                                                                
TX47SEQ  DS    CL3     R INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX47LAD  DS    CL8     R DATE      LAST ACTIVITY DATE                           
         DS    C                                                                
TX47AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX47VERI DS    CL12    R CHAR      VERSION ID                                   
*                                                                               
TX47X    DS    CL2                 RECORD END                                   
TX47LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - NETWORK USE DETAILS (05048)                                  
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX48PINV DS    CL18    R CHAR      PRIMARY INVOICE PRIMARY KEY                  
         DS    C                                                                
TX48UD   DS    CL8     R DATE      USE DATE                                     
         DS    C                                                                
TX48PN   DS    CL15    O CHAR      PROGRAM NAME                                 
         DS    C                                                                
TX48LIFT DS    CL1     R CHAR      LIFT?                                        
         DS    C                                                                
TX48NET  DS    CL1     O CHAR      NETWORK                                      
         DS    C                                                                
TX48ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX48X    DS    CL2                 RECORD END                                   
TX48LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - USE DETAILS (05049)                                          
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX49ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX49INV  DS    CL6     R DATE      INVOICE NUMBER                               
         DS    C                                                                
TX49CSD  DS    CL8     R DATE      CYCLE START DATE                             
         DS    C                                                                
TX49CED  DS    CL8     R DATE      CYCLE END DATE                               
         DS    C                                                                
TX49AC   DS    CL6     R CHAR      ALPHA CODE                                   
         DS    C                                                                
TX49PKEY DS    CL8     R CHAR      PRIMARY KEY                                  
*                                                                               
TX49X    DS    CL2                 RECORD END                                   
TX49LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - MARKET (05053)                                               
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX53PKEY DS    CL8     R CHAR      PRIMARY KEY                                  
         DS    C                                                                
TX53TYPE DS    CL1     R CHAR      TYPE                                         
         DS    C                                                                
TX53NMC  DS    CL6     R CHAR      NSI MARKET CODE                              
         DS    C                                                                
TX53AC   DS    CL6     R CHAR      ALPHA CODE                                   
         DS    C                                                                
TX53NAME DS    CL50    R CHAR      NAME                                         
         DS    C                                                                
TX53WGHT DS    CL11    O CHAR      WEIGHT                                       
         DS    C                                                                
TX53SWGH DS    CL11    O CHAR      SPANISH WEIGHT                               
         DS    C                                                                
TX53SUBS DS    CL11    O CHAR      SUBSCRIBERS                                  
*                                                                               
TX53X    DS    CL2                 RECORD END                                   
TX53LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
*&&DO                                                                           
***********************************************************************         
* TALENT EXTRACT - RADIO MARKET USE DETAILS (05050)                             
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX50PINV DS    CL18    R CHAR      PRIMARY INVOICE PRIMARY KEY                  
         DS    C                                                                
TX50CSD  DS    CL8     R DATE      CYCLE START DATE                             
         DS    C                                                                
TX50CED  DS    CL8     R DATE      CYCLE END DATE                               
         DS    C                                                                
TX50RMAC DS    CL6     R CHAR      RADIO MARKET ALPHA CODE                      
         DS    C                                                                
TX50RMPK DS    CL8     R CHAR      RADIO MARKET PRIMARY KEY                     
         DS    C                                                                
TX50ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX50X    DS    CL2                 RECORD END                                   
TX50LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CABLE MARKET USE DETAILS (05051)                             
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX51PINV DS    CL18    R CHAR      PRIMARY INVOICE PRIMARY KEY                  
         DS    C                                                                
TX51CSD  DS    CL8     R DATE      CYCLE START DATE                             
         DS    C                                                                
TX51CED  DS    CL8     R DATE      CYCLE END DATE                               
         DS    C                                                                
TX51CMAC DS    CL6     R CHAR      CABLE MARKET ALPHA CODE                      
         DS    C                                                                
TX51CMPK DS    CL8     R CHAR      CABLE MARKET PRIMARY KEY                     
         DS    C                                                                
TX51ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX51X    DS    CL2                 RECORD END                                   
TX51LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - LOCAL CABLE SYSTEM USE DETAILS (05052)                       
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX52PINV DS    CL18    R CHAR      PRIMARY INVOICE PRIMARY KEY                  
         DS    C                                                                
TX52CSD  DS    CL8     R DATE      CYCLE START DATE                             
         DS    C                                                                
TX52CED  DS    CL8     R DATE      CYCLE END DATE                               
         DS    C                                                                
TX52LCSC DS    CL6     R CHAR      LOCAL CABLE SYSTEM CODE                      
         DS    C                                                                
TX52LCSP DS    CL8     R CHAR      LOCAL CABLE SYSTEM PRIMARY KEY               
         DS    C                                                                
TX52ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX52X    DS    CL2                 RECORD END                                   
TX52LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - TELEVISION MARKET (05053)                                    
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX53TMPK DS    CL8     R CHAR      TELEVISION MARKET PRIMARY KEY                
         DS    C                                                                
TX53NMC  DS    CL6     R CHAR      NSI MARKET CODE                              
         DS    C                                                                
TX53AC   DS    CL6     R CHAR      ALPHA CODE                                   
         DS    C                                                                
TX53NAME DS    CL50    R CHAR      NAME                                         
*                                                                               
TX53X    DS    CL2                 RECORD END                                   
TX53LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - RADIO MARKET (05054)                                         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX54RMPK DS    CL8     R CHAR      RADIO MARKET PRIMARY KEY                     
         DS    C                                                                
TX54AMC  DS    CL6     R CHAR      ALPHA MARKET CODE                            
         DS    C                                                                
TX54NAME DS    CL50    R CHAR      NAME                                         
*                                                                               
TX54X    DS    CL2                 RECORD END                                   
TX54LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CABLE NETWORK (05055)                                        
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX55CNPK DS    CL8     R CHAR      CABLE NETWORK PRIMARY KEY                    
         DS    C                                                                
TX55CNC  DS    CL6     R CHAR      CABLE NETWORK CODE                           
         DS    C                                                                
TX55NAME DS    CL50    R CHAR      NAME                                         
*                                                                               
TX55X    DS    CL2                 RECORD END                                   
TX55LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - LOCAL CABLE SYSTEM (05056)                                   
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX56LCSP DS    CL8     R CHAR      LOCAL CABLE SYSTEM PRIMARY KEY               
         DS    C                                                                
TX56LCSC DS    CL6     R CHAR      LOCAL CABLE SYSTEM CODE                      
         DS    C                                                                
TX56NAME DS    CL50    R CHAR      NAME                                         
*                                                                               
TX56X    DS    CL2                 RECORD END                                   
TX56LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
*&&                                                                             
***********************************************************************         
* TALENT EXTRACT - CHECK (05057)                                                
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX57CHK  DS    CL39    R CHAR      CHECK PRIMARY KEY                            
         DS    C                                                                
TX57NUM  DS    CL8     O CHAR      CHECK NUMBER                                 
         DS    C                                                                
TX57PID  DS    CL6     O CHAR      PID                                          
         DS    C                                                                
TX57W4T  DS    CL1     R CHAR      W4 TYPE CODE                                 
         DS    C                                                                
TX57FREQ DS    CL1     O CHAR      FREQUENCY                                    
         DS    C                                                                
TX57EMP  DS    CL2     O CHAR      EMPLOYER                                     
         DS    C                                                                
TX57BA   DS    CL6     O CHAR      BANK ACCOUNT                                 
         DS    C                                                                
TX57CHKD DS    CL8     O DATE      CHECK DATE                                   
         DS    C                                                                
TX57RD   DS    CL8     O DATE      RUN DATE                                     
         DS    C                                                                
TX57CSHD DS    CL8     O DATE      CASHED DATE                                  
         DS    C                                                                
TX57CURR DS    CL1     O CHAR      CURRENCY                                     
         DS    C                                                                
TX57CPID DS    CL6     O CHAR      CORPORATION PID                              
         DS    C                                                                
TX57AGNT DS    CL4     O CHAR      AGENT                                        
         DS    C                                                                
TX57CMNT DS    CL60    O CHAR      COMMENT                                      
         DS    C                                                                
TX57STOP DS    CL1     R CHAR      STOPPED?                                     
         DS    C                                                                
TX57PULL DS    CL1     R CHAR      PULLED?                                      
         DS    C                                                                
TX57PINV DS    CL18    R CHAR      PRIMARY INVOICE KEY                          
         DS    C                                                                
TX57GRS  DS    CL11    O INT       GROSS AMOUNT                                 
         DS    C                                                                
TX57NTA  DS    CL11    O INT       NON TAXABLE AMOUNT                           
         DS    C                                                                
TX57MDA  DS    CL11    O INT       MISCELLANEOUS DEDUCTION AMOUNT               
         DS    C                                                                
TX57REA  DS    CL11    O INT       REIMBURSED EXPENSE AMOUNT                    
         DS    C                                                                
TX57NET  DS    CL11    O INT       NET AMOUNT                                   
         DS    C                                                                
TX57WIRE DS    CL11    O INT       WIRED AMOUNT                                 
         DS    C                                                                
TX57DRCT DS    CL11    O INT       DIRECT AMOUNT                                
         DS    C                                                                
TX57ACA  DS    CL11    O INT       AGENCY COMMISSION AMOUNT                     
         DS    C                                                                
TX57DA   DS    CL11    O INT       DUES AMOUNT                                  
         DS    C                                                                
TX57MNUM DS    CL9     O CHAR      MEMBERSHIP NUMBER                            
         DS    C                                                                
TX57PCA  DS    CL11    O INT       PERMANENT CHARITY AMOUNT                     
         DS    C                                                                
TX57MPA  DS    CL11    O INT       MPTRF AMOUNT                                 
         DS    C                                                                
TX57TDA  DS    CL11    O INT       TRUSTEE DEDUCTION AMOUNT                     
         DS    C                                                                
TX57TPP  DS    CL6     O CHAR      TRUSTEE PAYER PID                            
         DS    C                                                                
TX57VOID DS    CL1     R CHAR      VOIDED?                                      
         DS    C                                                                
TX57STAL DS    CL1     R CHAR      STALE?                                       
         DS    C                                                                
TX57EFT  DS    CL1     R CHAR      EFT LIEN?                                    
         DS    C                                                                
TX57VDER DS    CL1     R CHAR      VOIDER?                                      
         DS    C                                                                
TX57RISS DS    CL1     R CHAR      REISSUE?                                     
         DS    C                                                                
TX57ISS  DS    CL1     R CHAR      ISSUE?                                       
         DS    C                                                                
TX57TREF DS    CL1     R CHAR      TAX REFUND?                                  
         DS    C                                                                
TX57TT   DS    CL1     R CHAR      TAX TRANSFER                                 
         DS    C                                                                
TX57ST   DS    CL1     R CHAR      SSN TRANSFER?                                
         DS    C                                                                
TX57ACRA DS    CL11    O CHAR      APPLIED CREDIT AMOUNT                        
         DS    C                                                                
TX57AGA  DS    CL11    O CHAR      APPLIED GUARANTEE AMOUNT                     
*         DS    C                                                               
*TX57ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                           
*                                                                               
TX57SFEE DS    CL11    O CHAR      SESSION FEE                                  
         DS    C                                                                
TX57HRAT DS    CL11    O CHAR      HOURLY RATE                                  
         DS    C                                                                
TX57SPTS DS    CL2     O INT       SPOTS                                        
         DS    C                                                                
TX57DAYS DS    CL2     O INT       DAYS                                         
         DS    C                                                                
TX57OTHR DS    CL2     O INT       OVERTIME HOURS                               
         DS    C                                                                
TX57DTHR DS    CL2     O INT       DOUBLETIME HOURS                             
         DS    C                                                                
TX57TRVL DS    CL5     O CHAR      TRAVEL TIME                                  
         DS    C                                                                
TX57PDWD DS    CL5     O CHAR      PRIOR DAY WARDROBE                           
         DS    C                                                                
TX57TAGS DS    CL2     O INT       TAGS                                         
         DS    C                                                                
TX57WORK DS    CL5     O CHAR      WORK TIME                                    
         DS    C                                                                
TX57INDR DS    CL1     O CHAR      INDUSTRIAL RETAKE STATUS                     
         DS    C                                                                
TX57PRGS DS    CL2     O INT       PROGRAMS                                     
         DS    C                                                                
TX57RETK DS    CL5     O CHAR      RETAKE TIME                                  
         DS    C                                                                
TX57OVP1 DS    CL11    O CHAR      OVERSCALE PERCENTAGE 1                       
         DS    C                                                                
TX57OVP2 DS    CL11    O CHAR      OVERSCALE PERCENTAGE 2                       
         DS    C                                                                
TX57CATC DS    CL3     O CHAR      CATEGORY CODE                                
         DS    C                                                                
TX57CAMR DS    CL3     O CHAR      CAMERA                                       
         DS    C                                                                
TX57TAXU DS    CL3     O CHAR      TAX UNIT                                     
         DS    C                                                                
TX57LIFT DS    CL1     O CHAR      LIFT?                                        
         DS    C                                                                
TX57DBLS DS    CL1     O INT       DOUBLES                                      
         DS    C                                                                
TX57FSDT DS    CL8     O DATE      FIRST SERVICE DATE                           
         DS    C                                                                
TX57CNYR DS    CL3     O CHAR      CONTRACT YEAR                                
         DS    C                                                                
TX57APPC DS    CL1     O INT       APPLICATION CODE                             
         DS    C                                                                
TX57INCC DS    CL1     O INT       INCLUDE CODE                                 
         DS    C                                                                
TX57MANO DS    CL1     R CHAR      MANUAL OVERRIDE?                             
         DS    C                                                                
TX57TXLV DS    CL1     O CHAR      TAX LEVEL                                    
         DS    C                                                                
TX57MAJS DS    CL9     O CHAR      MAJORS                                       
         DS    C                                                                
TX57UNIT DS    CL11    O CHAR      UNITS                                        
         DS    C                                                                
TX57PNH  DS    CL11    O INT       PNH AMOUNT                                   
         DS    C                                                                
TX57SUN  DS    CL11    O INT       STARTING USE NUMBER                          
         DS    C                                                                
TX57NUSE DS    CL11    O INT       NUMBER OF USES                               
         DS    C                                                                
TX57SDTE DS    CL8     O DATE      SHOOT DATE                                   
         DS    C                                                                
TX57PDTE DS    CL8     O DATE      PUBLICATION DATE                             
         DS    C                                                                
TX57EDTE DS    CL8     O DATE      EXPIRATION DATE                              
         DS    C                                                                
TX57AFEE DS    CL5     O INT       AGENT FEE                                    
          DS   C                                                                
TX57PHRT DS    CL11    O INT       P AND H RATE                                 
         DS    C                                                                
TX57PERF DS    CL12    R CHAR      PERFORMER PRIMARY KEY                        
         DS    C                                                                
TX57SPNH DS    CL11    O INT       SUBJECT TO PNH AMOUNT                        
         DS    C                                                                
TX57UNI  DS    CL3     O CHAR      UNION                                        
         DS    C                                                                
TX57PCGR DS    CL1     R CHAR      IS PER CYCLE GRT PAYMENT?                    
         DS    C                                                                
TX57GRTC DS    CL4     O CHAR      GUARANTEE AT THE TIME OF PAYMENT             
         DS    C                                                                
TX57INDP DS    CL11    O INT       INDIVIDUAL PAYMENT AMOUNT                    
         DS    C                                                                
TX57CRPP DS    CL11    O INT       CORP PAYMENT AMOUNT                          
         DS    C                                                                
TX57GSTA DS    CL11    O INT       GST AMOUNT                                   
         DS    C                                                                
TX57USSC DS    CL3     O INT       USE SUBTYPE CODE                             
         DS    C                                                                
TX57BASA DS    CL11    O INT       BASE AMOUNT FROM PREVIOUS CONTRACT           
         DS    C                                                                
TX57PHBS DS    CL11    O INT       PNH BASED ON INCREASE                        
         DS    C                                                                
TX57PHDF DS    CL11    O INT       DIFFERENCE FROM PNH BASE                     
         DS    C                                                                
TX57LIEN DS    CL1     R CHAR      CHECK WAS GENERATED BY A LIEN?               
         DS    C                                                                
TX57TRST DS    CL1     R CHAR      CHECK WAS GENERATED BY A TRUSTEE?            
         DS    C                                                                
TX57MLTS DS    CL1     R CHAR      MULTI-SERVICE CONTRACT?                      
         DS    C                                                                
TX57OINV DS    CL18    O CHAR      ORIGINAL INVOICE KEY                         
*                                                                               
TX57X    DS    CL2                 RECORD END                                   
TX57LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CHECK FEDERAL TAX WITHHOLDINGS (05058)                       
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX58CHK  DS    CL39    R CHAR      CHECK PRIMARY KEY                            
         DS    C                                                                
TX58RES  DS    CL1     R CHAR      RESIDENT?                                    
         DS    C                                                                
TX58MAR  DS    CL1     O CHAR      MARITAL STATUS                               
         DS    C                                                                
TX58NOE  DS    CL2     O INT       NUMBER OF EXEMPTIONS                         
         DS    C                                                                
TX58WORK DS    CL1     R CHAR      WORK?                                        
         DS    C                                                                
TX58TAX  DS    CL11    O INT       TAX AMOUNT                                   
         DS    C                                                                
TX58FICA DS    CL11    O INT       FICA AMOUNT                                  
**        DS    C                                                               
*TX58ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                           
*                                                                               
TX58X    DS    CL2                 RECORD END                                   
TX58LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CHECK STATE TAX WITHHOLDINGS (05059)                         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX59CHK  DS    CL39    R CHAR      CHECK PRIMARY KEY                            
         DS    C                                                                
TX59WOR  DS    CL1     R CHAR      WORK OR RESIDENT?                            
         DS    C                                                                
TX59UNIT DS    CL3     R CHAR      TAX UNIT                                     
         DS    C                                                                
TX59MAR  DS    CL1     O CHAR      MARITAL STATUS                               
         DS    C                                                                
TX59NOE  DS    CL2     O INT       NUMBER OF EXEMPTIONS                         
         DS    C                                                                
TX59TAX  DS    CL11    O INT       TAX AMOUNT                                   
         DS    C                                                                
TX59UEA  DS    CL11    O INT       UNEMPLOYMENT AMOUNT                          
         DS    C                                                                
TX59DA   DS    CL11    O INT       DISABILITY AMOUNT                            
         DS    C                                                                
TX59FLIA DS    CL11    O INT       FAMILY LEAVE INSURANCE AMOUNT                
*         DS    C                                                               
*TX59ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                           
*                                                                               
TX59X    DS    CL2                 RECORD END                                   
TX59LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CHECK CITY TAX WITHHOLDINGS (05060)                          
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX60CHK  DS    CL39    R CHAR      CHECK PRIMARY KEY                            
         DS    C                                                                
TX60WOR  DS    CL1     R CHAR      WORK OR RESIDENT?                            
         DS    C                                                                
TX60UNIT DS    CL3     R CHAR      TAX UNIT                                     
         DS    C                                                                
TX60MAR  DS    CL1     O CHAR      MARITAL STATUS                               
         DS    C                                                                
TX60NOE  DS    CL2     O INT       NUMBER OF EXEMPTIONS                         
         DS    C                                                                
TX60TAX  DS    CL11    O INT       TAX AMOUNT                                   
*         DS    C                                                               
*TX60ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                           
*                                                                               
TX60X    DS    CL2                 RECORD END                                   
TX60LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CHECK CANADIAN TAX WITHHOLDINGS (05061)                      
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX61CHK  DS    CL39    R CHAR      CHECK PRIMARY KEY                            
         DS    C                                                                
TX61AMT  DS    CL11    O INT       TAX AMOUNT                                   
         DS    C                                                                
TX61HSTD DS    CL11    O INT       HST DUE                                      
         DS    C                                                                
TX61HSTP DS    CL11    O INT       HST PAID                                     
*         DS    C                                                               
*TX61ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                           
*                                                                               
TX61X    DS    CL2                 RECORD END                                   
TX61LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CHECK LIEN WITHHOLDING (05062)                               
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX62CHK  DS    CL39    R CHAR      CHECK PRIMARY KEY                            
         DS    C                                                                
TX62REF  DS    CL6     O CHAR      REFERENCE NUMBER                             
         DS    C                                                                
TX62AMT  DS    CL11    O INT       AMOUNT                                       
         DS    C                                                                
TX62LPP  DS    CL6     O CHAR      LIEN PAYER PID                               
*         DS    C                                                               
*TX62ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                           
*                                                                               
TX62X    DS    CL2                 RECORD END                                   
TX62LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CHECK DUE COMPANY WITHHOLDING (05063)                        
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX63CHK  DS    CL39    R CHAR      CHECK PRIMARY KEY                            
         DS    C                                                                
TX63REF  DS    CL6     O CHAR      REFERENCE NUMBER                             
         DS    C                                                                
TX63AMT  DS    CL11    O INT       AMOUNT                                       
*         DS    C                                                               
*TX63ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                           
*                                                                               
TX63X    DS    CL2                 RECORD END                                   
TX63LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CHECK AGENT CHECK SOURCE (05064)                             
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX64CHK  DS    CL39    R CHAR      CHECK PRIMARY KEY                            
         DS    C                                                                
TX64PID  DS    CL6     R CHAR      PERFORMER PID                                
*         DS    C                                                               
*TX64ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                           
*                                                                               
TX64X    DS    CL2                 RECORD END                                   
TX64LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PRODUCT GROUP (05065)                                        
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX65PGPK DS    CL18    R CHAR      PRODUCT GROUP PRIMARY KEY                    
         DS    C                                                                
TX65AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX65CLI  DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
TX65PGC  DS    CL6     R CHAR      PRODUCT GROUP CODE                           
         DS    C                                                                
TX65NAME DS    CL36    R CHAR      NAME                                         
         DS    C                                                                
TX65SNAM DS    CL16    O CHAR      SHORT NAME                                   
*                                                                               
TX65X    DS    CL2                 RECORD END                                   
TX65LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - PRODUCT TYPE (05066)                                         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX66PTPK DS    CL12    R CHAR      PRODUCT TYPE PRIMARY KEY                     
         DS    C                                                                
TX66AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX66PTC  DS    CL6     R CHAR      PRODUCT TYPE CODE                            
         DS    C                                                                
TX66DESC DS    CL36    O CHAR      DESCRIPTION                                  
         DS    C                                                                
TX66OD   DS    CL8     O DATE      OBSELETE DATE                                
*                                                                               
TX66X    DS    CL2                 RECORD END                                   
TX66LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - NETWORK (05067)                                              
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX67CODE DS    CL1     R CHAR      CODE                                         
         DS    C                                                                
TX67NAME DS    CL16    R CHAR      NAME                                         
*                                                                               
TX67X    DS    CL2                 RECORD END                                   
TX67LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - ESTIMATE/JOB NUMBER RECORD (05068)                 *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX68PINV DS    CL18    R CHAR      INVOICE PRIMARY KEY                          
         DS    C                                                                
TX68EJOB DS    CL16    R CHAR      ESTIMATE/JOB NUMBER                          
         DS    C                                                                
TX68PCT  DS    CL8     R CHAR      PERCENTAGE                                   
         DS    C                                                                
TX68SINV DS    CL18    R CHAR      SUBSIDIARY PRIMARY KEY                       
         DS    C                                                                
TX68ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX68X    DS    CL2                 RECORD END                                   
TX68LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - TIMESHSEET DAY (05069)                             *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX69PTIM DS    CL41    R CHAR      TIMESHEET PRIMARY KEY                        
         DS    C                                                                
TX69ASS  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX69PINV DS    CL6     R CHAR      INVOICE NUMBER                               
         DS    C                                                                
TX69PPER DS    CL12    R CHAR      PERFORMER PRIMARY KEY                        
         DS    C                                                                
TX69DATE DS    CL8     R DATE      TIMESHEET DATE                               
         DS    C                                                                
TX69SPOT DS    CL2     O INT       SPOTS                                        
         DS    C                                                                
TX69TAGS DS    CL2     O INT       TAGS                                         
         DS    C                                                                
TX69WKST DS    CL5     O CHAR      WORK START TIME                              
         DS    C                                                                
TX69WKET DS    CL5     O CHAR      WORK END TIME                                
         DS    C                                                                
TX69NDBR DS    CL1     R CHAR      NON-DEDUCTIBLE BREAKFAST?                    
         DS    C                                                                
TX69M1ST DS    CL5     O CHAR      MEAL 1 START TIME                            
         DS    C                                                                
TX69M1ET DS    CL5     O CHAR      MEAL 1 END TIME                              
         DS    C                                                                
TX69M2ST DS    CL5     O CHAR      MEAL 2 START TIME                            
         DS    C                                                                
TX69M2ET DS    CL5     O CHAR      MEAL 2 END TIME                              
         DS    C                                                                
TX69M3ST DS    CL5     O CHAR      MEAL 3 START TIME                            
         DS    C                                                                
TX69M3ET DS    CL5     O CHAR      MEAL 3 END TIME                              
         DS    C                                                                
TX69PDWD DS    CL8     O DATE      PRIOR DAY WARDROBE DATE                      
         DS    C                                                                
TX69PDST DS    CL5     O CHAR      PRIOR DAY WARDROBE START TIME                
         DS    C                                                                
TX69PDET DS    CL5     O CHAR      PRIOR DAY WARDROBE END TIME                  
         DS    C                                                                
TX69NPRM DS    CL1     R CHAR      NIGHT PREMIUM?                               
         DS    C                                                                
TX69MPN1 DS    CL1     R CHAR      MEAL PENALTY 1?                              
         DS    C                                                                
TX69MPN2 DS    CL1     R CHAR      MEAL PENALTY 2?                              
         DS    C                                                                
TX69MPN3 DS    CL1     R CHAR      MEAL PENALTY 3?                              
         DS    C                                                                
TX69SMKP DS    CL1     R CHAR      SMOKE PAY?                                   
         DS    C                                                                
TX6916HR DS    CL1     R CHAR      16 HOUR RULE?                                
         DS    C                                                                
TX69ADJA DS    CL11    O CHAR      ADJUSTMENT AMOUNT                            
         DS    C                                                                
TX69RHSD DS    CL1     R CHAR      REHEARSAL DAY?                               
         DS    C                                                                
TX69WXCL DS    CL1     R CHAR      WEATHER CANCELLATION?                        
         DS    C                                                                
TX69RPVL DS    CL1     R CHAR      REST PERIOD VIOLATION?                       
         DS    C                                                                
TX69NCON DS    CL1     R CHAR      NON-CONSECUTIVE DAY?                         
         DS    C                                                                
TX69TVLD DS    CL1     R CHAR      TRAVEL TO DISTANT LOCATION?                  
         DS    C                                                                
TX69TTDT DS    CL5     O CHAR      TRAVEL TO DEPART TIME                        
         DS    C                                                                
TX69TTAT DS    CL5     O CHAR      TRAVEL TO ARRIVE TIME                        
         DS    C                                                                
TX69TFDT DS    CL5     O CHAR      TRAVEL FROM DEPART TIME                      
         DS    C                                                                
TX69TFAT DS    CL5     O CHAR      TRAVEL FROM ARRIVE TIME                      
         DS    C                                                                
TX69TIDT DS    CL5     O CHAR      TRAVEL INTERVENING DEPART TIME               
         DS    C                                                                
TX69TIAT DS    CL5     O CHAR      TRAVEL INTERVENING ARRIVE TIME               
         DS    C                                                                
TX69NEWA DS    CL2     O INT       NON-EVENING WARDROBE ALLOTMENTS              
         DS    C                                                                
TX69EVWA DS    CL2     O INT       EVENING WARDROBE ALLOTMENTS                  
         DS    C                                                                
TX69OTRM DS    CL11    O CHAR      OTHER REIMBURSEMENTS                         
         DS    C                                                                
TX69CMNT DS    CL30    O CHAR      COMMENT                                      
*                                                                               
TX69X    DS    CL2                 RECORD END                                   
TX69LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - CONTROL RECORD (5070)                              *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX70AGY  DS    CL6     R CHAR      AGENCY CODE                                  
         DS    C                                                                
TX70CLI  DS    CL6     O CHAR      CLIENT CODE                                  
         DS    C                                                                
TX70ACRL DS    CL1     R CHAR      AGENCY COMMISSION RULE                       
         DS    C                                                                
TX70ACRT DS    CL5     O CHAR      AGENCY COMMISSION RATE                       
*                                                                               
TX70X    DS    CL2                 RECORD END                                   
TX70LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - EMPLOYER (5071)                                    *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX71EMP  DS    CL3     R CHAR      EMPLOYER CODE                                
         DS    C                                                                
TX71EMPN DS    CL36    R CHAR      EMPLOYER NAME                                
         DS    C                                                                
TX71IRSN DS    CL14    R CHAR      IRS NUMBER                                   
         DS    C                                                                
TX71GSTN DS    CL10    R CHAR      GST NUMBER                                   
         DS    C                                                                
TX71DSTA DS    CL2     R CHAR      DEFAULT STATE                                
         DS    C                                                                
TX71ADD1 DS    CL30    R CHAR      ADDRESS LINE 1                               
         DS    C                                                                
TX71ADD2 DS    CL30    O CHAR      ADDRESS LINE 2                               
*                                                                               
TX71X    DS    CL2                 RECORD END                                   
TX71LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - LIEN (5072)                                        *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX72LPK  DS    CL12    R CHAR      LIEN PRIMARY KEY                             
         DS    C                                                                
TX72PID  DS    CL6     R CHAR      PID                                          
         DS    C                                                                
TX72REF  DS    CL6     R CHAR      REFERENCE NUMBER                             
         DS    C                                                                
TX72EMP  DS    CL3     R CHAR      EMPLOYER                                     
         DS    C                                                                
TX72LT   DS    CL2     R CHAR      LIENT TYPE                                   
         DS    C                                                                
TX72EFT  DS    CL1     R CHAR      EFT?                                         
         DS    C                                                                
TX72PLTP DS    CL6     R CHAR      PAY LIEN TO PID                              
         DS    C                                                                
TX72EXP  DS    CL8     R DATE      EXPIRATION DATE                              
         DS    C                                                                
TX72CUR  DS    CL1     O CHAR      CURRENCY                                     
         DS    C                                                                
TX72TU   DS    CL3     O CHAR      TAX UNIT                                     
         DS    C                                                                
TX72AD   DS    CL11    O INT       AMOUNT DUE                                   
         DS    C                                                                
TX72EA   DS    CL11    O INT       EXEMPT AMOUNT                                
         DS    C                                                                
TX72DA   DS    CL11    O INT       DEDUCTION AMOUNT                             
         DS    C                                                                
TX72DP   DS    CL7     O INT       DEDUCT PERCENTAGE                            
         DS    C                                                                
TX72CA   DS    CL11    O INT       COLLECTED AMOUNT                             
         DS    C                                                                
TX72BA   DS    CL11    O INT       BALANCE AMOUNT                               
         DS    C                                                                
TX72NL1  DS    CL60    O CHAR      NARRATIVE LINE 1                             
         DS    C                                                                
TX72NL2  DS    CL60    O CHAR      NARRATIVE LINE 2                             
         DS    C                                                                
TX72NL3  DS    CL60    O CHAR      NARRATIVE LINE 3                             
         DS    C                                                                
TX72CAN  DS    CL15    O CHAR      CASE/ACCOUNT NUMBER                          
*                                                                               
TX72X    DS    CL2                 RECORD END                                   
TX72LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - DUE COMPANY (5073)                                 *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX73DCPK DS    CL12    R CHAR      DUE COMPANY PRIMARY KEY                      
         DS    C                                                                
TX73PID  DS    CL6     R CHAR      PID                                          
         DS    C                                                                
TX73REF  DS    CL6     R CHAR      REFERENCE NUMBER                             
         DS    C                                                                
TX73EMP  DS    CL3     O CHAR      EMPLOYER                                     
         DS    C                                                                
TX73ET   DS    CL1     R CHAR      ERROR TYPE                                   
         DS    C                                                                
TX73AC   DS    CL6     O CHAR      AGENCY CODE                                  
         DS    C                                                                
TX73AF   DS    CL8     O CHAR      AGENCY FLIST                                 
         DS    C                                                                
TX73U    DS    CL3     R CHAR      UNION                                        
         DS    C                                                                
TX73IPK  DS    CL18    O CHAR      INVOICE PRIMARY KYE                          
         DS    C                                                                
TX73CIPK DS    CL18    O CHAR      CREDIT INVOICE PRIMARY KYE                   
         DS    C                                                                
TX73CC   DS    CL6     O CHAR      CLIENT CODE                                  
         DS    C                                                                
TX73CF   DS    CL8     O CHAR      CLIENT FLIST                                 
         DS    C                                                                
TX73AD   DS    CL11    O INT       AMOUNT DUE                                   
         DS    C                                                                
TX73FLAG DS    CL1     O CHAR      FLAG                                         
         DS    C                                                                
TX73DP   DS    CL7     O INT       DEDUCT PERCENTAGE                            
         DS    C                                                                
TX73CA   DS    CL11    O INT       COLLECTED AMOUNT                             
         DS    C                                                                
TX73BA   DS    CL11    O INT       BALANCE AMOUNT                               
         DS    C                                                                
TX73RFA  DS    CL1     R CHAR      RECOVER FROM AGENCY?                         
         DS    C                                                                
TX73RFC  DS    CL1     R CHAR      RECOVER FROM CLIENT?                         
         DS    C                                                                
TX73CUR  DS    CL1     O CHAR      CURRENCY                                     
         DS    C                                                                
TX73LOCK DS    CL1     R CHAR      LOCKED?                                      
         DS    C                                                                
TX73NL1  DS    CL60    O CHAR      NARRATIVE LINE 1                             
         DS    C                                                                
TX73NL2  DS    CL60    O CHAR      NARRATIVE LINE 2                             
         DS    C                                                                
TX73NL3  DS    CL60    O CHAR      NARRATIVE LINE 3                             
*                                                                               
TX73X    DS    CL2                 RECORD END                                   
TX73LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - INTERNET NEW MEDIA (5074)                          *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX74INPK DS    CL5     R CHAR      INTERNET NEW MEDIA PRIMARY KEY               
         DS    C                                                                
TX74INMD DS    CL1     R CHAR      MEDIA                                        
         DS    C                                                                
TX74INCD DS    CL4     R CHAR      CODE                                         
         DS    C                                                                
TX74INNM DS    CL30    R CHAR      NAME                                         
*                                                                               
TX74X    DS    CL2                 RECORD END                                   
TX74LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - ASSET INTERNET - NEW MEDIA (5075)                            
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX75ASPK DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX75IAPK DS    CL5     R CHAR      AASET NEW MEDIA PRIMARY KEY                  
*                                                                               
TX75X    DS    CL2                 RECORD END                                   
TX75LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - COMMERCIAL POOL PRIMARY KEY (5076)                           
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX76CPPK DS    CL24    R CHAR      COMMERCIAL POOL PRIMARY KEY                  
         DS    C                                                                
TX76CPAG DS    CL6     R CHAR      AGENCY                                       
         DS    C                                                                
TX76CPCL DS    CL6     R CHAR      CLIENT                                       
         DS    C                                                                
TX76CPPR DS    CL6     R CHAR      PRODUCT                                      
         DS    C                                                                
TX76CPID DS    CL6     R CHAR      CMML POOL ID                                 
         DS    C                                                                
TX76CPNM DS    CL36    R CHAR      NAME                                         
         DS    C                                                                
TX76CPSN DS    CL16    O CHAR      SHORT NAME                                   
*                                                                               
TX76X    DS    CL2                 RECORD END                                   
TX76LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - BILL TO PRIMARY KEY (5077)                                   
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX77BTPK DS    CL8     R CHAR      BILLTO PRIMARY KEY                           
         DS    C                                                                
TX77BTAG DS    CL6     R CHAR      AGENCY                                       
         DS    C                                                                
TX77BTCD DS    CL2     R CHAR      CODE                                         
         DS    C                                                                
TX77BTNM DS    CL36    O CHAR      BILLING NAME                                 
         DS    C                                                                
TX77BTA1 DS    CL30    O CHAR      BILL ADDRESS LINE 1                          
         DS    C                                                                
TX77BTA2 DS    CL30    O CHAR      BILL ADDRESS LINE 2                          
         DS    C                                                                
TX77BTA3 DS    CL30    O CHAR      BILL ADDRESS LINE 3                          
         DS    C                                                                
TX77BTA4 DS    CL30    O CHAR      BILL ADDRESS LINE 4                          
         DS    C                                                                
TX77BTAT DS    CL36    O CHAR      ATTENTION NAME                               
         DS    C                                                                
TX77BTML DS    CL35    O CHAR      EMAIL ADDRESS                                
*                                                                               
TX77X    DS    CL2                 RECORD END                                   
TX77LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - CONTRACT TYPE (5078)                               *         
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX78CNTY DS    CL1     R CHAR      CONTRACT TYPE                                
         DS    C                                                                
TX78CNNM DS    CL13    R CHAR      NAME                                         
*                                                                               
TX78X    DS    CL2                 RECORD END                                   
TX78LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - PUBLISHED MUSIC (5079)                            *          
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX79PMCD DS    CL8     R CHAR      PUBLISHED MUSIC CODE                         
         DS    C                                                                
TX79PMAG DS    CL6     R CHAR      AGENCY                                       
         DS    C                                                                
TX79PMPR DS    CL6     O CHAR      PREVIOUS AGENCY                              
         DS    C                                                                
TX79PMOR DS    CL6     O CHAR      ORIGINAL AGENCY                              
         DS    C                                                                
TX79ORCD DS    CL8     O CHAR      ORIGINAL PUBLISHED MUSIC CODE                
         DS    C                                                                
TX79CNM1 DS    CL36    R CHAR      COMPOSITION NAME 1                           
         DS    C                                                                
TX79CNM2 DS    CL36    O CHAR      COMPOSITION NAME 2                           
         DS    C                                                                
TX79PUB1 DS    CL36    R CHAR      PUBLISHER 1                                  
         DS    C                                                                
TX79LCR1 DS    CL1     O CHAR      LICENSER 1                                   
         DS    C                                                                
TX79PUB2 DS    CL36    O CHAR      PUBLISHER 2                                  
         DS    C                                                                
TX79LCR2 DS    CL1     O CHAR      LICENSER 2                                   
         DS    C                                                                
TX79PUB3 DS    CL36    O CHAR      PUBLISHER 3                                  
         DS    C                                                                
TX79LCR3 DS    CL1     O CHAR      LICENSER 3                                   
         DS    C                                                                
TX79CMP1 DS    CL36    R CHAR      COMPOSER 1                                   
         DS    C                                                                
TX79CLC1 DS    CL1     O CHAR      COMPOSER LICENSER 1                          
         DS    C                                                                
TX79CMP2 DS    CL36    O CHAR      COMPOSER 2                                   
         DS    C                                                                
TX79CLC2 DS    CL1     O CHAR      COMPOSER LICENSER 2                          
         DS    C                                                                
TX79CMP3 DS    CL36    O CHAR      COMPOSER 3                                   
         DS    C                                                                
TX79CLC3 DS    CL1     O CHAR      COMPOSER LICENSER 3                          
         DS    C                                                                
TX79CMP4 DS    CL36    O CHAR      COMPOSER 4                                   
         DS    C                                                                
TX79CLC4 DS    CL1     O CHAR      COMPOSER LICENSER 4                          
         DS    C                                                                
TX79AUT1 DS    CL36    R CHAR      AUTHOR 1                                     
         DS    C                                                                
TX79ALC1 DS    CL1     O CHAR      AUTHOR LICENSER 1                            
         DS    C                                                                
TX79AUT2 DS    CL36    O CHAR      AUTHOR 2                                     
         DS    C                                                                
TX79ALC2 DS    CL1     O CHAR      AUTHOR LICENSER 2                            
         DS    C                                                                
TX79CLNM DS    CL36    R CHAR      CLIENT NAME                                  
         DS    C                                                                
TX79PRNM DS    CL36    O CHAR      PRODUCT NAME                                 
         DS    C                                                                
TX79COM1 DS    CL60    O CHAR      COMMENT 1                                    
         DS    C                                                                
TX79COM2 DS    CL60    O CHAR      COMMENT 2                                    
*                                                                               
TX79X    DS    CL2                 RECORD END                                   
TX79LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - VERSION-PUBLISHED MUSIC (5080)                     *         
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX80APK  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX80VER  DS    CL3     R CHAR      VERSION                                      
         DS    C                                                                
TX80MUCD DS    CL8     R CHAR      PUBLISHED MUSIC CODE                         
*                                                                               
TX80X    DS    CL2                 RECORD END                                   
TX80LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - EPISODE (5081)                                     *         
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX81PK   DS    CL11    R CHAR      EPISODE PRIMARY KEY                          
         DS    C                                                                
TX81AGY  DS    CL6     R CHAR      AGENCY                                       
         DS    C                                                                
TX81EPI  DS    CL5     R CHAR      EPISODE ID                                   
         DS    C                                                                
TX81WRK  DS    CL8     R DATE      WORK DATE                                    
         DS    C                                                                
TX81AIR  DS    CL8     R DATE      AIR DATE                                     
*                                                                               
TX81X    DS    CL2                 RECORD END                                   
TX81LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - EPISODE-PERFORMER(5082)                            *         
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX82EPI  DS    CL5     R CHAR      EPISODE ID                                   
         DS    C                                                                
TX82PPK  DS    CL12    R CHAR      PERFORMER PRIMARY KEY                        
         DS    C                                                                
TX82APK  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
*                                                                               
TX82X    DS    CL2                 RECORD END                                   
TX82LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - SOAP EPISODE-PERFORMER (5083)                      *         
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX83PK   DS    CL28    R CHAR      SOAP ASSET/EPISODE PRIMARY KEY               
         ORG   TX83PK                                                           
TX83PKA  DS    CL8                 ASSET PRIMARY KEY                            
TX83PKE  DS    CL5                 EPISODE                                      
TX83PKP  DS    CL6                 PID                                          
TX83PKC  DS    CL3                 CATEGORY                                     
TX83PKI  DS    CL6                 INVOICE                                      
         DS    C                                                                
TX83APK  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX83EPI  DS    CL5     R CHAR      EPISODE ID                                   
         DS    C                                                                
TX83PID  DS    CL6     R CHAR      PID                                          
         DS    C                                                                
TX83CAT  DS    CL3     R CHAR      CATEGORY                                     
         DS    C                                                                
TX83INV  DS    CL6     O CHAR      INVOICE                                      
         DS    C                                                                
TX83CAM  DS    CL3     R CHAR      CAMERA                                       
         DS    C                                                                
TX83UNT  DS    CL3     R CHAR      TAX UNIT                                     
         DS    C                                                                
TX83UNI  DS    CL3     R CHAR      UNION                                        
         DS    C                                                                
TX83LOC  DS    CL3     R CHAR      LOCAL                                        
         DS    C                                                                
TX83YEAR DS    CL3     R CHAR      CONTRACT YEAR                                
         DS    C                                                                
TX83CPK  DS    CL7     O CHAR      ASSOCIATED CORPORATION PK                    
         DS    C                                                                
TX83AGT  DS    CL4     O CHAR      AGENT                                        
         DS    C                                                                
TX83ROL  DS    CL2     O CHAR      WRITER ROLE                                  
         DS    C                                                                
TX83WPCT DS    CL6     O INT       WRITER PERCENTAGE                            
         DS    C                                                                
TX83PRAT DS    CL9     O INT       PERFORMANCE RATE                             
         DS    C                                                                
TX83CAMT DS    CL9     O INT       CREDIT AMOUNT                                
         DS    C                                                                
TX83CBAL DS    CL9     O INT       CREDIT BALANCE                               
         DS    C                                                                
TX83CMT  DS    CL57    O INT       COMMENT                                      
*                                                                               
TX83X    DS    CL2                 RECORD END                                   
TX83LEN  EQU   *-TOXRECD                                                        
                                                                                
***********************************************************************         
* TALENT EXTRACT - FIXED CYCLE TRACKING RECORD (5084)                 *         
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX84PEFK DS    CL12    R CHAR      PERFORMER PRIMARY KEY                        
         DS    C                                                                
TX84INVN DS    CL6     O CHAR      INVOICE NUMBER                               
         DS    C                                                                
TX84CYCS DS    CL8     O DATE      CYCLE START DATE                             
         DS    C                                                                
TX84CYCE DS    CL8     O DATE      CYCLE END DATE                               
         DS    C                                                                
TX84CAT  DS    CL3     O CHAR      CATEGORY                                     
         DS    C                                                                
TX84CAM  DS    CL3     O CHAR      CAMERA                                       
         DS    C                                                                
TX84OVP1 DS    CL11    O INT       OVERSCALE PERCENTAGE 1                       
         DS    C                                                                
TX84OVP2 DS    CL11    O INT       OVERSCALE PERCENTAGE 2                       
         DS    C                                                                
TX84APPL DS    CL11    O INT       APPLIED AMOUNT                               
         DS    C                                                                
TX84PNHA DS    CL11    O INT       P&H AMOUNT                                   
         DS    C                                                                
TX84BALN DS    CL11    O INT       BALANCE                                      
         DS    C                                                                
TX84USET DS    CL3     O CHAR      USE TYPE CODE                                
*                                                                               
TX84X    DS    CL2                 RECORD END                                   
TX84LEN  EQU   *-TOXRECD                                                        
                                                                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - USAGE HISTORY  (5085)                              *         
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX85PEFK DS    CL12    R CHAR      PERFORMER PRIMARY KEY                        
         DS    C                                                                
TX85USEC DS    CL3     R CHAR      USE CODE                                     
         DS    C                                                                
TX85INVN DS    CL6     R CHAR      INVOICE NUMBER                               
         DS    C                                                                
TX85APK  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX85CYCS DS    CL8     O DATE      CYCLE START DATE                             
         DS    C                                                                
TX85CYCE DS    CL8     O DATE      CYCLE END DATE                               
         DS    C                                                                
TX85SUBC DS    CL8     O CHAR      SUBSCRIBER COUNT                             
         DS    C                                                                
TX85NCBL DS    CL4     O CHAR      NUMBER OF CABLE SYSTEMS PAID                 
         DS    C                                                                
TX85SUBS DS    CL8     O CHAR      SUBSCRIBER                                   
         DS    C                                                                
TX85ISUB DS    CL8     O CHAR      INITIAL SUBSCRIBERS                          
*                                                                               
TX85X    DS    CL2                 RECORD END                                   
TX85LEN  EQU   *-TOXRECD                                                        
                                                                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - HISTORY COMMENT (5086)                             *         
***********************************************************************         
                                                                                
         ORG   TOXREDET                                                         
TX86APK  DS    CL8     R CHAR      ASSET PRIMARY KEY                            
         DS    C                                                                
TX86INVN DS    CL6     R CHAR      INVOICE NUMBER                               
         DS    C                                                                
TX86SEQ  DS    CL3     R INT       SORT SEQUENCE NUMBER                         
         DS    C                                                                
TX86CMNT DS    CL78    R CHAR      COMMENT LINE                                 
*                                                                               
TX86X    DS    CL2                 RECORD END                                   
TX86LEN  EQU   *-TOXRECD                                                        
                                                                                
         EJECT                                                                  
***********************************************************************         
* TALENT EXTRACT - TOTALS RECORD (05999)                              *         
***********************************************************************         
         SPACE 1                                                                
         ORG   TOXREDET                                                         
TX99REC  DS    CL5     R CHAR      RECORD NUMBER (050XX)                        
         DS    C                                                                
TX99CNT  DS    CL12    R CHAR      REC COUNT (EBCDIC)                           
*                                                                               
TX99X    DS    CL2                 RECORD END (PIPE)                            
TX99LEN  EQU   *-TOXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* BUFFERIN ADDRESSES TO PASS FROM TOXTRACT TO TOXROUTS                *         
***********************************************************************         
         SPACE 1                                                                
TOXBADD  DSECT                                                                  
TOXABUF  DS    AL4                 HID BUFFER ADDRESS                           
TOXBUFFN DS    AL4                 BUFFERIN ADDRESS                             
TOXCFAC  DS    AL4                 COMFACS ADDRESS                              
TOXBLEN  EQU   *-TOXBADD           RECORD LENGTH                                
         EJECT                                                                  
