*          DATA SET VENTAPED   AT LEVEL 001 AS OF 03/08/94                      
*                                                                               
*        NETPAK VENDOR TAPE RECORD                                              
*                                                                               
VENDTAPE DSECT            DSECT FOR VENDOR TAPE                                 
         DS    0CL200                                                           
VMED     DS    CL1                 MEDIA                                        
VNET     DS    CL4                 NETWORK                                      
VUNITS   DS    PL4                 UNITS                                        
VGORD    DS    PL8                 GROSS ORDERED(00.00)                         
VNORD    DS    PL8                 NET ORDERED(00.00)                           
VNCLRD   DS    PL8                 NET CLEARED(00.00)                           
VPCTCD   DS    PL3                 PERCENT CLEARED(NNN.NN)                      
VNCLRBL  DS    PL8                 NET TO BE CLEARED(00.00)                     
         DS    CL156               SPARE                                        
